{
    "1977_1": {
        "plotSummary": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.",
        "runtimeMinutes": "121"
    },
    "1977_10": {
        "plotSummary": "A three-way friendship between two free-spirited professional football players and the owner's daughter becomes compromised when two of them become romantically involved.",
        "runtimeMinutes": "108"
    },
    "1977_11": {
        "plotSummary": "An orphan boy and his magical dragon come to town with his abusive adoptive parents in pursuit.",
        "runtimeMinutes": "128"
    },
    "1977_12": {
        "plotSummary": "A Vietnam veteran suffering from post traumatic stress disorder breaks out of a VA hospital and goes on a road trip with a sympathetic traveler to start a worm farm in California with his fellow veterans.",
        "runtimeMinutes": "112"
    },
    "1977_13": {
        "plotSummary": "A psychiatrist with intense acrophobia (fear of heights) goes to work for a mental institution run by doctors who appear to be crazier than their patients, and have secrets that they are willing to commit murder to keep.",
        "runtimeMinutes": "94"
    },
    "1977_14": {
        "plotSummary": "A teenage girl once possessed by a demon finds that it still lurks within her. Meanwhile, a priest investigates the death of the girl's exorcist.",
        "runtimeMinutes": "117"
    },
    "1977_15": {
        "plotSummary": "Two mice of the Rescue Aid Society search for a little girl kidnapped by unscrupulous treasure hunters.",
        "runtimeMinutes": "78"
    },
    "1977_16": {
        "plotSummary": "A failing ice hockey team finds success with outrageously violent hockey goonery.",
        "runtimeMinutes": "123"
    },
    "1977_17": {
        "plotSummary": "Herbie, the Volkswagen Beetle with a mind of its own, is racing in the Monte Carlo Rally. Unbeknownst to Herbie's driver, thieves have hidden a cache of stolen diamonds in Herbie's gas tank, and are now trying to get them back.",
        "runtimeMinutes": "105"
    },
    "1977_18": {
        "plotSummary": "A hard but mediocre cop is assigned to escort a prostitute into custody from Las Vegas to Phoenix, so that she can testify in a mob trial. But a lot of people are literally betting that they won't make it into town alive.",
        "runtimeMinutes": "109"
    },
    "1977_19": {
        "plotSummary": "When her daughter joins a ballet company, a former dancer is forced to confront her long-ago decision to give up the stage to have a family.",
        "runtimeMinutes": "119"
    },
    "1977_2": {
        "plotSummary": "Roy Neary, an electric lineman, watches how his quiet and ordinary daily life turns upside down after a close encounter with a UFO.",
        "runtimeMinutes": "138"
    },
    "1977_20": {
        "plotSummary": "A mother and daughter find their personalities switched and have to live each other's lives on one strange Friday.",
        "runtimeMinutes": "95"
    },
    "1977_21": {
        "plotSummary": "A Greek tycoon's mistress tries to track down and find her ex-World War II lover.",
        "runtimeMinutes": "165"
    },
    "1977_22": {
        "plotSummary": "A dedicated schoolteacher spends her nights cruising bars, looking for abusive men with whom she can engage in progressively violent sexual encounters.",
        "runtimeMinutes": "136"
    },
    "1977_23": {
        "plotSummary": "At the behest of an old and dear friend, playwright Lillian Hellman undertakes a dangerous mission to smuggle funds into Nazi Germany.",
        "runtimeMinutes": "117"
    },
    "1977_24": {
        "plotSummary": "A troubled, rebellious teen drives his rambunctious baseball team out to Houston where they play an exhibition game and the boy meets his estranged father, and hires him as the teams coach.",
        "runtimeMinutes": "100"
    },
    "1977_25": {
        "plotSummary": "Benji sniffs out a bogus CIA agent in Athens, Greece. Read more: Synopsis",
        "runtimeMinutes": "85"
    },
    "1977_26": {
        "plotSummary": "An egotistical saxophonist and a young lounge singer meet on VJ Day and embark upon a strained and rocky romance, even as their careers begin a long, uphill climb.",
        "runtimeMinutes": "155"
    },
    "1977_27": {
        "plotSummary": "Black Sunday is the powerful story of a Black September terrorist group attempting to blow up a Goodyear blimp hovering over the Super Bowl stadium with 80,000 people and the president of the United States in attendance.",
        "runtimeMinutes": "143"
    },
    "1977_28": {
        "plotSummary": "A hunter squares off against a killer whale seeking vengeance for the death of its mate.",
        "runtimeMinutes": "92"
    },
    "1977_29": {
        "plotSummary": "Bobby Deerfield, a famous American race car driver on the European circuit, falls in love with the enigmatic Lillian Morelli, who is terminally ill.See moreBobby Deerfield, a famous American race car driver on the European circuit, falls in love with the enigmatic Lillian Morelli, who is terminally ill.  Written by Jeanne Armintrout See less",
        "runtimeMinutes": "124"
    },
    "1977_3": {
        "plotSummary": "Anxious about his future after high school, a 19-year-old Italian-American from Brooklyn tries to escape the harsh reality of his bleak family life by dominating the dance floor at the local disco.",
        "runtimeMinutes": "118"
    },
    "1977_30": {
        "plotSummary": "An isolated sculptor is visited by his three sons just before the start of WWII.",
        "runtimeMinutes": "104"
    },
    "1977_31": {
        "plotSummary": "The Peanuts gang goes to summer camp, and they participate in a river-raft race against some cheating bullies.",
        "runtimeMinutes": "76"
    },
    "1977_32": {
        "plotSummary": "During the 1920s, French Foreign Legion Major William Foster's (Gene Hackman's) unit is protecting an archaeological dig, but the discovery of an Arab sacred burial site prompts the angry Arab tribes to attack Foster's small garrison.",
        "runtimeMinutes": "107"
    },
    "1977_33": {
        "plotSummary": "Lady Booby alias \"Belle\" (Ann-Margret), the lively wife of the fat landed squire Sir Thomas Booby (Peter Bull), has a lusty eye on the attractive, intelligent villager Joseph Andrews (Peter Firth), a Latin pupil and protege of Parson Adams...See moreLady Booby alias \"Belle\" (Ann-Margret), the lively wife of the fat landed squire Sir Thomas Booby (Peter Bull), has a lusty eye on the attractive, intelligent villager Joseph Andrews (Peter Firth), a Latin pupil and protege of Parson Adams (Sir Michael Hordern), and makes him their footman. Joseph's heart belongs to a country girl, foundling Fanny Goodwill (Natalie Ogle), but his masters take him on a fashionable trip to Bath, where the spoiled society comes mainly to see and be seen, yet Sir Thomas really seeks relief for his sick foot, but drowns in the famous Roman baths. When the all but grieving lady finds Joseph's Christian virtue and true love resist her lusting passes just as well as the many ladies who fancy her footman, she fires the boy. On his way back on foot, he falls prey to highwaymen who rob him of everything, even the clothes on his back. He's found and nursed by an innkeeper's maid, which stirs lusts there, again besides his honorable conduct, but is found by the good Parson. Meanwhile, the lady consents to her cousin marrying below his station when learning the fiancee is Joseph's sister, Pamela (Karen Dotrice). The Parson barely escapes a wicked gentleman's totally unjust, all but gentle justice after being accused of the attempted rape committed by a squire he actually prevented, and comes to learn ever more about a relevant child-theft by Gypsies, but meanwhile, he, Joseph, and Fanny, fall prey again to the rapist's utter debauchery.  Written by KGF VissersSee less",
        "runtimeMinutes": "104"
    },
    "1977_34": {
        "plotSummary": "This movie interlaces the stories of several characters in a small town united by their use of CB (citizen's band) radio. Paul LeMat is the local CB coordinator who has time for little else in his life. His father, Roberts Blossom is a ...See moreThis movie interlaces the stories of several characters in a small town united by their use of CB (citizen's band) radio. Paul LeMat is the local CB coordinator who has time for little else in his life. His father, Roberts Blossom is a sour old man who is nice on the radio. Charles Napier is a trucker hospitalized after an accident, with hilarious consequences.  Written by Reid GagleSee less",
        "runtimeMinutes": "98"
    },
    "1977_35": {
        "plotSummary": "Story of an upper class college in the early '50s and how a \"harmless\" hazing resulted in a student's death. Read more: Synopsis",
        "runtimeMinutes": "100"
    },
    "1977_4": {
        "plotSummary": "The Bandit is hired on to run a tractor trailer full of beer over state lines, in hot pursuit by a pesky sheriff.",
        "runtimeMinutes": "96"
    },
    "1977_5": {
        "plotSummary": "Operation Market Garden, September 1944: The Allies attempt to capture several strategically important bridges in the Netherlands in the hope of breaking the German lines.",
        "runtimeMinutes": "175"
    },
    "1977_6": {
        "plotSummary": "In Bermuda, two amateur treasure-hunting divers have a run-in with local criminals when they inadvertently discover the secret cargo of a World War II shipwreck.",
        "runtimeMinutes": "123"
    },
    "1977_7": {
        "plotSummary": "James Bond investigates the hijacking of British and Russian submarines carrying nuclear warheads, with the help of a K.G.B. agent whose lover he killed.",
        "runtimeMinutes": "125"
    },
    "1977_8": {
        "plotSummary": "When God appears to an assistant grocery manager as a good natured old man, the Almighty selects him as his messenger for the modern world.",
        "runtimeMinutes": "98"
    },
    "1977_9": {
        "plotSummary": "Neurotic New York comedian Alvy Singer falls in love with the ditzy Annie Hall.",
        "runtimeMinutes": "93"
    }
}