{
    "1978_1": {
        "plotSummary": "Good girl Sandy Olsson and greaser Danny Zuko fell in love over the summer. When they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance?",
        "runtimeMinutes": "110"
    },
    "1978_10": {
        "plotSummary": "Fifteen years after murdering his sister on Halloween night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again.",
        "runtimeMinutes": "91"
    },
    "1978_11": {
        "plotSummary": "A shy San Francisco librarian and a bumbling cop fall in love as they solve a crime involving albinos, dwarves, and the Catholic Church.",
        "runtimeMinutes": "116"
    },
    "1978_12": {
        "plotSummary": "Slapstick black comedy about a man (Reynolds) who finds that he hasn't much longer to live and has bungled his attempts at suicide.",
        "runtimeMinutes": "100"
    },
    "1978_13": {
        "plotSummary": "Two stoners unknowingly smuggle a van - made entirely of marijuana - from Mexico to L.A., with incompetent Sgt. Stedenko on their trail.",
        "runtimeMinutes": "86"
    },
    "1978_14": {
        "plotSummary": "Billy Hayes, an American college student, is caught smuggling drugs out of Turkey and thrown into prison.",
        "runtimeMinutes": "121"
    },
    "1978_15": {
        "plotSummary": "A woman whose husband is fighting in Vietnam falls in love with another man who suffered a paralyzing combat injury there.",
        "runtimeMinutes": "127"
    },
    "1978_16": {
        "plotSummary": "The Fellowship of the Ring embark on a journey to destroy the One Ring and end Sauron's reign over Middle-earth.",
        "runtimeMinutes": "132"
    },
    "1978_17": {
        "plotSummary": "Charley is a surgeon who's recently lost his wife. He embarks on a tragicomic romantic quest with one woman after another until he meets up with Ann, a singular woman, closer to his own age, who immediately and unexpectedly captures his ...See moreCharley is a surgeon who's recently lost his wife. He embarks on a tragicomic romantic quest with one woman after another until he meets up with Ann, a singular woman, closer to his own age, who immediately and unexpectedly captures his heart.  Written by Dan Hartung See less",
        "runtimeMinutes": "98"
    },
    "1978_18": {
        "plotSummary": "Damien the Antichrist, now about to turn thirteen years old, finally learns of his destiny under the guidance of an unholy disciple of Satan. Meanwhile dark forces begin to eliminate all those who suspect the child's true identity.",
        "runtimeMinutes": "107"
    },
    "1978_19": {
        "plotSummary": "When strange seeds drift to earth from space, mysterious pods begin to grow and invade San Francisco, California, where they replicate the residents into emotionless automatons one body at a time.",
        "runtimeMinutes": "115"
    },
    "1978_2": {
        "plotSummary": "An alien orphan is sent from his dying planet to Earth, where he grows up to become his adoptive home's first and greatest superhero.",
        "runtimeMinutes": "143"
    },
    "1978_20": {
        "plotSummary": "Truckers form a mile long \"convoy\" in support of a trucker's vendetta with an abusive sheriff...Based on the country song of same title by C.W. McCall.",
        "runtimeMinutes": "110"
    },
    "1978_21": {
        "plotSummary": "An adaptation of \"The Wizard of Oz\" that tries to capture the essence of the African-American experience.",
        "runtimeMinutes": "134"
    },
    "1978_22": {
        "plotSummary": "A rebellious Cleveland warehouse worker rises through the ranks of a trucking industry union to become union president but his organized crime links cause his eventual downfall.",
        "runtimeMinutes": "145"
    },
    "1978_23": {
        "plotSummary": "A small-town band hits it big, but they must battle a nefarious plot in the music industry.",
        "runtimeMinutes": "113"
    },
    "1978_24": {
        "plotSummary": "A famous fashion photographer develops a disturbing ability to see through the eyes of a killer.",
        "runtimeMinutes": "104"
    },
    "1978_25": {
        "plotSummary": "1951: Andy Schmidt is in his last year of college. Taking life easy and always a saucy joke on his lips, he manages to win fellow student Mary's heart, although she's already otherwise engaged. But getting a job after college turns out ...See more1951: Andy Schmidt is in his last year of college. Taking life easy and always a saucy joke on his lips, he manages to win fellow student Mary's heart, although she's already otherwise engaged. But getting a job after college turns out much harder than he expected. Most directors take offense at his free interpretation of his roles. Desperate, he tries in wrestling. To avoid getting beaten up he stages the fights - and incidentally invents show-wrestling.  Written by Tom Zoerner See less",
        "runtimeMinutes": "97"
    },
    "1978_26": {
        "plotSummary": "Tia and Tony visit Los Angeles, but he's quickly kidnapped by an evil scientist, leaving her to desperately search for him.",
        "runtimeMinutes": "95"
    },
    "1978_27": {
        "plotSummary": "A high school grad and a hooker-in-training try to track down his stolen Corvette.",
        "runtimeMinutes": "105"
    },
    "1978_28": {
        "plotSummary": "The life of the Greek tycoon Theo Tomasis, based on Aristotle Onassis.",
        "runtimeMinutes": "107"
    },
    "1978_29": {
        "plotSummary": "As Hercule Poirot enjoys a luxurious cruise down the Nile, a newlywed heiress is found murdered on board. Can Poirot identify the killer before the ship reaches the end of its journey?",
        "runtimeMinutes": "140"
    },
    "1978_3": {
        "plotSummary": "Police chief Brody must protect the citizens of Amity after a second monstrous shark begins terrorizing the waters.",
        "runtimeMinutes": "116"
    },
    "1978_30": {
        "plotSummary": "The story of the life and career of the early rock and roll singer, from his meteoric rise to stardom, to his marriage and untimely death.",
        "runtimeMinutes": "114"
    },
    "1978_31": {
        "plotSummary": "An ex-'60s radical now working as a private eye is hired by an old flame to investigate a political smear campaign. The case becomes more dangerous as it unfolds.",
        "runtimeMinutes": "108"
    },
    "1978_32": {
        "plotSummary": "Several years after the deaths of Dick Buek and her father, Jill Kinmont and her mother leave Los Angeles to spend their summer in their hometown of Bishop, California. They rent a summer house from a handsome truck driver named John ...See moreSeveral years after the deaths of Dick Buek and her father, Jill Kinmont and her mother leave Los Angeles to spend their summer in their hometown of Bishop, California. They rent a summer house from a handsome truck driver named John Boothe. Jill is instantly captivated by John, but denies it to everyone, including herself. Eventually, Jill and John fall in love, but deep fears and hurts from the past threaten to be the couple's undoing.  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "1978_33": {
        "plotSummary": "Trisha Rawlings, a Beverly Hills socialite suffers from loneliness following the separation of her womanizing husband Stu. Strip, a young drifter, became infatuated with her and, develops a May/December relationship with her.",
        "runtimeMinutes": "102"
    },
    "1978_34": {
        "plotSummary": "Three sisters find their lives spinning out of control in the wake of their parents' sudden, unexpected divorce.",
        "runtimeMinutes": "92"
    },
    "1978_35": {
        "plotSummary": "After being released on parole, a career burglar assaults his former probation officer, returns to a life of crime, and goes on the run.",
        "runtimeMinutes": "114"
    },
    "1978_36": {
        "plotSummary": "Ella Connors is a single woman who gets pressured to sell her failing cattle farm to her corrupt ex suitor, Jacob Ewing. She asks for help from her neighbor, Frank Athearn. As Ella and Frank fight back through stampedes, jealousy, betrayal...See moreElla Connors is a single woman who gets pressured to sell her failing cattle farm to her corrupt ex suitor, Jacob Ewing. She asks for help from her neighbor, Frank Athearn. As Ella and Frank fight back through stampedes, jealousy, betrayal, and sabotage, they eventually find love.  Written by cactusjumpSee less",
        "runtimeMinutes": "118"
    },
    "1978_37": {
        "plotSummary": "The story of Alan Freed, the pioneering disc jockey who was instrumental in introducing and popularizing rock 'n' roll in the 1950s.",
        "runtimeMinutes": "91"
    },
    "1978_38": {
        "plotSummary": "A fictional retelling of the infamous Brink's Company robbery in Boston, which took place on January 17th, 1950, with a score of $2.700.000, and cost the American taxpayers $29.000.000 to apprehend the culprits with only $58.000 recovered.",
        "runtimeMinutes": "104"
    },
    "1978_39": {
        "plotSummary": "Due to the lack of men after the Civil War, a small western town allows a bachelorette with ulterior motives to save a horse thief from the gallows by marrying him. They must deal with his old gang, the Sheriff, the bank, and each other.",
        "runtimeMinutes": "105"
    },
    "1978_4": {
        "plotSummary": "At a 1962 college, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
        "runtimeMinutes": "109"
    },
    "1978_40": {
        "plotSummary": "In the criminal and violent world of modern-day Gypsies based in New York City, their 'king' Zharko Stepanowicz passes his leadership to his unwilling grandson, leaving the skipped father resentful.",
        "runtimeMinutes": "112"
    },
    "1978_41": {
        "plotSummary": "During World War II, several oddly assorted military experts are teamed in a mission to raid and destroy a bridge vital to enemy strategy.",
        "runtimeMinutes": "118"
    },
    "1978_42": {
        "plotSummary": "Three Italian-American brothers, living in the slums of 1940's New York City, try to help each other with one's wrestling career using one brother's promotional skills and another brother's con-artist tactics to thwart a sleazy manager.",
        "runtimeMinutes": "107"
    },
    "1978_43": {
        "plotSummary": "A small time hustler takes the pint-sized baseball team to Japan for a match against the country's best little league baseball team which sparks off a series of adventures and mishaps.",
        "runtimeMinutes": "91"
    },
    "1978_44": {
        "plotSummary": "Velvet's (Nanette Newman's) orphaned niece, Sarah (Tatum O'Neal), follows her dream of Olympic glory with her horse Arizona Pie.",
        "runtimeMinutes": "127"
    },
    "1978_45": {
        "plotSummary": "When three workers try to steal from the local union, they discover the corruption of the union instead and decide to blackmail them.",
        "runtimeMinutes": "114"
    },
    "1978_46": {
        "plotSummary": "A teenage girl lives as a prostitute in New Orleans in 1917.",
        "runtimeMinutes": "110"
    },
    "1978_47": {
        "plotSummary": "A Navy Captain uses his experimental Snark to reach a nuclear submarine stuck on an ocean ledge.",
        "runtimeMinutes": "111"
    },
    "1978_48": {
        "plotSummary": "In 1945, General Patton sends Germany's confiscated gold reserves to Frankfurt, but the Army train is robbed by plotters who also hire a Swiss hitman to kill the General.",
        "runtimeMinutes": "111"
    },
    "1978_49": {
        "plotSummary": "In 1948, at the U.S. embassy in Zadestan, a young diplomat is ordered to find the missing daughter of an influential U.S. Senator.",
        "runtimeMinutes": "127"
    },
    "1978_5": {
        "plotSummary": "The San Fernando Valley adventures of trucker turned prize-fighter Philo Beddoe and his pet orangutan Clyde.",
        "runtimeMinutes": "114"
    },
    "1978_50": {
        "plotSummary": "A hot-tempered farm laborer convinces the woman he loves to marry their rich but dying boss so that they can have a claim to his fortune.",
        "runtimeMinutes": "94"
    },
    "1978_51": {
        "plotSummary": "The story follows three teenagers through their senior year of high school in the 1960s, focusing on the star athlete of the group.",
        "runtimeMinutes": "92"
    },
    "1978_52": {
        "plotSummary": "In 1964, six teenagers from New Jersey run off to see The Beatles perform on The Ed Sullivan Show in the hope of meeting their idols. However, they don't have tickets. Along the way, they learn new things about friendship and growing up.",
        "runtimeMinutes": "104"
    },
    "1978_53": {
        "plotSummary": "A Hollywood agent finds himself in debt to a powerful bookie. To make a fast buck, he creates a team of exceptionally talented skateboarders and enters them in a downhill race. If they win, they will get $20,000.",
        "runtimeMinutes": "97"
    },
    "1978_54": {
        "plotSummary": "A trumpet player, self-destructive after the death of his wife and child in a fire, befriends a crippled youngster and together they battle obstacles through each other's encouragement.",
        "runtimeMinutes": "108"
    },
    "1978_55": {
        "plotSummary": "Protected by his brother (James Andronica), a mentally impaired Brooklynite (David Proval) pretends he's Superman and becomes a hero. Read more: Synopsis",
        "runtimeMinutes": "85"
    },
    "1978_6": {
        "plotSummary": "A Los Angeles Rams quarterback, accidentally taken away from his body by an overanxious angel before he was meant to die, returns to life in the body of a recently murdered millionaire.",
        "runtimeMinutes": "101"
    },
    "1978_7": {
        "plotSummary": "Hollywood aging stuntman Sonny Hooper wants to prove that he's still got what it takes to be a great professional in this risky and under-recognized line of work.",
        "runtimeMinutes": "99"
    },
    "1978_8": {
        "plotSummary": "To prove that he still is strong and powerful, Philippe Douvier decides to kill Clouseau. Once news of his \"death\" has been announced, Clouseau tries to take advantage of it and goes undercover with Cato to find out who tried to kill him.",
        "runtimeMinutes": "99"
    },
    "1978_9": {
        "plotSummary": "An in-depth examination of the ways in which the U.S. Vietnam War impacts and disrupts the lives of people in a small industrial town in Pennsylvania.",
        "runtimeMinutes": "183"
    }
}