{
    "1979_1": {
        "plotSummary": "James Bond investigates the mid-air theft of a space shuttle, and discovers a plot to commit global genocide.",
        "runtimeMinutes": "126"
    },
    "1979_10": {
        "plotSummary": "A simpleminded, sheltered country boy suddenly decides to leave his family home to experience life in the big city, where his naivete is both his best friend and his worst enemy.",
        "runtimeMinutes": "94"
    },
    "1979_11": {
        "plotSummary": "Kermit and his newfound friends trek across America to find success in Hollywood, but a frog legs merchant is after Kermit.",
        "runtimeMinutes": "95"
    },
    "1979_12": {
        "plotSummary": "A rodeo star past his prime steals his company's horse and rides into the desert, with a feisty reporter accompanying him.",
        "runtimeMinutes": "121"
    },
    "1979_13": {
        "plotSummary": "A reporter finds what appears to be a cover-up of safety hazards at a nuclear power plant.",
        "runtimeMinutes": "122"
    },
    "1979_14": {
        "plotSummary": "Wacky hijinks of counselors and campers at a less-than-average summer camp.",
        "runtimeMinutes": "94"
    },
    "1979_15": {
        "plotSummary": "Alcatraz is the most secure prison of its time. It is believed that no one can ever escape from it, until three daring men make a possible successful attempt at escaping from one of the most infamous prisons in the world.",
        "runtimeMinutes": "112"
    },
    "1979_16": {
        "plotSummary": "A bankrupt entrepreneur attempts to recoup some of her losses by getting a washed-out boxer she picked up as a tax loss back into the ring - an idea her protege isn't fond of.",
        "runtimeMinutes": "112"
    },
    "1979_17": {
        "plotSummary": "The life of a divorced television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.",
        "runtimeMinutes": "96"
    },
    "1979_18": {
        "plotSummary": "Director/choreographer Bob Fosse tells his own life story as he details the sordid career of Joe Gideon, a womanizing, drug-using dancer.",
        "runtimeMinutes": "123"
    },
    "1979_19": {
        "plotSummary": "A boy encounters a horse and bonds with him, later training him to race.",
        "runtimeMinutes": "118"
    },
    "1979_2": {
        "plotSummary": "Ted Kramer's wife leaves him, allowing for a lost bond to be rediscovered between Ted and his son, Billy. But a heated custody battle ensues over the divorced couple's son, deepening the wounds left by the separation.",
        "runtimeMinutes": "105"
    },
    "1979_20": {
        "plotSummary": "A research vessel finds a missing ship, commanded by a mysterious scientist, on the edge of a black hole.",
        "runtimeMinutes": "98"
    },
    "1979_21": {
        "plotSummary": "A divorced man falls in love, but somehow he can't get over his ex-wife. This affects his love life in comic ways. Based on Dan Wakefield's novel.",
        "runtimeMinutes": "105"
    },
    "1979_22": {
        "plotSummary": "A lawyer is forced to defend a guilty judge, while defending other innocent clients, and trying to find punishment for the guilty and provide justice for the innocent.",
        "runtimeMinutes": "119"
    },
    "1979_23": {
        "plotSummary": "A former boxer discovers that his biggest battle of all is going to be with his ex-wife, Annie, who returns after abandoning their young son seven years prior.",
        "runtimeMinutes": "121"
    },
    "1979_24": {
        "plotSummary": "A simpleminded, sheltered gardener becomes an unlikely trusted advisor to a powerful businessman and an insider in Washington politics.",
        "runtimeMinutes": "130"
    },
    "1979_25": {
        "plotSummary": "The tragic life of a self-destructive female rock star who struggles to deal with the constant pressures of her career and the demands of her ruthless business manager.",
        "runtimeMinutes": "125"
    },
    "1979_26": {
        "plotSummary": "Three friends who are living on the dole decide to organize a bank robbery.",
        "runtimeMinutes": "97"
    },
    "1979_27": {
        "plotSummary": "A satire of American professional football in which a veteran pass-catcher's individuality and refusal to become part of the team family is bitterly resented by his disciplinarian coaches.",
        "runtimeMinutes": "119"
    },
    "1979_28": {
        "plotSummary": "In the near future, a charismatic leader summons the street gangs of New York City in a bid to take it over. When he is killed, The Warriors are falsely blamed and now must fight their way home while every other gang is hunting them down.",
        "runtimeMinutes": "92"
    },
    "1979_29": {
        "plotSummary": "A young single mother and textile worker agrees to help unionize her mill despite the problems and dangers involved.",
        "runtimeMinutes": "114"
    },
    "1979_3": {
        "plotSummary": "After a space merchant vessel receives an unknown transmission as a distress call, one of the crew is attacked by a mysterious life form and they soon realize that its life cycle has merely begun.",
        "runtimeMinutes": "117"
    },
    "1979_30": {
        "plotSummary": "A 20th century astronaut emerges out of 500 years of suspended animation into a future time where Earth is threatened by alien invaders.",
        "runtimeMinutes": "89"
    },
    "1979_31": {
        "plotSummary": "At a 1962 college, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
        "runtimeMinutes": "109"
    },
    "1979_32": {
        "plotSummary": "The adventures of two idiotic outlaw wannabees, Amos and Theodore.",
        "runtimeMinutes": "88"
    },
    "1979_33": {
        "plotSummary": "The manager of a Saint-Tropez nightclub featuring drag entertainment, and his star attraction, are a gay couple. Madness ensues when his straight son brings home a fiancee and her ultra-conservative parents to meet them.",
        "runtimeMinutes": "97"
    },
    "1979_34": {
        "plotSummary": "In 1913, the charming, seductive and sinister vampire Count Dracula travels to England in search of an immortal bride.",
        "runtimeMinutes": "109"
    },
    "1979_35": {
        "plotSummary": "A psychopathic killer terrorizes a babysitter, then returns seven years later to menace her again.",
        "runtimeMinutes": "97"
    },
    "1979_36": {
        "plotSummary": "A married man and a married woman end up sleeping with each other, and decide to meet at the same place every year on the anniversary of their one night stand. As the years go by, they observe changes in each other and their relationship.",
        "runtimeMinutes": "119"
    },
    "1979_37": {
        "plotSummary": "Respected liberal Senator Joe Tynan is asked to lead the opposition to a Supreme Court appointment. It means losing an old friend and fudging principles to make the necessary deals, as well as further straining his already part-time family...See moreRespected liberal Senator Joe Tynan is asked to lead the opposition to a Supreme Court appointment. It means losing an old friend and fudging principles to make the necessary deals, as well as further straining his already part-time family life. But it could be a big boost to his career, so he takes it on. Helping him prepare the case is pretty southern researcher Karen Traynor, and their developing relationship further complicates and compromises his life.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "108"
    },
    "1979_38": {
        "plotSummary": "Born on the original Christmas in the stable next door to Jesus Christ, Brian of Nazareth spends his life being mistaken for a messiah.",
        "runtimeMinutes": "94"
    },
    "1979_39": {
        "plotSummary": "When a litter of Dalmatian puppies are abducted by the minions of Cruella de Vil, the parents must find them before she uses them for a diabolical fashion statement.",
        "runtimeMinutes": "79"
    },
    "1979_4": {
        "plotSummary": "Hysterical Californians prepare for a Japanese invasion in the days after Pearl Harbor.",
        "runtimeMinutes": "118"
    },
    "1979_40": {
        "plotSummary": "A log company's waste mutates the environment, creating a giant killer bear-monster.",
        "runtimeMinutes": "102"
    },
    "1979_41": {
        "plotSummary": "A small-town boy obsessed with the Italian cycling team vies for the affections of a college girl.",
        "runtimeMinutes": "101"
    },
    "1979_42": {
        "plotSummary": "Claude Bukowski leaves the family ranch in Oklahoma for New York where he is rapidly embraced into the hippie group of youngsters led by Berger, yet he's already been drafted. He soon falls in love with Sheila Franklin, a rich girl but ...See moreClaude Bukowski leaves the family ranch in Oklahoma for New York where he is rapidly embraced into the hippie group of youngsters led by Berger, yet he's already been drafted. He soon falls in love with Sheila Franklin, a rich girl but still a rebel inside.See less",
        "runtimeMinutes": "121"
    },
    "1979_43": {
        "plotSummary": "College graduates deal with Vietnam and other issues of the late 1960s. Read more: Synopsis",
        "runtimeMinutes": "110"
    },
    "1979_44": {
        "plotSummary": "Skaters band together to keep their roller-disco open.",
        "runtimeMinutes": "104"
    },
    "1979_45": {
        "plotSummary": "England, 1850s. A master criminal aims to rob a train of a large sum of gold. Security is incredibly tight and the task seems an impossible one. However, he has a plan and just the right people to carry it out.",
        "runtimeMinutes": "110"
    },
    "1979_46": {
        "plotSummary": "A supersonic airborne disaster. In order to survive a flight headed for the Moscow Olympics, passengers of the Concorde must endure aerial acrobatics to dodge missiles and survive a device that decompresses the plane.",
        "runtimeMinutes": "113"
    },
    "1979_47": {
        "plotSummary": "A teenage boy and his friends face off against a mysterious grave robber known only as the Tall Man, who keeps a lethal arsenal of terrible weapons with him.",
        "runtimeMinutes": "89"
    },
    "1979_48": {
        "plotSummary": "A corporate heir's mother pays for his disfigured girlfriend's plastic surgery, on one condition.",
        "runtimeMinutes": "97"
    },
    "1979_49": {
        "plotSummary": "An American couple in England stumble upon a rambling mansion where a number of powerful individuals have been summoned by its patriarch regarding the home's legacy.",
        "runtimeMinutes": "102"
    },
    "1979_5": {
        "plotSummary": "Newlyweds and their three kids move into a large house where a mass murder was committed. They start to experience strange, inexplicable manifestations which have strong effects on everyone living or visiting the house.",
        "runtimeMinutes": "117"
    },
    "1979_50": {
        "plotSummary": "In prerevolutionary Russia, a Jewish peasant contends with marrying off three of his daughters while growing anti-Semitic sentiment threatens his village.",
        "runtimeMinutes": "181"
    },
    "1979_51": {
        "plotSummary": "An LA police officer is murdered in the onion fields outside of Bakersfield. However, legal loopholes could keep his kidnappers from receiving justice, and his partner is haunted by overwhelming survivor's guilt.",
        "runtimeMinutes": "122"
    },
    "1979_52": {
        "plotSummary": "A Polish rabbi wanders through the Old West on his way to lead a synagogue in San Francisco. On the way he is nearly burnt at the stake by Indians and almost killed by outlaws.",
        "runtimeMinutes": "119"
    },
    "1979_53": {
        "plotSummary": "The U.S. must join forces with the U.S.S.R. in order to destroy a gigantic asteroid heading straight for Earth.",
        "runtimeMinutes": "108"
    },
    "1979_54": {
        "plotSummary": "The Pittsburgh, Pennsylvania basketball team is hopeless. Maybe with the aid of an astrologer, and some new astrologically compatible players, they can become winners.",
        "runtimeMinutes": "102"
    },
    "1979_55": {
        "plotSummary": "When her father is murdered, a pharmaceutical heiress becomes the next target of an unknown killer amid the international jet set.",
        "runtimeMinutes": "117"
    },
    "1979_56": {
        "plotSummary": "In order to save King Rudolph of Ruritania from assassins and murderous usurpers, the kingdom hires a look-a-like London cabby to impersonate the Monarch.",
        "runtimeMinutes": "108"
    },
    "1979_57": {
        "plotSummary": "December 1926, Agatha Christie's husband asks for a divorce. She leaves her car and goes missing 11 days. She books into a hotel as Mrs. Neele. Fiction: A US reporter looks for her and investigates.",
        "runtimeMinutes": "105"
    },
    "1979_58": {
        "plotSummary": "In a story told in narrative flashbacks, a young TV consultant is hired by the President of a bankrupt USA to organize a telethon in order to prevent the country from being repossessed by wealthy Native Americans.",
        "runtimeMinutes": "86"
    },
    "1979_59": {
        "plotSummary": "American marathon runner Michael Andropolis sets his heart on representing his country at the Olympic games. Meanwhile his marriage has fallen apart and his children have no respect for him. He sets out on his task with determination and ...See moreAmerican marathon runner Michael Andropolis sets his heart on representing his country at the Olympic games. Meanwhile his marriage has fallen apart and his children have no respect for him. He sets out on his task with determination and hope that his success will resolve his personal problems.  Written by Col Needham See less",
        "runtimeMinutes": "102"
    },
    "1979_6": {
        "plotSummary": "Rocky struggles in family life after his bout with Apollo Creed, while the embarrassed champ insistently goads him to accept a challenge for a rematch.",
        "runtimeMinutes": "119"
    },
    "1979_60": {
        "plotSummary": "A British mercenary arrives in pre-Revolution Cuba to help train General Batista's Army against Castro's guerrillas while he also romances a former lover now married to an unscrupulous plantation owner.",
        "runtimeMinutes": "122"
    },
    "1979_61": {
        "plotSummary": "A prequel of sorts to Butch Cassidy and the Sundance Kid which chronicles the two outlaws' lives in the years before the events portrayed in the 1969 movie.",
        "runtimeMinutes": "115"
    },
    "1979_62": {
        "plotSummary": "A rising tennis star falls for an older woman engaged with a wealthy man she doesn't love. Will he become the next John McEnroe? Will she choose love over financial security?",
        "runtimeMinutes": "120"
    },
    "1979_63": {
        "plotSummary": "As he approaches manhood, Ben Meechum struggles to win the approval of his demanding alpha male father, an aggressively competitive, but frustrated Marine pilot.",
        "runtimeMinutes": "115"
    },
    "1979_64": {
        "plotSummary": "Joining WWII, USA ships soldiers to UK. Matt and John arrive in 1942. Each see a local woman - married or to be engaged with soldiers serving faraway.",
        "runtimeMinutes": "138"
    },
    "1979_65": {
        "plotSummary": "A college professor (George Segal) and an English divorcee (Glenda Jackson) meet and marry while on a vacation in France. When the bride returns home she finds life less than rosey as the jungle of academia unfolds and the mirth of ...See moreA college professor (George Segal) and an English divorcee (Glenda Jackson) meet and marry while on a vacation in France. When the bride returns home she finds life less than rosey as the jungle of academia unfolds and the mirth of marriage fades.  Written by AnonymousSee less",
        "runtimeMinutes": "106"
    },
    "1979_66": {
        "plotSummary": "Margaret is a nurse in England during WW2, and married to a secret agent. Things get complicated when she falls for David, an American pilot.",
        "runtimeMinutes": "109"
    },
    "1979_67": {
        "plotSummary": "A young man meets a deaf teacher and finds she is a great dancer. He encourages her to follow her dream of becoming a professional dancer.",
        "runtimeMinutes": "106"
    },
    "1979_68": {
        "plotSummary": "A drifter named Beaudray Demerille wins a young orphan named Wanda in a poker game and takes her gold prospecting in the Grand Canyon.",
        "runtimeMinutes": "107"
    },
    "1979_69": {
        "plotSummary": "After a rich old man dies in a suspicious car accident in Acapulco, Mexico, his widow wants his insurance company to pony up five million dollars. Hotshot investigator Jake Decker (Charles Grodin) and charming model Ellie (Farrah ...See moreAfter a rich old man dies in a suspicious car accident in Acapulco, Mexico, his widow wants his insurance company to pony up five million dollars. Hotshot investigator Jake Decker (Charles Grodin) and charming model Ellie (Farrah Fawcett-Majors) come in to check it out.See less",
        "runtimeMinutes": "99"
    },
    "1979_7": {
        "plotSummary": "When an alien spacecraft of enormous power is spotted approaching Earth, Admiral James T. Kirk resumes command of the overhauled USS Enterprise in order to intercept it.",
        "runtimeMinutes": "132"
    },
    "1979_70": {
        "plotSummary": "Two 12-year-olds, the products of Upper West Side broken homes, struggle to make sense of their parents lives and their own adolescent feelings.",
        "runtimeMinutes": "101"
    },
    "1979_71": {
        "plotSummary": "A young Chicano gang member in Los Angeles comes to realize that the gang life is not what he really wants but doesn't know how to get out.",
        "runtimeMinutes": "102"
    },
    "1979_72": {
        "plotSummary": "Harry breaks down and loses his job after his wife is assassinated - could it be his turn next ?",
        "runtimeMinutes": "102"
    },
    "1979_73": {
        "plotSummary": "A neo-Nazi doctor tries to make a superwoman of his daughter who has been specially fed, exercised, and conditioned since she was a child in preparation of the Olympics.",
        "runtimeMinutes": "104"
    },
    "1979_74": {
        "plotSummary": "During World War II, a Basque shepherd is approached by the underground, who wants him to lead a scientist and his family across the Pyrenees while being pursued by a sadistic German.",
        "runtimeMinutes": "98"
    },
    "1979_75": {
        "plotSummary": "The younger brother of an assassinated US President is led down a rabbit hole of conspiracies and dead ends after learning of a man claiming to be the real shooter.",
        "runtimeMinutes": "97"
    },
    "1979_76": {
        "plotSummary": "A pyromaniac, ex-employee of a city oil refinery creates an explosion at the facility which starts a chain-reaction of fires that engulf the entire city.",
        "runtimeMinutes": "106"
    },
    "1979_77": {
        "plotSummary": "The two least likely bank robbers in the known universe plan and execute... kind of... the ultimate heist.",
        "runtimeMinutes": "100"
    },
    "1979_78": {
        "plotSummary": "A man escapes from a Louisiana prison to be at the California hospital bedside of his ailing son.",
        "runtimeMinutes": "108"
    },
    "1979_79": {
        "plotSummary": "A World War I deserter competes in the first long-distance motorcycle race.",
        "runtimeMinutes": "99"
    },
    "1979_8": {
        "plotSummary": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.",
        "runtimeMinutes": "147"
    },
    "1979_80": {
        "plotSummary": "When a leak of information in the African section of British Intelligence is discovered, security man Daintry is brought in to investigate.",
        "runtimeMinutes": "115"
    },
    "1979_81": {
        "plotSummary": "A film crew sets out to record a year in the life of an average family, but things quickly start going wrong.",
        "runtimeMinutes": "99"
    },
    "1979_82": {
        "plotSummary": "A smalltime US filmmaker goes to Cannes to try to get his movie in the limelight. A wife of one of the producers there gets interested in his story and they begin an affair.",
        "runtimeMinutes": "93"
    },
    "1979_83": {
        "plotSummary": "A background of rising fascism in Venice in 1930s. A music-student, Matthias, mixes with the town's bourgeoisie and falls in love with a mature teacher, Carla, the mother of his friend Renato, and then with his young colleague, Elena. The ...See moreA background of rising fascism in Venice in 1930s. A music-student, Matthias, mixes with the town's bourgeoisie and falls in love with a mature teacher, Carla, the mother of his friend Renato, and then with his young colleague, Elena. The themes include blackmail, betrayal, seduction, and eventually murder.See less",
        "runtimeMinutes": "105"
    },
    "1979_9": {
        "plotSummary": "A Hollywood composer goes through a mid-life crisis and becomes infatuated with a sexy, newly married woman.",
        "runtimeMinutes": "122"
    }
}