{
    "1981_1": {
        "plotSummary": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its awesome powers.",
        "runtimeMinutes": "115"
    },
    "1981_10": {
        "plotSummary": "A young boy accidentally joins a band of time travelling dwarves, as they jump from era to era looking for treasure to steal.",
        "runtimeMinutes": "116"
    },
    "1981_100": {
        "plotSummary": "A reporter suspects a creepy neighbor, who lives in the high-rise building across from hers, is a serial killer terrorizing the Miami area.",
        "runtimeMinutes": "84"
    },
    "1981_101": {
        "plotSummary": "The adorable little VW helps its owners break up a counterfeiting ring in Mexico.",
        "runtimeMinutes": "100"
    },
    "1981_102": {
        "plotSummary": "Herbie, the Volkswagen Beetle with a mind of its own, is racing in the Monte Carlo Rally. Unbeknownst to Herbie's driver, thieves have hidden a cache of stolen diamonds in Herbie's gas tank, and are now trying to get them back.",
        "runtimeMinutes": "105"
    },
    "1981_103": {
        "plotSummary": "A sex comedy anthology containing four stories, each from a different country (England, France, the U.S., and Italy).",
        "runtimeMinutes": "125"
    },
    "1981_104": {
        "plotSummary": "Tikoyo lives by the Bora Bora lagoon in the South Pacific, where he found a man-eating tiger shark when it was an orphaned baby, just a foot long. He named it Manidu, and it grew to be sixteen feet long. Tikoyo believes that his companion ...See moreTikoyo lives by the Bora Bora lagoon in the South Pacific, where he found a man-eating tiger shark when it was an orphaned baby, just a foot long. He named it Manidu, and it grew to be sixteen feet long. Tikoyo believes that his companion houses the soul of a wise old man, and helps him guard the sacred black pearls in the lagoon. In fact, Manidu does protect Tikoyo and his girlfriend Diana, only eating those who are their enemies, or who seek to destroy their environment, or steal the pearls.See less",
        "runtimeMinutes": "91"
    },
    "1981_105": {
        "plotSummary": "In 19th-century Oklahoma, two teen girls who love stories about outlaws, are on a quest to meet and join up with them. They find a shadow of a former gang and although disappointed, still try to help them escape from a vigorous Marshal.",
        "runtimeMinutes": "97"
    },
    "1981_106": {
        "plotSummary": "Ambitious young Jodie wants more out of life than the small Texas country town she lives in has to offer. Jodie realizes that in order to pursue her dreams she will have to leave Texas and move to the big city. However, her shiftless ...See moreAmbitious young Jodie wants more out of life than the small Texas country town she lives in has to offer. Jodie realizes that in order to pursue her dreams she will have to leave Texas and move to the big city. However, her shiftless factory worker boyfriend Kyle wants to stay in Texas.  Written by WoodyandersSee less",
        "runtimeMinutes": "104"
    },
    "1981_107": {
        "plotSummary": "A few years after the events of Man of Marble, a journalist investigates Mateusz Birkut's son Maciek Tomczyk, now an activist leading a shipyard strike.",
        "runtimeMinutes": "156"
    },
    "1981_108": {
        "plotSummary": "A young girl from a broken home having problems in school and in her personal life, decides to run away to live with her father in the wilderness.",
        "runtimeMinutes": "94"
    },
    "1981_109": {
        "plotSummary": "A mother and daughter find their personalities switched and have to live each other's lives on one strange Friday.",
        "runtimeMinutes": "95"
    },
    "1981_11": {
        "plotSummary": "Perseus must battle Medusa and the Kraken to save the Princess Andromeda.",
        "runtimeMinutes": "118"
    },
    "1981_110": {
        "plotSummary": "During World War II, the British must attack a German ship, but it's safe in neutral Goa. As a result, they send civilians: former soldiers who are about sixty years old.",
        "runtimeMinutes": "120"
    },
    "1981_111": {
        "plotSummary": "A high-spirited wife and her meekish husband hit the road to take back her kids from her previous marriage who live with her ex-inlaws.",
        "runtimeMinutes": "102"
    },
    "1981_112": {
        "plotSummary": "A psychiatrist tells the stories of a transvestite (Glen or Glenda) and a pseudohermaphrodite (Alan or Anne).",
        "runtimeMinutes": "65"
    },
    "1981_113": {
        "plotSummary": "During WW2 Hungarian resistance hides a married couple from the officials. The woman is sent to act as the wife of one of the resistance members who is also in hiding and pretending to be somebody else. They slowly begin to fall in love. Read more: Synopsis",
        "runtimeMinutes": "105"
    },
    "1981_12": {
        "plotSummary": "When a prosecutor leaks a false story that a liquor warehouse owner is involved in the murder of a union head, the man's life begins to unravel.",
        "runtimeMinutes": "116"
    },
    "1981_13": {
        "plotSummary": "A radical American journalist becomes involved with the Communist revolution in Russia, and hopes to bring its spirit and idealism to the United States.",
        "runtimeMinutes": "195"
    },
    "1981_14": {
        "plotSummary": "A little fox named Tod, and Copper, a hound puppy, vow to be best buddies forever. But as Copper grows into a hunting dog, their unlikely friendship faces the ultimate test.",
        "runtimeMinutes": "83"
    },
    "1981_15": {
        "plotSummary": "While on an African expedition with her father, Jane Parker meets Tarzan, and the two become fascinated by each other.",
        "runtimeMinutes": "115"
    },
    "1981_16": {
        "plotSummary": "Military cadets take extreme measures to ensure the future of their academy when its existence is threatened by local condo developers.",
        "runtimeMinutes": "126"
    },
    "1981_17": {
        "plotSummary": "Tom Sharky is demoted to vice after a bust goes terribly wrong. He and his team stumble across a mob murder tied to prostitution and government.",
        "runtimeMinutes": "122"
    },
    "1981_18": {
        "plotSummary": "Merlin the magician helps Arthur Pendragon unite the Britons around the Round Table of Camelot, even as dark forces conspire to tear it apart.",
        "runtimeMinutes": "140"
    },
    "1981_19": {
        "plotSummary": "A high-school student's love for a 15-year-old girl is thwarted by parental disapproval, circumstance, and accident; he burns down her family's house and is committed to psychiatric hospital.",
        "runtimeMinutes": "116"
    },
    "1981_2": {
        "plotSummary": "Norman is a curmudgeon with an estranged relationship with his daughter Chelsea. At Golden Pond, he and his wife nevertheless agree to care for Billy, the son of Chelsea's new boyfriend, and a most unexpected relationship blooms.",
        "runtimeMinutes": "109"
    },
    "1981_20": {
        "plotSummary": "Mel Brooks brings his one-of-a-kind comic touch to the history of mankind covering events from the Old Testament to the French Revolution in a series of episodic comedy vignettes.",
        "runtimeMinutes": "92"
    },
    "1981_21": {
        "plotSummary": "The director of a foster home is forced to move her kids from Philadelphia to Seattle in a broken-down bus driven by a fast-talking parolee assigned to the task. A hilarious road trip adventure.",
        "runtimeMinutes": "94"
    },
    "1981_22": {
        "plotSummary": "Kermit the Frog, The Great Gonzo, and Fozzie Bear are reporters who travel to Britain to interview a rich victim of jewel thieves and help her along with her secretary, Miss Piggy.",
        "runtimeMinutes": "97"
    },
    "1981_23": {
        "plotSummary": "Two American college students on a walking tour of Britain are attacked by a werewolf that none of the locals will admit exists.",
        "runtimeMinutes": "97"
    },
    "1981_24": {
        "plotSummary": "A quiet man's peaceful suburban lifestyle is threatened by the new, obnoxious couple that moves in next door.",
        "runtimeMinutes": "94"
    },
    "1981_25": {
        "plotSummary": "In New York City, South Bronx's main police precinct is nicknamed Fort Apache by its employees who feel like troopers surrounded by hostiles in a wild west isolated outpost.",
        "runtimeMinutes": "125"
    },
    "1981_26": {
        "plotSummary": "When Cinderella's cruel stepmother prevents her from attending the Royal Ball, she gets some unexpected help from the lovable mice Gus and Jaq, and from her Fairy Godmother.",
        "runtimeMinutes": "74"
    },
    "1981_27": {
        "plotSummary": "A movie is being made of a story, set in nineteenth century England, about Charles, a biologist who's engaged to be married, but who falls in love with outcast Sarah, whose melancholy makes her leave him after a short, but passionate ...See moreA movie is being made of a story, set in nineteenth century England, about Charles, a biologist who's engaged to be married, but who falls in love with outcast Sarah, whose melancholy makes her leave him after a short, but passionate affair. Anna (Meryl Streep) and Mike (Jeremy Irons), who play the characters of Sarah and Charles, go, during the shooting of the movie, through a relationship that runs parallel to that of their characters.  Written by Leon Wolters See less",
        "runtimeMinutes": "124"
    },
    "1981_28": {
        "plotSummary": "An immigrant housemaid seduces a 15-year-old boy and later fakes her own death as part of his chauffeur's blackmail plot. Troubles arise when the two start to fall in love.",
        "runtimeMinutes": "87"
    },
    "1981_29": {
        "plotSummary": "Jealous, harried air traffic controller Max Fiedler, recently dumped by his girlfriend, comes into contact with nuclear waste and is granted the power of telekinesis, which he uses not only to win her back, but to gain a little revenge.",
        "runtimeMinutes": "93"
    },
    "1981_3": {
        "plotSummary": "Superman agrees to sacrifice his powers to start a relationship with Lois Lane, unaware that three Kryptonian criminals he inadvertently released are conquering Earth.",
        "runtimeMinutes": "127"
    },
    "1981_30": {
        "plotSummary": "While Sheriff Brackett and Dr. Loomis hunt for Michael Myers, a traumatized Laurie is rushed to hospital, and the serial killer is not far behind her.",
        "runtimeMinutes": "92"
    },
    "1981_31": {
        "plotSummary": "A boozy Broadway actress comes out of a 12-week cure to face the problems of her best friends as well as her needy daughter. She tries to balance the terrors of returning to work with the demands of all around her with humor and insight, ...See moreA boozy Broadway actress comes out of a 12-week cure to face the problems of her best friends as well as her needy daughter. She tries to balance the terrors of returning to work with the demands of all around her with humor and insight, while staying off the booze.  Written by Ed LorussoSee less",
        "runtimeMinutes": "120"
    },
    "1981_32": {
        "plotSummary": "In 1997, when the U.S. president crashes into Manhattan, now a giant maximum security prison, a convicted bank robber is sent in to rescue him.",
        "runtimeMinutes": "99"
    },
    "1981_33": {
        "plotSummary": "In the midst of a searing Florida heat wave, a woman persuades her lover, a small-town lawyer, to murder her rich husband.",
        "runtimeMinutes": "113"
    },
    "1981_34": {
        "plotSummary": "Two generations of men find themselves haunted by the presence of a spectral woman. When the son of one of the elderly men returns to his hometown after his brother's mysterious death, they attempt to unravel her story.",
        "runtimeMinutes": "110"
    },
    "1981_35": {
        "plotSummary": "Mrs. Voorhees is dead, and Camp Crystal Lake is shut down, but a camp next to the infamous place is stalked by an unknown assailant.",
        "runtimeMinutes": "87"
    },
    "1981_36": {
        "plotSummary": "The now adult Antichrist plots to eliminate his future divine opponent while a cabal of monks plot to stop him.",
        "runtimeMinutes": "108"
    },
    "1981_37": {
        "plotSummary": "A housewife grows smaller and smaller in reaction to chemicals found in cosmetics and household products.",
        "runtimeMinutes": "88"
    },
    "1981_38": {
        "plotSummary": "Conservative street cop Deke DaSilva reluctantly agrees to terminate an international terrorist who has demanded media attention. But DaSilva's \"at-home\" tactics are very much put to the challenge.",
        "runtimeMinutes": "99"
    },
    "1981_39": {
        "plotSummary": "The abusive and traumatic adoptive upbringing of Christina Crawford at the hands of her mother, screen queen Joan Crawford, is depicted.",
        "runtimeMinutes": "129"
    },
    "1981_4": {
        "plotSummary": "Alcoholic billionaire playboy Arthur Bach must marry a woman he does not love, or he will be cut off from his $750,000,000 fortune. But when Arthur falls in love with a poor waitress, he must decide if he wants to choose love or money.",
        "runtimeMinutes": "97"
    },
    "1981_40": {
        "plotSummary": "A single man searches for a woman who will bear his baby with no strings attached.",
        "runtimeMinutes": "94"
    },
    "1981_41": {
        "plotSummary": "A visiting dignitary, a CIA agent, a Nazi spy, Japanese tourists, an assassin and a group of \"midget\" actors from The Wizard of Oz all check into an elite Los Angeles hotel called Under the Rainbow.",
        "runtimeMinutes": "98"
    },
    "1981_42": {
        "plotSummary": "After a bizarre and near deadly encounter with a serial killer, a television newswoman is sent to a remote mountain resort whose residents may not be what they seem.",
        "runtimeMinutes": "91"
    },
    "1981_43": {
        "plotSummary": "A ruthless German spy, trying to get out of Britain with vital information about D-Day, must spend time with a young woman and her crippled husband.",
        "runtimeMinutes": "112"
    },
    "1981_44": {
        "plotSummary": "The \"Alison Group\" has bought four beer breweries in difficulties. The young but rising top Manager Frank Macklin is sent to reorganize one of them, the one which happens to be the main company in his hometown. At first his old buddies are...See moreThe \"Alison Group\" has bought four beer breweries in difficulties. The young but rising top Manager Frank Macklin is sent to reorganize one of them, the one which happens to be the main company in his hometown. At first his old buddies are reluctant to have him as new boss, but since he can't save all of them from the severe changes, the climate soon changes. Then he learns that he increased the profit so much, that his bosses have decided to resell his brewery profitably to an incompetent Texas oil millionaire.  Written by Tom Zoerner See less",
        "runtimeMinutes": "100"
    },
    "1981_45": {
        "plotSummary": "A federal marshal stationed at a mining colony on the Jupiter moon of Io uncovers a drug-smuggling conspiracy. He gets no help from the workers or authorities when he finds himself marked for murder.",
        "runtimeMinutes": "109"
    },
    "1981_46": {
        "plotSummary": "Max, a dead corrupt businessman, makes a Faustian pact with Satan's henchman to drive three people to Hell in exchange for longer life. Soon Max realizes that there still may be good in him.",
        "runtimeMinutes": "96"
    },
    "1981_47": {
        "plotSummary": "A caveman seeks revenge on a much larger competitor for the hand of a beautiful cavewoman.",
        "runtimeMinutes": "91"
    },
    "1981_48": {
        "plotSummary": "A hard-nosed Chicago journalist has an unlikely love affair with an eagle researcher.",
        "runtimeMinutes": "103"
    },
    "1981_49": {
        "plotSummary": "A small town stud wants to go to Nashville and be a big country star. His ambitious kid sister works as his manager. When they cross paths with a small town sheriff, their dream comes in jeopardy.",
        "runtimeMinutes": "112"
    },
    "1981_5": {
        "plotSummary": "Two friends who are dissatisfied with their jobs decide to join the army for a bit of fun.",
        "runtimeMinutes": "106"
    },
    "1981_50": {
        "plotSummary": "A young black pianist becomes embroiled in the lives of an upper-class white family set among the racial tensions, infidelity, violence, and other nostalgic events in early 1900s New York City.",
        "runtimeMinutes": "155"
    },
    "1981_51": {
        "plotSummary": "A movie producer who made a huge flop tries to salvage his career by revamping his film as an erotic production, where its family-friendly star takes her top off.",
        "runtimeMinutes": "122"
    },
    "1981_52": {
        "plotSummary": "Liz and Merry Noel become friends as college roommates and their friendship endures over the years. Liz becomes a respected \"serious\" novelist. Merry Noel marries, has a daughter and writes, too: \"trash\" fiction which becomes enormously ...See moreLiz and Merry Noel become friends as college roommates and their friendship endures over the years. Liz becomes a respected \"serious\" novelist. Merry Noel marries, has a daughter and writes, too: \"trash\" fiction which becomes enormously successful. Their story begins in college and jumps ahead some years at a time to show their relationship with each other and those in their orbits as they grow and mature.  Written by Ron Kerrigan See less",
        "runtimeMinutes": "117"
    },
    "1981_53": {
        "plotSummary": "A scientist sends a man with extraordinary psychic powers to hunt others like him.",
        "runtimeMinutes": "103"
    },
    "1981_54": {
        "plotSummary": "A young wizarding apprentice is sent to kill a dragon which has been devouring girls from a nearby kingdom.",
        "runtimeMinutes": "108"
    },
    "1981_55": {
        "plotSummary": "A worldly ambitious monsignor clashes with his older brother, a cynical Los Angeles homicide detective who is investigating the brutal murder of a young prostitute.",
        "runtimeMinutes": "108"
    },
    "1981_56": {
        "plotSummary": "In a corrupt city, a small-time gangster and the estranged wife of a pot dealer find themselves thrown together in an escapade of love, money, drugs and danger.",
        "runtimeMinutes": "104"
    },
    "1981_57": {
        "plotSummary": "The sole surviving Texas Ranger (Klinton Spilsbury) of an ambush arranged by outlaw leader Major Bartholomew \"Butch\" Cavendish (Christopher Lloyd) returns to fight back as a great masked western hero, The Lone Ranger.",
        "runtimeMinutes": "98"
    },
    "1981_58": {
        "plotSummary": "For the first time in history a woman is appointed to the U.S. Supreme Court, where she becomes a friendly rival to a liberal associate.",
        "runtimeMinutes": "98"
    },
    "1981_59": {
        "plotSummary": "The sensuous wife of a lunch wagon proprietor and a rootless drifter begin a sordidly steamy affair and conspire to murder her Greek husband.",
        "runtimeMinutes": "122"
    },
    "1981_6": {
        "plotSummary": "A wide variety of eccentric competitors participate in a wild and illegal cross-country road race. However, the eccentric entrants will do anything to win the road race, including low-down, dirty tricks.",
        "runtimeMinutes": "95"
    },
    "1981_60": {
        "plotSummary": "A movie sound recordist accidentally records the evidence that proves that a car accident was actually murder and consequently finds himself in danger.",
        "runtimeMinutes": "108"
    },
    "1981_61": {
        "plotSummary": "A prostitute and a drifter find themselves bound together as they make their way through the rural South, doing what they have to do to survive.",
        "runtimeMinutes": "94"
    },
    "1981_62": {
        "plotSummary": "A former ace safe-cracker is trying to go straight--if he can score one last big heist for the mob.",
        "runtimeMinutes": "123"
    },
    "1981_63": {
        "plotSummary": "As allied P.O.W.s prepare for a soccer game against the German National Team to be played in Nazi-occupied Paris, the French Resistance and British officers are making plans for the team's escape.",
        "runtimeMinutes": "116"
    },
    "1981_64": {
        "plotSummary": "The wife of a murdered petrochemical company chairman and a banker investigating the liquidity of his new bank stumble upon an international financial scheme that could lead to global economic collapse.",
        "runtimeMinutes": "116"
    },
    "1981_65": {
        "plotSummary": "A New York cop investigates a series of brutal deaths that resemble animal attacks.",
        "runtimeMinutes": "115"
    },
    "1981_66": {
        "plotSummary": "When a rich white corporate executive finds out that he has an illegitimate black son, things start falling apart for him at home, at work, and in his social circles.",
        "runtimeMinutes": "92"
    },
    "1981_67": {
        "plotSummary": "During the Great Depression, a sheet-music salesman seeks to escape his dreary life through popular music and a love affair with an innocent schoolteacher.",
        "runtimeMinutes": "108"
    },
    "1981_68": {
        "plotSummary": "After her husband dies under mysterious circumstances, a widow becomes increasingly paranoid of the neighboring religious community that may have diabolical plans for her.",
        "runtimeMinutes": "100"
    },
    "1981_69": {
        "plotSummary": "Ken Harrison is an artist who makes sculptures. One day he is involved in a car accident, and is paralyzed from his neck down. All he can do is talk, and he wants to die. In hospital he make friends with some of the staff, and they support...See moreKen Harrison is an artist who makes sculptures. One day he is involved in a car accident, and is paralyzed from his neck down. All he can do is talk, and he wants to die. In hospital he make friends with some of the staff, and they support him when he goes to trial to be allowed to die.  Written by Eva Kristin Berntzen See less",
        "runtimeMinutes": "119"
    },
    "1981_7": {
        "plotSummary": "Two British track athletes, one a determined Jew, and the other a devout Christian, compete in the 1924 Olympics.",
        "runtimeMinutes": "125"
    },
    "1981_70": {
        "plotSummary": "A New York City narcotics detective reluctantly agrees to cooperate with a special commission investigating police corruption, and soon realises he's in over his head, and nobody can be trusted.",
        "runtimeMinutes": "167"
    },
    "1981_71": {
        "plotSummary": "Four teenagers visit a local carnival for a night of innocent amusement. They soon discover, however, that there is nothing innocent or amusing there at all.",
        "runtimeMinutes": "96"
    },
    "1981_72": {
        "plotSummary": "During a high profile Mafia testimony case in California's Riverside County, a hired killer checks into a hotel room near the courthouse, while his depressed next-door neighbor wants to commit suicide due to marital problems.",
        "runtimeMinutes": "96"
    },
    "1981_73": {
        "plotSummary": "Nightclub owner Renato and his transvestite companion/lover Albin becoming involved with the local cops and foreign spies when Albin unwittingly gets his hands on a roll of stolen microfilm. The gay couple then hide out in Renato's native ...See moreNightclub owner Renato and his transvestite companion/lover Albin becoming involved with the local cops and foreign spies when Albin unwittingly gets his hands on a roll of stolen microfilm. The gay couple then hide out in Renato's native Italy, but find little peace there with their frequent bickering among themselves.See less",
        "runtimeMinutes": "101"
    },
    "1981_74": {
        "plotSummary": "Harry Sears manages The California Dolls, a female wrestling tag team who tour America, hoping for a chance at winning big time. Harry's also romantically involved with one of them. Their fortunes seem osecondary to him (particularly when ...See moreHarry Sears manages The California Dolls, a female wrestling tag team who tour America, hoping for a chance at winning big time. Harry's also romantically involved with one of them. Their fortunes seem osecondary to him (particularly when Harry accepts an engagement involving mud wrestling!) but then a chance at the big ring match beckons, in Reno, Nevada  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "113"
    },
    "1981_75": {
        "plotSummary": "A janitor who claims he's seen a murder becomes romantically involved with the glamorous TV reporter covering the story.",
        "runtimeMinutes": "103"
    },
    "1981_76": {
        "plotSummary": "Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in Turkey during World War I.",
        "runtimeMinutes": "110"
    },
    "1981_77": {
        "plotSummary": "A decades-old folk tale surrounding a deranged murderer killing those who celebrate Valentine's Day turns out to be true to legend when a group defies the killer's order and people start turning up dead.",
        "runtimeMinutes": "90"
    },
    "1981_78": {
        "plotSummary": "When his father - who owned a circus - dies, Foster inherits 5 million dollars - and 3 orangutans. However there's a condition connected to the money: if he gives away the orangutans or just one gets sick or dies during the next 3 years, ...See moreWhen his father - who owned a circus - dies, Foster inherits 5 million dollars - and 3 orangutans. However there's a condition connected to the money: if he gives away the orangutans or just one gets sick or dies during the next 3 years, the zoological society will get all the money. So he not only has to deal with 3 apes and an annoyed girlfriend, but also with Laszlo, a kooky new roommate who came from the circus to help with the apes, a greedy zoological society's president, 3 bumbling henchmen and a cranky landlord.  Written by Tom Zoerner See less",
        "runtimeMinutes": "87"
    },
    "1981_79": {
        "plotSummary": "Mercenary James Shannon, on a reconnaissance job to the African nation of Zangaro, is tortured and deported. He returns to lead a coup.",
        "runtimeMinutes": "119"
    },
    "1981_8": {
        "plotSummary": "James Bond is assigned to find a missing British vessel, equipped with a weapons encryption device and prevent it from falling into enemy hands.",
        "runtimeMinutes": "127"
    },
    "1981_80": {
        "plotSummary": "A serial killer with his signature heavy breathing proceeds to systematically kill the students and teachers of Lamab high school.",
        "runtimeMinutes": "86"
    },
    "1981_81": {
        "plotSummary": "When a family moves to a country home, the young girls experience strange happenings that have a link to an occult event years past.",
        "runtimeMinutes": "84"
    },
    "1981_82": {
        "plotSummary": "A drummer plants doubts into the mind of a bandleader about his wife's faithfulness in an attempt to take over the band himself.",
        "runtimeMinutes": "87"
    },
    "1981_83": {
        "plotSummary": "A speculation on the fate of the famous hijacker who parachuted with his ransom and disappeared in the mountains, has Cooper following a meticulous plan to disappear into anonymity despite the best efforts of a dogged cop.",
        "runtimeMinutes": "100"
    },
    "1981_84": {
        "plotSummary": "When barrio leader Henry Reyna and his friends are unjustly convicted on circumstantial evidence, activist lawyers Alice Bloomfield and George Shearer fight the blatant racially motivated miscarriage of justice to win them their freedom.",
        "runtimeMinutes": "103"
    },
    "1981_85": {
        "plotSummary": "Douglas, a record salesman, is an obsessive fan of actress Sally Ross. When his letters are rejected, he strikes out at her and her loved ones.",
        "runtimeMinutes": "95"
    },
    "1981_86": {
        "plotSummary": "In occupied Paris, an actress married to a Jewish theater owner must keep him hidden from the Nazis while doing both of their jobs.",
        "runtimeMinutes": "131"
    },
    "1981_87": {
        "plotSummary": "Susan Anspach stars in this comedy as a news reporter who investigates a story about stolen milk causing milk and gas prices to rise. During the course of her investigation, other people become involved, culminating in a multiple car chase.See moreSusan Anspach stars in this comedy as a news reporter who investigates a story about stolen milk causing milk and gas prices to rise. During the course of her investigation, other people become involved, culminating in a multiple car chase.  Written by Ari Herzog See less",
        "runtimeMinutes": "94"
    },
    "1981_88": {
        "plotSummary": "Albert Brooks directs himself as a successful film editor with far too many issues that affects the relationship between him and his remarkably patient girlfriend.",
        "runtimeMinutes": "93"
    },
    "1981_89": {
        "plotSummary": "A comic book artist loses his hand, which in turn takes on a murderous life of its own.",
        "runtimeMinutes": "104"
    },
    "1981_9": {
        "plotSummary": "Three middle-aged wealthy couples take vacations together in Spring, Summer, Autumn and Winter. Along the way we are treated to mid-life, marital, parental and other crises.See moreThree middle-aged wealthy couples take vacations together in Spring, Summer, Autumn and Winter. Along the way we are treated to mid-life, marital, parental and other crises.  Written by Robert Nolty See less",
        "runtimeMinutes": "107"
    },
    "1981_90": {
        "plotSummary": "Two household robots run away and try to start a family.",
        "runtimeMinutes": "78"
    },
    "1981_91": {
        "plotSummary": "The life and career of Elvis Presley are chronicled in home movies, concert footage, and dramatizations. Subjects include early performances, army service, Ed Sullivan Show appearance, marriage, 1968 comeback, health decline and death.",
        "runtimeMinutes": "101"
    },
    "1981_92": {
        "plotSummary": "Egyptologist Erica Baron finds more than she bargained for during her long-planned trip to The Land of the Pharoahs: murder, theft, betrayal, love, and a mummy's curse.",
        "runtimeMinutes": "118"
    },
    "1981_93": {
        "plotSummary": "A satire of American progression in which a mayor tries to bribe an official to ensure a ramp connects Ticlaw to an up-and-coming intrastate. When his plan fails, the town residents are forced to take matters into their own hands.",
        "runtimeMinutes": "107"
    },
    "1981_94": {
        "plotSummary": "A divorcee with two sons has an affair with a young sailor passing through her Texas town in 1944.",
        "runtimeMinutes": "94"
    },
    "1981_95": {
        "plotSummary": "A group of friends race their high-powered cars up and down a dangerous and deadly mountain road known as Mulholland Drive to see who can claim the title of \"King of the Hill.\"",
        "runtimeMinutes": "90"
    },
    "1981_96": {
        "plotSummary": "Richard spots a man dumping a body, and decides to expose the man he thinks is the culprit with his friend Alex Cutter.",
        "runtimeMinutes": "109"
    },
    "1981_97": {
        "plotSummary": "Based on the biography of Olive Fredrickson, It tells of her life as a girl, then a trapper's wife and later a widow with three small children surviving under rugged pioneer conditions in northern Alberta Canada from the early 1900's ...See moreBased on the biography of Olive Fredrickson, It tells of her life as a girl, then a trapper's wife and later a widow with three small children surviving under rugged pioneer conditions in northern Alberta Canada from the early 1900's through to the Depression.  Written by markyoloupSee less",
        "runtimeMinutes": "94"
    },
    "1981_98": {
        "plotSummary": "Isaac Stern's cultural tour of China is seen, with the master violinist performing and mentoring young Chinese musicians. He visits rehearsals of the Peking Opera, meeting with their musicians who use traditional Chinese instruments, and ...See moreIsaac Stern's cultural tour of China is seen, with the master violinist performing and mentoring young Chinese musicians. He visits rehearsals of the Peking Opera, meeting with their musicians who use traditional Chinese instruments, and also visits a sports academy and other venues. The lingering effects of the Cultural Revolution (1966-1976), which opposed any western influences and oppressed those who introduced western approaches, are evident in the lack of skill development among many of the young musicians and the emphasis on technical skill rather than artistic interpretation.  Written by scgary66See less",
        "runtimeMinutes": "84"
    },
    "1981_99": {
        "plotSummary": "Who's been decapitating the innocent girls at a local night school? The police are baffled.",
        "runtimeMinutes": "88"
    }
}