{
    "1982_1": {
        "plotSummary": "A troubled child summons the courage to help a friendly alien escape Earth and return to his home world.",
        "runtimeMinutes": "115"
    },
    "1982_10": {
        "plotSummary": "A town's Sheriff and regular patron of a historical whorehouse fights to keep it running when a television reporter targets it as the Devil's playhouse.",
        "runtimeMinutes": "114"
    },
    "1982_100": {
        "plotSummary": "A boy with a music talent goes on a journey with his uncle for a stage concert.",
        "runtimeMinutes": "122"
    },
    "1982_101": {
        "plotSummary": "Dr Daniel Jekyll researching into drugs that would help mankind avoid surgery discovers a white powder that unleashes the animal in every man, and in his case turning him from a shy and timid doctor into a wild sex crazed party animal. To ...See moreDr Daniel Jekyll researching into drugs that would help mankind avoid surgery discovers a white powder that unleashes the animal in every man, and in his case turning him from a shy and timid doctor into a wild sex crazed party animal. To the delight and dismay of both his rich fiancee and stripper girlfriend.  Written by Carlos \"Da'Losman\" Diaz See less",
        "runtimeMinutes": "87"
    },
    "1982_102": {
        "plotSummary": "A TV reporter finds himself in the middle of an Arab leader buying two portable nukes, terrorists, arms dealer, a reporter/CIA spy killed, a US president ordering a K-I-L-L etc.",
        "runtimeMinutes": "117"
    },
    "1982_103": {
        "plotSummary": "It's a hard crime story about a Philadelphia shop owner who has enough of the criminals' violences and ravages. He organizes a patrol of civil people. It all starts to go wrong because his team's actions are taken as racial discrimination ...See moreIt's a hard crime story about a Philadelphia shop owner who has enough of the criminals' violences and ravages. He organizes a patrol of civil people. It all starts to go wrong because his team's actions are taken as racial discrimination ...  Written by Kornel Osvart See less",
        "runtimeMinutes": "98"
    },
    "1982_104": {
        "plotSummary": "An ex-con, on parole and trying to straighten his life out, decides to resume his boxing career when one of his prison enemies escapes and kills his girlfriend.",
        "runtimeMinutes": "108"
    },
    "1982_105": {
        "plotSummary": "A down-and-out American boxer becomes involved in a feud between two Japanese brothers.",
        "runtimeMinutes": "113"
    },
    "1982_106": {
        "plotSummary": "Good-looking but virginal \"rockstar\" teen Tommy (Michael Morgan) tries to score with some of the local high school girls. But a classmate's mom (Dame Joan Collins) decides to make a man out of him. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "1982_107": {
        "plotSummary": "Harold, a professional gambler, and his girlfriend Bonita, a lounge singer, follow Willie, a young blackjack dealer, around the western U.S. Harold has a jinx on Willie and can't lose with him. Bonita and Willie meet and fall for each ...See moreHarold, a professional gambler, and his girlfriend Bonita, a lounge singer, follow Willie, a young blackjack dealer, around the western U.S. Harold has a jinx on Willie and can't lose with him. Bonita and Willie meet and fall for each other and plot to do away with Harold and collect on his life insurance.  Written by Dan Larsen See less",
        "runtimeMinutes": "103"
    },
    "1982_108": {
        "plotSummary": "Popular comedians watch and give comments about the worst and silliest films from Hollywood.",
        "runtimeMinutes": "80"
    },
    "1982_109": {
        "plotSummary": "The 11-year old daughter and girlfriend of a man whose wife had been raped and killed in front of his daughter three years earlier are kidnapped by the same killer. Held captive in a bunker below Grand Central Station, the two plot their ...See moreThe 11-year old daughter and girlfriend of a man whose wife had been raped and killed in front of his daughter three years earlier are kidnapped by the same killer. Held captive in a bunker below Grand Central Station, the two plot their escape while the police try to track the kidnapper.  Written by Jerry Milani See less",
        "runtimeMinutes": "92"
    },
    "1982_11": {
        "plotSummary": "A young boy, Conan, becomes a slave after his parents are killed and tribe destroyed by a savage warlord and sorcerer, Thulsa Doom. When he grows up he becomes a fearless, invincible fighter. Set free, he plots revenge against Thulsa Doom.",
        "runtimeMinutes": "129"
    },
    "1982_110": {
        "plotSummary": "The story of one man's hilarious - and doomed - attempts to wield life's ultimate double-edged sword: infidelity.",
        "runtimeMinutes": "95"
    },
    "1982_111": {
        "plotSummary": "A famous opera singer, Giorgio Fini, loses his voice during an American tour. He goes to a female throat specialist, Pamela Taylor, whom he falls in love with.See moreA famous opera singer, Giorgio Fini, loses his voice during an American tour. He goes to a female throat specialist, Pamela Taylor, whom he falls in love with.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "110"
    },
    "1982_112": {
        "plotSummary": "A young cowboy hooks up with a legendary outlaw, and before long both are on the run from the law.",
        "runtimeMinutes": "90"
    },
    "1982_113": {
        "plotSummary": "A PI investigates the murder of his one-armed friend, a PI working on a case. Clues lead to a sex clinic. Bodies pile up.",
        "runtimeMinutes": "111"
    },
    "1982_114": {
        "plotSummary": "About a retired New York cop on Vacation in America's West who is drawn into a female sheriff's investigation of a mysterious series of cattle killings.",
        "runtimeMinutes": "97"
    },
    "1982_115": {
        "plotSummary": "A disturbed telepathic man is unable to fully control his ability to transmit his dreams and visions into the minds of the people around him, or even influence reality. A female therapist tries to help him, but his mother gets in the way.",
        "runtimeMinutes": "91"
    },
    "1982_116": {
        "plotSummary": "Two gamblers must leave New York City after one loses a lot of money. Doing what all gamblers in trouble would do, they hurry to the gambling capital Las Vegas to turn their luck around.See moreTwo gamblers must leave New York City after one loses a lot of money. Doing what all gamblers in trouble would do, they hurry to the gambling capital Las Vegas to turn their luck around.  Written by Melissa Portell See less",
        "runtimeMinutes": "105"
    },
    "1982_117": {
        "plotSummary": "A fan club of die-hard James Dean fans meet on the 20th anniversary of his death and reconnect, opening old wounds and facing new ones.",
        "runtimeMinutes": "109"
    },
    "1982_118": {
        "plotSummary": "A young American family moves to a House in Kyoto, Japan. It turns out to be haunted by the ghosts of a woman and her lover, who were killed by the woman's husband, as well as the ghost of the husband, who killed himself afterward.",
        "runtimeMinutes": "88"
    },
    "1982_119": {
        "plotSummary": "A couple has a fight after living together 5 years in Las Vegas. They go out and celebrate 4th of July, each with a new partner. Breakup?",
        "runtimeMinutes": "107"
    },
    "1982_12": {
        "plotSummary": "A young orphan girl's adventures in finding a family that will take her.",
        "runtimeMinutes": "126"
    },
    "1982_120": {
        "plotSummary": "Documentary about the blacklisted folk group, \"The Weavers,\" and the events leading up to their triumphant return to Carnegie Hall.",
        "runtimeMinutes": "78"
    },
    "1982_121": {
        "plotSummary": "The Monty Python troupe perform a combination of classic sketches and new material at the Hollywood Bowl.",
        "runtimeMinutes": "77"
    },
    "1982_122": {
        "plotSummary": "A true story about Emmy-winning documentary filmmaker Barbara Gordon's Valium addiction and her desperate attempts to kick the habit.",
        "runtimeMinutes": "107"
    },
    "1982_123": {
        "plotSummary": "A rootless young man's drawn into an unnamed religious cult by a beautiful girl. Every moment with the group causes him to become increasingly under the control of the cult's leader. After his parents fail in their attempt, they hire ...See moreA rootless young man's drawn into an unnamed religious cult by a beautiful girl. Every moment with the group causes him to become increasingly under the control of the cult's leader. After his parents fail in their attempt, they hire someone who has experience, kidnapPing, and then 'de-programming' - undoing the mental damage - which had been done to him.  Written by Tilman Hausherr See less",
        "runtimeMinutes": "111"
    },
    "1982_124": {
        "plotSummary": "Sir Sean Connery stars in Fred Zinnemann's haunting tale of incestuous love set against a magnificent background of the Swiss Alps.",
        "runtimeMinutes": "96"
    },
    "1982_125": {
        "plotSummary": "Teenager Danny Masters, the son of the late Harry Masters, considered the second best escape artist in history, wants to follow in his father's footsteps, he already a skilled but untested magician. As far as Danny knows, his father died ...See moreTeenager Danny Masters, the son of the late Harry Masters, considered the second best escape artist in history, wants to follow in his father's footsteps, he already a skilled but untested magician. As far as Danny knows, his father died in a dangerous escape routine. Escaping from under his grandmother's roof, Danny, in a step to achieve his goal as they have all his father's old professional paraphernalia, reunites with his Aunt Sibyl and Uncle Burke in the town of Harding where they have a mind-reading act, she who actually can read minds but which only impinges on the smoke and mirrors they've developed with the act itself. In his wanderings around Harding, Danny gets involved with corrupt Stu Quiñones, and indirectly with Stu's equally corrupt father, the town's mayor, Leon Quiñones. This father/son pair no longer associate with each other as although Stu aspires to be as corrupt as his father, Stu's activities are a little too brazen and public for a politician with which to deal. In those dealings, Danny devises what is largely seen as a publicity stunt in reality to get the one up on the Quiñoneses, but in which he will have to show his true mettle as a great escape artist. In the process, Danny may also provide some justice for his father, the true nature of his death which Danny learns along the way.  Written by HuggoSee less",
        "runtimeMinutes": "94"
    },
    "1982_126": {
        "plotSummary": "Rival book salesmen Bugs Bunny and Daffy Duck are forced by Sultan Yosemite Sam to read fairy tales to his spoiled, selfish son, Prince Abba-Dabba.",
        "runtimeMinutes": "74"
    },
    "1982_127": {
        "plotSummary": "A parody of film genres composed of three shorts, spoofing personal growth films, glossy soap operas, and police stories.",
        "runtimeMinutes": "89"
    },
    "1982_128": {
        "plotSummary": "A trainer attempts to retrain a vicious dog that's been raised to attack black people.",
        "runtimeMinutes": "90"
    },
    "1982_129": {
        "plotSummary": "Fictional account of real-life mystery writer Dashiell Hammett, and his involvement in the investigation of a beautiful Chinese cabaret actress' mysterious disappearance in San Francisco.",
        "runtimeMinutes": "97"
    },
    "1982_13": {
        "plotSummary": "A lawyer sees the chance to salvage his career and self-respect by taking a medical malpractice case to trial rather than settling.",
        "runtimeMinutes": "129"
    },
    "1982_130": {
        "plotSummary": "Corrine Burns retreats far into plans for her band, The Fabulous Stains, after her mother's death. So far that she gets them (she and two cousins) on a tour with a washed-out glam-rock group and a rising British punk band, radically ...See moreCorrine Burns retreats far into plans for her band, The Fabulous Stains, after her mother's death. So far that she gets them (she and two cousins) on a tour with a washed-out glam-rock group and a rising British punk band, radically changes her appearance, attracts a cult following and national media attention. With luck like this, what could go wrong?  Written by Renee Ann Byrd See less",
        "runtimeMinutes": "87"
    },
    "1982_131": {
        "plotSummary": "A billionaire businessman hires a man to influence a South American dictator. He winds up having an affair with the billionaire's wife.",
        "runtimeMinutes": "90"
    },
    "1982_14": {
        "plotSummary": "The life of the lawyer who became the famed leader of the Indian revolts against the British rule through his philosophy of nonviolent protest.",
        "runtimeMinutes": "191"
    },
    "1982_15": {
        "plotSummary": "An underemployed reporter finds himself literally purchased as a toy for a rich spoiled brat.",
        "runtimeMinutes": "102"
    },
    "1982_16": {
        "plotSummary": "A pilot is sent into the Soviet Union on a mission to steal a prototype jet fighter that can be partially controlled by a neuralink.",
        "runtimeMinutes": "136"
    },
    "1982_17": {
        "plotSummary": "On another planet in the distant past, a Gelfling embarks on a quest to find the missing shard of a magical crystal, and so restore order to his world.",
        "runtimeMinutes": "93"
    },
    "1982_18": {
        "plotSummary": "A mercenary with a three-bladed sword rediscovers his royal heritage's dangerous future when he is recruited to help a princess foil the designs of a brutal tyrant and a powerful sorcerer in conquering a land.",
        "runtimeMinutes": "100"
    },
    "1982_19": {
        "plotSummary": "When a professional couple who have lived & worked together for many years finally decide to marry, their sudden betrothal causes many unexpectedly funny and awkward difficulties. They soon find that being married is often quite different ...See moreWhen a professional couple who have lived & worked together for many years finally decide to marry, their sudden betrothal causes many unexpectedly funny and awkward difficulties. They soon find that being married is often quite different from being \"best friends.\"  Written by Ary Luiz Dalazen Jr. See less",
        "runtimeMinutes": "116"
    },
    "1982_2": {
        "plotSummary": "Michael Dorsey, an unsuccessful actor, disguises himself as a woman in order to get a role on a trashy hospital soap.",
        "runtimeMinutes": "116"
    },
    "1982_20": {
        "plotSummary": "Richard Pryor performs his stand-up comedy act on the Sunset Strip.",
        "runtimeMinutes": "82"
    },
    "1982_21": {
        "plotSummary": "Having revived from his wounds, Jason Voorhees takes refuge at a cabin near Crystal Lake. As a group of co-eds arrive for their vacation, Jason continues his killing spree.",
        "runtimeMinutes": "95"
    },
    "1982_22": {
        "plotSummary": "A computer hacker is abducted into the digital world and forced to participate in gladiatorial games where his only chance of escape is with the help of a heroic security program.",
        "runtimeMinutes": "96"
    },
    "1982_23": {
        "plotSummary": "It's a spoof on hospital soap operas with a few gangsters thrown in. A new batch of interns begins at City Hospital.",
        "runtimeMinutes": "96"
    },
    "1982_24": {
        "plotSummary": "Sophie is the survivor of Nazi concentration camps, who has found a reason to live with Nathan, a sparkling if unsteady American Jew obsessed with the Holocaust.",
        "runtimeMinutes": "150"
    },
    "1982_25": {
        "plotSummary": "A struggling young writer finds his life and work dominated by his unfaithful wife and his radical feminist mother, whose best-selling manifesto turns her into a cultural icon.",
        "runtimeMinutes": "136"
    },
    "1982_26": {
        "plotSummary": "A struggling female soprano finds work playing a male female impersonator, but it complicates her personal life.",
        "runtimeMinutes": "134"
    },
    "1982_27": {
        "plotSummary": "A blade runner must pursue and terminate four replicants who stole a ship in space, and have returned to Earth to find their creator.",
        "runtimeMinutes": "117"
    },
    "1982_28": {
        "plotSummary": "A faulty computer causes a passenger space shuttle to head straight for the Sun. Can Ted Striker save the day and get the shuttle back on track - again?",
        "runtimeMinutes": "85"
    },
    "1982_29": {
        "plotSummary": "A group of Southern California high school students are enjoying their most important subjects: sex, drugs, and rock n' roll.",
        "runtimeMinutes": "90"
    },
    "1982_3": {
        "plotSummary": "A young man must complete his work at a Navy Officer Candidate School to become an aviator, with the help of a tough Gunnery Sergeant and his new girlfriend.",
        "runtimeMinutes": "124"
    },
    "1982_30": {
        "plotSummary": "A Vietnam vet returns home from a prisoner of war camp and is greeted as a hero, but is quickly forgotten and soon discovers how tough survival is in his own country.See moreA Vietnam vet returns home from a prisoner of war camp and is greeted as a hero, but is quickly forgotten and soon discovers how tough survival is in his own country.  Written by JD-2 See less",
        "runtimeMinutes": "97"
    },
    "1982_31": {
        "plotSummary": "In the post-apocalyptic Australian wasteland, a cynical drifter agrees to help a small, gasoline-rich community escape a horde of bandits.",
        "runtimeMinutes": "96"
    },
    "1982_32": {
        "plotSummary": "The story of a young deer growing up in the forest.",
        "runtimeMinutes": "70"
    },
    "1982_33": {
        "plotSummary": "A confined but troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
        "runtimeMinutes": "95"
    },
    "1982_34": {
        "plotSummary": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its awesome powers.",
        "runtimeMinutes": "115"
    },
    "1982_35": {
        "plotSummary": "Cheech and Chong are hired to drive a limo from Chicago to Las Vegas by two shady Arabs - Mr. Slyman (Cheech) and Prince Habib (Chong). Unbeknownst to them, five million dollars of dirty money has been stuffed throughout the car.",
        "runtimeMinutes": "90"
    },
    "1982_36": {
        "plotSummary": "A morgue attendant is talked into running a brothel at his workplace after a deceased pimp is sent there. However, the pimp's killers don't look too kindly on this new 'business', nor does the morgue's owner.",
        "runtimeMinutes": "106"
    },
    "1982_37": {
        "plotSummary": "An anthology which tells five terrifying tales inspired by the E.C. horror comic books of the 1950s.",
        "runtimeMinutes": "120"
    },
    "1982_38": {
        "plotSummary": "This story takes place in prehistoric time when three tribesmen search for a new fire source.",
        "runtimeMinutes": "100"
    },
    "1982_39": {
        "plotSummary": "In 1880s Australia, after young Jim Craig's father dies, Jim takes a job at the Harrison cattle ranch, where he is forced to become a man.",
        "runtimeMinutes": "102"
    },
    "1982_4": {
        "plotSummary": "A veteran Green Beret is forced by a cruel Sheriff and his deputies to flee into the mountains and wage an escalating one-man war against his pursuers.",
        "runtimeMinutes": "93"
    },
    "1982_40": {
        "plotSummary": "A race car driver is driving to a race in a motor home with his race car on a trailer. His car gets stripped of parts. He ends up with 6 orphan kids on his way to the race.",
        "runtimeMinutes": "108"
    },
    "1982_41": {
        "plotSummary": "A dissolute matinee idol is slated to appear on a live TV variety show.",
        "runtimeMinutes": "92"
    },
    "1982_42": {
        "plotSummary": "A research team in Antarctica is hunted by a shape-shifting alien that assumes the appearance of its victims.",
        "runtimeMinutes": "109"
    },
    "1982_43": {
        "plotSummary": "A Broadway playwright puts murder in his plan to take credit for a student's play.",
        "runtimeMinutes": "116"
    },
    "1982_44": {
        "plotSummary": "Film noir parody with a detective uncovering a sinister plot. Characters from real noirs appear as scenes from various films are intercut.",
        "runtimeMinutes": "88"
    },
    "1982_45": {
        "plotSummary": "Wendy and her brothers are whisked away to the magical world of Neverland with the hero of their stories, Peter Pan.",
        "runtimeMinutes": "77"
    },
    "1982_46": {
        "plotSummary": "A high school science nerd gains telekinetic powers after a laboratory accident and uses them for revenge upon bullies.",
        "runtimeMinutes": "98"
    },
    "1982_47": {
        "plotSummary": "A goofy Korean finds his life hopelessly complicated with people continually confusing him with Bruce Lee.",
        "runtimeMinutes": "87"
    },
    "1982_48": {
        "plotSummary": "Architect Paul Kersey once again becomes a vigilante when he tries to find the five street punks who murdered his daughter and housekeeper, this time on the dark streets of Los Angeles.",
        "runtimeMinutes": "89"
    },
    "1982_49": {
        "plotSummary": "The ghost of a dead husband haunts his wife as she moves back to their house in NYC. She's about to marry an egyptologist there.",
        "runtimeMinutes": "101"
    },
    "1982_5": {
        "plotSummary": "After winning the ultimate title and being the world champion, Rocky falls into a hole and finds himself picked up by a former enemy.",
        "runtimeMinutes": "99"
    },
    "1982_50": {
        "plotSummary": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.",
        "runtimeMinutes": "121"
    },
    "1982_51": {
        "plotSummary": "A British student at a 1960s American high school must prove himself to the leader of a girls' gang whose members can only date greasers.",
        "runtimeMinutes": "115"
    },
    "1982_52": {
        "plotSummary": "To save her ill son, a field mouse must seek the aid of a colony of rats, with whom she has a deeper link than she ever suspected.",
        "runtimeMinutes": "82"
    },
    "1982_53": {
        "plotSummary": "Kids all over America want Silver Shamrock masks for Halloween. Doctor Daniel Challis seeks to uncover a plot by Silver Shamrock owner Conal Cochran.",
        "runtimeMinutes": "98"
    },
    "1982_54": {
        "plotSummary": "A group of college-age buddies struggle with their imminent passage into adulthood in 1959 Baltimore.",
        "runtimeMinutes": "110"
    },
    "1982_55": {
        "plotSummary": "A sword-and-sorcery fantasy about a young man's search for revenge. Armed with supernatural powers, the handsome hero and his animal allies wage war against marauding forces.",
        "runtimeMinutes": "118"
    },
    "1982_56": {
        "plotSummary": "When an idealistic American writer disappears during the Chilean coup d'etat in September 1973, his wife and father try to find him.",
        "runtimeMinutes": "122"
    },
    "1982_57": {
        "plotSummary": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader and a bounty hunter named Boba Fett all over the galaxy.",
        "runtimeMinutes": "124"
    },
    "1982_58": {
        "plotSummary": "A deranged, misogynistic killer assaults a journalist. When he discovers that she survived the attack, he follows her to the hospital to finish her off.",
        "runtimeMinutes": "105"
    },
    "1982_59": {
        "plotSummary": "A single mother prostitute, who goes by the name Princess, finds herself forced to work undercover for the police in order to apprehend a homicidal, misogynistic pimp named Ramrod, who will do anything not to get arrested.",
        "runtimeMinutes": "97"
    },
    "1982_6": {
        "plotSummary": "In 1954, a group of Florida high-school guys try to help their buddy lose his virginity, which leads them to seek revenge on a sleazy nightclub owner and his redneck sheriff brother for harassing them.",
        "runtimeMinutes": "94"
    },
    "1982_60": {
        "plotSummary": "While facing the stress of his play being produced on Broadway, a playwright deals with having to raise his son, his stepdaughters, and his stepsons.",
        "runtimeMinutes": "110"
    },
    "1982_61": {
        "plotSummary": "A dysfunctional family moves into a new house, which proves to be satanic, resulting in the demonic possession of their teenage son.",
        "runtimeMinutes": "104"
    },
    "1982_62": {
        "plotSummary": "An ambitious priest seduces a nun and leads the Vatican into shady business during and after World War II.",
        "runtimeMinutes": "121"
    },
    "1982_63": {
        "plotSummary": "A successful young L.A. doctor and his equally successful television-producer wife find their happily-ever-after life torn assunder when he suddenly confronts his long-repressed attraction for other men. Zach and Claire live a comfortable ...See moreA successful young L.A. doctor and his equally successful television-producer wife find their happily-ever-after life torn assunder when he suddenly confronts his long-repressed attraction for other men. Zach and Claire live a comfortable life secure in their love for one another when Bart, a swinging L.A. novelist, walks into Zach's office and awakens unfamiliar feelings in him. In a move which leaves him wracked with guilt, Zach cancels dinner with his wife in order to go out with Bart. He is inexplicably drawn to this man who seems intent on keeping him at arms distance. Why can't Bart allow their relationship to grow? he wonders. Exasperated, he asks Bart, \"Do you snore? Does anybody ever get a chance to find out?\" As Zach's absences become more and more frequent, Claire's concern manifests itself in the suspicion that he is having an affair with another woman. Jilted by Bart and feeling alone for the first time in his married life, Zach resolves to tell Claire the truth about himself. Predictably, Claire is shocked that she could have known so little about the man she has loved for so many years and accuses him of deceiving her from the very start.  Written by Mark Fleetwood See less",
        "runtimeMinutes": "113"
    },
    "1982_64": {
        "plotSummary": "A popular anchorwoman, Jaime Douglas, is stalked by a photographer who's obsessed with her and wants to win her affections at any cost.",
        "runtimeMinutes": "104"
    },
    "1982_65": {
        "plotSummary": "The claustrophobic world of a WWII German U-boat; boredom, filth and sheer terror.",
        "runtimeMinutes": "149"
    },
    "1982_66": {
        "plotSummary": "A sheriff tries to stop the killing spree of a silent maniacal murderer who, as the result of secret genetic experimentation by an unethical scientist, has the ability to self-heal.",
        "runtimeMinutes": "103"
    },
    "1982_67": {
        "plotSummary": "The young daughter of a politician runs away due to lack of attention. She hides in the car of two not-so-bright crooks who are slowly converted into parent figures to her. A surprising bond of love and redirection forms among the trio as ...See moreThe young daughter of a politician runs away due to lack of attention. She hides in the car of two not-so-bright crooks who are slowly converted into parent figures to her. A surprising bond of love and redirection forms among the trio as the police close down on the supposed kidnappers.  Written by John Vogel See less",
        "runtimeMinutes": "105"
    },
    "1982_68": {
        "plotSummary": "It's been 10 years since Lizzie Borden High School's class of '72 graduated, and the preppies, the hippies and the in-crowd has returned to reminisce over good times past. But classmate Walter Baylor has returned too with a vengeance.",
        "runtimeMinutes": "84"
    },
    "1982_69": {
        "plotSummary": "Completely innocent man, Michael Jordon, is drawn into a web of government secrets when a girl carrying a mysterious package gets into a taxi with him. When she's later murdered, Michael becomes the chief suspect and goes on the run.",
        "runtimeMinutes": "110"
    },
    "1982_7": {
        "plotSummary": "With the assistance of the Enterprise crew, Admiral Kirk must stop an old nemesis, Khan Noonien Singh, from using the life-generating Genesis Device as the ultimate weapon.",
        "runtimeMinutes": "113"
    },
    "1982_70": {
        "plotSummary": "A mother of four is abandoned by her husband for a younger woman. Husband, wife and children struggle to survive the seemingly inevitable divorce.",
        "runtimeMinutes": "124"
    },
    "1982_71": {
        "plotSummary": "A wacky inventor and his wife invite two other couples for a weekend party at a romantic summer house in the 1900s countryside.",
        "runtimeMinutes": "88"
    },
    "1982_72": {
        "plotSummary": "Journalist Marie Jouvet (Joanna Lumley) attempts to uncover the mysterious disappearance of Chief Inspector Jacques Clouseau (Peter Sellers).",
        "runtimeMinutes": "96"
    },
    "1982_73": {
        "plotSummary": "A light comedy/love story based on the life of blind musician Tom Sullivan.",
        "runtimeMinutes": "103"
    },
    "1982_74": {
        "plotSummary": "True tale about two men planing to escape from communist East Germany in a hot air balloon, but only if they can take their families with them.",
        "runtimeMinutes": "107"
    },
    "1982_75": {
        "plotSummary": "The crew of a large ship sail the high seas encountering other pirates from other ships. The boy from the ship ends up having to save his girlfriend who is kidnapped by a bunch of other pirates.",
        "runtimeMinutes": "105"
    },
    "1982_76": {
        "plotSummary": "A young woman gets raped by a mysterious man-creature, and years later her son begins a horrific transformation into a similar beast.",
        "runtimeMinutes": "98"
    },
    "1982_77": {
        "plotSummary": "After their mother dies and their father leaves them, teenage brothers Tex and Mason McCormick struggle to make it on their own.",
        "runtimeMinutes": "103"
    },
    "1982_78": {
        "plotSummary": "In 1905, after ten years of missionary work in Africa, the Reverend Charles Fortescue (Sir Michael Palin) is recalled to England, where his Bishop gives him his new assignment, to minister to London's prostitutes. Charles hopes Deborah ...See moreIn 1905, after ten years of missionary work in Africa, the Reverend Charles Fortescue (Sir Michael Palin) is recalled to England, where his Bishop gives him his new assignment, to minister to London's prostitutes. Charles hopes Deborah Fitzbanks (Phoebe Nicholls), his fiancee, will object and give him an excuse to say no to the Bishop. But she is so imperturbably innocent that she totally fails to understand what he is being asked to do, and urges him to do his best. Wealthy Lady Isabel Ames (Dame Maggie Smith) is expected to fund the work, but once she makes it clear to Charles that there will be no contribution unless he shares her bed.  Written by James Barrett See less",
        "runtimeMinutes": "90"
    },
    "1982_79": {
        "plotSummary": "A young woman's sexual awakening brings horror when she discovers her urges transform her into a monstrous black leopard.",
        "runtimeMinutes": "118"
    },
    "1982_8": {
        "plotSummary": "A hard-nosed cop reluctantly teams up with a wise-cracking criminal temporarily paroled to him, in order to track down a killer.",
        "runtimeMinutes": "96"
    },
    "1982_80": {
        "plotSummary": "Grandmother has nothing to say when Libby tells her that she is off to LA to look up Dad, a Hollywood screenwriter. Grandmother has been in a New York cemetery for six years and Dad has been out of Libby's life for 16 of her 19 years. ...See moreGrandmother has nothing to say when Libby tells her that she is off to LA to look up Dad, a Hollywood screenwriter. Grandmother has been in a New York cemetery for six years and Dad has been out of Libby's life for 16 of her 19 years. Libby arrives in LA on a Tuesday and phones Dad the one night that Stephanie, who does Jane Fonda's hair, stays over. Stephanie is there the next morning when Libby decides she needs to tell her story face-to-face.  Written by Dale O'Connor See less",
        "runtimeMinutes": "108"
    },
    "1982_81": {
        "plotSummary": "A researcher for the CIA who convinces his superiors to send him to the eastern bloc in order to avenge the murder of his wife by enemy agents discovers a web of deception underneath his wife's death.See moreA researcher for the CIA who convinces his superiors to send him to the eastern bloc in order to avenge the murder of his wife by enemy agents discovers a web of deception underneath his wife's death.  Written by Keith Loh See less",
        "runtimeMinutes": "112"
    },
    "1982_82": {
        "plotSummary": "A wealthy cosmetic tycoon and her 12-year-old daughter who's dying from leukemia, strike up a sentimental friendship with a California politician. Since the girl has only six weeks or less to live, the trio fly to New York City where the ...See moreA wealthy cosmetic tycoon and her 12-year-old daughter who's dying from leukemia, strike up a sentimental friendship with a California politician. Since the girl has only six weeks or less to live, the trio fly to New York City where the daughter skates the ice rink at Rockefeller Center, assumes the lead in The Nutcracker ballet, and sight-sees most of the city.  Written by matt-282See less",
        "runtimeMinutes": "107"
    },
    "1982_83": {
        "plotSummary": "A casino security guard is forced into violence from when the Hong Kong mob threatens his friends.",
        "runtimeMinutes": "90"
    },
    "1982_84": {
        "plotSummary": "A brave unicorn (Mia Farrow) and a magician (Alan Arkin) fight an evil King (Sir Christopher Lee), who is obsessed with attempting to capture the world's unicorns.",
        "runtimeMinutes": "92"
    },
    "1982_85": {
        "plotSummary": "Terrorists take over a plutonium bomb and threaten to detonate it in a Saudi Arabian oil field. A special anti-terrorist unit is sent in to stop them.",
        "runtimeMinutes": "96"
    },
    "1982_86": {
        "plotSummary": "A corrupt border Agent decides to clean up his act when an impoverished woman's baby is put up for sale on the black market.",
        "runtimeMinutes": "108"
    },
    "1982_87": {
        "plotSummary": "Trying to find how a millionaire wound up with a phony diamond brings Hercule Poirot (Sir Peter Ustinov) to an exclusive island resort frequented by the rich and famous. When a murder is committed, everyone has an alibi.",
        "runtimeMinutes": "117"
    },
    "1982_88": {
        "plotSummary": "A straight police detective is unnerved when ordered to go undercover with a gay police clerk, as a couple, to solve a series of murders in the gay community.",
        "runtimeMinutes": "93"
    },
    "1982_89": {
        "plotSummary": "A Manhattan psychiatrist probes a patient's murder and falls for the victim's mysterious mistress.",
        "runtimeMinutes": "93"
    },
    "1982_9": {
        "plotSummary": "A family's home is haunted by a host of demonic ghosts.",
        "runtimeMinutes": "114"
    },
    "1982_90": {
        "plotSummary": "Pizza delivery boy Gary, loudmouth David and hunky Rick are three high students out to lose their virginity any way they can. Gary falls for transfer student Karen, who gets involved with Rick.",
        "runtimeMinutes": "92"
    },
    "1982_91": {
        "plotSummary": "Story about a rapid deployment defense unit that is called into action whenever freedom is threatened.",
        "runtimeMinutes": "99"
    },
    "1982_92": {
        "plotSummary": "The intertwined lives and loves of three highly-ranked athletes striving for the national team; Chris bounces between the beds of male coach Terry and her female friend, competitor, and role model Tory.",
        "runtimeMinutes": "124"
    },
    "1982_93": {
        "plotSummary": "After their caravan is attacked and their respective families butchered by Arab marauders, teenagers David and Sarah flee across the desert. But the desert is filled with danger from the elements, animals and the appetite of the Jackal.",
        "runtimeMinutes": "100"
    },
    "1982_94": {
        "plotSummary": "Monterey, California in the 1940's. Cannery Row - the section of town where the now closed fish canneries are located - is inhabited primarily by the down and out, although many would not move away even if they could. Probably the most ...See moreMonterey, California in the 1940's. Cannery Row - the section of town where the now closed fish canneries are located - is inhabited primarily by the down and out, although many would not move away even if they could. Probably the most upstanding citizen in the area is Doc, a marine biologist who earns a living primarily by collecting and selling marine specimens for research. He is a lost soul who is looking for his place in life. He is running away from his past, one where he is trying to make amends for what he considers a past wrong. But his current life isn't totally satisfying either. He believes that his recent collection of eight baby octopi will help him define that future in conducting research on their behavior. However, he is finding that research is not as easy as he had hoped, and that he is still feeling restless. Into the area comes drifter Suzy DeSoto. She too is a lost soul. With few job skills, she gets a job as what she calls a floozy in the local whorehouse, despite her openly headstrong demeanor not making her well suited to the work. Doc and Suzy are immediately attracted to each other, but theirs is a clash of personalities, despite each truly liking the other. The other residents of Cannery Row do their part for a Doc/Suzy coupling, not always with successful results. Doc and Suzy will first have to find their own lot in life before they can commit to someone else, be it the other or anyone else.  Written by HuggoSee less",
        "runtimeMinutes": "120"
    },
    "1982_95": {
        "plotSummary": "Terrorists in the process of kidnapping a child get trapped in a house with an extremely deadly snake.",
        "runtimeMinutes": "93"
    },
    "1982_96": {
        "plotSummary": "During the Korean War, General Douglas MacArthur masterminds the amphibious invasion of Inchon in September 1950. Read more: Synopsis",
        "runtimeMinutes": "140"
    },
    "1982_97": {
        "plotSummary": "Orphan Heidi lives with her grandpa in Swiss Alps. She brings joy to all there. However, her aunt takes her to the city to live as a servant girl to a cold rich strict family and their nice but sad handicapped daughter.",
        "runtimeMinutes": "94"
    },
    "1982_98": {
        "plotSummary": "A sobering mid-life crisis fuels dissatisfaction in Philip Dimitrius, to the extent where the successful architect trades his marriage and career in for a spiritual exile on a remote Greek island where he hopes to conjure meaning into his ...See moreA sobering mid-life crisis fuels dissatisfaction in Philip Dimitrius, to the extent where the successful architect trades his marriage and career in for a spiritual exile on a remote Greek island where he hopes to conjure meaning into his life - trying the patience of his new girlfriend and angst-ridden teenage daughter.  Written by David ParkerSee less",
        "runtimeMinutes": "140"
    },
    "1982_99": {
        "plotSummary": "A young American couple and a French woman engage in a threesome in the Greek Islands.",
        "runtimeMinutes": "98"
    }
}