{
    "1983_1": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap.",
    "1983_10": "Five years later, Tony Manero's Saturday Night Fever is still burning. Now he's strutting toward his biggest challenge yet: succeeding as a dancer on the Broadway stage.",
    "1983_100": "Personal assistant Norman struggles to get deteriorating veteran actor Sir through a difficult performance of King Lear.",
    "1983_101": "On a desert planet, warlord Jared-Syn is trying to convince a tribe of mutants that he's their messiah and gain unlimited power hidden in a crystal. Ranger Dogen and explorer Dhyana, who's father was murdered by Syn, must stop him.",
    "1983_102": "After his wife and son are brutalized by thugs and a corrupt criminal justice system puts the perpetrators back on the street, a New York City factory worker turns vigilante to find some measure of bloody justice.",
    "1983_103": "A television newswoman picks up the story of a 1960s rock band whose long-lost leader - Eddie Wilson - may still be alive, while searching for the missing tapes of the band's never-released album.",
    "1983_104": "Ensuing after the events of Clouseau's disappearance, his bosses at the Surete put a computer into service to elect a new shrewd detective, Sleigh, who turns up just as inept as Clouseau.",
    "1983_105": "Convinced that her father's death was not accidental, a beautiful girl decides to investigate to find out the truth, aided by her boyfriend. Her sleuthing draws her to a local mortuary, where many secrets will be revealed.",
    "1983_106": "An aspiring mystery writer becomes accidently embroiled in an international plot during a two-week stay in Malta.",
    "1983_107": "After serving two decades in prison, Yellowbeard (Graham Chapman) breaks out determined to recover the treasure that he buried so long ago, alongside his son, old crew, and the British Navy.",
    "1983_108": "Nazis are forced to turn to a Jewish historian for help in battling the ancient demon they have inadvertently freed from its prison.",
    "1983_109": "When a top local businessman and his two bumbling nephews try to shut down the town's only video arcade, arcade employees and patrons fight back.",
    "1983_11": "After he's laid off, a husband switches roles with his wife. She returns to the workforce, and he becomes a stay-at-home dad, a job he has no clue how to do.",
    "1983_110": "The Rolling Stones' shows in Tempe, Arizona and East Rutherford, New Jersey during their 1981 US tour.",
    "1983_111": "Violetta meets Alfredo and quickly falls for him. After the lovers run away together, they live in bliss for a short time. However, Alfredo's father, Giorgio, starts to interfere, concerned that Violetta's bad reputation will affect the ...See moreVioletta meets Alfredo and quickly falls for him. After the lovers run away together, they live in bliss for a short time. However, Alfredo's father, Giorgio, starts to interfere, concerned that Violetta's bad reputation will affect the marriage prospects of Alfredo's sister. Violetta reluctantly leaves Alfredo, but his love is so strong that it leads him to actions that have tragic consequences.  Written by Toby PadillaSee less",
    "1983_112": "In medieval France, some villagers challenge a man's claim of identity when he (as he says) returns home from some time in the army.",
    "1983_113": "The story of Billy Mills, the American Indian that came from obscurity, to win the 10,000 meter long distance foot race in the Tokyo Olympics.",
    "1983_114": "A warrior seeks his true origins in a seemingly prehistoric wasteland.",
    "1983_115": "It's suspected that a peace/anti-nuke organization in UK has some extremists willing to use terrorism. The action will probably be against an embassy in London. The SAS/Special Air Service try to get the organization infiltrated.",
    "1983_116": "Five friends travel to a cabin in the woods, where they unknowingly release flesh-possessing demons.",
    "1983_117": "Rupert Pupkin is a passionate yet unsuccessful comic who craves nothing more than to be in the spotlight and to achieve this, he stalks and kidnaps his idol to take the spotlight for himself.",
    "1983_119": "A State Department employee finds an egg-shaped device with a green fluid inside that makes the person who drinks it invisible. He finds himself being chased by foreign agents who want the substance.",
    "1983_12": "A Chicago teenager is looking for fun at home while his parents are away, but the situation quickly gets out of hand.",
    "1983_120": "J.P. Tannen takes his three children for a vacation cruise. They usually live with their mother and stepfather, but now J.P. feels capable of taking them. Emotional tragedy strikes, causing battles parent against parent, and parent against...See moreJ.P. Tannen takes his three children for a vacation cruise. They usually live with their mother and stepfather, but now J.P. feels capable of taking them. Emotional tragedy strikes, causing battles parent against parent, and parent against child. J.P. tries to show his children that he loves them.  Written by Melissa Portell See less",
    "1983_121": "An aspiring country/western singer, whose money is disappearing faster than his career opportunities, enters a \"Tough Man\" amateur boxing contest to earn some cash to pay his bills. Amazingly enough, he wins it, and is picked to go onto ...See moreAn aspiring country/western singer, whose money is disappearing faster than his career opportunities, enters a \"Tough Man\" amateur boxing contest to earn some cash to pay his bills. Amazingly enough, he wins it, and is picked to go onto the national finals. He's torn between his first love, music, and the glitz, glamor and money of the \"Tough Man\" world.  Written by frankfob2@yahoo.comSee less",
    "1983_122": "A man with a wife and two daughters learns that he has a son. It seems that a few years ago while visiting France, he had an accident and he had an affair with the doctor who treated him. Now he has learned that she just died and is ...See moreA man with a wife and two daughters learns that he has a son. It seems that a few years ago while visiting France, he had an accident and he had an affair with the doctor who treated him. Now he has learned that she just died and is informed of his son. He then tells his wife, she then suggest that they bring him over. While there all sorts of tension begin to arise. How will this affect them?  Written by See less",
    "1983_123": "During WWII, a British colonel tries to bridge the cultural divides between a British POW and the Japanese camp commander in order to avoid bloodshed.",
    "1983_124": "A young artist is commissioned by the wife of a wealthy landowner to make a series of drawings of the estate while her husband is away.",
    "1983_125": "In 1944, the residents of a small Italian town under Axis control flee their homes to seek out the liberating Allied forces.",
    "1983_126": "A programmer at a TV station that specializes in adult entertainment searches for the producers of a dangerous and bizarre broadcast.",
    "1983_127": "Having revived from his wounds, Jason Voorhees takes refuge at a cabin near Crystal Lake. As a group of co-eds arrive for their vacation, Jason continues his killing spree.",
    "1983_128": "Frolicking youth comedy about zany high school students set in the 1960s.",
    "1983_129": "The life of a suburban American family is scarred after a nuclear attack.",
    "1983_13": "The Griswold family's cross-country drive to the Walley World theme park proves to be much more arduous than they ever anticipated.",
    "1983_130": "The co-eds of a Boston college campus are targeted by a mysterious killer who is creating a human jigsaw puzzle from their body parts.",
    "1983_131": "A swashbuckling adventure which takes place in the mid-1800's on the South Pacific islands where bloody raids and battles were once the rule of the day.",
    "1983_132": "In a 1966 New Jersey high school, Jill and new student Sheik from the other side of the tracks make their way in a first love romance.",
    "1983_133": "Anne is investigating the life of her grand-aunt Olivia, whose destiny has always been shrouded with scandal. As Anne delves into the history of her grand-aunt, she is led to reconsider her own life.",
    "1983_134": "A collection of expertly photographed phenomena with no conventional plot. The footage focuses on nature, humanity and the relationship between them.",
    "1983_135": "The world's water supply has dried up due to some sort of apocalypse. A beautiful woman holds the secret to where one of the last springs being guarded by a group of Amazons. A \"Road Warrior\" like crew captures her and tries to make her ...See moreThe world's water supply has dried up due to some sort of apocalypse. A beautiful woman holds the secret to where one of the last springs being guarded by a group of Amazons. A \"Road Warrior\" like crew captures her and tries to make her talk through brutal torture. The hero (Styrker) unites with some of the remaining \"good guys\" and the Amazons and frees the woman. They go on to a \"Road Warrior\" type of concluding battle with the bad guys.  Written by Paul Sakamoto See less",
    "1983_136": "Mega-promoter Colin Beverly plans to sabotage the New Year's 1983 concert of small-time operator Max Wolfe. Wolfe's assistants Neil Allen and Willie Loman find romance while trying to save the drugs, violence, and rock and roll from ...See moreMega-promoter Colin Beverly plans to sabotage the New Year's 1983 concert of small-time operator Max Wolfe. Wolfe's assistants Neil Allen and Willie Loman find romance while trying to save the drugs, violence, and rock and roll from Beverly's schemes.  Written by See less",
    "1983_137": "A happily married woman comes to realize herself of being a repressed lesbian after she has an affair with a female college professor, and then tries to come to terms with her newfound lifestyle.",
    "1983_138": "Charlie's ex-wife disappears, and he travels to where she grew up--a rural town in the Midwest--to look for her. But, surprisingly, nobody knows about her or any of her many relatives, the Newmans. He meets aliens; but when he contacts the...See moreCharlie's ex-wife disappears, and he travels to where she grew up--a rural town in the Midwest--to look for her. But, surprisingly, nobody knows about her or any of her many relatives, the Newmans. He meets aliens; but when he contacts the FBI, they don't believe him. He tells his story to a tabloid; and suddenly, he is chased by the aliens.  Written by Mattias ThuressonSee less",
    "1983_139": "Set in 1965, four rowdy teenage guys travel to Tijuana, Mexico for a night of partying when they are joined by a heartbroken housewife who is in town seeking a quick divorce.",
    "1983_14": "Synthetic kryptonite laced with tar splits Superman in two: good Clark Kent and bad Man of Steel.",
    "1983_140": "Hoping to achieve success in Hollywood, a young aspiring screenwriter allows others to exploit her. She goes through affair after sordid affair in her attempt to write her own screenplay and have it produced.",
    "1983_141": "A woman starts exhibiting increasingly disturbing behavior after asking her husband for a divorce. Suspicions of infidelity soon give way to something much more sinister.",
    "1983_142": "Documentary about the American gospel music scene, focusing on two of the movement's pioneering forces, Thomas A. Dorsey and Willie May Ford Smith.",
    "1983_143": "A man becomes destructively obsessed with killing a dangerous rat, which has taken residence in his, recently renovated, house.",
    "1983_144": "An ordinary sex-starved teenager and his friends start secretly video recording high school girls and their activity irks the community, as well as their principal.",
    "1983_145": "After winning the ultimate title and being the world champion, Rocky falls into a hole and finds himself picked up by a former enemy.",
    "1983_146": "The retelling of an incident in Gonzales, Texas in 1901 revolving around a stolen horse, mistaken identity and a killing. An unusual story of the all too usual exploitation of the powerless in Texas History.",
    "1983_147": "In this offbeat comedy, an unlikely romance develops between a flamboyant, middle-aged piano tuner and an extremely timid office worker. In HD.",
    "1983_148": "At the end of the ice age, an evil queen and her son are set on conquering the world using magic and warriors. The lone survivor of a crushed village fights back as does the king of Fire Keep.",
    "1983_149": "After a young man leaves a band of pirates, hilarity ensues.",
    "1983_15": "A group of seven former college friends gather for a week-end reunion at a South Carolina vacation home after the funeral of another of their college friends.",
    "1983_150": "Daniel Isaacson attempts to determine the true complicity of his parents Paul and Rochelle Isaacson, who were executed for espionage in the 1950s.",
    "1983_151": "A family's home is haunted by a host of demonic ghosts.",
    "1983_152": "Four young soldiers waiting to be shipped to Vietnam deal with racial tension and their own intolerance when one soldier reveals he's gay.",
    "1983_153": "Britannia Hospital is not preparing for a visit from Queen Elizabeth I, who died in 1603. The visitor is a fictional representation of Queen Elizabeth the Queen Mother.",
    "1983_154": "This film tells the story about a group of girls at an exclusive German girls boarding school. Across the lake is an exclusive boys boarding school... Written by Anonymous",
    "1983_155": "Shirley Muldowney is determined to be a top-fuel drag racer, although no woman has ever raced them before. Despite the high risks of this kind of racing and the burden it places on her family life, she perseveres in her dream.See moreShirley Muldowney is determined to be a top-fuel drag racer, although no woman has ever raced them before. Despite the high risks of this kind of racing and the burden it places on her family life, she perseveres in her dream.  Written by Reid GagleSee less",
    "1983_156": "The mating rituals of two teenage surf chicks from the southern suburbs of Sydney.",
    "1983_157": "The story of Hannie Schaft, Dutch Resistance, told in flashback as they try to bring collaborators and criminals to justice in 1945.",
    "1983_158": "A malevolent rock star kidnaps a singer to force her to participate in the summoning of a demon, and her band must help her stop him.",
    "1983_16": "A S.P.E.C.T.R.E. Agent has stolen two American nuclear warheads, and James Bond must find their targets before they are detonated.",
    "1983_17": "The cop test pilot for an experimental police helicopter learns the sinister implications of the new vehicle.",
    "1983_18": "A Jewish girl disguises herself as a boy to enter religious training.",
    "1983_19": "A worker at a plutonium processing plant is purposefully contaminated, psychologically tortured and possibly murdered to prevent her from exposing worker safety violations at the plant.",
    "1983_2": "Follows hard-to-please Aurora looking for love, and her daughter's family problems.",
    "1983_20": "After twenty-two years of psychiatric care, Norman Bates attempts to return to a life of solitude, but the specters of his crimes - and his mother - continue to haunt him.",
    "1983_21": "The naughty high schoolers of Angel Beach High now seek revenge on a group of KKK religious fanatics and corrupt politicians who want to shut down their Shakespeare production after they cast a Seminole transfer student in the lead.",
    "1983_22": "Ten years after his son went M.I.A. in Vietnam, U.S. Marine retired Colonel Jason Rhodes assembles a private rescue team to find Americans held in P.O.W. camps in Laos.",
    "1983_23": "Exiled into the dangerous forest by her wicked stepmother, a princess is rescued by seven dwarf miners who make her part of their household.",
    "1983_24": "A government researcher, sent to research the \"menace\" of wolves in the north, learns about the true beneficial and positive nature of the species.",
    "1983_25": "Four horror and science fiction segments, directed by four famous directors, each of them being a new version of a classic story from Rod Serling's landmark television series.",
    "1983_26": "To inherit his mother-in-law's colossal fortune, a hard-living gambling addict must change his unhealthy ways before they get the best of him.",
    "1983_27": "During WW1, an alcoholic American biplane pilot is hired by the spoiled daughter of an industrialist to find her father who disappeared in Asia.",
    "1983_28": "The rivalry between two gangs, the poor Greasers and the rich Socs, only heats up when one gang member kills a member of the other.",
    "1983_29": "Two sets of two college guys spend a spring break together in Fort Lauderdale, Florida. There they have lots of fun in and out of the sun.",
    "1983_3": "A Pittsburgh woman with two jobs as a welder and an exotic dancer wants to get into ballet school.",
    "1983_30": "When God decides to destroy Earth, four angels aim to redeem mankind through a young man and woman with their own troubles.",
    "1983_31": "A rich father hires a tutor for his son. The son is a horny teenager and the tutor is a gorgeous blonde. Complications ensue.",
    "1983_32": "A young man in private school spends one crazy night out, but soon realizes the woman he hooked up with is not who he expected.",
    "1983_33": "The story of the original Mercury 7 astronauts and their macho, seat-of-the-pants approach to the space program.",
    "1983_34": "Cujo, a friendly St. Bernard, contracts rabies and conducts a reign of terror on a small American town.",
    "1983_35": "A nerdish boy buys a strange car with an evil mind of its own and his nature starts to change to reflect it.",
    "1983_36": "Two mice of the Rescue Aid Society search for a little girl kidnapped by unscrupulous treasure hunters.",
    "1983_37": "A man awakens from a coma to discover he has a psychic ability.",
    "1983_38": "When Jesse Lujack steals a car in Las Vegas and drives down to LA, his criminal ways only escalate- but when will it end?",
    "1983_39": "In the 1940s, a young boy named Ralphie attempts to convince his parents, his teacher and Santa that a Red Ryder BB gun really is the perfect Christmas gift.",
    "1983_4": "A snobbish investor and a wily street con artist find their positions reversed as part of a bet by two callous millionaires.",
    "1983_40": "An English teacher and struggling single mother has her life disrupted when the father who abandoned her as a child comes back into her life.",
    "1983_41": "Julie, a girl from the valley, meets Randy, a punk from the city. They are from different worlds and find love. Somehow they need to stay together in spite of her trendy, shallow friends.",
    "1983_42": "An ambitious young football star is trapped in a dying mill town--unless his gridiron skills can win him a way out.",
    "1983_43": "A prince and a fellowship of companions set out to rescue his bride from a fortress of alien invaders who have arrived on their home planet.",
    "1983_44": "On a distant planet inhabited by mutants, two bounty-hunters race to rescue three Earth female captives from the clutches of an evil mutant warlord.",
    "1983_45": "Part live stand-up performance, part documentary, this film is one of comedian Richard Pryor's later stand-up performances. As foul-mouthed as ever, Pryor touches on most of the same topics as in his previous live shows. Read more: Synopsis",
    "1983_46": "The misadventures of a group of unfortunate but street-wise cabbies working for a Washington, D.C. decrepit taxicab company.",
    "1983_47": "A Moscow police officer investigates a vicious triple homicide and stumbles upon a high-level international political conspiracy.",
    "1983_48": "Cheech and Chong fly to the marijuana capital of the world, Amsterdan, for a film festival where they take Dolly Parton and Burt Reynold's place in a limo, suite, press conference and performance. They throw in some sketches as well.",
    "1983_49": "The comedy team takes a look at life in all of its stages in their own uniquely silly way.",
    "1983_5": "A giant thirty-five-foot shark becomes trapped in a SeaWorld theme park and it's up to the sons of police chief Brody to rescue everyone.",
    "1983_50": "An alcoholic professor has been hired by a working-class girl for higher education.",
    "1983_51": "Chris from a girls' boarding school loves Jim from a nearby boys' boarding school. Jordan also wants Jim and plays dirty. Jim and 2 friends visit the girls' school posing as girls.",
    "1983_52": "Having both lost their jobs, two strangers become unlikely friends after a run in with a would be robber, who is actually a hitman with a grudge against the two.",
    "1983_53": "A woman is tormented and sexually molested by an invisible demon.",
    "1983_54": "After ninjas killed his family, Cho and his son Kane come to America to start a new life. He opens a doll shop but is unwittingly importing heroin in the dolls. When his friend betrays him, Cho must prepare for the ultimate battle.",
    "1983_55": "At the onset of WW2, a Polish actor's family and the Polish Resistance help the troupe of a theatre escape Poland and the invading Nazis.",
    "1983_56": "The title character, a popular NASCAR driver, clashes with the fried-chicken mogul that sponsors his racing team.",
    "1983_57": "After helping the local police with some horse thieves, a Texas Ranger aims at a drug lord with arms trade as well. They're interested in the same woman and they're both into martial arts.",
    "1983_58": "A teenager loses his horse in Morocco and gets him back after various daredevil adventures.",
    "1983_59": "A poor boy named Arthur learns the power of love, kindness, knowledge and bravery with the help of a wizard called Merlin in the path to become one of the most beloved kings in English history.",
    "1983_6": "A young man finds a back door into a military central computer in which reality is confused with game-playing, possibly starting World War III.",
    "1983_60": "The warrior Deathstalker is sent by a witch on a quest to find a chalice, an amulet, and a sword, two of which are held by the wicked sorcerer Munkar.",
    "1983_61": "\"Documentary\" about a man who can look and act like whoever he's around, and meets various famous people.",
    "1983_63": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its awesome powers.",
    "1983_64": "A villain named McCreep steals the Smurfs' magic flute, an instrument that makes people dance wildly, and uses it to rob them. The Smurf King sends out Peewit to track down the thief and retrieve the flute.",
    "1983_65": "A womanizing sculptor named David goes to seek help from a psychiatrist, Marianna, to cure him of his obsession with women.",
    "1983_66": "The story of the Greek mythological figure, updated in this 80's version.",
    "1983_67": "After a seemingly innocent prank goes horribly wrong, a group of sorority sisters are stalked and murdered one by one in their sorority house while throwing a party to celebrate their graduation.",
    "1983_68": "A pimp on the run trusts his sex workers to a meek professor of literature, who accepts the challenge.",
    "1983_69": "A small time arms dealer in South America to sell weapons to the revolutionaries, winds up negotiating the sale of an experimental plane to the nation's dictator.",
    "1983_7": "A fake Faberge egg, and a fellow Agent's death, lead James Bond to uncover an international jewel-smuggling operation, headed by the mysterious Octopussy, being used to disguise a nuclear attack on N.A.T.O. forces.",
    "1983_70": "A brain surgeon marries a femme fatale, causing his life to turn upside down. Things go more awry when he falls in love with a talking brain.",
    "1983_71": "A young Australian reporter tries to navigate the political turmoil of Indonesia during the rule of President Sukarno with the help of a diminutive photographer.",
    "1983_72": "Researchers develop a system where they can jump into people's minds. But when people involved bring their personal problems into the equation, it becomes dangerous - perhaps deadly.",
    "1983_73": "A psychiatrist, who falls in love with a patient, is visited by the spirit of Sigmund Freud, who gives him advice on how to handle it.",
    "1983_74": "This movie, centering on a child's abduction, casts Kate Nelligan as the distraught mother who lashes out at the police (in the person of a relentless detective played by Judd Hirsch), who treat her and her husband as suspects, even as she...See moreThis movie, centering on a child's abduction, casts Kate Nelligan as the distraught mother who lashes out at the police (in the person of a relentless detective played by Judd Hirsch), who treat her and her husband as suspects, even as she hounds them to find her child and drives away her husband (David Dukes) and friends (including Stockard Channing) with her intensity and single-mindedness.  Written by alfiehitchieSee less",
    "1983_75": "Chicago crime kid Mick O'Brien is sent to reform school after accidentally killing a rival's kid brother.",
    "1983_77": "Canada's most famous hosers, Bob and Doug McKenzie, get jobs at the Elsinore Brewery, only to learn that something is rotten with the state of it.",
    "1983_78": "A broken-down, middle-aged country singer gets a new wife, reaches out to his long-lost daughter, and tries to put his troubled life back together.",
    "1983_79": "In a small American town, a diabolical circus and its demonic proprietor prey on the townsfolk.",
    "1983_8": "A rape victim is exacting revenge on her aggressors in a small town outside San Francisco. \"Dirty\" Harry Callahan, on suspension for angering his superiors (again), is assigned to the case.",
    "1983_80": "An LAPD detective and his rookie partner are on the trail of a psychopathic young man who is murdering young women.",
    "1983_81": "Two of the screen's finest comic actors, Dudley Moore and Mary Steenburgen, star as successful writing partners whose timing is perfect on stage but amusingly pathetic in their love life. In HD.",
    "1983_82": "Two young Swedish children experience the many comedies and tragedies of their family, the Ekdahls.",
    "1983_83": "Anthology of four horror tales with a supernatural twist based on urban legends.",
    "1983_84": "A lonely 10-year-old boy living with his parents in a remote coastal part of Alaska, spontaneously finds a legendary golden seal and her newborn pup. But the greed for her valuable pelt sets off the hunters, including his own father, the ...See moreA lonely 10-year-old boy living with his parents in a remote coastal part of Alaska, spontaneously finds a legendary golden seal and her newborn pup. But the greed for her valuable pelt sets off the hunters, including his own father, the local natives, and an ambitious poacher in pursuit the seal. The golden seal and her cub are hunted for a huge bounty on her head and the mythological legend.  Written by matt-282See less",
    "1983_85": "During the Cold War, a controversial television journalist is asked by the C.I.A. to persuade certain acquaintances, who are Soviet Agents of the Omega network, to defect.",
    "1983_86": "A successful young model finds trouble when her obsessive manager-turned-husband becomes dangerously jealous.",
    "1983_87": "A team of cons is planning a new scam involving betting on a boxing match but one of its past victims aims to exact revenge by eliminating the whole group.",
    "1983_88": "A reporter moves into the Amityville house in defiance of the supernatural events connected to it, and finds everyone around him besieged by the evil manifestations which are connected to a demonic presence in the basement.",
    "1983_89": "Young Carol Henderson ends up in prison where she must learn how to survive in an environment plagued by violence, murder, rape, racism, drugs and staff corruption and brutality.",
    "1983_9": "In 1980 Miami, a determined Cuban immigrant takes over a drug cartel and succumbs to greed.",
    "1983_90": "During Dirty War, half-English doctor in Argentina befriends the police, the rebels and the alcoholic Honorary British Consul, whose Latino wife he seduces. When the consul is mistakenly kidnapped by the rebels, he must pick a side.",
    "1983_91": "A love triangle develops between a beautiful yet dangerous vampire, her cellist companion, and a gerontologist.",
    "1983_92": "An American oil company sends a man to Scotland to buy up an entire village where they want to build a refinery. But things don't go as expected.",
    "1983_94": "Three journalists in a romantic triangle are involved in political intrigue during the last days of the corrupt Somozoa regime in Nicaragua before it falls to a popular revolution in 1979.",
    "1983_95": "Big and Little Enos are opening a sea food restaurant. They bet Sheriff Buford T. Justice that he cannot drive from Miami to the Enos ranch in Texas in a given amount of time. If Buford loses he has to give up his badge.",
    "1983_96": "A married college professor begins a torrid affair with her failing student, who secretly moonlights as a late-night strip-club dancer.",
    "1983_97": "Disgusted with criminals escaping the judicial system via technicalities, an idealistic young judge investigates an alternative method for punishing the guilty.See moreDisgusted with criminals escaping the judicial system via technicalities, an idealistic young judge investigates an alternative method for punishing the guilty.  Written by See less",
    "1983_98": "When an aging, but gentlemanly stagecoach robber is released from prison, he decides to go to Canada to become a train robber.",
    "1983_99": "A former police detective juggles wrestling with his personal demons and becoming obsessed with a hauntingly beautiful woman."
}