{
    "1984_1": "In 1935, Indiana Jones arrives in India, still part of the British Empire, and is asked to find a mystical stone. He then stumbles upon a secret cult committing enslavement and human sacrifices in the catacombs of an ancient palace.",
    "1984_10": "Admiral Kirk and his bridge crew risk their careers stealing the decommissioned U.S.S. Enterprise to return to the restricted Genesis Planet to recover Spock's body.",
    "1984_100": "He had everything and wanted nothing. He learned that he had nothing and wanted everything. He saved the world and then it shattered. The path to enlightenment is as sharp and narrow as a razor's edge.",
    "1984_101": "Adventurer, brain surgeon, rock musician Buckaroo Banzai and his crime-fighting team, the Hong Kong Cavaliers, must stop evil alien invaders from the eighth dimension who are planning to conquer Earth.",
    "1984_102": "A teen must protect his family when his mother's sinister new boyfriend begins exerting his authority in their home.",
    "1984_103": "In 1942 California, two young men await induction into the U.S. Marines and say goodbye to their girlfriends.",
    "1984_104": "Sheena grew up in the African wild, raised by a mystical witch woman. When her foster mother is framed for a murder Sheena is forced to flee, helped by her ability to talk to animals and her knowledge of the jungle.",
    "1984_105": "A writer for a greeting card company discovers the struggles and tribulations of living alone after breaking up with his unfaithful girlfriend.",
    "1984_106": "Second in the series of Meatball movies. A group of kids attempt to save a summer camp that's a financial failure.",
    "1984_107": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life.",
    "1984_108": "Anna is a young woman who discovers her mother had an affair with a married man for 15 years, so she starts her own affair with a married man. She works for a Los Angeles public radio station. She often must care for her alcoholic father ...See moreAnna is a young woman who discovers her mother had an affair with a married man for 15 years, so she starts her own affair with a married man. She works for a Los Angeles public radio station. She often must care for her alcoholic father and comply with his many demands. When she finds love letters, revealing her mother's longtime involvement with someone else, she develops a romantic notion of the idea as something suitable for herself. She meets a photographer, Oliver, who is happily married and a father. Their physical attraction is immediate and they begin a torrid affair, but he cautions her from the start that he has no intention of leaving his family. She has no objection, enjoying the sex and intimacy for the time being, until feelings develop and she begins to desire a permanent relationship, intruding on his privacy in the process, with unhappy consequences for all. In the end she finally meets the man her mother had an affair with and she decides to take a job offer at a radio station in San Francisco to give herself a fresh start in life.See less",
    "1984_109": "The film talks about a family that weathers all sorts of disasters and keeps going in spite of it all. It is noted for its wonderful assortment of oddball characters.See moreThe film talks about a family that weathers all sorts of disasters and keeps going in spite of it all. It is noted for its wonderful assortment of oddball characters.  Written by L.H. Wong See less",
    "1984_11": "A young man is reunited with a mermaid who saved him from drowning as a boy. He falls in love with her, not knowing who or what she is.",
    "1984_110": "Frustrated housewife/writer Cathy Palmer ghostwrites a story about Rebecca Ryan, a dashing international spy, and wins a trip to Paris. While there, she is involved in an accident, and awakens in the hospital believing she IS Rebecca Ryan....See moreFrustrated housewife/writer Cathy Palmer ghostwrites a story about Rebecca Ryan, a dashing international spy, and wins a trip to Paris. While there, she is involved in an accident, and awakens in the hospital believing she IS Rebecca Ryan. Much craziness ensues as she meets the writer of the Rebecca Ryan books, thwarts real international spies, and eventually gets her memory back.  Written by Suzanne Houghton See less",
    "1984_111": "16 y.o. Charles loves to photograph. A cute girl's photo ends up in his camera. He later sees the older Laura singing in a bar. He takes a lot more photos of her and ends seeing her again, wishing to help her career.",
    "1984_112": "An innovative concert movie for the rock group The Talking Heads.",
    "1984_113": "Harry Keach has been widowed for two years and works as a demolition crane operator on a demolition crew.",
    "1984_114": "With only a week left before graduation, a young dreamer itches to renounce an uninspiring scholarship, stand up to his despotic father and pursue a career in oceanography. But, has anyone ever spread his wings away from Grandview, U.S.A.?",
    "1984_115": "A bizarre series of sudden disappearances on the streets of New York City seems to point toward something unsavory living in the sewers.",
    "1984_116": "A spoiled rich young man hires a young hustler, who lives in a broken car and owes money to a dicey loan shark, to take his place in his elite prep school and graduate for him.",
    "1984_117": "Spinal Tap, one of England's loudest bands, is chronicled by film director Marty DiBergi on what proves to be a fateful tour.",
    "1984_118": "Teenager Leslie Hindenberg, mistakenly believing she has just weeks to live, decides she will lose her virginity before she dies. Meanwhile, hormone-crazed Alan Holt pursues some sex for himself, with predictable results.See moreTeenager Leslie Hindenberg, mistakenly believing she has just weeks to live, decides she will lose her virginity before she dies. Meanwhile, hormone-crazed Alan Holt pursues some sex for himself, with predictable results.  Written by Aaron Teitlebaum See less",
    "1984_119": "Peter Soffel is the stuffy warden of a remote American prison around the turn of the century. His wife, Kate, finds herself attracted to prisoner Ed Biddle. She abandons her husband and children to help Ed and his brother Jack escape and ...See morePeter Soffel is the stuffy warden of a remote American prison around the turn of the century. His wife, Kate, finds herself attracted to prisoner Ed Biddle. She abandons her husband and children to help Ed and his brother Jack escape and accompanies them into the wintery wasteland.  Written by Reid GagleSee less",
    "1984_12": "A young musician, tormented by an abusive situation at home, must contend with a rival singer, a burgeoning romance, and his own dissatisfied band, as his star begins to rise.",
    "1984_120": "A 'salt of the Earth' Missouri woman on vacation in Paris slowly gives in to the advances of a pushy--and very much married--French yuppie. Will their unconventional romance last until September, when she must return home?",
    "1984_121": "An orphan boy and his magical dragon come to town with his abusive adoptive parents in pursuit.",
    "1984_122": "A Jewish refugee marries a soldier to escape deportation to Germany. Meanwhile a wealthy art student loses her first husband to a stray Resistance bullet; at the Liberation she meets an actor, gets pregnant, and marries him.",
    "1984_123": "Two Texas border guards, a young hotshot and his older and more cynical partner, find a jeep buried for 20 years in the desert, with a skeleton, a scoped rifle, and a box with $800,000 in cash. They decide to keep the money, but quietly ...See moreTwo Texas border guards, a young hotshot and his older and more cynical partner, find a jeep buried for 20 years in the desert, with a skeleton, a scoped rifle, and a box with $800,000 in cash. They decide to keep the money, but quietly check up on the cryptic info they've found on the dead driver. Soon, the Feds are running all over the place, and it looks like the jeep may be linked to the JFK assassination. But the Feds are trying to cover it up, and eliminate anyone who knows about the jeep.  Written by Brian W Martz See less",
    "1984_124": "Two brothers who can feel each others' pain and pleasure mess up the French revolution.",
    "1984_125": "The flamethrower-wielding vigilante John Eastland returns to rid New York City of a drug lord and his gang.",
    "1984_126": "A mute alien with the appearance of a black human is chased by outer-space bounty hunters through the streets of Harlem.",
    "1984_127": "His mother dead, PS lives in Sydney with working-class Aunt Lila and Uncle George. When he's six or eight, his posh Aunt Vanessa descends from England. Named a co-guardian by PS's feckless, absent father, she asserts her rights and ...See moreHis mother dead, PS lives in Sydney with working-class Aunt Lila and Uncle George. When he's six or eight, his posh Aunt Vanessa descends from England. Named a co-guardian by PS's feckless, absent father, she asserts her rights and convinces Lila to have PS live with her weekdays. PS is happy at Lila's, playing with children, running about, speaking up. At Vanessa's, there's a regimen of private school, round vowels, piano and riding lessons, and lonely indoor play with fancy toys. He's miserable and when he objects, she sues for complete custody. Will anyone listen to him? And will he take on Vanessa's challenges to find out who he is and to love someone?  Written by See less",
    "1984_128": "A mysterious woman, fashion designer by day and prostitute by night, is hounded by two men: a married father of two children and a sexually repressed preacher.",
    "1984_129": "The mighty warrior, Kain, crosses the barren wastelands of the planet Ura, where two arch enemies, Zeg and the evil degenerate Balcaz, fight incessantly for control of the village's only well.",
    "1984_13": "The life, success and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporaneous composer who was insanely jealous of Mozart's talent and claimed to have murdered him.",
    "1984_130": "The true story of an Australian racehorse that became a champion, with the help of a local stableboy.",
    "1984_131": "After a small earthquake in a tiny, quiet town, local citizens start to exhibit bizarre, violent and self-destructive behaviour.",
    "1984_132": "Biopic about the great college football coach Paul \"Bear\" Bryant of the University of Alabama.",
    "1984_133": "A day in the life of a self-destructive British consul in Mexico on the eve of World War II.",
    "1984_134": "Little Billy witness his parents getting killed by Santa after being warned by his senile grandpa that Santa punishes those who are naughty. Now Billy is 18, and out of the orphanage, and he has just become Santa, himself.",
    "1984_135": "Love doctor radio host Nancy, bar owner Eve, Pearl, drifter Mickey et al meet in LA.",
    "1984_136": "A New Yorker's life is thrown into a tailspin when his younger cousin surprise-visits him, starting a strange, unpredictable adventure.",
    "1984_137": "An elderly painter whose son visits with his family on the weekends, is also surprised by a visit from his still-single daughter.",
    "1984_138": "An artificially intelligent PC and his human owner find themselves in a romantic rivalry over a woman.",
    "1984_139": "Travis Henderson, an aimless drifter who has been missing for four years, wanders out of the desert and must reconnect with society, himself, his life, and his family.",
    "1984_14": "New Orleans single dad and cop Wes Block (Clint Eastwood) goes after a serial rapist-killer, but when he gets too close to the target, the hunter suddenly becomes the hunted.",
    "1984_140": "In middle of the Vietnam War, a Navy surgeon and a nurse fall in love. Their affection for one another provides a striking contrast to the violence of warfare.",
    "1984_141": "A quiet school truant officer, Joe, uncovers a young boy's attempt to fake a residential address, and subsequently gets involved romantically with the boy's mother. The truant officer waffles between a sadistic relationship with his ...See moreA quiet school truant officer, Joe, uncovers a young boy's attempt to fake a residential address, and subsequently gets involved romantically with the boy's mother. The truant officer waffles between a sadistic relationship with his on-again, off-again girlfriend and the mother. When one of the officer's inventions takes off, he chooses the girl and shatters the friendship with the boy and his mother. Only at the last possible moment does he figure out what he's sacrificed, and attempts to get it back.  Written by Cheryl Pickard See less",
    "1984_142": "Chilly is just a guy from the streets with a talent for break-dancing. When his wicked moves catch the eye of an industry pro, Chilly finds his dreams of fame and fortune coming true, for better or for worse.",
    "1984_143": "Busy and often absent father must take care of his two boys after his wife dies. They all live in Tunisia because of their father's job. The older boy is handling the difficult changes much better than the younger one.",
    "1984_144": "The son of a woman dying of a brain tumour tries to fulfil his mother's last wish: to meet Greta Garbo.",
    "1984_145": "On the run from the police and a female roller derby team, scam artist Michael Rangeloff steals a coffin and boards a train, pretending to be a soldier bringing home a dead war buddy. The train ride turns into far more than Michael ...See moreOn the run from the police and a female roller derby team, scam artist Michael Rangeloff steals a coffin and boards a train, pretending to be a soldier bringing home a dead war buddy. The train ride turns into far more than Michael bargains for.  Written by See less",
    "1984_146": "After two friends return home from the Vietnam War one becomes mentally unstable and obsesses with becoming a bird.",
    "1984_147": "Intent on winning a competition in place of her distinguished late father, beautiful young heiress Dale takes on the guise of a man and competes in his spot, embarking on a car race that crosses the unforgiving Sahara desert.",
    "1984_148": "In 1925, Nacib (Marcello Mastroianni) is the owner of bar in a small Brazilian coastal town runs by the local colonels. He meets Gabriela (Sonia Braga) and hires her on as a cook. They soon enter a passionate relationship, fueled by his ...See moreIn 1925, Nacib (Marcello Mastroianni) is the owner of bar in a small Brazilian coastal town runs by the local colonels. He meets Gabriela (Sonia Braga) and hires her on as a cook. They soon enter a passionate relationship, fueled by his strong attraction to her sensual nature. However, he soon grows annoyed by the attention she receives. Under advisement of his best friend, Tonico (Cantafora), he proposes to her, partly in the hopes that the attention quells. After their marriage, he insists that she dress and behave more modestly so they can be seen as more respectable. Unfortunately, she cannot help but stray and he is forced to annul the marriage when he finds her in bed with Tonico. Later, as both Nacib and the town begin to undergo a transformation, Nacib and Gabriela resume their relationship. The political ways of the town modernize slightly and Gabriela returns as Nacib's mistress.  Written by Will GilbertSee less",
    "1984_149": "In the 1940s, a young boy named Ralphie attempts to convince his parents, his teacher and Santa that a Red Ryder BB gun really is the perfect Christmas gift.",
    "1984_15": "A middle-aged unknown comes seemingly out of nowhere to become a legendary baseball player with almost supernatural talent.",
    "1984_150": "After serving time for a theft he didn't commit, all Billy wants to do is to reconnect with his daughter. However, some loose ends, like the whereabouts of the stolen loot, just won't let him go.",
    "1984_151": "In L.A., a young woman tries to uncover what led to the brutal murder of her old flame and who killed him.",
    "1984_152": "Alan Bird witnesses how an ice cream van is attacked and destroyed by an angry competitor. This leads him into the struggle between two Italian families, the Bernardis and the Rossis, over whose ice cream vans can sell where in Glasgow.",
    "1984_153": "A Boston feminist and a conservative Southern lawyer contend for the heart and mind of a beautiful and bright girl unsure of her future.",
    "1984_154": "A few people come into possession of an ancient Aztec doll. However, the doll is possessed by an evil spirit, which takes over their bodies.",
    "1984_155": "Doc Jenkins is a singer/songwriter who tries to leave his singer/songwriter roots to be a music \"mogul\", and gets tangled up in a bad publishing deal. He enlists a team of cronies, including a young singer and his former singing partner, ...See moreDoc Jenkins is a singer/songwriter who tries to leave his singer/songwriter roots to be a music \"mogul\", and gets tangled up in a bad publishing deal. He enlists a team of cronies, including a young singer and his former singing partner, Blackie Buck, and together they execute his plan to get out of the deal. He gets help from a stereotypical small-time concert promoter. Honey Carder is the love interest/ex-wife.  Written by See less",
    "1984_156": "An investigative reporter following an espionage story goes to London and gets involved with murder, scam artists and rock concerts.",
    "1984_157": "The lives of a group of young Chicago men as seen through the eyes of one of them, a thirtysomething writer suffering from the early onset of midlife crisis brought on by nostalgia, his dying friend, and the wedding of his old flame.",
    "1984_158": "A Midwestern farm family faces major emotional adjustment after a tragedy results in the death of an older brother. Read more: Synopsis",
    "1984_159": "The true story of Bob Champion, a British steeple chase jockey who, in the late 1970s, was diagnosed with cancer. Rather than succumb to the disease, however, Bob stages a miraculous recovery and goes on to win the 1981 Grand National ...See moreThe true story of Bob Champion, a British steeple chase jockey who, in the late 1970s, was diagnosed with cancer. Rather than succumb to the disease, however, Bob stages a miraculous recovery and goes on to win the 1981 Grand National steeple chase on the horse Aldaniti.  Written by Jonathan Broxton See less",
    "1984_16": "A missing heir of respected Scottish family, raised in African jungles by animals, finally returns to his estate only to realize that difference between the two worlds is really significant.",
    "1984_160": "As a vicious wild boar terrorizes the Australian outback, the husband of one of the victims is joined by a hunter and a farmer in a search for the beast.",
    "1984_161": "Blue and Eli, two friends, have problems with women. Blue, a yet-to-be discovered painter is left by his longtime girlfriend, because she considers him too immature for a long lasting relationship. Eli works in his father's aerobic suit ...See moreBlue and Eli, two friends, have problems with women. Blue, a yet-to-be discovered painter is left by his longtime girlfriend, because she considers him too immature for a long lasting relationship. Eli works in his father's aerobic suit business and is still searching for a woman who is interesting enough to spend more than one night with her. Blue and Eli's friendship is put to a severe test as both fall in love with Liliane, Blue's attractive new gallerist.  Written by Robert Zeithammel See less",
    "1984_162": "Reduced to minding the counter at a crusty pawn shop, Weslake tumbles onto a scheme by some disgruntled misfit clients to rob the place. Rather than blow the whistle, however, he insinuates himself as the heist's mastermind.",
    "1984_163": "A young punk recruited by a car repossession agency finds himself in pursuit of a Chevrolet Malibu that is wanted for a $20,000 bounty - and has something otherworldly stashed in its trunk.",
    "1984_164": "In 1925, Arctic prospector Jack McCann (Gene Hackman) becomes a rich man when he strikes gold, but twenty years later, he faces major personal and family problems.",
    "1984_165": "Thieves run over a child while escaping after a robbery. A deadly hitman who likes to taunt his targets is hired to track them down. Stone moves to England, but the assassin follows. Loosely based on Donald Westlake's cult crime novel.",
    "1984_17": "At Adams College, a group of bullied outcasts and misfits resolve to fight back for their peace and self-respect.",
    "1984_18": "A joint U.S.-Soviet expedition is sent to Jupiter to learn what happened to the Discovery, and H.A.L.",
    "1984_19": "A struggling young jazz dancer meets up with two break-dancers. Together they become the sensation of the street crowds.",
    "1984_2": "A freewheeling Detroit cop pursuing a murder investigation finds himself dealing with the very different culture of Beverly Hills.",
    "1984_20": "A soon-to-be-married man's friends throw him the ultimate bachelor party.",
    "1984_21": "It is the dawn of World War III. In mid-western America, a group of teenagers band together to defend their town, and their country, from invading Soviet forces.",
    "1984_22": "Slick Private Investigator Mike Murphy (Burt Reynolds) and tough Police Lieutenant Speer (Clint Eastwood), once partners, now bitter enemies, reluctantly team up to investigate a murder.",
    "1984_23": "A dying millionaire has her soul transferred into a younger, willing woman. However, something goes wrong, and she finds herself in her lawyer's body - together with the lawyer.",
    "1984_24": "In central Texas in the 1930s, a widow, with two small children, tries to run her small 40-acre farm with the help of two disparate people.",
    "1984_25": "A journalist is trapped in Cambodia during tyrant Pol Pot's bloody 'Year Zero' cleansing campaign, which claimed the lives of two million 'undesirable' civilians.",
    "1984_26": "After being mortally wounded and taken to the morgue, murderer Jason Voorhees spontaneously revives and embarks on a killing spree as he makes his way back to his home at Camp Crystal Lake.",
    "1984_27": "Conan leads a ragtag group of adventurers on a quest for a princess.",
    "1984_28": "A Duke's son leads desert warriors against the galactic emperor and his father's evil nemesis when they assassinate his father and free their desert world from the emperor's rule.",
    "1984_29": "A comic allegory about a traveling Bushman who encounters modern civilization and its stranger aspects, including a clumsy scientist and a band of revolutionaries.",
    "1984_3": "Three former parapsychology professors set up shop as a unique ghost removal service.",
    "1984_30": "An alien takes the form of a young widow's husband and makes her drive him across the country. The government tries to stop them.",
    "1984_31": "Video game expert Alex Rogan finds himself transported to another planet after conquering The Last Starfighter video game only to find out it was just a test. He was recruited to join the team of best starfighters to defend their world from the attack.",
    "1984_32": "The original characters from The Cannonball Run (1981) race across the country once more in various cars and trucks.",
    "1984_33": "A well meaning but burned-out high school teacher tries to maintain order against the backdrop of a pending lawsuit against his school district when it comes to light they gave a diploma to an illiterate student.",
    "1984_34": "Cultural mistrust and false accusations doom a friendship in British colonial India between an Indian doctor, an Englishwoman engaged to marry a city magistrate, and an English educator.",
    "1984_35": "A living puppet, with the help of a cricket as his conscience, must prove himself worthy to become a real boy.",
    "1984_36": "The US needs to convince the visiting emir Khala'ad of Othar to allow an American military base in his strategic realm. Clueless nightclub waitress Sunny Ann Davis accidentally spots and stops a terrorist shooting at the president and his ...See moreThe US needs to convince the visiting emir Khala'ad of Othar to allow an American military base in his strategic realm. Clueless nightclub waitress Sunny Ann Davis accidentally spots and stops a terrorist shooting at the president and his royal guest. Her naive comments charm the press, so the State Department recruits her for its Protocol. She falls in love with charming Middle East desk chief Michael Ransome, who resigns rather than help trick her into a 'contact mission' to Othar, where the emir's plan with her unexpectedly stirs a revolution.  Written by KGF VissersSee less",
    "1984_37": "A bigamist must keep his wives from meeting each other, which becomes tricky when they're both pregnant.",
    "1984_38": "Meet the jazz musicians, dancers, owner and guests (e.g. gangster Dutch Schultz) of The Cotton Club in 1928-30s Harlem.",
    "1984_39": "Kermit and his friends go to New York City to get their musical on Broadway only to find it's a more difficult task than they anticipated.",
    "1984_4": "A boy inadvertently breaks three important rules concerning his new pet and unleashes a horde of malevolently mischievous monsters on a small town.",
    "1984_40": "The monstrous spirit of a slain child murderer seeks revenge by invading the dreams of teenagers whose parents were responsible for his untimely death.",
    "1984_41": "On his way to work, Teddy spots Charlotte, an incredibly beautiful Woman in Red. He really wants to meet her, but what would his wife say?",
    "1984_42": "A Russian saxophonist visiting New York with a circus troupe suddenly decides to defect from the USSR during a shopping trip to a department store, but he finds adjusting to American life more difficult than he imagined.",
    "1984_43": "A recent high school graduate unsure of his future gets a summer job at the Flamingo beach club, and meets the charismatic Phil Brody.",
    "1984_44": "A girl's \"sweet\" sixteenth birthday becomes anything but special, as she suffers from every embarrassment possible.",
    "1984_45": "Bagheera the Panther and Baloo the Bear have a difficult time trying to convince a boy to leave the jungle for human civilization.",
    "1984_46": "Colonel Braddock launches a mission deep into the jungles of Vietnam to find the POW camp that he escaped from and free the Americans still held captive there.",
    "1984_47": "An African-American officer investigates a murder in a racially charged situation in World War II.",
    "1984_48": "A gangster hires an ex-football player to find his girlfriend. When he finds her, they fall in love, and the twists start to appear.",
    "1984_49": "George Burns returns as God, and as Satan. They battle over the soul of a young rock star who is willing to sell his soul to the devil.",
    "1984_5": "A martial arts master agrees to teach karate to a bullied teenager.",
    "1984_50": "A country music star must turn an obnoxious New York cabbie into a singer in order to win a bet.",
    "1984_51": "Three rookie sailors who have just completed basic training are out on their first weekend pass. As they hit one bar after another, they soon forget everything the Navy ever taught them.",
    "1984_52": "Parody of WWII spy movies in which an American rock and roll singer becomes involved in a Resistance plot to rescue a scientist imprisoned in East Germany.",
    "1984_53": "Harkin Banks heads to skiing championships in California. A teen runaway tags along as he parties and competes with friends and foes.",
    "1984_54": "A troubled boy dives into a wondrous fantasy world through the pages of a mysterious book.",
    "1984_55": "A composer suspects his wife of cheating. He plots to kill her and frame it on her lover.",
    "1984_56": "A military weapons engineer struggles to do his job responsibly, while a hapless tank commander has to live with the consequences in combat years later.",
    "1984_57": "Best friends and their daughters vacation in Rio de Janeiro only for one to fall for the other's daughter.",
    "1984_58": "A handsome jewel thief is arrested and in order to avoid prison, must break into the heavily guarded German Embassy to steal millions in gems.",
    "1984_59": "Molly, a highschooler, secretly earns her living as Angel, a street prostitute whose only family and friends are the ones she works with on the streets. She has to survive against a serial killer who is targeting people of her profession.",
    "1984_6": "A mousy romance novelist sets off for Colombia to ransom her kidnapped sister, and soon finds herself in the middle of a dangerous adventure hunting for treasure with a mercenary rogue.",
    "1984_60": "Set in the 1930s, an honest, good-hearted man is forced to turn to a life of crime to finance his neurotic mother's sky-rocketing medical bills.",
    "1984_61": "A couple who participated in a potent medical experiment gain telepathic ability and then have a child who is pyrokinetic.",
    "1984_62": "An aspiring DJ, from the South Bronx, and his best friend, a promoter, try to get into show business by exposing people to hip-hop music and culture.",
    "1984_63": "A developer tries to bulldoze a community recreation center. The local breakdancers try to stop it.",
    "1984_64": "A young couple is trapped in a remote town where a dangerous religious cult of children believes that everyone over age 18 must be killed.",
    "1984_65": "A comet wipes out most of life on Earth, leaving two Valley Girls fighting against cannibal zombies and a sinister group of scientists.",
    "1984_66": "After losing a powerful orb, Kara Zor-El, Superman's cousin, comes to Earth to retrieve it and instead finds herself up against a wicked witch.",
    "1984_67": "In a distant future scarce of water, space pirates get caught after stealing ice from a spaceship. They are sold to a princess looking for her dad. He might have found a planet abundant with water.",
    "1984_68": "A professional killer comes out of retirement to investigate and avenge the brutal murder of an old friend.",
    "1984_69": "Alternating between the past and the present, a precocious little girl sues her selfish, career-driven parents for emancipation, surprising them both.",
    "1984_7": "A group of good-hearted, but incompetent misfits enter the police academy, but the instructors there are not going to put up with their pranks.",
    "1984_70": "A young psychic on the run from himself is recruited by a government agency experimenting with the use of the dream-sharing technology and is given the inverse task of planting an idea into the mind of the U.S. president.",
    "1984_71": "Bob McGraw is in his 12th year of college, goofing his way through life.",
    "1984_72": "A farming family battles severe storms, a bank is threatening to repossess their farm, and there are other hard times in a battle to save and hold on to their farm.",
    "1984_73": "Sergeant Major Zack arrives at a new army base with his wife, son and Sherman tank. One night at a bar he \"stops\" a pimp/deputy from beating a girl. The corrupt sheriff uses Zack's son for revenge and Zack uses his tank.",
    "1984_74": "Although they live married lives, two strangers keep running into each other, starting a friendship that could blossom into so much more.",
    "1984_75": "A famous rock star falls in love with a child psychologist who has ears only for the classics, and has never heard of him.",
    "1984_76": "A high-school wrestler parties with his buddy at a swinging-singles apartment complex.",
    "1984_77": "In his attempts to reconcile a lounge singer with his mistress, a hapless talent agent is mistaken as her lover by a jealous gangster.",
    "1984_78": "Four college coeds, virginal Jennie, outgoing Carole, wealthy and spoiled Southern belle Sandra and horny Laurie, travel to Fort Lauderdale for their Easter week of Spring Break, and become involved in a series of adventures and ...See moreFour college coeds, virginal Jennie, outgoing Carole, wealthy and spoiled Southern belle Sandra and horny Laurie, travel to Fort Lauderdale for their Easter week of Spring Break, and become involved in a series of adventures and misadventures, which include the naive Jennie being pursued by musician drifter Scott and Sandra's snobbish musician cousin Camden. Meanwhile, Carole is seeking a break in her relationship with the jealous Chip who follows her down to Florida. Sandra pursues a romance with local policeman Ernie who arrests her on the first night for being drunk and disorderly, while Laurie just seeks any man she can get her hands on.  Written by matt-282See less",
    "1984_79": "A woman trapped in a boring marriage begins an affair with a handsome man who seems able to read her mind. She doesn't know that he has broken into her house and read her diaries, where she has recorded her deepest thoughts and fantasies.See moreA woman trapped in a boring marriage begins an affair with a handsome man who seems able to read her mind. She doesn't know that he has broken into her house and read her diaries, where she has recorded her deepest thoughts and fantasies.  Written by See less",
    "1984_8": "A city teenager moves to a small town where rock music and dancing have been banned, and his rebellious spirit shakes up the populace.",
    "1984_80": "A compilation of scenes from many science fiction, crime drama and horror films of the 1930s through 1980s.",
    "1984_81": "In WW2, the Allies race against time to persuade two nuclear scientists working for the Germans to switch sides.",
    "1984_82": "Gilbert Ivy and his wife Jewell are farmers. They seem to be working against the odds, producing no financial surplus. Gilbert has lost hope of ever becoming prosperous, but his wife decides to fight for her family.See moreGilbert Ivy and his wife Jewell are farmers. They seem to be working against the odds, producing no financial surplus. Gilbert has lost hope of ever becoming prosperous, but his wife decides to fight for her family.  Written by Mattias ThuressonSee less",
    "1984_83": "Set in the 1920s, a young woman sets out to lose her virginity. Her mission leads her to a Moroccan sheikh and a Spanish bullfighter.",
    "1984_84": "A young actor's obsession with spying on a beautiful woman who lives nearby leads to a baffling series of events with drastic consequences.",
    "1984_85": "A young American hustler pursues the girl of his dreams to Oxford, where he must enroll to obtain her.",
    "1984_86": "Fed up with their Captain's harsh discipline, a sailing ship's crew decides to take action.",
    "1984_87": "In a totalitarian future society, a man, whose daily work is re-writing history, tries to rebel by falling in love.",
    "1984_88": "A motorbike riding loner rebel on the high school football team wins a date with a cute, rich cheerleader. At the high school dance, her boyfriend's behavior leads to a breakup - opening doors.",
    "1984_89": "A United States Navy destroyer escort participates in a Navy \"invisibility\" experiment that inadvertently sends two sailors forty years into the future.",
    "1984_9": "A human soldier is sent from 2029 to 1984 to stop an almost indestructible cyborg killing machine, sent from the same year, which has been programmed to execute a young woman whose unborn son is the key to humanity's future salvation.",
    "1984_90": "A mercenary is hired to rescue his ex-girlfriend, a singer who has been kidnapped by a motorcycle gang.",
    "1984_91": "Susan Berlanger, a New York based concert flutist, is currently in the pit orchestra for a ballet company where her best friend Lisa Elliott is a dancer. Susan's parents are helping arrange a European concert tour to increase her ...See moreSusan Berlanger, a New York based concert flutist, is currently in the pit orchestra for a ballet company where her best friend Lisa Elliott is a dancer. Susan's parents are helping arrange a European concert tour to increase her professional profile. She is considering accepting the marriage proposal of straight-laced investment banker Frank Bantam, it a marriage of convenience for both with Frank still in the closet, and Susan facing her own man problems. Having contracted a case of viral encephalitis at age nine, Susan requires a brace to walk, and even then with a limp. As such, many men seem to be attracted to her until they see the brace. In going on that European tour, Susan comes up with an idea to explore life without being judged solely by her disability. On her limited funds, she will ditch a couple of the tour dates and instead head to the French ski resort of Megève on a deal. Before she goes, she is able to persuade a Parisian doctor to put her usually braced leg in a cast so that people will just assume that she is recuperating from a ski injury, instead of being permanently disabled. The ruse works, she making some friends and having some lovers along the way. Key among those is an American skier named Steve Haslachez at the mountain for some races, a Parisienne named Nicole Schallon who is waiting for her married lover to show up, ski equipment executive François Rossignol who is a little more comfortable discussing his own physical disability, and freelance photographer Peter Nichols who is largely there to take photos of his current love interest Bobbie, also there for the races. Despite their bumpy beginning, she especially makes that romantic connection with Peter. She has to decide if there is any chance of a future with him, which means not only being fit into his already hectic global travel schedule, but being up front with him about her disability, which, if past history is any indication, may kibosh the relationship anyway.  Written by HuggoSee less",
    "1984_92": "An American actress with a penchant for lying is forcibly recruited by Mossad, the Israeli intelligence agency, to trap a Palestinian bomber, by pretending to be the girlfriend of his dead brother.",
    "1984_93": "An evil ninja attempts to avenge his death from beyond the grave, by possessing an innocent woman's body.",
    "1984_94": "A prehistoric Neanderthal man found frozen in ice is revived by an arctic exploration team, who then attempt to use him for their own scientific means.",
    "1984_95": "Frumpy singles Hunter, Rounder and Ashby rent a beach house to take advantage of the surf, sun and scores of available women. Not having what it takes, the men hire a sexy young surfer, Scotty, to help them meet girls.",
    "1984_96": "A New York City drug dealer decides to get out of the business, but has to flee from mobsters.",
    "1984_97": "Two cousins unknowingly rob the mob and face the dangerous consequences.",
    "1984_98": "In the near future, a police officer specializes in malfunctioning robots. When a robot turns out to have been programmed to kill, he begins to uncover a homicidal plot to create killer robots... and his son becomes a target. Read more: Synopsis",
    "1984_99": "A woman finds romance when she takes a job at an aircraft plant to help make ends meet after her husband goes off to war."
}