{
    "1985_1": {
        "plotSummary": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the eccentric scientist Doc Brown.",
        "runtimeMinutes": "116"
    },
    "1985_10": {
        "plotSummary": "A troubled child summons the courage to help a friendly alien escape Earth and return to his home world.",
        "runtimeMinutes": "115"
    },
    "1985_100": {
        "plotSummary": "Two escaped convicts and a female railway worker find themselves trapped on a train with no brakes and nobody driving.",
        "runtimeMinutes": "111"
    },
    "1985_101": {
        "plotSummary": "Prince Adam is sent to the world of Etheria to find his long abducted sister, Adora, and awaken her to her own destiny.",
        "runtimeMinutes": "100"
    },
    "1985_102": {
        "plotSummary": "After discovering that his wife is cheating on him, an insomniac aerospace engineer accidentally meets, and tries to help a beautiful model on the run from some extremely dangerous people.",
        "runtimeMinutes": "115"
    },
    "1985_103": {
        "plotSummary": "In 1940s Texas, an elderly woman is determined to visit her childhood home for one last time.",
        "runtimeMinutes": "108"
    },
    "1985_104": {
        "plotSummary": "Two reporters for a tabloid newspaper are sent to Transylvania to find the Frankenstein monster, or get fired. They are laughed at there, but something suspicious is going on. Could there be monsters, vampires, mummies and werewolves?",
        "runtimeMinutes": "93"
    },
    "1985_105": {
        "plotSummary": "The fearless warrior Red Sonja sets out to avenge her family's murder and rid her kingdom from the tyrannical rule of evil Queen Gedren.",
        "runtimeMinutes": "89"
    },
    "1985_106": {
        "plotSummary": "Henry's parents are lost in Africa, so he must live with his greedy and heartless Uncle Augustus. In the crevices of the house live the \"Littles\" kind, elf-like creatures. August enslaves Henry and wants to tear down his house to build a ...See moreHenry's parents are lost in Africa, so he must live with his greedy and heartless Uncle Augustus. In the crevices of the house live the \"Littles\" kind, elf-like creatures. August enslaves Henry and wants to tear down his house to build a shopping center. Grandpa Little cares for Tom and Lucy, the Littles' children. Tom befriends a vicious cat by removing a splinter from his paw. After a series of adventures, the Littles and Henry get evidence of Augustus' plot to steal Henry's home. Augustus is arrested, the house is saved, and all ends well.  Written by AnonymousSee less",
        "runtimeMinutes": "72"
    },
    "1985_107": {
        "plotSummary": "Janey is new in town and soon meets Lynne, who shares her passion for dancing in general and \"Dance TV\" in particular.",
        "runtimeMinutes": "90"
    },
    "1985_108": {
        "plotSummary": "A young Englishwoman spends twenty years to make whatever kind of life for herself, at the expense of others around her, in post-World War II England.",
        "runtimeMinutes": "121"
    },
    "1985_109": {
        "plotSummary": "A singing cowboy roams the Wild West with his sidekick, dancing horse and fancy wardrobe.",
        "runtimeMinutes": "88"
    },
    "1985_11": {
        "plotSummary": "Two bumbling government employees think they are U.S. spies, only to discover that they are actually decoys for Nuclear War.",
        "runtimeMinutes": "102"
    },
    "1985_110": {
        "plotSummary": "A new transfer student to St. Basil's Boys' Prep School tries to fit in while romantically pursuing a troubled young girl.",
        "runtimeMinutes": "104"
    },
    "1985_111": {
        "plotSummary": "An American gymnast travels to a foreign country to compete in a deadly game not won by anyone other than a native in more than 900 years.",
        "runtimeMinutes": "90"
    },
    "1985_112": {
        "plotSummary": "Molly, former prostitute, has managed to leave her street life with help from Lt. Andrews. She studies law and leads a normal life. When Andrews is killed by a brutal gang, she returns to the streets as Angel to find his killers.",
        "runtimeMinutes": "93"
    },
    "1985_113": {
        "plotSummary": "An eccentric scientist teaches a student in his own manner while he looks for a way to clone his deceased wife.",
        "runtimeMinutes": "107"
    },
    "1985_114": {
        "plotSummary": "Israel circa 1,000 B.C. The adult life of David, who would eventually become King of Israel, is presented. The blessing of the Prophets, as the voice of God, is required before the King can take any major action. It is because God is ...See moreIsrael circa 1,000 B.C. The adult life of David, who would eventually become King of Israel, is presented. The blessing of the Prophets, as the voice of God, is required before the King can take any major action. It is because God is annoyed with King Saul for not following his word that the Prophet Samuel, taking his cues from God, surprisingly and unexpectedly anoints David, the teenaged and youngest of Jesse's four sons, the next King. Regardless, it isn't until David's encounter with Goliath that he and many of the Israelites believe he could and should be King. Believing the anointing of David undermines his rule, King Saul, whose army is far outnumbered by those of the enemy Philistines, takes one measure after another against David and by association at the peril of his army in battles against the Philistines. These moves by Saul do not sit well with many, but especially his son Jonathan, who supports David as the next King. Over David's eventual rule as King, he will have his own issues with God and the Prophets as often ruling by his emotions rather than by God's word, especially with regard to the treatment of his eldest son Absalom, and in his relationship with Bathsheba.  Written by HuggoSee less",
        "runtimeMinutes": "114"
    },
    "1985_115": {
        "plotSummary": "A small group of military officers and scientists dwell in an underground bunker as the world above is overrun by zombies.",
        "runtimeMinutes": "96"
    },
    "1985_116": {
        "plotSummary": "A boy inadvertently breaks three important rules concerning his new pet and unleashes a horde of malevolently mischievous monsters on a small town.",
        "runtimeMinutes": "106"
    },
    "1985_117": {
        "plotSummary": "Rainbow Brite must stop an evil princess and her underlings from taking over the planet Spectra.",
        "runtimeMinutes": "85"
    },
    "1985_118": {
        "plotSummary": "A teenage girl in a country manor falls asleep while reading a magazine, and has a disturbing dream involving wolves prowling the woods below her bedroom window.",
        "runtimeMinutes": "95"
    },
    "1985_119": {
        "plotSummary": "When a teenager is shot at the beach, a journalist from The Miami Journal is sent to cover the story. He's called by the murderer and told there'll be four more.",
        "runtimeMinutes": "103"
    },
    "1985_12": {
        "plotSummary": "Irwin M. \"Fletch\" Fletcher is a newspaper reporter being offered a large sum to off a cancerous millionaire, but is on the run, risking his job and finding clues when it's clear the man is healthy.",
        "runtimeMinutes": "98"
    },
    "1985_120": {
        "plotSummary": "The history of dance depicted on film.",
        "runtimeMinutes": "105"
    },
    "1985_121": {
        "plotSummary": "A high school student and his friend find a strange, orb-like piece of equipment to use as a science project, but must stop it when it begins to threaten mankind.",
        "runtimeMinutes": "94"
    },
    "1985_122": {
        "plotSummary": "Thirty years after the original monster's rampage, a new Godzilla emerges and attacks Japan.",
        "runtimeMinutes": "87"
    },
    "1985_123": {
        "plotSummary": "A hip guardian angel named Bobby Fantana, who died in a car race in the 60s, reluctantly agrees to watch over a lonely 80s high schooler who needs guidance on how to become cool.",
        "runtimeMinutes": "90"
    },
    "1985_124": {
        "plotSummary": "In Medieval Japan, an elderly warlord retires, handing over his empire to his three sons. However, he vastly underestimates how the new-found power will corrupt them and cause them to turn on each other...and him.",
        "runtimeMinutes": "162"
    },
    "1985_125": {
        "plotSummary": "Jimmy Lynch is angry because his older brother, who was injured as a result of an off duty fire rescue, is denied benefits by the city.",
        "runtimeMinutes": "102"
    },
    "1985_126": {
        "plotSummary": "After years of research, the doctor finally succeeds in creating the perfect woman, who gets the name \"Eva\".",
        "runtimeMinutes": "118"
    },
    "1985_127": {
        "plotSummary": "Set on the subterranean Mine-World, a band of human worker are treated like slaves under the power of the evil overlord Zygon until one, Orin, unearths the hilt of a mythical sword that only he can master. Escaping the planet, he runs into...See moreSet on the subterranean Mine-World, a band of human worker are treated like slaves under the power of the evil overlord Zygon until one, Orin, unearths the hilt of a mythical sword that only he can master. Escaping the planet, he runs into the rogue smuggler Dagg and a pair of helpful droids and the princess, who all team up to return to the Mine-World with a plan to defeat Zygon and free Orin's enslaved people.  Written by Anthony Pereyra {hypersonic91@yahoo.com}See less",
        "runtimeMinutes": "100"
    },
    "1985_128": {
        "plotSummary": "Theta Pi Gamma fraternity's newest pledge--a gawky, innocent, and utterly uncool bookworm--and two of his self-confident fraternity brothers embark on a week-long vacation in Palm Springs. Can they transform him into a real Casanova?",
        "runtimeMinutes": "94"
    },
    "1985_129": {
        "plotSummary": "A Texas teenager cuts her hair short and becomes an outlaw martyr with her brother and friends.",
        "runtimeMinutes": "96"
    },
    "1985_13": {
        "plotSummary": "A retired Special Forces colonel tries to save his daughter, who was abducted by his former subordinate.",
        "runtimeMinutes": "90"
    },
    "1985_130": {
        "plotSummary": "An ex-con and break-dancer helps save a neighborhood from a greedy developer while trying to win a rap contest.",
        "runtimeMinutes": "92"
    },
    "1985_131": {
        "plotSummary": "Eight young people from Ohio, who are dancers, come to New York City to compete in a major talent competition. But, when they get there, they learn that they have to wait some time before they take part in it. So they try to do their best ...See moreEight young people from Ohio, who are dancers, come to New York City to compete in a major talent competition. But, when they get there, they learn that they have to wait some time before they take part in it. So they try to do their best to survive in the Big Apple before competition, and get some lessons about the real world.  Written by See less",
        "runtimeMinutes": "110"
    },
    "1985_132": {
        "plotSummary": "Four Venice Beach boys make a pact to lose their virginity before beginning their senior year of high school.",
        "runtimeMinutes": "85"
    },
    "1985_133": {
        "plotSummary": "Jeff Marx wants to study medicine and become a physician. However, his grades are far from enough to get him into an American medical school. But instead he gets a chance to study medicine abroad, in a small Latin American dictatorship, ...See moreJeff Marx wants to study medicine and become a physician. However, his grades are far from enough to get him into an American medical school. But instead he gets a chance to study medicine abroad, in a small Latin American dictatorship, governed by Ramon Madera, who falls in love with Jeff's girlfriend, also a medical student.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "98"
    },
    "1985_134": {
        "plotSummary": "A 1920s flapper who haunts her old house possesses a reserved housewife who just moved in. However, she cannot leave before she receives her massive audition for a Hollywood studio.",
        "runtimeMinutes": "98"
    },
    "1985_135": {
        "plotSummary": "In post-World War II Britain, food rationing continues, leading a married couple to become involved in the flourishing bacon black market.",
        "runtimeMinutes": "92"
    },
    "1985_136": {
        "plotSummary": "A political appointee risks her job and her life to expose corruption.",
        "runtimeMinutes": "112"
    },
    "1985_137": {
        "plotSummary": "A stormy relationship, complicated by the strictures of 1950s social class and gender roles, ends in death. Based on the life of Ruth Ellis, the last woman hanged in Britain.",
        "runtimeMinutes": "96"
    },
    "1985_138": {
        "plotSummary": "The owner of a seedy small-town Texas bar discovers that one of his employees is having an affair with his wife. A chaotic chain of misunderstandings, lies and mischief ensues after he devises a plot to have them murdered.",
        "runtimeMinutes": "99"
    },
    "1985_139": {
        "plotSummary": "A man named Zac Hobson awakens to find himself alone in the world. In a desperate attempt to search for others, he finds only two who have their own agenda.",
        "runtimeMinutes": "91"
    },
    "1985_14": {
        "plotSummary": "When a new gang moves into town it's up to the screwball police team to stop them.",
        "runtimeMinutes": "87"
    },
    "1985_140": {
        "plotSummary": "After an odd new medical student arrives on campus, a dedicated local and his girlfriend become involved in bizarre experiments centering around the re-animation of dead tissue.",
        "runtimeMinutes": "104"
    },
    "1985_141": {
        "plotSummary": "A woman working as a security guard in an agricultural research facility finds herself and her co-worker Schmidt fighting to survive against their former friends.",
        "runtimeMinutes": "99"
    },
    "1985_142": {
        "plotSummary": "Documents the preparation and rehearsals for Sting's first solo concert, as well as his supporting band's opinions on their leader and his controversial efforts.",
        "runtimeMinutes": "97"
    },
    "1985_143": {
        "plotSummary": "A major league star who is on the verge of breaking a record, meets a singer and they get married, but they have different goals, so they separate, jeopardizing his opportunity in sports and the possibility of making up with his wife.",
        "runtimeMinutes": "105"
    },
    "1985_144": {
        "plotSummary": "A small \"Dance-ercize\" studio fights for its existence against the unscrupulous owner of a rival club. The conflict boils down to a \"Dance Marathon\" to settle the score.See moreA small \"Dance-ercize\" studio fights for its existence against the unscrupulous owner of a rival club. The conflict boils down to a \"Dance Marathon\" to settle the score.  Written by Kevin Thom See less",
        "runtimeMinutes": "89"
    },
    "1985_145": {
        "plotSummary": "Sports physician Marcus persuades his unstable brother David to come with him and train for a bicycle race across the Rocky Mountains. Marcus doesn't tell David that he has a brain aneurysm which could render him paralyzed or dead at any ...See moreSports physician Marcus persuades his unstable brother David to come with him and train for a bicycle race across the Rocky Mountains. Marcus doesn't tell David that he has a brain aneurysm which could render him paralyzed or dead at any given moment. While David powerfully heads for the victory, Marcus has to realize that the contest is now beyond his capabilities. / Features great views of the Rockies and an insight in the tactics of bicycle races.  Written by Tom Zoerner See less",
        "runtimeMinutes": "113"
    },
    "1985_146": {
        "plotSummary": "During a shooting in court young prostitute Scarlet manages to flee. In a state of confusion, the black Tracy, who was arrested for a minor delict, follows her. When she decides to leave Scarlett, an accident makes it impossible. So ...See moreDuring a shooting in court young prostitute Scarlet manages to flee. In a state of confusion, the black Tracy, who was arrested for a minor delict, follows her. When she decides to leave Scarlett, an accident makes it impossible. So they're bound together on a flight from the police and some of the meanest criminals of New York.  Written by Tom Zoerner See less",
        "runtimeMinutes": "87"
    },
    "1985_147": {
        "plotSummary": "Gwendoline, a runaway nun, arrives in Hong Kong on a mission to find her father, who was last seen in the legendary Land of the Yik Yak searching for a rare butterfly. She's guided on her perilous journey by the selfish mercenary Willard.",
        "runtimeMinutes": "105"
    },
    "1985_148": {
        "plotSummary": "A 1920s mail pilot and a rich man's daughter crash-land on a mountain full of hungry wolves.",
        "runtimeMinutes": "96"
    },
    "1985_149": {
        "plotSummary": "The mysterious death of an enigmatic young man newly arrived in the suburb of Wetherby releases the long-repressed, dark passions of some of its residents.",
        "runtimeMinutes": "102"
    },
    "1985_15": {
        "plotSummary": "Five high school students meet in Saturday detention and discover how they have a lot more in common than they thought.",
        "runtimeMinutes": "97"
    },
    "1985_150": {
        "plotSummary": "Exploring the somewhat darker and more mysterious side of Lewis Carroll's classic book, the movie follows Alice Liddell Hargreaves (Coral Browne) (the book's inspiration) as an old woman who is haunted by the characters, by whom she was ...See moreExploring the somewhat darker and more mysterious side of Lewis Carroll's classic book, the movie follows Alice Liddell Hargreaves (Coral Browne) (the book's inspiration) as an old woman who is haunted by the characters, by whom she was once so amused. As she thinks back on it, she starts to see her relationship with Reverend Charles L. Dodgson/Lewis Carroll (Sir Ian Holm) in a new way, and realizes the vast change between the young Alice and the old.  Written by Max VaughnSee less",
        "runtimeMinutes": "94"
    },
    "1985_151": {
        "plotSummary": "Two men and a woman circle the globe in a satellite armed with a nuclear device. The third world war breaks out, and a few months later the satellite crashes. They survive the crash but one man gets killed by survivors and the other man ...See moreTwo men and a woman circle the globe in a satellite armed with a nuclear device. The third world war breaks out, and a few months later the satellite crashes. They survive the crash but one man gets killed by survivors and the other man gets caught. The woman stays by the remains of the the satellite but is soon caught by evil punks who have taken power.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "88"
    },
    "1985_152": {
        "plotSummary": "Two New York City cops, Billy Wong and Danny Garoni, head to Hong Kong after the daughter of a rich businessman is kidnapped by the drug lord, Mr. Ko.",
        "runtimeMinutes": "91"
    },
    "1985_153": {
        "plotSummary": "Ten years after ratting on his old mobster friends in exchange for personal immunity, two hit men drive a hardened criminal to Paris for his execution. However, while on the way, whatever can go wrong, does go wrong.",
        "runtimeMinutes": "98"
    },
    "1985_154": {
        "plotSummary": "May is waiting for her boyfriend in a run-down American motel, when an old flame turns up and threatens to undermine her efforts and drag her back into the life that she was running away from. The situation soon turns complicated.",
        "runtimeMinutes": "106"
    },
    "1985_155": {
        "plotSummary": "A group of unscrupulous characters seek buried treasure in the old west.",
        "runtimeMinutes": "84"
    },
    "1985_156": {
        "plotSummary": "Judges and bodybuilders (Rachel McLish, Bev Francis, Carla Dunlap) try to define femininity at the 1983 world championship, Caesars Palace, Las Vegas.",
        "runtimeMinutes": "107"
    },
    "1985_157": {
        "plotSummary": "An investigative journalist gets hooked on the subject of his inquiry - professional gambling.",
        "runtimeMinutes": "96"
    },
    "1985_158": {
        "plotSummary": "Emerald is an agent the Germans \"have\" inside allied intelligence 1944/WWII. With \"help\" from Emerald, the Germans catch Wheeler, believed to know the when and where of D-Day. Emerald is sent to be Wheeler's cell mate. Let the game begin.",
        "runtimeMinutes": "95"
    },
    "1985_159": {
        "plotSummary": "The story of a Jewish writer, from his life as a young boy in Montreal to his more complicated grown-up life.",
        "runtimeMinutes": "119"
    },
    "1985_16": {
        "plotSummary": "The recovery of a microchip off the body of a fellow agent, leads James Bond to a mad industrialist who plans to create a worldwide microchip monopoly by destroying California's Silicon Valley.",
        "runtimeMinutes": "131"
    },
    "1985_160": {
        "plotSummary": "A fictionalized account in four chapters of the life of celebrated Japanese writer Yukio Mishima.",
        "runtimeMinutes": "120"
    },
    "1985_161": {
        "plotSummary": "A trio of moronic aliens crash-land on Earth and become celebrities, while a fourth alien, who arrives separately, finds himself ignored.",
        "runtimeMinutes": "90"
    },
    "1985_162": {
        "plotSummary": "The son of a German General becomes part of a mysterious conspiracy to gain hidden Nazi funds.",
        "runtimeMinutes": "112"
    },
    "1985_163": {
        "plotSummary": "On improvising a burglary at a shady tycoon's home, Fred takes refuge in the hip and surreal universe of the Paris Metro and encounters its assorted denizens, the tycoon's henchmen and his disenchanted young wife.",
        "runtimeMinutes": "104"
    },
    "1985_164": {
        "plotSummary": "Charlie is a 16-year-old orphan struggling to raise her two younger brothers when she endeavors to train a rogue horse she names Sylvester and turn him into an eventing champion.",
        "runtimeMinutes": "104"
    },
    "1985_165": {
        "plotSummary": "Joe Mulholland, Head of Production at a Hollywood studio, makes a rather fool-hardy promise to a dying friend. He undertakes to make a major movie using the title - if not the content - of a best-selling sex manual \"Love in Sex\". Enlisting...See moreJoe Mulholland, Head of Production at a Hollywood studio, makes a rather fool-hardy promise to a dying friend. He undertakes to make a major movie using the title - if not the content - of a best-selling sex manual \"Love in Sex\". Enlisting the help of depressed screenwriter Herb Derman and rather off-centre director Sid Spokane to try and come up with an idea or two, Joe soon wishes he was not one of those people who always try to keep their promises.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "80"
    },
    "1985_166": {
        "plotSummary": "A trapper and his young son get pulled into the American revolution early as unwilling participants and remain involved through to the end.",
        "runtimeMinutes": "126"
    },
    "1985_167": {
        "plotSummary": "The story of two adolescent boys who are guests at a Florida resort for the week-end. Their only interest is, of course, chasing girls, but fate has much more in store for them.See moreThe story of two adolescent boys who are guests at a Florida resort for the week-end. Their only interest is, of course, chasing girls, but fate has much more in store for them.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "1985_168": {
        "plotSummary": "Nick is a writer in New York when he gets posted to a bureau in Greece. He has waited 30 years for this. He wants to know why his mother was killed in the civil war years earlier. In a parallel plot line we see Nick as a young boy and his ...See moreNick is a writer in New York when he gets posted to a bureau in Greece. He has waited 30 years for this. He wants to know why his mother was killed in the civil war years earlier. In a parallel plot line we see Nick as a young boy and his family as they struggle to survive in the occupied Greek hillside. The plot lines converge as Nick's investigations bring him closer to the answers.  Written by Robert B. Young See less",
        "runtimeMinutes": "114"
    },
    "1985_169": {
        "plotSummary": "A brother and sister arrive in a small town to help their relatives run an amusement park, and they find the town is terrorized by a local street gang.",
        "runtimeMinutes": "89"
    },
    "1985_17": {
        "plotSummary": "The Griswolds win a vacation tour across Europe where the usual havoc ensues.",
        "runtimeMinutes": "95"
    },
    "1985_170": {
        "plotSummary": "A teenage boy living in a Cape Breton coal mining community during the 1930's finds himself contemplating life and is haunted by a murder he witnessed in town.",
        "runtimeMinutes": "107"
    },
    "1985_171": {
        "plotSummary": "In Victorian England, two grave robbers supply a wealthy doctor with bodies to research anatomy on, but greed causes them to look for a more simple way to get the job done. Based on the horrifying Burke and Hare case.",
        "runtimeMinutes": "93"
    },
    "1985_172": {
        "plotSummary": "Michel is a teenager particularly ill at ease in his own skin. After an unhappy affair with a young Algerian girl and running away from home, he finally finds his balance. But he must now restore that of his parents, facing divorce.",
        "runtimeMinutes": "90"
    },
    "1985_173": {
        "plotSummary": "Alex and Erica Boyer's marriage is in a crisis: job and wife bore Alex. When Erica has an accident that has her staying in a wheel chair for some time, it changes their life: Alex meets Erica's young therapy assistant Lisa and gets the ...See moreAlex and Erica Boyer's marriage is in a crisis: job and wife bore Alex. When Erica has an accident that has her staying in a wheel chair for some time, it changes their life: Alex meets Erica's young therapy assistant Lisa and gets the idea that she'd be the end of his boredom and he could start over with her. However Lisa's boyfriend feels what's going on and isn't idle.  Written by Tom Zoerner See less",
        "runtimeMinutes": "96"
    },
    "1985_174": {
        "plotSummary": "Five college buddies from the University of Texas circa 1971 embark on a final road trip odyssey across the Mexican border before facing up to uncertain futures, in Vietnam and otherwise.",
        "runtimeMinutes": "91"
    },
    "1985_175": {
        "plotSummary": "A group of mercenaries is hired to spring Rudolf Hess from Spandau Prison in Berlin. Read more: Synopsis",
        "runtimeMinutes": "125"
    },
    "1985_176": {
        "plotSummary": "During the final months of Argentinian Military Dictatorship in 1983, a high school teacher sets out to find out who the mother of her adopted daughter is.",
        "runtimeMinutes": "112"
    },
    "1985_177": {
        "plotSummary": "The lives of an ex-con, a coffee-shop owner, and a young couple looking to make it rich intersect in the fictional and hypnotic Rain City.",
        "runtimeMinutes": "111"
    },
    "1985_178": {
        "plotSummary": "A free-spirited 15-year-old girl flirts with a dangerous stranger in the Northern California suburbs and must prepare herself for the frightening and traumatic consequences.",
        "runtimeMinutes": "92"
    },
    "1985_179": {
        "plotSummary": "A family is deeply affected by father's extramarital affairs and the turbulent consequences of Tito-Stalin split.",
        "runtimeMinutes": "136"
    },
    "1985_18": {
        "plotSummary": "A teenager with a massive facial skull deformity and biker gang mother attempt to live as normal a life as possible under the circumstances.",
        "runtimeMinutes": "120"
    },
    "1985_180": {
        "plotSummary": "Set during the fading glory of the Austro-Hungarian empire, the film tells of the rise and fall of Alfred Redl (Brandauer), an ambitious young officer who proceeds up the ladder to become head of the Secret Police only to become ensnared ...See moreSet during the fading glory of the Austro-Hungarian empire, the film tells of the rise and fall of Alfred Redl (Brandauer), an ambitious young officer who proceeds up the ladder to become head of the Secret Police only to become ensnared in political deception.  Written by Dawn M. BarcliftSee less",
        "runtimeMinutes": "144"
    },
    "1985_19": {
        "plotSummary": "A minor league baseball player has to spend $30 million in thirty days, in order to inherit $300 million. However, he's not allowed to own any assets, destroy the money, gift it, give it to charity or tell anyone about the deal.",
        "runtimeMinutes": "102"
    },
    "1985_2": {
        "plotSummary": "Rocky Balboa proudly holds the world heavyweight boxing championship, but a new challenger has stepped forward: Drago, a six-foot-four, 261-pound fighter who has the backing of the Soviet Union.",
        "runtimeMinutes": "91"
    },
    "1985_20": {
        "plotSummary": "A Russian American ballet dancer's airplane is forced to land in USSR, where he's \"repatriated\". He stays with an American man married to a Russian. Will the American help him flee USSR?",
        "runtimeMinutes": "136"
    },
    "1985_21": {
        "plotSummary": "A mysterious preacher (Clint Eastwood) protects a humble prospector village from a greedy mining company trying to encroach on their land.",
        "runtimeMinutes": "115"
    },
    "1985_22": {
        "plotSummary": "When eccentric man-child Pee-wee Herman gets his beloved bike stolen in broad daylight, he sets out across the U.S. on the adventure of his life.",
        "runtimeMinutes": "91"
    },
    "1985_23": {
        "plotSummary": "A wealthy woman is murdered in her beach house. The husband is allegedly knocked out first. He inherits all. He has a female ex criminal prosecutor represent him in court.",
        "runtimeMinutes": "108"
    },
    "1985_24": {
        "plotSummary": "Two high school nerds use a computer program to literally create the perfect woman, but she turns their lives upside down.",
        "runtimeMinutes": "94"
    },
    "1985_25": {
        "plotSummary": "A group of friends, just out of college, struggle with adulthood.",
        "runtimeMinutes": "110"
    },
    "1985_26": {
        "plotSummary": "After being exiled from the most advanced town in post apocalyptic Australia, a drifter travels with a group of abandoned children to rebel against the town's queen.",
        "runtimeMinutes": "107"
    },
    "1985_27": {
        "plotSummary": "An ordinary high school student discovers that his family has an unusual pedigree when he finds himself turning into a werewolf.",
        "runtimeMinutes": "91"
    },
    "1985_28": {
        "plotSummary": "When a litter of Dalmatian puppies are abducted by the minions of Cruella de Vil, the parents must find them before she uses them for a diabolical fashion statement.",
        "runtimeMinutes": "79"
    },
    "1985_29": {
        "plotSummary": "A misfit bunch of friends come together to right the injustices which exist in a small town.",
        "runtimeMinutes": "133"
    },
    "1985_3": {
        "plotSummary": "Rambo returns to the jungles of Vietnam on a mission to infiltrate an enemy base-camp and rescue the American POWs still held captive there.",
        "runtimeMinutes": "96"
    },
    "1985_30": {
        "plotSummary": "33 y.o. Emma moves to a ranch with her son after divorce. She offer stable to horse owners. It's tough at first. She befriends the older Murphy. Her ex shows up.",
        "runtimeMinutes": "107"
    },
    "1985_31": {
        "plotSummary": "A teenage boy is haunted in his dreams by deceased child murderer Freddy Krueger, who is out to possess him in order to continue his reign of terror in the real world.",
        "runtimeMinutes": "87"
    },
    "1985_32": {
        "plotSummary": "A bored New Jersey suburban housewife's fascination with a kooky character she's read about in the personal columns leads to her being mistaken for the woman herself.",
        "runtimeMinutes": "104"
    },
    "1985_33": {
        "plotSummary": "Two professional assassins fall in love.",
        "runtimeMinutes": "130"
    },
    "1985_34": {
        "plotSummary": "In New York City, a young man searches for a Master to obtain the final level of martial arts mastery known as the Glow.",
        "runtimeMinutes": "109"
    },
    "1985_35": {
        "plotSummary": "When a naive novice nun is discovered with a dead newborn in her convent quarters, a court-appointed psychiatrist investigates her case.",
        "runtimeMinutes": "98"
    },
    "1985_36": {
        "plotSummary": "A teenager discovers that the newcomer in his neighborhood is a vampire, so he turns to an actor in a television horror show for help dealing with the undead.",
        "runtimeMinutes": "106"
    },
    "1985_37": {
        "plotSummary": "An overworked air-traffic controller takes his family on a beach vacation but is soon beset by series of mishaps.",
        "runtimeMinutes": "87"
    },
    "1985_38": {
        "plotSummary": "After the son of engineer Bill Markham is abducted by an aboriginal tribe on the edge of the rain forest, the engineer spends the next 10 years searching for him.",
        "runtimeMinutes": "114"
    },
    "1985_39": {
        "plotSummary": "The legend of Santa Claus is put in jeopardy when an unscrupulous toy manufacturer attempts to take over Christmas.",
        "runtimeMinutes": "107"
    },
    "1985_4": {
        "plotSummary": "In 20th-century colonial Kenya, a Danish baroness/plantation owner has a passionate love affair with a free-spirited big-game hunter.",
        "runtimeMinutes": "161"
    },
    "1985_40": {
        "plotSummary": "The Care Bears watch over a young brother and sister who have lost their trust in humanity. Meanwhile an evil wizard wishes to cover the Earth in concrete.",
        "runtimeMinutes": "77"
    },
    "1985_41": {
        "plotSummary": "Still haunted by his past, Tommy Jarvis - who, as a child, killed Jason Voorhees - wonders if the serial killer is connected to a series of brutal murders occurring in and around the secluded halfway house where he now lives.",
        "runtimeMinutes": "92"
    },
    "1985_42": {
        "plotSummary": "A young boy and a bunch of misfit friends embark on a quest to find a dark magic item of ultimate power before a diabolical tyrant can.",
        "runtimeMinutes": "80"
    },
    "1985_43": {
        "plotSummary": "As graduation nears for the class of 1955 at Angel Beach High, the gang once again faces off against their old enemy, Porky, who wants them to throw the school's championship basketball game because he's betting on the opposing team.",
        "runtimeMinutes": "92"
    },
    "1985_44": {
        "plotSummary": "A Chicago cop is caught in the middle of a gang war while his own comrades shun him because he wants to take down an irresponsible cop.",
        "runtimeMinutes": "101"
    },
    "1985_45": {
        "plotSummary": "1962, after Yale graduation, womanizing Lawrence flees a gambling debt that his rich dad won't pay. He takes his roomie's place as Peace Corps Volunteer in Thai Golden Triangle with 2 other PCVs. Will he survive 2 years?",
        "runtimeMinutes": "107"
    },
    "1985_46": {
        "plotSummary": "When assorted people start having inexplicable delusions that lead to their deaths, a teenage Sherlock Holmes decides to investigate.",
        "runtimeMinutes": "109"
    },
    "1985_47": {
        "plotSummary": "A police detective cracks down on organized crime in Chinatown after the murders of Triad and Mafia leaders.",
        "runtimeMinutes": "134"
    },
    "1985_48": {
        "plotSummary": "The thief Gaston escapes the dungeon of medieval Aquila through the latrine. Soldiers are about to kill him when Navarre saves him. Navarre, traveling with his spirited hawk, plans to kill the bishop of Aquila with help from Gaston.",
        "runtimeMinutes": "121"
    },
    "1985_49": {
        "plotSummary": "Walter Gibson is a university freshman going through a dry spell. His old buddy arranges a \"sure thing\" for him in California. Gibson and his classmate Allison then take a long road trip out to Cali, and both foil each other's plans.",
        "runtimeMinutes": "100"
    },
    "1985_5": {
        "plotSummary": "When Joan Wilder is abducted while on a trip along the Nile, her boyfriend, Jack Colton, and pal Ralph rush to rescue her and retrieve a fabled jewel.",
        "runtimeMinutes": "106"
    },
    "1985_50": {
        "plotSummary": "A one-man army comes to the rescue of the United States when a spy attempts an invasion.",
        "runtimeMinutes": "107"
    },
    "1985_51": {
        "plotSummary": "A fearless Secret Service agent will stop at nothing to bring down the counterfeiter who killed his partner.",
        "runtimeMinutes": "116"
    },
    "1985_52": {
        "plotSummary": "The true story of a disillusioned military contractor employee and his drug pusher childhood friend who became walk-in spies for the Soviet Union.",
        "runtimeMinutes": "131"
    },
    "1985_53": {
        "plotSummary": "A gay man and a political prisoner are together in a prison. The gay man narrates the stories of two fake movies and his own life.",
        "runtimeMinutes": "120"
    },
    "1985_54": {
        "plotSummary": "Architect/vigilante Paul Kersey arrives back in New York City and is forcibly recruited by a crooked police chief to fight street crime caused by a large gang terrorizing the neighborhoods.",
        "runtimeMinutes": "92"
    },
    "1985_55": {
        "plotSummary": "Fortune hunter Allan Quatermain teams up with a resourceful woman to help her find her missing father lost in the wilds of 1900s Africa while being pursued by hostile tribes and a rival German explorer.",
        "runtimeMinutes": "100"
    },
    "1985_56": {
        "plotSummary": "A paleontologist and her husband discover a mother and baby brontosaurus in Africa, and try to protect them from a group of hunters intent on capturing the dinosaurs.",
        "runtimeMinutes": "95"
    },
    "1985_57": {
        "plotSummary": "Six guests are anonymously invited to a strange mansion for dinner, but after their host is killed, they must cooperate with the staff to identify the murderer as the bodies pile up.",
        "runtimeMinutes": "94"
    },
    "1985_58": {
        "plotSummary": "An officially \"dead\" cop is trained to become an extraordinary unique assassin in service of the US President.",
        "runtimeMinutes": "121"
    },
    "1985_59": {
        "plotSummary": "When two bumbling employees at a medical supply warehouse accidentally release a deadly gas into the air, the vapors cause the dead to rise again as zombies.",
        "runtimeMinutes": "91"
    },
    "1985_6": {
        "plotSummary": "A black Southern woman struggles to find her identity after suffering abuse from her father and others over four decades.",
        "runtimeMinutes": "154"
    },
    "1985_60": {
        "plotSummary": "Hopefuls try out before a demanding director for a part in a new musical.",
        "runtimeMinutes": "113"
    },
    "1985_61": {
        "plotSummary": "A strong-willed female stock car driver challenges her chauvinistic crush to a race to win his respect- and get him into bed.",
        "runtimeMinutes": "91"
    },
    "1985_62": {
        "plotSummary": "Big Bird is sent to live far from Sesame Street by a pesky social worker named Miss Finch. Unhappy, he runs away from there, prompting the rest of the Sesame Street gang to go on a cross-country journey to find him.",
        "runtimeMinutes": "88"
    },
    "1985_63": {
        "plotSummary": "An angel must show a mother the true meaning of Christmas. It's not just presents and materialistic things, but the people she cares about.",
        "runtimeMinutes": "89"
    },
    "1985_64": {
        "plotSummary": "A stray cat is the linking element of three tales of suspense and horror.",
        "runtimeMinutes": "94"
    },
    "1985_65": {
        "plotSummary": "A high school wrestler in Spokane, Washington has trouble focusing on his training regimen when a beautiful young drifter takes up temporary residence at his home.",
        "runtimeMinutes": "107"
    },
    "1985_66": {
        "plotSummary": "Teenage geniuses deal with their abilities while developing a high-powered laser for a university project. When their professor intends to turn their work into a military weapon, they decide to ruin his plans.",
        "runtimeMinutes": "108"
    },
    "1985_67": {
        "plotSummary": "A female aerobics instructor meets a male reporter doing a story on health clubs, but it isn't love at first sight.",
        "runtimeMinutes": "115"
    },
    "1985_68": {
        "plotSummary": "An ex-newspaper woman who is now a suburban housewife can't resist getting involved in an investigation of the murder of a philandering dentist who had been having affairs with several of her neighbors.",
        "runtimeMinutes": "99"
    },
    "1985_69": {
        "plotSummary": "In a small town, brutal killings start to plague the close knit community. Marty Coslaw, a paraplegic boy, is convinced the murders are the doings of a werewolf.",
        "runtimeMinutes": "95"
    },
    "1985_7": {
        "plotSummary": "When a group of trespassing seniors swim in a pool containing alien cocoons, they find themselves energized with youthful vigor.",
        "runtimeMinutes": "117"
    },
    "1985_70": {
        "plotSummary": "During a long space war, the lives of two wounded enemies become dependent on their ability to forgive and to trust.",
        "runtimeMinutes": "108"
    },
    "1985_71": {
        "plotSummary": "A race of space vampires arrives in London and infects the populace, beginning an apocalyptic descent into chaos.",
        "runtimeMinutes": "101"
    },
    "1985_72": {
        "plotSummary": "Terry feels discriminated against when the summer jobs at Sun Tribune go to 2 guys. She decides to do something about it. She dresses like a guy and gets a haircut. Will students at the other high school notice? Girls notice \"him\".",
        "runtimeMinutes": "100"
    },
    "1985_73": {
        "plotSummary": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap.",
        "runtimeMinutes": "131"
    },
    "1985_74": {
        "plotSummary": "Dorothy, saved from a psychiatric experiment by a mysterious girl, is somehow called back to Oz when a vain witch and the Nome King destroy everything that makes the magical land beautiful.",
        "runtimeMinutes": "113"
    },
    "1985_75": {
        "plotSummary": "The story of a man who has started a new hip-hop/rap label called Krush Groove.",
        "runtimeMinutes": "97"
    },
    "1985_76": {
        "plotSummary": "Jonathan plays Gotcha with fellow college students, testing ability as assassin or mark, using paintball guns on campus. He flies to Paris on vacation and, with a woman taking his virginity, on to Berlin, where the game/ammo gets real.",
        "runtimeMinutes": "101"
    },
    "1985_77": {
        "plotSummary": "Prequel to the first Missing In Action, set in the early 1980s it shows the capture of Colonel Braddock during the Vietnam war in the 1970s, and his captivity with other American POWs in a brutal prison camp, and his plans to escape. Read more: Synopsis",
        "runtimeMinutes": "100"
    },
    "1985_78": {
        "plotSummary": "In New Jersey in 1935, a movie character walks off the screen and into the real world.",
        "runtimeMinutes": "82"
    },
    "1985_79": {
        "plotSummary": "The goofy students of a remedial drivers education class find themselves butting heads with their abusive police instructors.",
        "runtimeMinutes": "90"
    },
    "1985_8": {
        "plotSummary": "When a young Amish boy is sole witness to a murder, policeman John Book goes into hiding in Amish country to protect him until the trial.",
        "runtimeMinutes": "112"
    },
    "1985_80": {
        "plotSummary": "An ordinary word processor has the worst night of his life after he agrees to visit a girl in Soho who he met that evening at a coffee shop.",
        "runtimeMinutes": "97"
    },
    "1985_81": {
        "plotSummary": "American soldier, obviously very skilled in martial arts, single-handedly takes on mercenaries in the Philippines.",
        "runtimeMinutes": "95"
    },
    "1985_82": {
        "plotSummary": "After his girlfriend ditches him for a boorish ski jock, Lane decides that suicide is the only answer. However, his increasingly inept attempts bring him only more agony and embarrassment. Filled with the wildest teen nightmares.",
        "runtimeMinutes": "97"
    },
    "1985_83": {
        "plotSummary": "A husband and wife in their 30s decide to quit their jobs, live as free spirits and cruise America in a Winnebago.",
        "runtimeMinutes": "91"
    },
    "1985_84": {
        "plotSummary": "A vampire Countess needs to drink the blood of a virgin in order to keep her eternal beauty. It seems that all is hopeless, until she bumps into Mark Kendall.",
        "runtimeMinutes": "94"
    },
    "1985_85": {
        "plotSummary": "A bureaucrat in a dystopic society becomes an enemy of the state as he pursues the woman of his dreams.",
        "runtimeMinutes": "132"
    },
    "1985_86": {
        "plotSummary": "A boy obsessed with 50s sci-fi movies about aliens has a recurring dream about a blueprint of some kind, which he draws for his inventor friend. With the help of a third kid, they follow it and build themselves a spaceship. Now what?",
        "runtimeMinutes": "109"
    },
    "1985_87": {
        "plotSummary": "In the 1930s, a tomboy runs away from her guardian to join her single father who is 2,000 miles away, where he has found work.",
        "runtimeMinutes": "101"
    },
    "1985_88": {
        "plotSummary": "Three former parapsychology professors set up shop as a unique ghost removal service.",
        "runtimeMinutes": "105"
    },
    "1985_89": {
        "plotSummary": "The new kid in school must battle a gang of street toughs after stealing the gang leader's girl.",
        "runtimeMinutes": "112"
    },
    "1985_9": {
        "plotSummary": "A group of young misfits called The Goonies discover an ancient map and set out on an adventure to find a legendary pirate's long-lost treasure.",
        "runtimeMinutes": "114"
    },
    "1985_90": {
        "plotSummary": "The story of Patsy Cline, the velvet-voiced country music singer who died in a tragic plane crash at the height of her fame.",
        "runtimeMinutes": "115"
    },
    "1985_91": {
        "plotSummary": "When American Donna Lloyd is kidnapped during a trip to Europe, her son Chris and her husband Walter start searching for her.",
        "runtimeMinutes": "117"
    },
    "1985_92": {
        "plotSummary": "1956. Obsessed with the hottest girl in class, a gawky high school student takes a crash course in teenage coolness from his motorcycle rebel neighbour, under the watchful eye of the eternal symbol of teenage rebellion: James Dean.",
        "runtimeMinutes": "100"
    },
    "1985_93": {
        "plotSummary": "A man picked randomly out of a crowd is made the target of CIA survelliance and pursuit.",
        "runtimeMinutes": "92"
    },
    "1985_94": {
        "plotSummary": "Two juvenile delinquents find themselves growing apart, for one is growing up, and the other is staying young and reckless.",
        "runtimeMinutes": "102"
    },
    "1985_95": {
        "plotSummary": "An anonymous love letter left in Michael's locker on the last day of school wreaks havoc on his life and the lives of everyone who come in contact with it.",
        "runtimeMinutes": "90"
    },
    "1985_96": {
        "plotSummary": "Released from prison, Stick meets up with a friend and joins him on a job delivering a bag. His friend gets killed in the setup. Stick gets away and is ready to forget all and see his daughter, but they won't forget.",
        "runtimeMinutes": "109"
    },
    "1985_97": {
        "plotSummary": "A middle-aged steelworker is content with his job and his family, but feels that something is missing in his life. On his 50th birthday, he stops in at a local bar for a drink to celebrate. He finds himself attracted to the very sexy ...See moreA middle-aged steelworker is content with his job and his family, but feels that something is missing in his life. On his 50th birthday, he stops in at a local bar for a drink to celebrate. He finds himself attracted to the very sexy barmaid and, to his surprise, he finds that she is also very attracted to him.  Written by frankfob2@yahoo.comSee less",
        "runtimeMinutes": "111"
    },
    "1985_98": {
        "plotSummary": "A collection of animated interpretations of great works of Western classical music.",
        "runtimeMinutes": "125"
    },
    "1985_99": {
        "plotSummary": "A seemingly normal young boy turns out to be a top secret, military-created robot with superhuman abilities.",
        "runtimeMinutes": "99"
    }
}