{
    "1987_1": "A married man's one-night stand comes back to haunt him when that lover begins to stalk him and his family.",
    "1987_10": "During the era of Prohibition in the United States, Federal Agent Eliot Ness sets out to stop ruthless Chicago gangster Al Capone and, because of rampant corruption, assembles a small, hand-picked team to help him.",
    "1987_100": "The Chipmunks compete with the Chipettes in a round the world race.",
    "1987_101": "A presidential bodyguard is assigned to protect an objecting first lady, as repeated attempts are made on her life.",
    "1987_102": "The lone survivor of an onslaught of flesh-possessing spirits holes up in a cabin with a group of strangers while the demons continue their attack.",
    "1987_103": "South African journalist Donald Woods is forced to flee the country, after attempting to investigate the death in custody of his friend, the black activist Steve Biko.",
    "1987_104": "Unable to find work after a past felony, graduate John Wisdom and his girlfriend embark on a cross-country bank-robbing spree in order to aid American farmers.",
    "1987_105": "A wealthy writer, who has had terrible experiences with money-hungry girlfriends and ex-wives, pretends to be a broke, washed-up novelist, to see if the woman he loves wants him for himself, or just for his money. Read more: Synopsis",
    "1987_106": "In 1950s Texas, a woman trying to recover sexy photos of herself and divorce her husband witnesses a murder and uncovers corrupt land dealings.",
    "1987_107": "Egocentric bandit Salvatore Giuliano fights the Church, the Mafia, and the landed gentry while leading a populist movement for Sicilian independence.",
    "1987_108": "A Sergeant must deal with his desires to save the lives of young soldiers being sent to Viet Nam. Continuously denied the chance to teach the soldiers about his experiences, he settles for trying to help the son of an old Army buddy.",
    "1987_109": "An actor limited to stereotypical roles because of his ethnicity, dreams of making it big as a highly respected performer. As he makes his rounds, the film takes a satiric look at African American actors in Hollywood.",
    "1987_11": "Take two rival television reporters: one handsome, one talented, both male. Add one Producer, female. Mix well, and watch the sparks fly.",
    "1987_110": "A greedy landowner and his backward nephew conspire to block the only water source for an adjoining property in order to bankrupt the owner and force him to sell.",
    "1987_111": "Between two Thanksgivings two years apart, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly.",
    "1987_112": "Secret Agent Leonard Parker (Bill Cosby) is called out of retirement to save the world from evil genius Medusa Johnson (Gloria Foster).",
    "1987_113": "A high school slacker commits a shocking act and proceeds to let his friends in on the secret. However, the friends' reaction is almost as ambiguous and perplexing as the crime itself.",
    "1987_114": "After being dumped by his girlfriend, a boy runs away to California. But he ends up in heaven because he dies after trying to help a family from drowning in a river. In heaven he'll meet a beautiful girl, who has never reincarnated before.",
    "1987_115": "Gunnery Sergeant Burns reports for duty to an American Embassy in the Middle East. However due to the 'enlightened' views of the Ambassador, the marine security detachment he is in charge of is severely restricted in their functions and ...See moreGunnery Sergeant Burns reports for duty to an American Embassy in the Middle East. However due to the 'enlightened' views of the Ambassador, the marine security detachment he is in charge of is severely restricted in their functions and presence to avoid upsetting the host government. As a result, when terrorists attack the compound, they are able to kidnap hostages and escape with little opposition. Burns ignores the Ambassador's restrictions, and throws the rule books out the window, as he becomes a one man army in an attempt to rescue the hostages, and wipe out the terrorists.  Written by Brian W Martz See less",
    "1987_116": "Gabriel Conroy and wife Greta attend an early January dinner with friends at the home of his spinster aunts, an evening which results in an epiphany for both of them.",
    "1987_117": "A black Southern woman struggles to find her identity after suffering abuse from her father and others over four decades.",
    "1987_118": "A hitman approachs a writer to help him create the next best seller on his career, but the violent world he was a part of has other plans.",
    "1987_119": "Dan arrives too late for his girlfriend's family's plane to the Caribbean. He gets the next. Once there, Dan's hot pursuit of his girlfriend includes 3 friendly locals, a dubious yacht skipper, corrupt police, hijacker, pirates etc.",
    "1987_12": "The equally-straight-laced and \"by the book\" nephew of Joe Friday must work with his more laid-back partner to solve a mystery.",
    "1987_120": "On a remote Caribbean island, Army Ranger Joe Armstrong investigates the disappearance of several marines, which leads him to The Lion, a super-criminal who has kidnapped a local scientist and mass-produced an army of mutant Ninja warriors.",
    "1987_121": "A beautiful but shy shepherdess plots vengeance on the men whose greedy conspiracy to acquire her father's land caused his death years earlier.",
    "1987_122": "A homeless street musician becomes a demon when sexually aroused.",
    "1987_123": "After learning how to surf by using the local wave tanks, Arizona resident Rick uses his winnings from a recent contest to fly to Hawaii and try to make a living for himself as a professional wave rider.",
    "1987_124": "A young group of monster fanatics attempt to save their hometown from Count Dracula and his monsters.",
    "1987_125": "Allan Quatermain once again teams up with Jesse Huston where the discovery of a mysterious old gold piece sends Quatermain looking for his long-lost brother, missing in the wilds of Africa after seeking a lost white race.",
    "1987_126": "A nerd gets himself in hot water with the new bully, a quiet bad boy who challenges him to fight on the grounds of their high school after the day's end.",
    "1987_127": "Following the death of his father, suburbanite Obie runs away from home and winds up on Chicago's South Side. After being mugged, he befriends con artist Scam. The two then embark on a Down South adventure involving gangsters, the police, ...See moreFollowing the death of his father, suburbanite Obie runs away from home and winds up on Chicago's South Side. After being mugged, he befriends con artist Scam. The two then embark on a Down South adventure involving gangsters, the police, and a search for Scam's father.  Written by AnonymousSee less",
    "1987_128": "A small-town farmer's son reluctantly joins a traveling group of vampires after he is bitten by a beautiful drifter.",
    "1987_129": "In a staid English seaside town after the Second World War, young Lynda grows up with her widowed father and younger sister. Rebellious Lynda has been swearing constantly from an early age. At sixteen, she becomes more exhibitionist and ...See moreIn a staid English seaside town after the Second World War, young Lynda grows up with her widowed father and younger sister. Rebellious Lynda has been swearing constantly from an early age. At sixteen, she becomes more exhibitionist and seeks out sexual encounters challenging the prevailing lower-middle class attitudes to sex. She eventually becomes pregnant by an acquaintance of her father.  Written by Will GilbertSee less",
    "1987_13": "Two detectives observe an escaped convict's ex-girlfriend, but complications set in when one of them falls for her.",
    "1987_130": "Pinocchio and his friends, a glow worm and a marionette, search for a magic music box. However, so is the evil Scalawag and the Emperor of the Night.",
    "1987_131": "Based on the life of successful poet Charles Bukowski and his exploits in Hollywood during the 60s, 70s, and 80s.",
    "1987_132": "An ex-C.I.A. hit man running from his past (Malone) finds just how difficult it is to retire when he runs across a small town controlled by mercenaries and a family that's resisting their control.",
    "1987_133": "Highlights from Prince's 1987 European concert tour, including selections from the rock star's album of the same title.",
    "1987_134": "A rookie cop goes undercover and infiltrates a car thief ring.",
    "1987_135": "Las Vegas is the backdrop for all the torrid action of heat, as Burt Reynolds plays the soft-hearted bodyguard who's out to protect his friends.",
    "1987_136": "A Southern California coed parties with her roommates and flirts with a surfer next door.",
    "1987_137": "Thirty years after her accidental death at her 1957 senior prom, the tortured spirit of prom queen Mary Lou Maloney returns to seek revenge.",
    "1987_138": "The Care Bears and Alice set out to stop an evil wizard from taking over Wonderland.",
    "1987_139": "A psychiatrist comes to the aid of a compulsive gambler and is led by a smooth-talking grifter into the shadowy but compelling world of stings, scams, and con men.",
    "1987_14": "Aliens help a feisty old New York couple in their battle against the ruthless land developer who's out to evict them.",
    "1987_140": "After murdering his entire family, a man marries a widow with a teenage daughter in another town and prepares to do it all over again.",
    "1987_141": "After his lover rejects him, a young man trapped by the oppressiveness of Edwardian society tries to come to terms with and accept his sexuality.",
    "1987_142": "A fledgling actress is lured to a remote mansion for a screen-test, soon discovering she is actually a prisoner in the middle of a blackmail plot.",
    "1987_143": "A geneticist takes his assistants to his old family home to locate the deadly product of his late mother's revolutionary research into rapid human evolution - his monstrous tentacled baby brother - before a mad scientist gets to him first.",
    "1987_144": "A San Quentin inmate, sentenced to life without parole, writes a play that catches the interest of a reporter.",
    "1987_145": "A mysterious black box spells danger to a con man and female detective.",
    "1987_146": "An Italian tells his story of love to a Russian. In a series of flashbacks, Romano Patroni leaves his wife to visit a spa where he falls in love with a Russian woman. He returns to Italy resolved to leave his wife and marry his love.",
    "1987_147": "A group of American boys and a shipwrecked Russian sailor become friends in the midst of the Cold War.",
    "1987_148": "The ghost of a dead porn star comes to Earth to help a nerd with his sex life.",
    "1987_149": "A free-spirited teenager attempts to get back in touch with his overly conservative parents after returning home from years away at a boarding school.",
    "1987_15": "Three single women in a picturesque village have their wishes granted, at a cost, when a mysterious and flamboyant man arrives in their lives.",
    "1987_150": "An aspiring composer discovers a broken-winged, beautiful angel in his swimming pool. When everyone finds out, he must deal with his jealous fiance, his future father-in-law, and his friends who have a business plan.",
    "1987_151": "When a meteorite lands near his family farm during a storm in Tennessee, the son of a struggling farmer believes it's connected to strange plague-like events afflicting the crops, the farm animals and even the family themeselves.",
    "1987_152": "A day in the life of several prostitutes in an upscale Manhattan whore house. The film is a stark portrayal of the women prostitutes, the male customers and the motivations of both. Watch as the madam manipulates her \"girls\". Watch as she ...See moreA day in the life of several prostitutes in an upscale Manhattan whore house. The film is a stark portrayal of the women prostitutes, the male customers and the motivations of both. Watch as the madam manipulates her \"girls\". Watch as she answers the phone by saying \"Hello John, what's new and different?\" Watch as the \"johns\" try to manipulate the \"girls\". Part nudie exploitation, part sociological thesis.  Written by Mark Logan See less",
    "1987_153": "A computer nerd makes a deal with the Devil and gets a new beefcake body.",
    "1987_154": "The story of the rise of a madame of a suburban brothel catering to older men, inspired by the real experiences of Cynthia Payne.",
    "1987_155": "J.C. Cullen arrives in Chicago and, with his cool hand, becomes a top dice roller. But when he meets a beautiful dancer, his luck may have finally run out - her husband is a ruthless killer.",
    "1987_156": "A priest is put in a dilemma when the serial killer who has been murdering priests and nuns confesses to him.",
    "1987_157": "A labor union organizer comes to an embattled mining community brutally and violently dominated and harassed by the mining company.",
    "1987_158": "Biographer John Lahr is writing a book about playwright Joe Orton. Joe and Kenneth meet at drama school and live together for ten years as lovers and collaborators. Both want to be writers, but only one of them is successful.",
    "1987_159": "A reclusive scientist builds a robot which looks exactly like Dr. Ulysses, a scientist set to go on a long-term space mission. Since the (real) scientist seems to lack all emotions, he is unable to program his (lack of) emotion into his ...See moreA reclusive scientist builds a robot which looks exactly like Dr. Ulysses, a scientist set to go on a long-term space mission. Since the (real) scientist seems to lack all emotions, he is unable to program his (lack of) emotion into his automaton, and an eccentric woman is hired to \"educate\" the robot on human behavior. In the end, she falls in love - but is it the robot or Mr. Right?  Written by Susan Southall See less",
    "1987_16": "A bitter ex-husband wants his former spouse dead. A put-upon momma's boy wants his mother dead. Who will pull it off?",
    "1987_160": "Dodger must confront the struggles of life as he is visited by the Garbage Pail Kids and intimidated by some older bullies.",
    "1987_161": "A crafty political aide and his soft-spoken pal are assigned the job of delivering a senator's out-of-control teenage daughter to an institution. Written by Anonymous",
    "1987_162": "A war veteran tries to investigate the murder of his son who was working as a Russian translator for the British intelligence service during the Cold War. He meets a web of deception and paranoia that seems to be impenetrable.",
    "1987_163": "Martin, an I.R.A. hitman, is seen by a Catholic priest while carrying out a hit. He grows a bond with the priest and his niece. But his past and his former employers put all their lives in danger.",
    "1987_164": "Scatterbrained Polly gets a job as a secretary in Gabrielle's art gallery. Polly aspires to be a professional photographer, and idolizes Gabrielle for her artistic ability. When Gabrielle rekindles an old romantic relationship with the ...See moreScatterbrained Polly gets a job as a secretary in Gabrielle's art gallery. Polly aspires to be a professional photographer, and idolizes Gabrielle for her artistic ability. When Gabrielle rekindles an old romantic relationship with the younger painter Mary, Polly becomes jealous, and discovers Gabrielle is not who she claims to be.  Written by Mike JonesSee less",
    "1987_165": "A man is framed for murder and sent to prison. He is beaten and tortured, then forced to fight the prison's worst killer, a martial-arts fighting midget called Thud.",
    "1987_166": "In a small Tennessee town, a historian relates four horror stories to a reporter.",
    "1987_167": "Two aged sisters reflect on life and the past during a late summer day in Maine.",
    "1987_168": "Steele is ex-cop and Vietnam vet who is determined to bring down Kwan, former South Vietnamese general and now rich and powerful drug lord.",
    "1987_169": "A modern day Romeo & Juliet story is told in New York when an Italian boy and a Chinese girl become lovers, causing a tragic conflict between ethnic gangs.See moreA modern day Romeo & Juliet story is told in New York when an Italian boy and a Chinese girl become lovers, causing a tragic conflict between ethnic gangs.  Written by Keith Loh See less",
    "1987_17": "Biographical story of the rise from nowhere of early rock and roll singer Ritchie Valens who died at age 17 in a plane crash with Buddy Holly and The Big Bopper.",
    "1987_170": "Sammy and Rosie are an unconventional couple. They live in the midst chaos, surround themselves with intellectual street people and sleep with everybody except each other. Things become interesting when Sammy's father comes to visit.",
    "1987_171": "A successful aging dancer takes a young female protegee.",
    "1987_172": "In the early 1980s, a series of gruesome murders occurred at Crippen High School. A few years later, a film crew uses the now-abandoned Crippen High as the set for a film. But an uninvited guest makes an appearance on the set.",
    "1987_173": "Professor hires a spaceship to get to the source of weird signals from deep space. The trip is cut short however when the ship's computer gets jealous because the captain is in love with one of the female passengers and it gets homicidal.",
    "1987_174": "A New York journalist lies when his fake story about a pimp describes a real pimp up for murder.",
    "1987_175": "Spalding Gray discusses his participation in the film The Killing Fields and the background story about the troubles of Cambodia.",
    "1987_176": "True story of a transatlantic business correspondence about used books that developed into a close friendship.",
    "1987_177": "After their mother commits suicide, two sisters end up living with their kind but peculiar aunt in their grandmother's old house in a small 1950s town.",
    "1987_178": "A man and a woman go out on a \"big\" third date. He's ashamed to admit he just lost his job, and she's afraid he'll run away if he finds out that she has a kid. Small lies lead to bigger ones and the night gets crazy very soon.",
    "1987_179": "A 14-year-old nicknamed the 'Woo Woo Kid', is a teenage casanova who has affairs and runs away to marry two older women, mothers themselves, fascinating the public and the media with his romantic prowess.",
    "1987_18": "In a dystopic and crime-ridden Detroit, a terminally wounded cop returns to the force as a powerful cyborg haunted by submerged memories.",
    "1987_180": "Todd Barret is an aspiring businessman. He's got what it takes, but what he doesn't have is enough money to stay in college. So he cooks up a plan to make the first ever all male sports calendar. He eventually convinces Cactus Jack, a very...See moreTodd Barret is an aspiring businessman. He's got what it takes, but what he doesn't have is enough money to stay in college. So he cooks up a plan to make the first ever all male sports calendar. He eventually convinces Cactus Jack, a very shadowy and tough loan shark, to give him enough money to make the deal. Todd makes enough to pay for his education, but what about the money he owes Cactus Jack?  Written by Sean Kilby and Jason Parker See less",
    "1987_181": "A disparate group of travelers is eating in an isolated restaurant when a man drops dead of a heart attack. Before he dies, they discover that he is wanted for stealing several million dollars, and he tells them that he has hidden a ...See moreA disparate group of travelers is eating in an isolated restaurant when a man drops dead of a heart attack. Before he dies, they discover that he is wanted for stealing several million dollars, and he tells them that he has hidden a million dollars in each of four different locations, and gives them clues as to where the locations are. They all then take off and try to get to the hidden treasure before any of the others do.  Written by frankfob2@yahoo.comSee less",
    "1987_182": "The Shelleys visit Lord Byron and compete to write a horror story.",
    "1987_183": "A son longs to escape from his stifling home, where his genteel mother worries about the future prospects of his lame, shy sister.",
    "1987_184": "A womanizing CIA agent and an insecure insurance agent are paired together to make sure a deal goes through with aliens for the future of mankind.",
    "1987_185": "Writer, ex-con and 40-something bottle-baby Tim Madden, who is prone to black-outs, awakens from a two-week bender to discover a pool of blood in his car, a blond woman's severed head in his marijuana stash, and the new Provincetown police...See moreWriter, ex-con and 40-something bottle-baby Tim Madden, who is prone to black-outs, awakens from a two-week bender to discover a pool of blood in his car, a blond woman's severed head in his marijuana stash, and the new Provincetown police chief, Captain Luther Regency, shacked up with his former girlfriend Madeleine. As his father Dougy helps him try to unravel the mystery, he is dogged by the psychotic Capt. Regency, who has it in for Tim as a car-crash that he was involved in with Madeline has left her unable to have children. Flashing-back to the past, Tim remembers the time when he encouraged Madeline to swing with a Li'l Abnerish couple from down South, the fundamentalist preacher Big Stoop and his Daisy Mae-ish wife, Patty Lareine, whose ad Tim had come across in 'Screw' magazine. It's on the trip back that the car crash occurs, since Madeline is incensed that Tim has so enjoyed Patty Lareine's charms. Except for his father Dougy, who is dying of cancer, Tim suspects everyone, including his ex-wife Patty Lareine, multi-millionaire prep-school pal Wardley Meeks III, - and himself - of murder. Patty Lareine had left Big Stoop, married Wardley, left him in a messy divorce which netted her a rich cash settlement, and in turn married Tim, whom she fancied. Patty Lareine disappears, and Tim goes on his fatal bender that has left his memory in shards after receiving a letter from Madeline informing him that her husband is having an affair with his wife. Tim remembers his assignation in the local tavern's parking lot with the blond porn star Jessica Pond, while her effete husband Lonnie Pangborn watched from the sidelines, distraught. It was Jessica's head in the Hefty bag with his grass, but soon, another head turns up in his marijuana stash, that of Patty Lareine. We eventually learn that she and her ex- Wardley, a bisexual skewed towards the gay side, had been involved in a massive marijuana deal, a deal that also involved Jessica Pond and Lonnie Pangborn, who are also missing. Will Tim be able to get to the bottom of the mystery and save himself from another stretch in stir? As his father Dougy reminds him, \"Tough guys don't dance,\" and Tim has been doing everything but the Charlston in his attempt to keep ahead of the forces closing in on him. Will he unravel the case and reclaim his lost manhood? And what does an old witch trial and the unspeakably lumpen sleazoids down at the garage at the outskirts of town have to do with all this?  Written by Jon C. HopwoodSee less",
    "1987_186": "Two twin barbarians seek revenge from the warlord who massacred their tribe and captured them when they were small children.",
    "1987_187": "A few unusual characters and their unconventional therapists cross paths resulting in hilarious interactions.",
    "1987_188": "A drama focusing on the suffering, torture, and brutal treatment the American P.O.W.s had to deal with daily while in North Vietnam's Hoa Lo Prison, the most infamous P.O.W. camp in Hanoi. The film focuses on the resistance the prisoners ...See moreA drama focusing on the suffering, torture, and brutal treatment the American P.O.W.s had to deal with daily while in North Vietnam's Hoa Lo Prison, the most infamous P.O.W. camp in Hanoi. The film focuses on the resistance the prisoners gave to their captors and the strong bonds formed by the Americans during their captivity.  Written by mike407See less",
    "1987_189": "Sundance prizewinner. Fictionalized portrait of one of history's great literary couples: Stein & Toklas. Summer 1930s France, Alice tends to ailing Gertrude; they visit Fernande Olivier, Guillaume Apollinaire, others; and Hemingway pops in.See moreSundance prizewinner. Fictionalized portrait of one of history's great literary couples: Stein & Toklas. Summer 1930s France, Alice tends to ailing Gertrude; they visit Fernande Olivier, Guillaume Apollinaire, others; and Hemingway pops in.  Written by trivwhizSee less",
    "1987_19": "Two women unknowingly share the same man, but when he disappears, both go out looking for him and enter his surprisingly dangerous life.",
    "1987_190": "This documentary movie covers two concerts at the Fox Theatre in St. Louis, Missouri, to celebrate Chuck Berry's 60th birthday, and also discusses his life and career.",
    "1987_191": "An American skydiver wakes up in the middle of nowhere in Spain and must recount the last five agonizing days to figure out how she got there.",
    "1987_192": "This biographical film, based on the life of French artist Paul Gauguin (Donald Sutherland), follows the painter as he returns to Paris after a long stay in Tahiti and must confront his wife, his children, and his former lover.See moreThis biographical film, based on the life of French artist Paul Gauguin (Donald Sutherland), follows the painter as he returns to Paris after a long stay in Tahiti and must confront his wife, his children, and his former lover.  Written by Matt See less",
    "1987_193": "In a post-apocalyptic world, a warrior wandering through the desert comes upon a group of settlers who are being menaced by a murderous gang that is after the water they control.",
    "1987_194": "A spoof 1950s science fiction movie, interspersed with various comedy sketches concerning late night television.",
    "1987_195": "An Italian high school student named Andrea becomes infatuated with Giulia, an older woman he sees outside his classroom window. Giulia's fiance, a leftist radical, has been jailed and is currently on trial for political crimes. Andrea and...See moreAn Italian high school student named Andrea becomes infatuated with Giulia, an older woman he sees outside his classroom window. Giulia's fiance, a leftist radical, has been jailed and is currently on trial for political crimes. Andrea and Giulia meet, and begin rendezvousing at her apartment, where a sexual relationship quickly unfolds. The situation is complicated when the fiance's mother realizes this, and confronts Andrea's father. Andrea's father is a psychiatrist who treats patients with psychoanalysis. He has treated Giulia in the past. The psychiatrist finds himself a victim of Giulia's sexual advances, which he attributes to madness. As a passionate affair unfolds between Giulia and Andrea, the viewer is left wondering exactly how crazy Giulia really is, and whether Giulia had an affair with the boy's father as well. Intensity of passion between Giulia and Andrea builds towards the climax. Andrea's father confronts him about this affair, but Andrea doesn't back down.  Written by WikiSee less",
    "1987_196": "A former CIA agent, John Creasy, is hired as a bodyguard for a girl in Italy, who becomes the daughter he never had. When she is abducted, Creasy's fiery rage is unleashed, and despite being badly wounded, embarks on a bloody revenge spree.",
    "1987_197": "A murderer who assumes the identity of a new deputy is unbeknownst to the sheriff planning to pin a separate murder on him.",
    "1987_198": "At a summer house in Vermont, neighbor Howard falls in love with Lane, who's in a relationship with Peter, who's falling for Stephanie, who's married with children.",
    "1987_199": "Bill (Sir Anthony Hopkins) is a man who's very bitter about his divorce and losing custody of his son. So, when one of his friends is being sued for divorce by his wife, so that she can enter into a lesbian relationship, Bill decides to ...See moreBill (Sir Anthony Hopkins) is a man who's very bitter about his divorce and losing custody of his son. So, when one of his friends is being sued for divorce by his wife, so that she can enter into a lesbian relationship, Bill decides to help his friend gain custody of his son in any way that they can devise, including using a sleazeball lawyer. But while Bill feels that feminism has robbed him of his family, he begins to be appalled at what he and Roger (Jim Broadbent) have done.  Written by Kathy LiSee less",
    "1987_2": "Axel Foley returns to Beverly Hills to help Taggart and Rosewood investigate Chief Bogomil's near-fatal shooting and the series of \"alphabet crimes\" associated with it.",
    "1987_20": "Chief Brody's widow believes that her family is deliberately being targeted by another shark in search of revenge.",
    "1987_200": "A pair of detectives is assigned to investigate a murder, and discover a trail of corruption and criminal activity that leads right back to their own police department.",
    "1987_201": "An artist, framed for the murder of a woman, is drawn into a web of corruption, blackmail and deceit.",
    "1987_202": "Feeling lonely and neglected by her overworked husband, Roxy, a Depression-era farm wife, is drawn into an ill-advised affair with Jack, their hired hand.See moreFeeling lonely and neglected by her overworked husband, Roxy, a Depression-era farm wife, is drawn into an ill-advised affair with Jack, their hired hand.  Written by Marg Baskin See less",
    "1987_203": "The story of a shy boy who gets convinced by his parents to spend a few summer days in the mountains. So, he joins a group, and the vacation begins. Unfortunately, things turn out to be a little tough for our small friend.",
    "1987_204": "On Christmas Eve Johnny Modine's father is murdered by a psycho cut-throat. The cop swears bloody revenge, though he's taken off the case. He doesn't suspect yet that he's also target in a diabolic plan of revenge.See moreOn Christmas Eve Johnny Modine's father is murdered by a psycho cut-throat. The cop swears bloody revenge, though he's taken off the case. He doesn't suspect yet that he's also target in a diabolic plan of revenge.  Written by Tom Zoerner See less",
    "1987_205": "The two brothers Treat and Philip lived alone since they were kids. Interdependent they dwell in a loft house and live on little thefts, until an aging minor criminal moves in with them and takes over the role of a father.",
    "1987_206": "Gemma is 13 years old lives and with her grandpa in the country, she has for many years. One day her mother shows up, and wants to take Gemma to the city. Her mother is married now, and can provide for Gemma. Gemma goes with her mother. In...See moreGemma is 13 years old lives and with her grandpa in the country, she has for many years. One day her mother shows up, and wants to take Gemma to the city. Her mother is married now, and can provide for Gemma. Gemma goes with her mother. In the city she gets to know Rory, a mentally disabled boy. They play together, imagining that they are married.  Written by Eva Kristin Berntzen See less",
    "1987_207": "A gang of bank robbers with a suitcase full of money go to the desert to hide out. After burying the loot, they find their way to a surreal town full of cowboys who drink an awful lot of coffee. The townspeople are hostile to the outsiders...See moreA gang of bank robbers with a suitcase full of money go to the desert to hide out. After burying the loot, they find their way to a surreal town full of cowboys who drink an awful lot of coffee. The townspeople are hostile to the outsiders at first, but seem to accept them once they've killed a couple of people. After a while, a mysterious man named Dade arrives, who seems to have unpleasant business to settle with the robbers. A free-for-all shoot-em-up ensues.  Written by George S. Davis See less",
    "1987_208": "Lowbrow humor is the feature in this 'Porky's for girls'. The students of an elite international private school that teaches rich young women how to behave like proper ladies rebel against their strict, snobbish and brutish head teacher.",
    "1987_209": "After the bankruptcy of their father's stonemasonry firm, Nicola and Andrea emigrate to America to restore their fortunes. After many adventures and near-disasters, they end up in Hollywood designing sets for D.W. Griffith and marry ...See moreAfter the bankruptcy of their father's stonemasonry firm, Nicola and Andrea emigrate to America to restore their fortunes. After many adventures and near-disasters, they end up in Hollywood designing sets for D.W. Griffith and marry beautiful actresses, but tragedy strikes with the arrival of World War I, which finds the brothers fighting on opposite sides...  Written by Michael Brooke See less",
    "1987_21": "James Bond is sent to investigate a KGB policy to kill all enemy spies and uncovers an arms deal that potentially has major global ramifications.",
    "1987_210": "Cute Katya starts as window dresser at a Pittsburgh department store. She dates a reporter. A fan stalks her and is increasingly nasty.",
    "1987_211": "An American journalist is set up and fed false information after the Lebanon war.",
    "1987_212": "The life of Gaby Brimmer, a girl physically handicapped, who finally gets her goals of study and triumph. Read more: Synopsis",
    "1987_213": "Realistic story of working class Yorkshire life. Two schoolgirls have a sexual fling with a married man. Serious and light-hearted by turns.",
    "1987_214": "A series of interviews are conducted concerning people's beliefs towards the possibility of an afterlife. The interviews are filmed against a set of strange backdrops, and are intercut with clips from classic films and a variety of stock ...See moreA series of interviews are conducted concerning people's beliefs towards the possibility of an afterlife. The interviews are filmed against a set of strange backdrops, and are intercut with clips from classic films and a variety of stock footage.  Written by Jennifer HarrisonSee less",
    "1987_215": "December 1944. As their bomber is shot down during a mission over Japan, Sergeant McManus and Robert, a young lieutenant, have no other choice but make a parachute jump. They are captured by local villagers and are saved from execution by ...See moreDecember 1944. As their bomber is shot down during a mission over Japan, Sergeant McManus and Robert, a young lieutenant, have no other choice but make a parachute jump. They are captured by local villagers and are saved from execution by Fukushima, the village elder. McManus never accepts his lot unlike Robert, who soon takes an interest in Japanese customs and rites. More, he falls in love with pretty Miyoko, Fukushima's widowed daughter-in-law...  Written by Guy BellingerSee less",
    "1987_216": "A Chinese lawyer tries to execute the will of Sam Wong.",
    "1987_217": "A young man discovers that not only does he have the ability to read minds, but that if he holds a camera next to his head he can transmit the thoughts he sees onto film. He strikes a deal with a wealthy businessman to use his powers but ...See moreA young man discovers that not only does he have the ability to read minds, but that if he holds a camera next to his head he can transmit the thoughts he sees onto film. He strikes a deal with a wealthy businessman to use his powers but with two conditions: one is that he'll make enough money for a sex-change operation, and the other is that under no circumstances are his powers to be used for military purposes. Things don't work out quite the way he planned.  Written by frankfob2@yahoo.comSee less",
    "1987_218": "A young lady is kept away from boys by her overprotective mother because flames tend to spontaneously erupt whenever her hormones are aroused; for her, \"protection\" on a dinner date is carrying a fire extinguisher.",
    "1987_219": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.",
    "1987_22": "Eddie Murphy in a stand-up performance recorded live. For an hour and a half he talks about his favourite subjects: sex and women.",
    "1987_220": "Small time crooksters Nick (Peter Falk) and Charlie (Charles Durning) have an elaborate plan to rob an exclusive jewelers store. Using a variety of disguises and posing as rich old men and women they begin the set-up, but then Nick falls ...See moreSmall time crooksters Nick (Peter Falk) and Charlie (Charles Durning) have an elaborate plan to rob an exclusive jewelers store. Using a variety of disguises and posing as rich old men and women they begin the set-up, but then Nick falls for the owner of a neighboring antique store and things get a little complicated.  Written by Col Needham See less",
    "1987_221": "A beautiful novelist gets involved with the violent underworld crime elements in New York City and becomes a target. Alec Baldwin plays the cop who pursues her killers.",
    "1987_222": "O.C. and Stiggs aren't your average unhappy teenagers. They not only despise their suburban surroundings, they plot against it. They seek revenge against the middle class Schwab family, who embody all they detest: middle class.",
    "1987_223": "A young girl agrees to work in a center for girls who can't stay with their parents. She gets wrapped up in the plights of several of the girls, and tries to help them, but only gets herself into trouble with her parents and supervisor.",
    "1987_224": "When the closure of a railway is announced, employees commandeer a locomotive to get to corporate headquarters and confront the president.",
    "1987_225": "A college freshman begins to notice that students at her new school are losing their individuality. She discovers that the faculty are operating on the students' brains to make them docile and productive, but she's having non of it.",
    "1987_226": "PC does a 360 degree jump on his windsurfer board early morning. A cute singer's the only witness, so PC looks for her. He's in love - not mutual.",
    "1987_227": "A sorcerer tries to sacrifice a group of people inside his house with the intention of using their vitality to keep his wife alive.",
    "1987_228": "Nurse and con artist Belle Haimes (Valri Bromfield) lives with her dull-witted husband Rex Haimes (Stephen E. Miller) in the Hart Mansion in British Columbia. There she cares for the invalid, 103 year-old Slim Hart, aka Pappy, (Joe Austin)...See moreNurse and con artist Belle Haimes (Valri Bromfield) lives with her dull-witted husband Rex Haimes (Stephen E. Miller) in the Hart Mansion in British Columbia. There she cares for the invalid, 103 year-old Slim Hart, aka Pappy, (Joe Austin) and his wife, Minnie (Enid Saunders) who is in a coma. Waking up from a sleep, Belle is not enthusiastic about returning to her job and overhears the night nurse (Leslie Jones) reading a postcard from the Hart's two twin boys, Martin Hart (Eric Christmas) and Art Hart (Ted Stidder) that they will be returning home soon. Belle plots the death of old Mrs. Hart and the kidnapping of Old Pappy but things don't go quite according to plan.  Written by Kevin Cloud Brechner, Time River ProductionsSee less",
    "1987_229": "Ator and his brother are separated as children by the evil witch Phaedra. 18 years later she takes over the kingdom with the help of a masked warrior. Ator and Princess Janna prepare for the final fight.",
    "1987_23": "The Henderson family adopt a friendly Sasquatch but have a hard time trying to keep the legend of 'Bigfoot' a secret.",
    "1987_230": "Marco Venieri receives word that his brother Luca, an ex-terrorist turned state's evidence, has killed himself in Columbia. Marco takes the journey to Columbia only to find a country permeated with poverty, corruption, racism and crime.",
    "1987_231": "Anna and Ben are settled in rural Chile in the early 1970's. They are very isolated and their only real friends are two Chilean sisters, Eva and Monica. When Ben is stranded in Santiago on the eve of the military takeover of 1973, Anna is ...See moreAnna and Ben are settled in rural Chile in the early 1970's. They are very isolated and their only real friends are two Chilean sisters, Eva and Monica. When Ben is stranded in Santiago on the eve of the military takeover of 1973, Anna is livid...and this is made worse by the fact that Eva, the ex-personal assistant to Allende's wife, has been arrested by the soldiers of the new Pinochet regime and taken into custody where she is emotionally and sexually defiled. She is released, only to be further harassed by one of her arresting officers, Raoul, who poses as her protector but wishes to rape her. Meanwhile, Anna becomes involved with a Canadian journalist named Paul, who is compiling information for an extensive journalistic treatment of the coup. Anna and Ben organize an escape for Eva, over the walls of a convent to the safety of an embassy.  Written by thustlebirdSee less",
    "1987_232": "The last cinema in a small town in South Wales closes. This means for the projectionist Trevor and ice cream vendor Mona that they are out of job. They come up with a new idea: They want to grow mushrooms in the humid clima of the cinema...See moreThe last cinema in a small town in South Wales closes. This means for the projectionist Trevor and ice cream vendor Mona that they are out of job. They come up with a new idea: They want to grow mushrooms in the humid clima of the cinema...  Written by Peter W. Simeon See less",
    "1987_24": "A man must struggle to travel home for Thanksgiving with a lovable oaf of a shower curtain ring salesman as his only companion.",
    "1987_25": "Exiled into the dangerous forest by her wicked stepmother, a princess is rescued by seven dwarf miners who make her part of their household.",
    "1987_26": "A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.",
    "1987_27": "A psychiatrist familiar with knife-wielding dream demon Freddy Krueger helps teens at a mental hospital battle the killer who is invading their dreams.",
    "1987_28": "The story of the final Emperor of China.",
    "1987_29": "A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider who takes the youth under his wing.",
    "1987_3": "Spending the summer at a Catskills resort with her family, Frances \"Baby\" Houseman falls in love with the camp's dance instructor, Johnny Castle.",
    "1987_30": "A young artist, searching for his vocation, makes a mannequin so perfect he falls in love with it. Finding the mannequin in a store window, he gets a job there and his creation comes to life.",
    "1987_31": "The large-nosed C.D. Bales is in love with the beautiful Roxanne; she falls for his personality but another man's looks.",
    "1987_32": "A workaholic needs a date for a dinner with new important clientele, but who his brother sets him up with could lead to disaster.",
    "1987_33": "In a dystopian America, a falsely convicted policeman gets his shot at freedom when he must forcibly participate in a TV game show where convicts, runners, must battle killers for their freedom.",
    "1987_34": "A star pilot and his sidekick must come to the rescue of a Princess and save the galaxy from a ruthless race of beings known as Spaceballs.",
    "1987_35": "Freddy the gym teacher has to teach remedial English in summer (high) school, if he wants tenure. As he can only teach gym and his students want fun, emphasis is on \"field trips\" - until he's fired unless all his students pass the test.",
    "1987_36": "A coverup and witchhunt occur after a politician accidentally kills his mistress.",
    "1987_37": "A mysterious potion switches the personalities of a buttoned up doctor and his laid back son.",
    "1987_38": "A babysitter must battle her way through the big city after being stranded there with the kids she's looking after.",
    "1987_39": "When Cinderella's cruel stepmother prevents her from attending the Royal Ball, she gets some unexpected help from the lovable mice Gus and Jaq, and from her Fairy Godmother.",
    "1987_4": "Three bachelors find themselves forced to take care of a baby left by one of the guys' girlfriends.",
    "1987_40": "After moving to a new town, two brothers discover that the area is a haven for vampires.",
    "1987_41": "An outcast secretly pays the most popular girl in school one thousand dollars to pretend to be his girlfriend for a month.",
    "1987_42": "A high-class call girl accused of murder fights for the right to stand trial rather than be declared mentally incompetent.",
    "1987_43": "While home sick in bed, a young boy's grandfather reads him the story of a farmboy-turned-pirate who encounters numerous obstacles, enemies and allies in his quest to be reunited with his true love.",
    "1987_44": "The rising college nerds set out to a convention in Florida, but are not welcomed by the Alpha Beta representatives.",
    "1987_45": "When a childless couple of an ex-con and an ex-cop decide to help themselves to one of another family's quintuplets, their lives become more complicated than they anticipated.",
    "1987_46": "The misfit Police Academy graduates now are assigned to train a group of civilian volunteers to fight crime once again plaguing the streets.",
    "1987_47": "A cruel but beautiful heiress mocks and cheats a hired carpenter. When she gets amnesia after an accident, he decides to introduce her to regular life by convincing her they're husband and wife.",
    "1987_48": "The life of super-yuppie J.C. is thrown into turmoil when she inherits a baby from a distant relative.",
    "1987_49": "A test pilot is miniaturized in a secret experiment, and accidentally injected into a hapless store clerk.",
    "1987_5": "In 1965, an unorthodox and irreverent DJ named Adrian Cronauer begins to shake up things when he is assigned to the U.S. Armed Services radio station in Vietnam.",
    "1987_50": "A minor car accident drives two rival aluminum-siding salesmen to the ridiculous extremes of man versus man in 1963 Baltimore.",
    "1987_51": "A federal investigator tracks down a gold-digging woman who moves from husband to husband to kill them and collect the inheritance.",
    "1987_52": "Ernest, a lovable loser who works as a summer camp handyman and dreams of becoming a guidance councilor, must find a way to inspire a group of juvenile delinquents as well as stop a shady strip mining company from closing the camp.",
    "1987_53": "Benji is left in the wilderness after an accident. Can he survive?",
    "1987_54": "A young English boy struggles to survive under Japanese occupation during World War II.",
    "1987_55": "An Air Force pilot joins a top secret military experiment involving chimps, but begins to suspect there might be something more to the mysterious \"Project X\".",
    "1987_56": "A suburban housewife chokes to death and is brought back to life by a spell cast by her wacky sister. Read more: Synopsis",
    "1987_57": "Con man Kevin Lennihan, framed in a jewel smuggling, tries for an insanity plea, and is sent to a hospital for review, where he is confused for a doctor and takes over the hospital when a major storm hits.",
    "1987_58": "A teacher is assigned to be the principal of a violent and crime-ridden high school.",
    "1987_59": "When a homeless man is accused of murdering a Justice Department file clerk, a public defender is tasked with mounting his legal defense.",
    "1987_6": "Two newly paired cops who are complete opposites must put aside their differences in order to catch a gang of drug smugglers.",
    "1987_60": "A New York psychiatrist finds that a brujería-inspired cult, which believes in child sacrifice, has a keen interest in his own son.",
    "1987_61": "When Keith goes out with Amanda, the girl of his dreams, Amanda's ex-boyfriend plans to get back at Keith. Meanwhile, Keith's best friend, tomboy Watts, realizes she has feelings for Keith.",
    "1987_62": "A corrupt lieutenant in the homicide division is threatened by the righteous DA while trying to solve a string of mysterious murders.",
    "1987_63": "With the help of a smooth talking tomcat, a family of Parisian felines set to inherit a fortune from their owner try to make it back home after a jealous butler kidnaps them and leaves them in the country.",
    "1987_64": "When an L.A. born American citizen is mistaken for a Mexican illegal alien and deported to Mexico, he has to do everything he can to get across the border.",
    "1987_65": "The heroic warrior He-Man battles against the evil lord Skeletor and his armies of darkness for control of Castle Grayskull.",
    "1987_66": "A private investigator is hired by a man who calls himself Louis Cyphre to track down a singer named Johnny Favorite. But the investigation takes an unexpected and somber turn.",
    "1987_67": "A retired cop blackmails ex burglar Bernice into paying him $20,000 - thus burgling. Paid to get a dentist's jewelry back from her ex's apartment, someone murders the ex and Bernice is a suspect. She investigates.",
    "1987_68": "Tough trucker Lincoln Hawk is determined to win back his son and triumph at the world arm wrestling championships.",
    "1987_69": "The Man of Steel crusades for nuclear disarmament and meets Lex Luthor's latest creation, Nuclear Man.",
    "1987_7": "A talented young man can't get an executive position without rising through the ranks, so he comes up with a shortcut, which also benefits his love life.",
    "1987_70": "Children are hidden away in the attic by their conspiring mother and grandmother.",
    "1987_71": "A nostalgic look at radio's golden age focusing on one ordinary family and the various performers in the medium.",
    "1987_72": "A woman discovers the newly resurrected, partially formed, body of her brother-in-law. She starts killing for him to revitalize his body so he can escape the demonic beings that are pursuing him after he escaped their sadistic underworld.",
    "1987_73": "Two terrible lounge singers get booked to play a gig in a Moroccan hotel but somehow become pawns in an international power play between the C.I.A., the Emir of Ishtar, and the rebels trying to overthrow his regime.",
    "1987_74": "A research team finds a mysterious cylinder in a deserted church. If opened, it could mean the end of the world.",
    "1987_75": "Three more bone-chilling tales that include a vengeful wooden Native American, a monstrous blob in a lake, and a hitchhiker who wants revenge and will not die.",
    "1987_76": "A very realistic interpretation of one of the bloodiest battles of the Vietnam War.",
    "1987_77": "Kids, left home alone, accidentally unleash a horde of malevolent demons from a mysterious hole in their suburban backyard.",
    "1987_78": "A womanizer meets his match when he falls for a woman in debt to the mafia.",
    "1987_79": "Frankie and Annette, having grown up and put aside their beach-partying lifestyle, visit their daughter in Southern California and discover there's still some wild times left in them.",
    "1987_8": "A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior.",
    "1987_80": "Terry has an affair with his boss' wife. From his bedroom window, she sees a rape and murder attempt. Terry reports it to the police as if he saw it. Things get complicated.",
    "1987_81": "John Preston is a British Agent with the task of preventing the Russians detonating a nuclear explosion next to an American base in the UK. The Russians are hoping this will shatter the \"special relationship\" between the two countries.",
    "1987_82": "A college freshman returns to L.A. for the holidays at his ex-girlfriend's request, but discovers that his former best friend has an out-of-control drug habit.",
    "1987_83": "Rita is a tough narc cop with a wig for every occasion. Outside a drug heist scene with several bodies and a hardly cut fatal drug, Fatal Beauty, she finds a Kroll Construction van with a dead Kroll employee in it. Who is Kroll?",
    "1987_84": "A Texas Ranger and a ruthless narcotics kingpin - they were childhood friends, now they are adversaries...",
    "1987_85": "A pair of siblings must choose whether to pursue their dream of touring with their rock band or support their family and stay in Cleveland, Ohio.",
    "1987_86": "Three bumbling orderlies are hired to take care of an old rich man. Humorous mayhem follows.",
    "1987_87": "A married New York cop falls for the socialite murder witness he's been assigned to protect.",
    "1987_88": "Bill, a young boy living on the outskirts of London experiences the exhilaration of World War II. During this period, Bill learns about sex, death, love, hypocrisy, and the faults of adults as he prowls the ruins of bombed houses.",
    "1987_89": "A spoiled rich girl is visited by her fairy godmother and turned into a maid.",
    "1987_9": "Loretta Castorini, a bookkeeper from Brooklyn, New York, finds herself in a difficult situation when she falls for the brother of the man she has agreed to marry.",
    "1987_90": "A cop and an FBI agent race for answers after law abiding people suddenly become violent criminals.",
    "1987_91": "Robin, one year out of law school with one trial, gets set up with an unwinnable murder case for having forced his law firm to make him partner with unethical behavior, tarnishing the firm.",
    "1987_92": "A boy and his brother don't get along well. In order to let their ill mother rest, they're separated and sent each one with their relatives.",
    "1987_93": "Todd Howard is a struggling teenager. Nothing seems to be going very well for him, until he turns into a wolf.",
    "1987_94": "The new owner of a sinister house gets involved with reanimated corpses and demons searching for an ancient Aztec skull with magic powers.",
    "1987_95": "Bounty hunter Nick Randall (Rutger Hauer) is offered two hundred fifty thousand dollars by the C.I.A. to get the terrorist behind the bombing of a Los Angeles, California movie theater. Nick quit the C.I.A. because he couldn't trust them. ...See moreBounty hunter Nick Randall (Rutger Hauer) is offered two hundred fifty thousand dollars by the C.I.A. to get the terrorist behind the bombing of a Los Angeles, California movie theater. Nick quit the C.I.A. because he couldn't trust them. Can they be trusted now, and can he stop the terrorists?See less",
    "1987_96": "An alcoholic drifter spends Halloween in his home town of Albany, New York after returning there for the first time in decades.",
    "1987_97": "The life of an uptight tax lawyer turns chaotic when he is asked to escort a young woman newly released from prison, who persuades him to help prove her innocence.",
    "1987_98": "A stockbroker on the run from the mob decides to hide out from them by enrolling as a student in high school.",
    "1987_99": "Architect/vigilante Paul Kersey takes on the members of a vicious Los Angeles drug cartel to stop the flow of drugs after his girlfriend's daughter dies from an overdose."
}