{
    "1988_1": {
        "plotSummary": "Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country.",
        "runtimeMinutes": "133"
    },
    "1988_10": {
        "plotSummary": "When a secretary's idea is stolen by her boss, she seizes an opportunity to steal it back by pretending she has her boss' job.",
        "runtimeMinutes": "113"
    },
    "1988_100": {
        "plotSummary": "Twin gynecologists take full advantage of the fact that nobody can tell them apart, until their relationship begins to deteriorate over a woman.",
        "runtimeMinutes": "116"
    },
    "1988_101": {
        "plotSummary": "After a middle-aged couple divorces, they must each enter the frightening but funny world of blind dates and new relationships.",
        "runtimeMinutes": "104"
    },
    "1988_102": {
        "plotSummary": "Ex baseball player Billy comes home to receive his childhood darling's ashes (suicide). He reminisces.",
        "runtimeMinutes": "98"
    },
    "1988_103": {
        "plotSummary": "Mike, now released from a psychiatric hospital, continues his journey to stop the evil Tall Man from his grim work.",
        "runtimeMinutes": "97"
    },
    "1988_104": {
        "plotSummary": "McGriff and Albaby are probably doing the worst law enforcement job in the world - they are plain clothes U.S. military policemen on duty in war-time Saigon. However, their job becomes even harder when they start investigating the serial ...See moreMcGriff and Albaby are probably doing the worst law enforcement job in the world - they are plain clothes U.S. military policemen on duty in war-time Saigon. However, their job becomes even harder when they start investigating the serial killings of local prostitutes. Their prime suspect is high ranking U.S. Army officer which brings their lives in danger.  Written by Dragan Antulov See less",
        "runtimeMinutes": "102"
    },
    "1988_105": {
        "plotSummary": "A television actress encounters a variety of eccentric characters after embarking on a journey to discover why her lover abruptly left her.",
        "runtimeMinutes": "88"
    },
    "1988_106": {
        "plotSummary": "A mother whose child was killed in a dingo attack in the Australian Outback fights to prove her innocence when she is accused of murder.",
        "runtimeMinutes": "120"
    },
    "1988_107": {
        "plotSummary": "A 'pleasantly plump' teenager teaches 1962 Baltimore a thing or two about integration after landing a spot on a local TV dance show.",
        "runtimeMinutes": "92"
    },
    "1988_108": {
        "plotSummary": "A Cincinnati college student breaks off his engagement to his wealthy fiancee after he falls in love with a backwoods Kentucky girl he meets at a party. She claims to be 20 years old, but he learns that she's actually just 16 and already ...See moreA Cincinnati college student breaks off his engagement to his wealthy fiancee after he falls in love with a backwoods Kentucky girl he meets at a party. She claims to be 20 years old, but he learns that she's actually just 16 and already married.  Written by Chris CuomoSee less",
        "runtimeMinutes": "105"
    },
    "1988_109": {
        "plotSummary": "Fred P. Chaney receives as inheritance after the death of his mother a speaking horse that also has good knowledge about the stock-market. With the help of this horse Fred gains a lot at the stock-market of Chicago.See moreFred P. Chaney receives as inheritance after the death of his mother a speaking horse that also has good knowledge about the stock-market. With the help of this horse Fred gains a lot at the stock-market of Chicago.  Written by Volker BoehmSee less",
        "runtimeMinutes": "83"
    },
    "1988_11": {
        "plotSummary": "An orphaned brontosaurus teams up with other young dinosaurs in order to reunite with their families in a valley.",
        "runtimeMinutes": "69"
    },
    "1988_110": {
        "plotSummary": "An alien trying to escape from NASA is befriended by a wheelchair-bound boy.",
        "runtimeMinutes": "95"
    },
    "1988_111": {
        "plotSummary": "A priest battles a demon that kills sinners in the act of sinning.",
        "runtimeMinutes": "102"
    },
    "1988_112": {
        "plotSummary": "A charming womanizer has to find a way to get $80 to elope to Hawaii with his one true love, or else go to his father's chosen business school.",
        "runtimeMinutes": "90"
    },
    "1988_113": {
        "plotSummary": "Braddock mounts a one-man assault to free his wife and son who are still being held in a Vietnam prison camp.",
        "runtimeMinutes": "101"
    },
    "1988_114": {
        "plotSummary": "Two friends living in a small town during the 1960s, run away to enjoy their freedom during the Vietnam War, thus disappointing the father of one of them. When they return to town, they realize the importance of family unity.",
        "runtimeMinutes": "95"
    },
    "1988_115": {
        "plotSummary": "A group of kids venture into enemy territory in an ambitious attempt to rescue their Navy Seal fathers who were captured during a failed mission in North Korea.",
        "runtimeMinutes": "97"
    },
    "1988_116": {
        "plotSummary": "A dramatization of the Black Sox scandal when the underpaid Chicago White Sox accepted bribes to deliberately lose the 1919 World Series.",
        "runtimeMinutes": "119"
    },
    "1988_117": {
        "plotSummary": "Upon arriving in a small town where she has inherited a rundown mansion, a famous horror hostess battles an evil uncle, and townspeople who want her burned at the stake.",
        "runtimeMinutes": "96"
    },
    "1988_118": {
        "plotSummary": "When a teen tries to set up a band at his school, his mother who was a big fan of Elvis Presley gets in a wreck he and his band members decides to kidnap Elvis and have him hooked up with his mother.",
        "runtimeMinutes": "97"
    },
    "1988_119": {
        "plotSummary": "A quadriplegic man has a trained monkey help him with his paralysis, until the little monkey begins to develop feelings, and rage, against its new master.",
        "runtimeMinutes": "113"
    },
    "1988_12": {
        "plotSummary": "An accountant is chased by bounty hunters, the F.B.I., and the Mafia after jumping bail.",
        "runtimeMinutes": "126"
    },
    "1988_120": {
        "plotSummary": "Danny was lucky 3 years ago at the arrest of Terror, a serial killer of young women. Danny's about to be dad, when Terror escapes prison and is back killing. Will Danny get lucky this time?",
        "runtimeMinutes": "96"
    },
    "1988_121": {
        "plotSummary": "A Jamaican woman becomes the housekeeper for a rich Baltimore family and bonds with a disillusioned teenage boy.",
        "runtimeMinutes": "108"
    },
    "1988_122": {
        "plotSummary": "Tony Award-winning actor and playwright Harvey Fierstein re-creates his role as the unsinkable Arnold Beckoff in this film adaptation of the smash Broadway play TORCH SONG TRILOGY. A very personal story that is both funny and poignant, ...See moreTony Award-winning actor and playwright Harvey Fierstein re-creates his role as the unsinkable Arnold Beckoff in this film adaptation of the smash Broadway play TORCH SONG TRILOGY. A very personal story that is both funny and poignant, TORCH SONG TRILOGY chronicles a New Yorker's search for love, respect and tradition in a world that seems not especially made for him. From Arnold's hilarious steps toward domestic bliss with a reluctant school teacher, to his first truly promising love affair with a young fashion model, Arnold's greatest challenge remains his complicated relationship with his mother. But armed with a keenly developed sense of humor and oftentimes piercing wit, Arnold continues to test the commonly accepted terms of endearment--and endurance--in a universally affecting story that confirms that happiness is well worth carrying a torch for.  Written by Michael BraemSee less",
        "runtimeMinutes": "120"
    },
    "1988_123": {
        "plotSummary": "A divorced mother may lose custody of her young daughter to her ex-husband after he learns that the little girl crawled into bed with the mother and her boyfriend.",
        "runtimeMinutes": "104"
    },
    "1988_124": {
        "plotSummary": "Tom Mix and Wyatt Earp team up to solve a murder at the Academy Awards in 1929 Hollywood.",
        "runtimeMinutes": "102"
    },
    "1988_125": {
        "plotSummary": "A French boarding school run by priests seems to be a haven from World War II until a new student arrives. He becomes the roommate of the top student in his class. Rivals at first, the roommates form a bond and share a secret.",
        "runtimeMinutes": "104"
    },
    "1988_126": {
        "plotSummary": "During the late 19th century, a strict religious community in a Danish village takes in a French refugee from the Franco-Prussian War as a servant to the late pastor's daughters.",
        "runtimeMinutes": "103"
    },
    "1988_127": {
        "plotSummary": "During the Vietnam War, Colonel Hambleton's aircraft is shot down over enemy territory and a frantic rescue operation ensues.",
        "runtimeMinutes": "105"
    },
    "1988_128": {
        "plotSummary": "On his girlfriend's insistence, a disgruntled man tries to make peace with his high-spirited, street-smart and often irritatingly careless father, a failed actor who never quit his dream to be a success.",
        "runtimeMinutes": "105"
    },
    "1988_129": {
        "plotSummary": "While Ellie is strong, streetwise, practical, social but scholarly weak, Janis is the opposite and thus make ideal room and team mates at a tough 16 week FBI training course.",
        "runtimeMinutes": "82"
    },
    "1988_13": {
        "plotSummary": "Incompetent police Detective Frank Drebin must foil an attempt to assassinate Queen Elizabeth II.",
        "runtimeMinutes": "85"
    },
    "1988_130": {
        "plotSummary": "Eggs of the small but voracious alien creatures called Crites are left behind on earth and, after hatching, set their appetites on the small farm town of Grover's Bend.",
        "runtimeMinutes": "86"
    },
    "1988_131": {
        "plotSummary": "Wiley and Sandra have been happily married for years, but are now breaking up. Sam, Wiley's childhood friend, is starting to fall in love with a new teacher at the high school. As they try to adjust to these conflicting emotions, they face...See moreWiley and Sandra have been happily married for years, but are now breaking up. Sam, Wiley's childhood friend, is starting to fall in love with a new teacher at the high school. As they try to adjust to these conflicting emotions, they face needing to evaluate their own relationship.  Written by See less",
        "runtimeMinutes": "101"
    },
    "1988_132": {
        "plotSummary": "A biography of the rock music star.",
        "runtimeMinutes": "100"
    },
    "1988_133": {
        "plotSummary": "A cop and his undead partner must chase down the diabolical villain who killed him.",
        "runtimeMinutes": "86"
    },
    "1988_134": {
        "plotSummary": "A lonely German woman ends up in the most desolate motel on Earth and decides to make it brighter.",
        "runtimeMinutes": "95"
    },
    "1988_135": {
        "plotSummary": "Legendary hip-hop group Run-D.M.C. stars in this cross between a blaxploitation film and a spaghetti western. They must find and punish the evil drug lord-record company executive who murdered their friend. Along the way, they encounter ...See moreLegendary hip-hop group Run-D.M.C. stars in this cross between a blaxploitation film and a spaghetti western. They must find and punish the evil drug lord-record company executive who murdered their friend. Along the way, they encounter racist bikers, blonde bimbos, and the Beastie Boys!  Written by Brad CartySee less",
        "runtimeMinutes": "87"
    },
    "1988_136": {
        "plotSummary": "After her father's ship is carried off by a sudden storm, the spunky Pippi Longstocking is stranded with her horse, Alfonso, and monkey, Mr. Nilsson, and takes up residence in the old family home, which is thought by neighborhood children ...See moreAfter her father's ship is carried off by a sudden storm, the spunky Pippi Longstocking is stranded with her horse, Alfonso, and monkey, Mr. Nilsson, and takes up residence in the old family home, which is thought by neighborhood children to be haunted. Soon, two children, Tommy and Annika, venture into the house only to meet up with Pippi. The three soon become friends and get into various adventures together, including cleaning the floor with scrubbing shoes, dodging the \"splunks\", going down a river in barrels, and helping Pippi with the problem of having to go to a children's home. Older children will probably get the most out of this movie.  Written by Amelia ChanowithSee less",
        "runtimeMinutes": "104"
    },
    "1988_137": {
        "plotSummary": "Renowned Russian piano teacher Irina Sousatzka gets a new student - Bengali piano prodigy Manek. They are both immigrants in the UK and bond quickly. When Manek's single mother's business fails, he must make a career decision.",
        "runtimeMinutes": "122"
    },
    "1988_138": {
        "plotSummary": "Shoe-shiner Gino is hired to take the rap for a mafia murder. Two-bit gangster Jerry watches over Gino and gives him a weekend to remember.",
        "runtimeMinutes": "100"
    },
    "1988_139": {
        "plotSummary": "The rivalry between Enzo and Jacques, two childhood friends and now world-renowned free divers, becomes a beautiful and perilous journey into oneself and the unknown.",
        "runtimeMinutes": "168"
    },
    "1988_14": {
        "plotSummary": "The spirits of a deceased couple are harassed by an unbearable family that has moved into their home, and hire a malicious spirit to drive them out.",
        "runtimeMinutes": "92"
    },
    "1988_140": {
        "plotSummary": "A rude, contemptuous talk show host becomes overwhelmed by the hatred that surrounds his program just before it goes national.",
        "runtimeMinutes": "110"
    },
    "1988_141": {
        "plotSummary": "After a tragic accident, a man conjures up a towering, vengeful demon called Pumpkinhead to destroy a group of unsuspecting teenagers.",
        "runtimeMinutes": "86"
    },
    "1988_142": {
        "plotSummary": "An angel tires of overseeing human activity and wishes to become human when he falls in love with a mortal.",
        "runtimeMinutes": "128"
    },
    "1988_143": {
        "plotSummary": "Ten teenagers party at an abandoned funeral parlor on Halloween night. When an evil force awakens, demonic spirits keep them from leaving and turn their gathering into a living Hell.",
        "runtimeMinutes": "90"
    },
    "1988_144": {
        "plotSummary": "In 1940s Kenya, a married couple join other affluent British expatriates in a lifestyle of recklessness and excess, but soon find themselves in a troubling situation.",
        "runtimeMinutes": "107"
    },
    "1988_145": {
        "plotSummary": "Dominick and Eugene are twins, but Dominick is a little bit slow due to an accident in his youth. They live together, with Dominick working as garbage man to put Eugene through medical school. Their relationship becomes strained when ...See moreDominick and Eugene are twins, but Dominick is a little bit slow due to an accident in his youth. They live together, with Dominick working as garbage man to put Eugene through medical school. Their relationship becomes strained when Eugene must decide between his devotion to his brother, or his need to go away to complete his training. Things are also not helped by Dominick's co-worker, or Eugene's budding romance.  Written by Murray Chapman See less",
        "runtimeMinutes": "111"
    },
    "1988_146": {
        "plotSummary": "A Denver reporter investigates the mass murder of a family of Mormons in rural Colorado.",
        "runtimeMinutes": "91"
    },
    "1988_147": {
        "plotSummary": "The eldest son of a fugitive family comes of age and wants to live a life of his own.",
        "runtimeMinutes": "116"
    },
    "1988_148": {
        "plotSummary": "A former prisoner of war is brainwashed as an unwitting assassin for an international Communist conspiracy.",
        "runtimeMinutes": "126"
    },
    "1988_149": {
        "plotSummary": "An aging ruthless businessman swaps bodies with his grandson in the wake of getting into a car accident.",
        "runtimeMinutes": "93"
    },
    "1988_15": {
        "plotSummary": "In London, four very different people team up to commit armed robbery, then try to doublecross each other for the loot.",
        "runtimeMinutes": "108"
    },
    "1988_150": {
        "plotSummary": "A young man returning home to attend a wedding hooks up with a drifter who turns out to be a violent bank robber. Before he knows it, the man finds himself involved in the robber's plans.",
        "runtimeMinutes": "108"
    },
    "1988_151": {
        "plotSummary": "1963. Thirteen year old Molly Roth, the eldest of three offspring of Gus and Diana Roth, lives a carefree life as part of the affluent white minority in South Africa. Race is a non-issue for her as although, under apartheid, the Roths ...See more1963. Thirteen year old Molly Roth, the eldest of three offspring of Gus and Diana Roth, lives a carefree life as part of the affluent white minority in South Africa. Race is a non-issue for her as although, under apartheid, the Roths largely exist among other white people like them, she feels equally comfortable around the black people in her life, such as their servants and her parents' black friends. Beyond knowing that they are busy in their work, Molly is unaware of the full extent of what her parents do, Gus a leading member of the South African Communist Party and Ruth an anti-apartheid journalist who also secretly works for the underground in support of the outlawed African National Congress. Shortly after Gus quietly escapes the country to evade probable arrest by the government - Molly believing it just a short work related trip - Molly's carefree life starts to unravel when Diana is detained for ninety days under a new law that allows such detention without ever even being charged with a criminal offense. The goal of Diana's interrogators, led by Inspector Muller, is to get her to divulge details especially of the underground, most specifically proverbial \"names\". Beyond missing her mother, Molly begins to resent the anti-apartheid work which has directly and indirectly impacted her life in a negative way, she wanting a mother, not an activist-mother. As the situation with Diana evolves, which includes someone needing to act as caregivers to Molly and her younger sisters while Diana is in detention, Molly gets a broader perspective of her situation under apartheid as she is able to see more of life just outside her protected white enclave, and as she is made aware of what Diana is trying to achieve for society in her work.  Written by HuggoSee less",
        "runtimeMinutes": "112"
    },
    "1988_152": {
        "plotSummary": "The troubled life and career of jazz musician Charlie \"Bird\" Parker (Forest Whitaker).",
        "runtimeMinutes": "161"
    },
    "1988_153": {
        "plotSummary": "The boy Krishna is abandoned by his mother at the Apollo Circus and she tells him that he can only return home when he can afford 500 rupees to pay for the bicycle of his brother that he had trashed. Krishna is left behind by the circus ...See moreThe boy Krishna is abandoned by his mother at the Apollo Circus and she tells him that he can only return home when he can afford 500 rupees to pay for the bicycle of his brother that he had trashed. Krishna is left behind by the circus and he takes a train to Bombay. Krishna is called Chaipau by the street children of Bombay and he works delivering and selling tea for Chacha, who owns a street bar. Krishna befriends the heroin addicted Chillum that sells drugs for the drug dealer and caftan Baba Golub, and the girl Manju Golub, who is the daughter of Baba with the prostitute Rekha Golub. Krishna dreams on saving 500 rupees to return home, but the life on the streets of Bombay is not easy.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "113"
    },
    "1988_154": {
        "plotSummary": "When his wife dies, Lassefar (Max von Sydow) takes his 12-year-old son, Pelle (Pelle Hvenegaard), from their home in Sweden to Denmark in search of a better life. Signing on as laborers at a large farm, father and son undergo numerous ...See moreWhen his wife dies, Lassefar (Max von Sydow) takes his 12-year-old son, Pelle (Pelle Hvenegaard), from their home in Sweden to Denmark in search of a better life. Signing on as laborers at a large farm, father and son undergo numerous trials, including prejudice against immigrants and run-ins with those more powerful than themselves in both the physical and the social sense. Over the course of a year, young Pelle learns what it takes to survive in a harsh and unforgiving world.  Written by yusufpiskinSee less",
        "runtimeMinutes": "157"
    },
    "1988_155": {
        "plotSummary": "A struggling artist is hired to forge paintings, causing him to cross paths with his ex-wife and her powerful new husband.",
        "runtimeMinutes": "126"
    },
    "1988_156": {
        "plotSummary": "Two psychics are hired to find the location of a lost Incan city Located somewhere in the Ecuadorian mountains, that is said to hide a great treasure.",
        "runtimeMinutes": "99"
    },
    "1988_157": {
        "plotSummary": "A crooked American businessman tries to push the shady influential owner of a nightclub in Newcastle, England to sell him the club. The club's new employee and the American's ex lover fall in love and inadvertently stir the pot.",
        "runtimeMinutes": "93"
    },
    "1988_158": {
        "plotSummary": "An F.B.I. Agent works to uncover an All-American family as Soviet sleeper Agents, and gets caught up in friendship with their unaware son.",
        "runtimeMinutes": "98"
    },
    "1988_159": {
        "plotSummary": "An author tells the story of how, as a young boy growing up in a 1960s small town, he was haunted after witnessing the murder of a little girl.",
        "runtimeMinutes": "113"
    },
    "1988_16": {
        "plotSummary": "The story of Dian Fossey, a scientist who came to Africa to study the vanishing mountain gorillas, and later fought to protect them.",
        "runtimeMinutes": "129"
    },
    "1988_160": {
        "plotSummary": "This documentary, on the life of artist Vincent Van Gogh, is told through his letters to his brother Theo, from 1872 until his tragic death. We gain first hand insight into the man, his motivations, and his humanity.",
        "runtimeMinutes": "105"
    },
    "1988_161": {
        "plotSummary": "Facing a mid-life crisis, a woman rents an apartment next to a psychiatrist's office to write a new book, only to become drawn to the plight of a pregnant woman seeking that doctor's help.",
        "runtimeMinutes": "81"
    },
    "1988_162": {
        "plotSummary": "The wife's affair and a death in the family hasten the demise of an upper-class English marriage.",
        "runtimeMinutes": "118"
    },
    "1988_163": {
        "plotSummary": "A young Southern debutante temporarily abandons her posh lifestyle and upcoming, semi-arranged marriage to have a lustful and erotic fling with a rugged drifter who works at a local carnival.",
        "runtimeMinutes": "104"
    },
    "1988_164": {
        "plotSummary": "1908: Basil Pascali (Sir Ben Kingsley), a spy for the Sultan, sends reports to Istanbul that nobody reads. His suspicions are roused when a British archeologist appears, who may not be quite what he seems.See more1908: Basil Pascali (Sir Ben Kingsley), a spy for the Sultan, sends reports to Istanbul that nobody reads. His suspicions are roused when a British archeologist appears, who may not be quite what he seems.  Written by Cleo See less",
        "runtimeMinutes": "104"
    },
    "1988_165": {
        "plotSummary": "A group of adventurers sneak into Cuba to try to recover $1 million in cash that when hidden when Fidel Castro took over in 1959. They find themselves trying to avoid detection by Cuban authorities while also battling modern-day pirates ...See moreA group of adventurers sneak into Cuba to try to recover $1 million in cash that when hidden when Fidel Castro took over in 1959. They find themselves trying to avoid detection by Cuban authorities while also battling modern-day pirates who are also after the treasure.  Written by frankfob2@yahoo.comSee less",
        "runtimeMinutes": "104"
    },
    "1988_166": {
        "plotSummary": "In the 1970s, Patricia Hearst is abducted by American revolutionaries, but eventually joins their cause instead.",
        "runtimeMinutes": "108"
    },
    "1988_167": {
        "plotSummary": "Mr. North, a stranger to a small, but wealthy, Rhode Island town, quickly has rumors started about him that he has the power to heal people's ailments. The rumors are magnified by his tendency to collect negative charges and give shocks to...See moreMr. North, a stranger to a small, but wealthy, Rhode Island town, quickly has rumors started about him that he has the power to heal people's ailments. The rumors are magnified by his tendency to collect negative charges and give shocks to anyone he touches. In his adventures he befriends an old man who is a shut-in and helps him rediscover the world.  Written by Kevin See less",
        "runtimeMinutes": "93"
    },
    "1988_168": {
        "plotSummary": "A modernized version of the story which inspired Verdi's opera, \"La Forza del Destino\".",
        "runtimeMinutes": "118"
    },
    "1988_169": {
        "plotSummary": "A film that successfully argued that a man was wrongly convicted for murder by a corrupt justice system in Dallas County, Texas.",
        "runtimeMinutes": "101"
    },
    "1988_17": {
        "plotSummary": "A selfish, cynical television executive is haunted by three spirits bearing lessons on Christmas Eve.",
        "runtimeMinutes": "101"
    },
    "1988_170": {
        "plotSummary": "When an archaeologist uncovers a strange skull in foreign land, the residents of a near-by town begin to disappear, leading to further inexplicable occurrences.",
        "runtimeMinutes": "93"
    },
    "1988_171": {
        "plotSummary": "Five former cub scouts have a reunion and go camping on the mountain they never conquered. High jinks ensue due to their childhood enemies and a group of escaped convicts who mistake them for an FBI unit.See moreFive former cub scouts have a reunion and go camping on the mountain they never conquered. High jinks ensue due to their childhood enemies and a group of escaped convicts who mistake them for an FBI unit.  Written by Mickey Blake See less",
        "runtimeMinutes": "86"
    },
    "1988_172": {
        "plotSummary": "Ten short films by ten different directors with nearly no speech but set to arias by different composers.",
        "runtimeMinutes": "90"
    },
    "1988_173": {
        "plotSummary": "Arthur returns to London after working abroad for many years with his now deceased father. Almost at once he becomes involved in the problems of his mother's seamstress Amy and of her father residing in the Marshalsea debtors' prison.",
        "runtimeMinutes": "357"
    },
    "1988_174": {
        "plotSummary": "A psychotic young man returns to his old neighborhood after release from prison. He seeks out the woman he previously tried to rape and the man who protected her, with twisted ideas of love for her and hate for him.",
        "runtimeMinutes": "90"
    },
    "1988_175": {
        "plotSummary": "When a former prison wardress who dominates the lives of her three adult stepchildren and her daughter is found dead at an archaeological dig near the Dead Sea, there are a great many suspects.",
        "runtimeMinutes": "102"
    },
    "1988_176": {
        "plotSummary": "A boy takes in a stray dog, later discovering that it is an ultra-intelligent runaway being stalked by a dangerous creature from the same genetic research lab.",
        "runtimeMinutes": "91"
    },
    "1988_177": {
        "plotSummary": "Julia, an American woman living in Italy, becomes depressed and traumatized after her husband Paolo is killed in a car accident on their wedding day. Six years later, Julia inexplicably finds herself sliding in time between two different ...See moreJulia, an American woman living in Italy, becomes depressed and traumatized after her husband Paolo is killed in a car accident on their wedding day. Six years later, Julia inexplicably finds herself sliding in time between two different worlds, where in one she is still struggling with her grief over Paolo's death, and in the other she is married to Paolo. In the latter time-line, Paolo is alive and well with their five year old son, and Julia is having an affair with a British gentleman named Daniel. The frequent supernatural sliding between these two worlds threaten to drive Julia crazy, as she begins having difficulty in telling them apart, and as she learns which world she is currently living in.  Written by matt-282See less",
        "runtimeMinutes": "98"
    },
    "1988_178": {
        "plotSummary": "In Paris outskirts Blanche, a young clerk, befriends Lea, a girl livelier than she is. Lea is going steady with Fabien who is a friend to Alexandre who is going steady with Adrienne but is however loved by Blanche. Somehow a way has to be ...See moreIn Paris outskirts Blanche, a young clerk, befriends Lea, a girl livelier than she is. Lea is going steady with Fabien who is a friend to Alexandre who is going steady with Adrienne but is however loved by Blanche. Somehow a way has to be found to get out of this emotional chaos!  Written by Salvatore Santangelo See less",
        "runtimeMinutes": "103"
    },
    "1988_179": {
        "plotSummary": "A wax museum owner uses his horror exhibits to unleash evil on the world.",
        "runtimeMinutes": "95"
    },
    "1988_18": {
        "plotSummary": "A young farmer is chosen to undertake a perilous journey in order to protect a special baby from an evil queen.",
        "runtimeMinutes": "126"
    },
    "1988_180": {
        "plotSummary": "A group of dangerous terrorists succeeds to get hold of a tank of the army and all its crew. Written by Anonymous",
        "runtimeMinutes": "93"
    },
    "1988_181": {
        "plotSummary": "Two sisters turn their family mansion in Louisiana into a guest house. One of their guests is an aide to a congressman, and turns their lives inside out.",
        "runtimeMinutes": "91"
    },
    "1988_182": {
        "plotSummary": "Aspiring and incarcerated rock singer, Robin Shea (Rebecca De Mornay) seduces prison guard Billy Moran (Vincent Spano). Robin marries Billy to get out of jail, but Robin's concerns are on politician James Tiernan (Frank Langella).",
        "runtimeMinutes": "100"
    },
    "1988_183": {
        "plotSummary": "When a boxer is killed because he wouldn't take a dive, his brother tries to find a way to avenge him even if only symbolically.",
        "runtimeMinutes": "95"
    },
    "1988_184": {
        "plotSummary": "A killer dressed in a police uniform begins murdering innocent people on the streets of New York City.",
        "runtimeMinutes": "85"
    },
    "1988_185": {
        "plotSummary": "A young lawyer, after falling in love with a beautiful woman, finds that she has an extremely mysterious past.",
        "runtimeMinutes": "99"
    },
    "1988_186": {
        "plotSummary": "A New York playwright is summoned to Ireland to bury his father (his \"Da\"). While at his boyhood home, he encounters his father's spirit and relives memories both pleasant and not.See moreA New York playwright is summoned to Ireland to bury his father (his \"Da\"). While at his boyhood home, he encounters his father's spirit and relives memories both pleasant and not.  Written by Dan See less",
        "runtimeMinutes": "102"
    },
    "1988_187": {
        "plotSummary": "Spike Fumo is an Italian kid apsiring to be a boxer. He falls in love with a rich girl, who turns out to be the daughter of a Mafia boss. Spike is threatened to leave Bensonhurst by the mob, and then goes to a poverty-stricken Puerto Rican...See moreSpike Fumo is an Italian kid apsiring to be a boxer. He falls in love with a rich girl, who turns out to be the daughter of a Mafia boss. Spike is threatened to leave Bensonhurst by the mob, and then goes to a poverty-stricken Puerto Rican part of Brooklyn.  Written by Philip Brubaker See less",
        "runtimeMinutes": "100"
    },
    "1988_188": {
        "plotSummary": "An exploration of technologically developing nations and the effect the transition to Western-style modernization has had on them.",
        "runtimeMinutes": "99"
    },
    "1988_189": {
        "plotSummary": "On a magical artifact called the Bone of Scone, that gives \"Puppy Power\" to the Pound Puppies and Pound Purries. However, a villain named Marvin McNasty plans to take it and use it for world domination. Without the Bone of Scone, humans ...See moreOn a magical artifact called the Bone of Scone, that gives \"Puppy Power\" to the Pound Puppies and Pound Purries. However, a villain named Marvin McNasty plans to take it and use it for world domination. Without the Bone of Scone, humans will not understand what the animals are saying and, if it is broken, Puppy Power will forever be lost.  Written by Anthony Pereyra {hypersonic91@yahoo.com}See less",
        "runtimeMinutes": "76"
    },
    "1988_19": {
        "plotSummary": "A privileged rich debutante and a cynical struggling entertainer share a turbulent, but strong childhood friendship over the years.",
        "runtimeMinutes": "123"
    },
    "1988_190": {
        "plotSummary": "Based on the story of Ronald Christopher \"Buster\" Edwards (Phil Collins), one of the thieves involved in \"The Great Train Robbery\" of 1963.",
        "runtimeMinutes": "91"
    },
    "1988_191": {
        "plotSummary": "In 1950s America, an FBI agent and a blacklist victim uncover a plot to smuggle Nazi war criminals into the country.",
        "runtimeMinutes": "101"
    },
    "1988_192": {
        "plotSummary": "In Texas, Floyd is the owner of a decadent bar nearby the coast. He misses his wife Dorothy, who disappeared one year ago, and does not pay attention to the business, giving credit to everybody. His senile father-in-law The General lives ...See moreIn Texas, Floyd is the owner of a decadent bar nearby the coast. He misses his wife Dorothy, who disappeared one year ago, and does not pay attention to the business, giving credit to everybody. His senile father-in-law The General lives with him demanding care. He has two employees, the former inmate of a mental institution Jimmy and the spinster Louise that has a love affair with him and has offered her saving to become his partner. Floyd has a huge tax debt and his pseudo-friend Charlie is forcing him to sell the place very cheap. However Louise finds that a bridge will be built soon and will increase the value of the bar.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "95"
    },
    "1988_193": {
        "plotSummary": "Linda is still tormented by giving up a baby for adoption at 15. She wants a baby, but her husband has enough in his model trains, mistress and being a doctor.",
        "runtimeMinutes": "91"
    },
    "1988_194": {
        "plotSummary": "Chuck brought sorrow to his family when he shot his father who is now a semi-invalid. After 15 years of self destruction, he returns home to seek forgiveness.",
        "runtimeMinutes": "93"
    },
    "1988_195": {
        "plotSummary": "It's the 60s and a bunch of crazy teenagers meet in the beautiful island of Hawaii during their summer holidays. Although they come from different backgrounds, they hang out together and shake up the island! They surf, dance, drink, fight ...See moreIt's the 60s and a bunch of crazy teenagers meet in the beautiful island of Hawaii during their summer holidays. Although they come from different backgrounds, they hang out together and shake up the island! They surf, dance, drink, fight and fall in love. As the summer approaches its end, they find themselves inseparable, friends for a lifetime...  Written by Xenophon Tsakanikas See less",
        "runtimeMinutes": "98"
    },
    "1988_196": {
        "plotSummary": "Michael flies up to French Canada to visit his girlfriend and her wacky family. She doesn't love him anymore, the grandma mistakes him for her late husband, the sister appears naked and makes advances, the dad likes to be naked as well.",
        "runtimeMinutes": "94"
    },
    "1988_197": {
        "plotSummary": "Documentary showcase, what life was like for the music artists living during the Los Angeles Heavy Metal scene in the mid and late 1980s.",
        "runtimeMinutes": "93"
    },
    "1988_198": {
        "plotSummary": "An evil force from a 1000 years in the future begins to destroy an idyllic paradise, where the citizens are in perfect harmony with nature.",
        "runtimeMinutes": "78"
    },
    "1988_199": {
        "plotSummary": "With the background of the XX century Italian history, Carlo, a retired teacher, traces the vicissitudes of his family.",
        "runtimeMinutes": "127"
    },
    "1988_2": {
        "plotSummary": "A toon-hating detective is a cartoon rabbit's only hope to prove his innocence when he is accused of murder.",
        "runtimeMinutes": "104"
    },
    "1988_20": {
        "plotSummary": "A lost and alone kitten joins a gang of dogs engaged in petty larceny in New York City.",
        "runtimeMinutes": "74"
    },
    "1988_200": {
        "plotSummary": "Fact-based account of a secret society of murderers, and of the man who exposed them in British India 1825.",
        "runtimeMinutes": "102"
    },
    "1988_201": {
        "plotSummary": "The spirit of a long-dead prisoner returns for revenge, haunting the prison's new governor.",
        "runtimeMinutes": "102"
    },
    "1988_202": {
        "plotSummary": "In Texas, the naive Travis Rogers quits his job to marry his beloved Stephanie \"Stephi\" Lawrence and work with his father-in-law. However he decides to buy a car with his US$ 5,000.00 savings in Dallas before the wedding. He goes to a car ...See moreIn Texas, the naive Travis Rogers quits his job to marry his beloved Stephanie \"Stephi\" Lawrence and work with his father-in-law. However he decides to buy a car with his US$ 5,000.00 savings in Dallas before the wedding. He goes to a car dealer and the sexy saleswoman Jonni Tigersmith convinces him to buy an expensive fully-loaded Lamborghini-type car after the test drive. But soon Travis finds that his car is a piece of junk. When Jonni sees the car, she has an argument with her crooked boss since it is not the test drive car and is fired together with the mechanic. She meets Travis and they have one night stand. They team up with the mechanic and decide to retrieve the car he bought. Meanwhile Stephi is waiting for travel for the rehearsals and finally for the wedding. Will Travis marry Stephi or stay with Jonni?  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "81"
    },
    "1988_203": {
        "plotSummary": "A couple of creative losers accidently become big shots in the video music industry.",
        "runtimeMinutes": "93"
    },
    "1988_204": {
        "plotSummary": "In the nuclear ravaged wasteland of Earth 2087 water is as precious as life itself. The isolated Lost Wells outpost survived the holocaust and the inhabitants guard the source of their existence. Now an evil cult of renegades want control ...See moreIn the nuclear ravaged wasteland of Earth 2087 water is as precious as life itself. The isolated Lost Wells outpost survived the holocaust and the inhabitants guard the source of their existence. Now an evil cult of renegades want control of their valuable water supply. And the villagers are no match for such brute military force. Only one man can help the stricken community - a mercenary living in a distant cannibal city. But even he, and his strange henchmen, may not be able to survive in the world gone wild.  Written by See less",
        "runtimeMinutes": "95"
    },
    "1988_205": {
        "plotSummary": "Gritty drama that follows two high school acquaintances, Hancock, a basketball star, and Danny, a geek turned drifter, after they graduate.",
        "runtimeMinutes": "102"
    },
    "1988_206": {
        "plotSummary": "A surreal portrait of a Catholic Private School and its hierarchy. A new student must submit to the bizarre rituals of his peers and the expectations of the school's administration by selling chocolates.See moreA surreal portrait of a Catholic Private School and its hierarchy. A new student must submit to the bizarre rituals of his peers and the expectations of the school's administration by selling chocolates.  Written by Brooke See less",
        "runtimeMinutes": "100"
    },
    "1988_207": {
        "plotSummary": "When call-girl Della gets caught in the middle of a drug bust at a hotel where she was meeting a trick, she is held hostage by a robber that busted in on the drug agents and the drug dealers. She gets rescued by vice cop Church who is ...See moreWhen call-girl Della gets caught in the middle of a drug bust at a hotel where she was meeting a trick, she is held hostage by a robber that busted in on the drug agents and the drug dealers. She gets rescued by vice cop Church who is accused of staging the aborted bust. Ex-ballplayer turned drug dealer Roger is in tight with corrupt vice cops and their superiors And the fireworks start popping.  Written by Richard Jones See less",
        "runtimeMinutes": "96"
    },
    "1988_208": {
        "plotSummary": "To prove his brother's innocence, undercover officer Nick enrolls in high school again, dealing with crushes, bullies, humiliations, popularity swings, and quirky teachers and staff to find the real murderer.",
        "runtimeMinutes": "98"
    },
    "1988_209": {
        "plotSummary": "A college dropout called for jury duty tries to prove his childhood crush innocent.",
        "runtimeMinutes": "102"
    },
    "1988_21": {
        "plotSummary": "A group of young recruits go through boot camp during the Second World War in Biloxi, Mississippi. From the play by Neil Simon.",
        "runtimeMinutes": "106"
    },
    "1988_210": {
        "plotSummary": "A journalist agrees to meet an obscene caller at a bar, and ends up witnessing a murder. Written by Rob Hartill",
        "runtimeMinutes": "96"
    },
    "1988_211": {
        "plotSummary": "American judge in Germany must decide if the hijacking of an East German plane into West Berlin was justified.",
        "runtimeMinutes": "96"
    },
    "1988_212": {
        "plotSummary": "Hiller, a computer expert, was bribed by group of bank robbers to obtain details of the security system at a newly-built bank. Having obtained the information, he thought he'd seen the last of the robbers. But now they've traced him and ...See moreHiller, a computer expert, was bribed by group of bank robbers to obtain details of the security system at a newly-built bank. Having obtained the information, he thought he'd seen the last of the robbers. But now they've traced him and his son to London. They hold the son hostage and force Hiller to decode the information about the alarm and then to take part in the robbery.  Written by AnonymousSee less",
        "runtimeMinutes": "150"
    },
    "1988_213": {
        "plotSummary": "In rural 1960s Australia, a boy watches helplessly as his best friend falls in love with a small-time criminal, setting off a violent chain of events.",
        "runtimeMinutes": "103"
    },
    "1988_214": {
        "plotSummary": "A warrior leaves home to fight in the Hundred Years' War (1337-1453) between France and England. Before his departure, he gives his young son, François, a sword to safeguard his mother and her virtue. One day, after the boy opens a bedroom...See moreA warrior leaves home to fight in the Hundred Years' War (1337-1453) between France and England. Before his departure, he gives his young son, François, a sword to safeguard his mother and her virtue. One day, after the boy opens a bedroom door to find his mother willingly submitting to a man, he uses the sword to kill the man and becomes traumatized with guilt and enmity toward his mother. Years later, François (Bernard-Pierre Donnadieu) must go off to war as a chevalier, or knight. While he is away, his daughter, the gentle and loving Beatrice (Julie Delpy), sees to the needs of her little brother and her feckless mother. Although the castle in which they live is a sepulcher of shadows and stone, Beatrice maintains her spirits as she looks forward to the day when her father's voice will once again echo in the corridors. After four years of war in which he was held captive for a time by the English, he returns to the castle, a hardened warrior who has renounced God. Inside his twisted mind, he still carries the memory of that terrible day long ago, the day he discovered that his mother was an adulteress. Giving the demons within him free rein, he begins to abuse everyone around him: He insults, bullies, and pillages the local village. He even forces his son (Nils Tavernier) to wear women's clothes and become the prey in a hunt. As he descends deeper into depravity, it is innocent Beatrice who suffers the most. Whether he has completely destroyed her, or whether she will rise up and destroy him, becomes the central focus of the film as it moves toward its conclusion.See less",
        "runtimeMinutes": "131"
    },
    "1988_215": {
        "plotSummary": "A matador is wounded by a bull and can no longer kill in the arena. It just a one flaw besides many others from several characters whom unsuspected collide.",
        "runtimeMinutes": "110"
    },
    "1988_216": {
        "plotSummary": "Alex (Al Pillay) is a disgruntled server at a snobby exclusive restaurant who falls on hard times. Forced to deal with the contempt and disgust of the upper class, Alex and cohorts attempt to go on a rampage. Meanwhile, General Karpov (...See moreAlex (Al Pillay) is a disgruntled server at a snobby exclusive restaurant who falls on hard times. Forced to deal with the contempt and disgust of the upper class, Alex and cohorts attempt to go on a rampage. Meanwhile, General Karpov (Dave Beard) and Spider (Lemmy) plot to involve the inept anarchists in their plans to derail the Prime-Minister-to-be's campaign.  Written by Jeff Mercer See less",
        "runtimeMinutes": "90"
    },
    "1988_217": {
        "plotSummary": "A young woman wanders around New York City and stumbles across a number of strange characters and settings that represent the \"underground\" areas of the city. She sees stand up comedy in Central Park, a prostitution auction, a voodoo ...See moreA young woman wanders around New York City and stumbles across a number of strange characters and settings that represent the \"underground\" areas of the city. She sees stand up comedy in Central Park, a prostitution auction, a voodoo ceremony, an S&M club, and a number of very interesting performance artists. These are just a few of the sights and sounds of New York that she encounters.  Written by Josh Pasnak See less",
        "runtimeMinutes": "83"
    },
    "1988_218": {
        "plotSummary": "Two brothers who are forced off their farm in the debt stricken mid-west become folk heroes when they begin robbing the banks that have been foreclosing on farmers.See moreTwo brothers who are forced off their farm in the debt stricken mid-west become folk heroes when they begin robbing the banks that have been foreclosing on farmers.  Written by Keith Loh See less",
        "runtimeMinutes": "108"
    },
    "1988_219": {
        "plotSummary": "An old patriarch unites all members of his family for his birthday, but the group of people are full of personal and social problems.",
        "runtimeMinutes": "99"
    },
    "1988_22": {
        "plotSummary": "A fan who has an affair with one minor-league baseball player each season meets an up-and-coming pitcher and the experienced catcher assigned to him.",
        "runtimeMinutes": "108"
    },
    "1988_220": {
        "plotSummary": "A distraught husband kidnaps the judge who freed his wife's killers on insufficient evidence. He gives him seven hours to find evidence that will put them away, or he'll kill his wife.",
        "runtimeMinutes": "90"
    },
    "1988_221": {
        "plotSummary": "After a sexual encounter with a beautiful client, a teenage delivery boy finds himself being turned into a vampire.",
        "runtimeMinutes": "89"
    },
    "1988_222": {
        "plotSummary": "A corrupt television preacher and his congregation are held hostage by a woman, her lover, and her two cousins in an attempt to avenge the theft of her inheritance. A quirky look at the dishonesty of the televangelist industry.See moreA corrupt television preacher and his congregation are held hostage by a woman, her lover, and her two cousins in an attempt to avenge the theft of her inheritance. A quirky look at the dishonesty of the televangelist industry.  Written by Cate Harrington See less",
        "runtimeMinutes": "93"
    },
    "1988_223": {
        "plotSummary": "Two overzealous psychopathic US tax collectors blackmail bounty hunter Vince Holloway into stopping an illegal transfer of 20 Mio. dollars from a Mexican tax paradise into the USA. So he arrives in Diablo, where life isn't worth a penny. ...See moreTwo overzealous psychopathic US tax collectors blackmail bounty hunter Vince Holloway into stopping an illegal transfer of 20 Mio. dollars from a Mexican tax paradise into the USA. So he arrives in Diablo, where life isn't worth a penny. It seems impossible to raid the heavily guarded bank. He has to assure himself of help of the barwoman Dakota and a little boy.  Written by Tom Zoerner See less",
        "runtimeMinutes": "90"
    },
    "1988_224": {
        "plotSummary": "A Soviet tank and its warring crew become separated from their patrol and lost in an Afghan valley with a group of vengeance-seeking rebels on their tracks.",
        "runtimeMinutes": "111"
    },
    "1988_225": {
        "plotSummary": "An Irish tough-guy debt collector is asked by his local community to help rid the town of developers bent on building a chemical plant on the outskirts of town. The developers are ruthless and have sent their heavies into town to keep the ...See moreAn Irish tough-guy debt collector is asked by his local community to help rid the town of developers bent on building a chemical plant on the outskirts of town. The developers are ruthless and have sent their heavies into town to keep the locals quiet.  Written by Rob HartillSee less",
        "runtimeMinutes": "96"
    },
    "1988_226": {
        "plotSummary": "American professor Tarl Cabot is transported via a magical ring to planet Gor, where he must help an oppressed country overthrow its evil king and his barbarian henchmen.",
        "runtimeMinutes": "94"
    },
    "1988_227": {
        "plotSummary": "A troubled Vietnam war vet deserts his wife and child shortly after he returns from the war. He returns after 10 years, where he's been living like an animal in the forest. He finds himself unprepared for the changes that he will have to ...See moreA troubled Vietnam war vet deserts his wife and child shortly after he returns from the war. He returns after 10 years, where he's been living like an animal in the forest. He finds himself unprepared for the changes that he will have to cope with, and when the vet tries to contact his son, he realizes that he has caused more damage than he had imagined.  Written by Brennan StorrSee less",
        "runtimeMinutes": "114"
    },
    "1988_228": {
        "plotSummary": "During WW2 Hanna Szenes, a Hungarian Jew living in British Palestine, volunteers to go behind enemy lines to rescue Jews from deportation to death camps.",
        "runtimeMinutes": "148"
    },
    "1988_229": {
        "plotSummary": "In the mid-60s, a teenage 4.0 high-school student is drawn out of his element on a dare by his peers, to become a dancer on popular TV music show.",
        "runtimeMinutes": "95"
    },
    "1988_23": {
        "plotSummary": "Freddy Krueger returns once again to terrorize the dreams of the remaining Dream Warriors, as well as those of a young woman who may be able to defeat him for good.",
        "runtimeMinutes": "93"
    },
    "1988_230": {
        "plotSummary": "A tragic mishap at a chocolate factory results in candy lovers getting an unexpected 'extra' in their sweets. The problem is that they want more!",
        "runtimeMinutes": "98"
    },
    "1988_231": {
        "plotSummary": "The son of a priest slain by the Mau Mau moves in with a police officer and his wife in 1950 Kenya. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "1988_232": {
        "plotSummary": "A crazy out of work actress, Vashti Blue, spends all her time in her small apartment with her pet owl and her telephone, which she uses to try and solve all her problems with life.",
        "runtimeMinutes": "96"
    },
    "1988_233": {
        "plotSummary": "A hard-boiled police detective sets out to capture a gruesome serial killer terrorizing the canals of Amsterdam.",
        "runtimeMinutes": "114"
    },
    "1988_234": {
        "plotSummary": "A modern-day deputy tracks an abducted girl to a ghost town, and the spirits of the past who took her.",
        "runtimeMinutes": "85"
    },
    "1988_235": {
        "plotSummary": "Everything returns to normal after Chernobyl. That is, everything but art. Most of the great works are lost, and it is up to people like William Shakespear Junior the Fifth to restore the lost artwork of the human race. He finds strange ...See moreEverything returns to normal after Chernobyl. That is, everything but art. Most of the great works are lost, and it is up to people like William Shakespear Junior the Fifth to restore the lost artwork of the human race. He finds strange goings-on at a resort enough to remind him of all the lines of the play, dealing with mob boss Don Learo and his daughter Cordelia, a strange professor named Jean Luc-Godard (sic), who repeatedly xeroxes his hand for no particular reason. He is followed by four humanoid goblins that keep tormenting Cordelia. There is also the gentleman whose girlfriend, Valerie, isn't always visible. Then the film is sent off to New York for Mr. Alien to edit.  Written by Scott Hutchins See less",
        "runtimeMinutes": "90"
    },
    "1988_236": {
        "plotSummary": "In this spoof inspired by the Salem witch trials the town's mayor and the judge agree to sentence several innocent townspeople to death for witchcraft in order to confiscate their land for themselves. However, sexy real witches show up.",
        "runtimeMinutes": "86"
    },
    "1988_237": {
        "plotSummary": "A visiting son tries to warn his father and stepmother that they are being menaced by a living and intelligent pulse of electricity that moves from house to house and terrorizes the residents therein.",
        "runtimeMinutes": "95"
    },
    "1988_238": {
        "plotSummary": "The story of a widow (in West Virginia) who takes in a drifter who she believes killed her husband. She begins to fall for him but cannot be sure if she should trust him.See moreThe story of a widow (in West Virginia) who takes in a drifter who she believes killed her husband. She begins to fall for him but cannot be sure if she should trust him.  Written by Scott Lane See less",
        "runtimeMinutes": "100"
    },
    "1988_239": {
        "plotSummary": "In 1917 when the British forces are bogged down in front of the Turkish and German lines in Palestine they rely on the Australian light horse regiment to break the deadlock.",
        "runtimeMinutes": "131"
    },
    "1988_24": {
        "plotSummary": "An experienced cop and his rookie partner patrol the streets of East Los Angeles while trying to keep the gang violence under control.",
        "runtimeMinutes": "120"
    },
    "1988_240": {
        "plotSummary": "Through a series of extraordinary circumstances, an eccentric teenager believes he may be the alien prince of a distant planet, ready to lead his brethren home.",
        "runtimeMinutes": "85"
    },
    "1988_241": {
        "plotSummary": "An aimless young man, Johnny (Gary Oldman), is sent to prison. He entrusts his beloved dog, Evie, to the care of his former lover and best friend, Frank (Sir Alan Bates). When he gets out of prison, he has to face difficulties at home. ...See moreAn aimless young man, Johnny (Gary Oldman), is sent to prison. He entrusts his beloved dog, Evie, to the care of his former lover and best friend, Frank (Sir Alan Bates). When he gets out of prison, he has to face difficulties at home. Added to this, is the fact that he may have to give up Evie to Frank.  Written by Samantha Santa Maria See less",
        "runtimeMinutes": "90"
    },
    "1988_242": {
        "plotSummary": "Delightful tale of a cat who becomes a sharp gentleman and sets out to restore his master's name and wealth after he gives Puss a pair of magic boots.",
        "runtimeMinutes": "96"
    },
    "1988_243": {
        "plotSummary": "In 1815, authors Lord Byron, Mary Shelley and Percy Shelley get together for some philosophical discussions, but the situation soon deteriorates into mind games, drugs and sex.",
        "runtimeMinutes": "106"
    },
    "1988_244": {
        "plotSummary": "A million years ago in Africa, the last of the Australopithecines is on flight from the humans, who killed the rest of his clan. Alone, seeking others of his kind, he traverses steppes, deserts and mountains until he reaches the coast. But...See moreA million years ago in Africa, the last of the Australopithecines is on flight from the humans, who killed the rest of his clan. Alone, seeking others of his kind, he traverses steppes, deserts and mountains until he reaches the coast. But there are already humans, there.  Written by Tom Zoerner See less",
        "runtimeMinutes": "91"
    },
    "1988_245": {
        "plotSummary": "A teenager in love, who needs money to arrange his future life with his mistress, kidnaps his own father for ransom, but nobody cares.",
        "runtimeMinutes": "87"
    },
    "1988_246": {
        "plotSummary": "A naive elderly British rural couple survive the initial onslaught of a nuclear war.",
        "runtimeMinutes": "84"
    },
    "1988_247": {
        "plotSummary": "A student-teacher relationship goes way beyond the classroom, including pre-historic times.",
        "runtimeMinutes": "89"
    },
    "1988_248": {
        "plotSummary": "A business man plans to dump toxic waste in a state park, but it doesn't go according to plan.",
        "runtimeMinutes": "91"
    },
    "1988_25": {
        "plotSummary": "A group of young gunmen, led by Billy the Kid, become deputies to avenge the murder of the rancher who became their benefactor. But when Billy takes their authority too far, they become the hunted.",
        "runtimeMinutes": "107"
    },
    "1988_26": {
        "plotSummary": "A single mother gives her son a much sought-after doll for his birthday, only to discover that it is possessed by the soul of a serial killer.",
        "runtimeMinutes": "87"
    },
    "1988_27": {
        "plotSummary": "A Chicago man and his family go camping with his obnoxious brother-in-law.",
        "runtimeMinutes": "91"
    },
    "1988_28": {
        "plotSummary": "Two con men try to settle their rivalry by betting on who can swindle a young American heiress out of fifty thousand dollars first.",
        "runtimeMinutes": "110"
    },
    "1988_29": {
        "plotSummary": "A former L.A. drug dealer tries to go straight but his past and his underworld connections bring him into the focus of the DEA, the Mexican feds and the Mexican drug cartels.",
        "runtimeMinutes": "115"
    },
    "1988_3": {
        "plotSummary": "An extremely pampered African Prince travels to Queens, New York, and goes undercover to find a wife that he can respect for her intelligence and will.",
        "runtimeMinutes": "116"
    },
    "1988_30": {
        "plotSummary": "Two couples of sisters from New York and from the countryside discover that they are connected in an incredible way.",
        "runtimeMinutes": "97"
    },
    "1988_31": {
        "plotSummary": "The story of a young deer growing up in the forest.",
        "runtimeMinutes": "70"
    },
    "1988_32": {
        "plotSummary": "Inspector \"Dirty\" Harry Callahan must stop a sick secret contest to murder local celebrities, which includes himself as a target.",
        "runtimeMinutes": "91"
    },
    "1988_33": {
        "plotSummary": "A tough Russian policeman is forced to partner up with a cocky Chicago police detective when he is sent to Chicago to apprehend a Georgian drug lord who killed his partner and fled the country.",
        "runtimeMinutes": "104"
    },
    "1988_34": {
        "plotSummary": "A scheming widow and her manipulative ex-lover make a bet regarding the corruption of a recently married woman.",
        "runtimeMinutes": "119"
    },
    "1988_35": {
        "plotSummary": "Two F.B.I. Agents with wildly different styles arrive in Mississippi to investigate the disappearance of some civil rights activists.",
        "runtimeMinutes": "128"
    },
    "1988_36": {
        "plotSummary": "An emotionally distant writer of travel guides must carry on with his life after his son is killed and his marriage crumbles.",
        "runtimeMinutes": "121"
    },
    "1988_37": {
        "plotSummary": "In 1988, Earth makes the first contact with an alien civilization. In 1991, these aliens, known as Newcomers, slowly begin to be integrated into human society after three years of quarantine.",
        "runtimeMinutes": "91"
    },
    "1988_38": {
        "plotSummary": "After a young woman suffers a brutal gang rape in a bar one night, a prosecutor assists in bringing the perpetrators to justice, including the ones who encouraged and cheered on the attack.",
        "runtimeMinutes": "111"
    },
    "1988_39": {
        "plotSummary": "An F.B.I. Agent teams up with a tracker to pursue a murderer after he vanishes into the mountains and infiltrates a hiking group.",
        "runtimeMinutes": "110"
    },
    "1988_4": {
        "plotSummary": "Australian outback expert protects his New York love from gangsters who've followed her down under.",
        "runtimeMinutes": "108"
    },
    "1988_40": {
        "plotSummary": "Ernest helps Santa Claus as he searches for his successor.",
        "runtimeMinutes": "95"
    },
    "1988_41": {
        "plotSummary": "An FBI agent posing as a combine driver becomes romantically involved with a Midwest farmer who lives a double life as a white supremacist.",
        "runtimeMinutes": "127"
    },
    "1988_42": {
        "plotSummary": "A couple swap city life for the country, but their picturesque new hometown turns out to be just a little bit different to what they were expecting.",
        "runtimeMinutes": "101"
    },
    "1988_43": {
        "plotSummary": "The old age pensioners that left at the end of the first film come back to Earth to visit their relatives. Will they all decide to go back to the planet where no one grows old, or will they be tempted to stay back on Earth?",
        "runtimeMinutes": "116"
    },
    "1988_44": {
        "plotSummary": "A little fox named Tod, and Copper, a hound puppy, vow to be best buddies forever. But as Copper grows into a hunting dog, their unlikely friendship faces the ultimate test.",
        "runtimeMinutes": "83"
    },
    "1988_45": {
        "plotSummary": "A teen decides to go for a night on the town with his friends despite flunking his driver's test.",
        "runtimeMinutes": "88"
    },
    "1988_46": {
        "plotSummary": "Robot Johnny Five comes to the city and gets manipulated by criminals who want him for their own purposes.",
        "runtimeMinutes": "110"
    },
    "1988_47": {
        "plotSummary": "An undercover FBI agent falls in love with a recently widowed mafia wife, who is trying to restart her life following her husband's murder while being pursued by a libidinous mafia kingpin seeking to claim her for himself.",
        "runtimeMinutes": "104"
    },
    "1988_48": {
        "plotSummary": "A medical school dropout and a housewife/mom try to make it as stand-up comedians. They become friends and help each other out at an NYC comedy club.",
        "runtimeMinutes": "128"
    },
    "1988_49": {
        "plotSummary": "A San Francisco civilian police detective is forced to work on a series of murders with his former enemy commanding officer while dating his daughter.",
        "runtimeMinutes": "97"
    },
    "1988_5": {
        "plotSummary": "A physically perfect but innocent man goes in search of his long-lost twin brother, who is short, a womanizer, and small-time crook.",
        "runtimeMinutes": "107"
    },
    "1988_50": {
        "plotSummary": "Vengence drives a tough Detroit cop to stay on the trail of a power hungry auto magnate who's systematically eliminating his competition.",
        "runtimeMinutes": "96"
    },
    "1988_51": {
        "plotSummary": "The story of Preston Tucker, the maverick car designer and his ill-fated challenge to the auto industry with his revolutionary car concept.",
        "runtimeMinutes": "110"
    },
    "1988_52": {
        "plotSummary": "An anthropologist goes to Haiti after hearing rumors about a drug used by black magic practitioners to turn people into zombies.",
        "runtimeMinutes": "98"
    },
    "1988_53": {
        "plotSummary": "The Police Academy's commandant will be honored at a police convention in Miami Beach. At the airport he picks a wrong bag with stolen diamonds. The \"owners\" want them back.",
        "runtimeMinutes": "90"
    },
    "1988_54": {
        "plotSummary": "Years after Tommy Jarvis chained him underwater at Camp Crystal Lake, the dormant Jason Voorhees is accidentally released from his prison by a telekinetic teenager. Now, only she can stop him.",
        "runtimeMinutes": "88"
    },
    "1988_55": {
        "plotSummary": "Abby Quinn is eagerly awaiting childbirth but is haunted by dreams where she suffers a miscarriage. When she decides to rent a room to a mysterious stranger, she realizes a chain of events that will unleash the end of humanity.",
        "runtimeMinutes": "97"
    },
    "1988_56": {
        "plotSummary": "A former Special Operations Vietnam vet works as a Chicago cop, and uncovers C.I.A. wrongdoing.",
        "runtimeMinutes": "99"
    },
    "1988_57": {
        "plotSummary": "Ten years after his original massacre, the invalid Michael Myers awakens on Halloween Eve and returns to Haddonfield to kill his seven-year-old niece. Can Dr. Loomis stop him?",
        "runtimeMinutes": "88"
    },
    "1988_58": {
        "plotSummary": "In a hotel room in Paris, a doctor comes out of the shower and finds that his wife has disappeared. He soon finds himself caught up in a world of intrigue, espionage, gangsters, drugs and murder.",
        "runtimeMinutes": "120"
    },
    "1988_59": {
        "plotSummary": "Johnny's the top high-school football player and many colleges want him. His girlfriend, coach and best friend want him in the college, serving themselves most.",
        "runtimeMinutes": "91"
    },
    "1988_6": {
        "plotSummary": "Rambo mounts a one-man mission to rescue his friend Colonel Trautman from the clutches of the formidable invading Soviet forces in Afghanistan.",
        "runtimeMinutes": "102"
    },
    "1988_60": {
        "plotSummary": "After she gets pregnant, a teenage girl must decide whether she should keep the baby or not.",
        "runtimeMinutes": "90"
    },
    "1988_61": {
        "plotSummary": "A Manhattan single meets a man through her Jewish grandmother's matchmaker.",
        "runtimeMinutes": "97"
    },
    "1988_62": {
        "plotSummary": "A disillusioned young writer living in New York City turns to drugs and drinking to block out the memories of his dead mother and estranged wife.",
        "runtimeMinutes": "107"
    },
    "1988_63": {
        "plotSummary": "Young newlyweds find out just how unprepared they are for their future together.",
        "runtimeMinutes": "106"
    },
    "1988_64": {
        "plotSummary": "A recently orphaned heiress meets a young racing yacht captain on Long Island. He shows interest in her and, being heiress to $200,000,000, love may not be the reason.",
        "runtimeMinutes": "91"
    },
    "1988_65": {
        "plotSummary": "Pee-wee Herman is now a small-town farmer with a fiancee, but when a traveling circus comes to town, he finds himself falling for the trapeze artist.",
        "runtimeMinutes": "86"
    },
    "1988_66": {
        "plotSummary": "Arthur loses his fortune for staying with Linda, right as the two were preparing to adopt a child. As their marriage suffers, Arthur plans for a way to get his money back, but first he must sober up and get a real job.",
        "runtimeMinutes": "113"
    },
    "1988_67": {
        "plotSummary": "A not so popular young man wants to pledge to a popular fraternity at his historically black college.",
        "runtimeMinutes": "121"
    },
    "1988_68": {
        "plotSummary": "Carol Anne is staying with her aunt in a high-rise building, where the supernatural forces haunting her make their return.",
        "runtimeMinutes": "98"
    },
    "1988_69": {
        "plotSummary": "The story of Jaime Escalante, a high school teacher who successfully inspired his dropout prone students to learn calculus.",
        "runtimeMinutes": "103"
    },
    "1988_7": {
        "plotSummary": "A talented New York City bartender takes a job at a bar in Jamaica and falls in love.",
        "runtimeMinutes": "104"
    },
    "1988_70": {
        "plotSummary": "A creature from another planet tries to seduce a shy Earth physicist to gain control over his researches. The result of this important mission much exceeded her expectations.",
        "runtimeMinutes": "105"
    },
    "1988_71": {
        "plotSummary": "An accidental breakdown of a valve on the irrigation ditch launches a hot confrontation between local farmers and corrupt authorities.",
        "runtimeMinutes": "117"
    },
    "1988_72": {
        "plotSummary": "Young Jim Craig returns to his home in the Australian high country. He finds that things are not as he left them - his girlfriend is being pursued by another man, and her father doesn't want Jim back into her life.",
        "runtimeMinutes": "110"
    },
    "1988_73": {
        "plotSummary": "A divorced executive named Marshall and his 11-year-old son, Charlie, casually touch a magical Tibetan skull, releasing a mysterious power that transfers Marshall's mind to Charlie's body and vice versa. Their problems have just begun.",
        "runtimeMinutes": "98"
    },
    "1988_74": {
        "plotSummary": "In this parody of blaxploitation movies, a black hero wannabe reunites former black heroes from the 70s to help him get revenge on Mr. Big.",
        "runtimeMinutes": "88"
    },
    "1988_75": {
        "plotSummary": "A drifter discovers a pair of sunglasses that allow him to wake up to the fact that aliens have taken over the Earth.",
        "runtimeMinutes": "94"
    },
    "1988_76": {
        "plotSummary": "Three teenage girls come of age while working at a pizza parlor in the Connecticut town of Mystic.",
        "runtimeMinutes": "104"
    },
    "1988_77": {
        "plotSummary": "A college professor's day: his top student allegedly commits suicide, his wife presents him with divorce papers and he overnights in a freshman girl's dorm. The next day: more murders around him. Will he find the killer in time?",
        "runtimeMinutes": "96"
    },
    "1988_78": {
        "plotSummary": "A Louisiana football legend struggles to deal with life's complexities after his college career is over.",
        "runtimeMinutes": "127"
    },
    "1988_79": {
        "plotSummary": "With high hopes on their quest to track down The Perfect Man, two girls take a vacation at a plush health resort. But unfortunately, the men they encounter seem to wilt at the thought of anything more than Casual Sex.",
        "runtimeMinutes": "97"
    },
    "1988_8": {
        "plotSummary": "After wishing to be made big, a teenage boy wakes the next morning to find himself mysteriously in the body of an adult.",
        "runtimeMinutes": "104"
    },
    "1988_80": {
        "plotSummary": "Kirsty is brought to an institution after the horrible events of Hellraiser, where the occult-obsessive head doctor resurrects Julia and unleashes the Cenobites and their demonic underworld.",
        "runtimeMinutes": "97"
    },
    "1988_81": {
        "plotSummary": "\"Bloodsport\" follows Frank Dux, an American martial artist serving in the military, who decides to leave the army to compete in a martial arts tournament in Hong Kong where fights to the death can occur.",
        "runtimeMinutes": "92"
    },
    "1988_82": {
        "plotSummary": "When a crass new-money tycoon's membership application is turned down at a snooty country club, he retaliates by buying the club and turning it into a tacky amusement park.",
        "runtimeMinutes": "98"
    },
    "1988_83": {
        "plotSummary": "A US actor gets a gig in South American Parador. When the dictator dies, he's forced to play him for real and gets his mistress. Can they change Parador?",
        "runtimeMinutes": "103"
    },
    "1988_84": {
        "plotSummary": "A burnt-out shrink needs a temp. A charming escaped convict takes over his practice and radio show.",
        "runtimeMinutes": "97"
    },
    "1988_85": {
        "plotSummary": "Arlo accepts what seems to him to be a dream promotion to Idaho. He soon discovers, however, that moving has its own share of problems.",
        "runtimeMinutes": "89"
    },
    "1988_86": {
        "plotSummary": "General Chappy Sinclair assembles a joint U.S.- Soviet strike team to take out a rogue middle eastern nuclear base.",
        "runtimeMinutes": "105"
    },
    "1988_87": {
        "plotSummary": "A legal attorney and renegade cop team up to stop a corrupt cop.",
        "runtimeMinutes": "112"
    },
    "1988_88": {
        "plotSummary": "In 1968, a Czech doctor with an active sex life meets a woman who wants monogamy, and then the Soviet invasion further disrupts their lives.",
        "runtimeMinutes": "171"
    },
    "1988_89": {
        "plotSummary": "The lone survivor of a suicide cult wakes from a thirteen-year coma in a psychiatric ward, where other patients suddenly start dying under mysterious and gruesome circumstances.",
        "runtimeMinutes": "80"
    },
    "1988_9": {
        "plotSummary": "An NYPD officer tries to save his wife and several others taken hostage by German terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles.",
        "runtimeMinutes": "132"
    },
    "1988_90": {
        "plotSummary": "Curious kids unearth the barrels that previously helped revive the dead, which proves the second time's an undead charm.",
        "runtimeMinutes": "89"
    },
    "1988_91": {
        "plotSummary": "A television news chief courts his anchorwoman ex-wife with an eleventh-hour story.",
        "runtimeMinutes": "105"
    },
    "1988_92": {
        "plotSummary": "Fatherless barrio Puertorican Rico is a menial car mechanic by day, but lives for the nights, when he dances and dates hot dancing girls, cockily convinced the title of Salsa king in fancy nightclub La Luna's upcoming contest is to be his....See moreFatherless barrio Puertorican Rico is a menial car mechanic by day, but lives for the nights, when he dances and dates hot dancing girls, cockily convinced the title of Salsa king in fancy nightclub La Luna's upcoming contest is to be his. He encourages his best friend, courteous gentleman Ken, to date his sister Margarita so he gets a free hand with her flirtatious classmate Lola. The reigning salsa queen Luna's interest in Ruco as dance-partner threatens his on-off relationship with Vicki. More jealous trouble follows when Ken and Margarita fall in true love.  Written by KGF VissersSee less",
        "runtimeMinutes": "97"
    },
    "1988_93": {
        "plotSummary": "A hustling drug addict checks himself into rehabilitation to escape trouble with the law and realizes that it's exactly what he needs.",
        "runtimeMinutes": "124"
    },
    "1988_94": {
        "plotSummary": "A documentary of the Irish rock group U2 on their Fall 1987 tour of North America.",
        "runtimeMinutes": "99"
    },
    "1988_95": {
        "plotSummary": "When a hotelier attempts to fill the chronic vacancies at his castle by launching an advertising campaign that falsely portrays the property as haunted, two actual ghosts show up and end up falling for two guests.",
        "runtimeMinutes": "99"
    },
    "1988_96": {
        "plotSummary": "A drunken Sherlock Holmes is really just a cover for the real detective, Dr. Watson.",
        "runtimeMinutes": "107"
    },
    "1988_97": {
        "plotSummary": "The life of Jesus Christ, his journey through life as he faces the struggles all humans do, and his final temptation on the cross.",
        "runtimeMinutes": "164"
    },
    "1988_98": {
        "plotSummary": "Justine Bateman rocks out as the leader of an all-girl band that struggles with men and drugs during a summer resort gig.",
        "runtimeMinutes": "92"
    },
    "1988_99": {
        "plotSummary": "A deadly entity from space crashes near a small town and starts to consume anyone in its path. Panic ensues, as shady government scientists try to contain the horrific creature.",
        "runtimeMinutes": "95"
    }
}