{
    "1989_1": {
        "plotSummary": "In 1938, after his father Professor Henry Jones, Sr. goes missing while pursuing the Holy Grail, Professor Henry \"Indiana\" Jones, Jr. finds himself up against Adolf Hitler's Nazis again to stop them from obtaining its powers.",
        "runtimeMinutes": "127"
    },
    "1989_10": {
        "plotSummary": "The biography of Ron Kovic. Paralyzed in the Vietnam war, he becomes an anti-war and pro-human rights political activist after feeling betrayed by the country he fought for.",
        "runtimeMinutes": "145"
    },
    "1989_100": {
        "plotSummary": "After being double crossed and thrown in jail, a deformed gangster gets a new face and rehabilitation, but his desire for revenge looms.",
        "runtimeMinutes": "94"
    },
    "1989_101": {
        "plotSummary": "The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.",
        "runtimeMinutes": "228"
    },
    "1989_102": {
        "plotSummary": "Two Los Angeles police detectives, cynical veteran Malloy and cocky rookie Dietz, hunt for a serial killer, an ex-cop named Taylor, who randomly chooses his victims from a phone directory.",
        "runtimeMinutes": "92"
    },
    "1989_103": {
        "plotSummary": "Summer of 1963. Carson is getting married to her boyfriend so her friends Melaina, Pudge and Luanne take her to Myrtle Beach for one last irresponsible weekend.See moreSummer of 1963. Carson is getting married to her boyfriend so her friends Melaina, Pudge and Luanne take her to Myrtle Beach for one last irresponsible weekend.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "98"
    },
    "1989_104": {
        "plotSummary": "A lawyer defends her father accused of war crimes, but there is more to the case than she suspects.",
        "runtimeMinutes": "124"
    },
    "1989_105": {
        "plotSummary": "An unemployed visionary becomes the manager of a local public station. The station becomes a success, with all sorts of hilarious sight gags and wacky humor.",
        "runtimeMinutes": "97"
    },
    "1989_106": {
        "plotSummary": "Shirley is a 42-year-old Liverpudlian bored housewife, who takes a holiday trip to Greece, meeting a local man who bolsters her self-confidence. She evolves and transforms to the point of finally being unrecognizable by her husband.",
        "runtimeMinutes": "108"
    },
    "1989_107": {
        "plotSummary": "Linda and Michael, married for ten years, desperately want a baby and turn to an adoption agency which introduces them to Lucy, a teenage girl expecting her first baby. The three agree that Linda and Michael will adopt Lucy's baby and that...See moreLinda and Michael, married for ten years, desperately want a baby and turn to an adoption agency which introduces them to Lucy, a teenage girl expecting her first baby. The three agree that Linda and Michael will adopt Lucy's baby and that Lucy will sign away custody. Things don't go quite to plan however..  Written by Rob HartillSee less",
        "runtimeMinutes": "95"
    },
    "1989_108": {
        "plotSummary": "An NTSB investigator seeking the cause of an airline disaster meets a warrior woman from 1000 years in the future. She replaces the people from airplanes before they crash with corpses with the same features.",
        "runtimeMinutes": "108"
    },
    "1989_109": {
        "plotSummary": "An accident puts the consciousness of an elderly dream researcher into the body of a bratty teenager. The problem? The kid prefers dreamworld limbo to real life.",
        "runtimeMinutes": "114"
    },
    "1989_11": {
        "plotSummary": "A married couple try everything to get each other to leave the house in a vicious divorce battle.",
        "runtimeMinutes": "116"
    },
    "1989_110": {
        "plotSummary": "John Larroquette is the head of a detective agency that is hired to find a missing person, probably kidnapped. They employ the help of a mystic/psychic to help find the missing girl.See moreJohn Larroquette is the head of a detective agency that is hired to find a missing person, probably kidnapped. They employ the help of a mystic/psychic to help find the missing girl.  Written by Jason Ihle See less",
        "runtimeMinutes": "83"
    },
    "1989_111": {
        "plotSummary": "A nosy cab driver gets a hot tip on a race horse and wins big, but he can't seem to stop gambling. Will he go broke or walk home with a pretty penny?",
        "runtimeMinutes": "90"
    },
    "1989_112": {
        "plotSummary": "Three years after his divorce from his model-wife is the psychologist Larry Livingstone ready for a new commitment. He falls in love with the young widow Beth who has two children. But Beth and the children are still in mourning over their...See moreThree years after his divorce from his model-wife is the psychologist Larry Livingstone ready for a new commitment. He falls in love with the young widow Beth who has two children. But Beth and the children are still in mourning over their dead husband and father and Larry finds it a bit difficult to penetrate their reservations. Larry himself has to deal with his ex-wife and his love for his own two kids. Slowly both Beth and the children realise that they have to go on with their lives and that they have been giving a second chance.  Written by See less",
        "runtimeMinutes": "119"
    },
    "1989_113": {
        "plotSummary": "A pharmacy-robbing dope fiend and his crew pop pills and evade the law.",
        "runtimeMinutes": "101"
    },
    "1989_114": {
        "plotSummary": "Two years after being forced out of NYPD, quirky Nick is rehired by the mayor to catch a serial killer after the 11th murder of a woman.",
        "runtimeMinutes": "97"
    },
    "1989_115": {
        "plotSummary": "When police officer Xavier Quinn's childhood friend, Maubee, becomes associated with murder and a briefcase full of ten thousand dollar bills, The Mighty Quinn must clear his name. Or try to catch him, which could be even trickier.",
        "runtimeMinutes": "98"
    },
    "1989_116": {
        "plotSummary": "The complacent life of three small town brothers is shattered when their father sells the family business from under them.",
        "runtimeMinutes": "91"
    },
    "1989_117": {
        "plotSummary": "A group of college debaters learn about the world, friendships, love, dreams and family in this warm, endearing drama.",
        "runtimeMinutes": "107"
    },
    "1989_118": {
        "plotSummary": "A Soviet Special Forces soldier is sent on a mission to infiltrate an African rebel army and assassinate its leader, but the war machine they trained starts to think for himself.",
        "runtimeMinutes": "105"
    },
    "1989_119": {
        "plotSummary": "Randy is still unfocused after 2 years in college. His dad will no longer pay tuition and Randy gets a job delivering pizzas. Several cute cougars pay him $200 for pizza delivery and \"services rendered\". Their husbands?",
        "runtimeMinutes": "98"
    },
    "1989_12": {
        "plotSummary": "After capturing a drug lord, Felix Leiter is left for dead and his wife is murdered. James Bond goes rogue and seeks vengeance on those responsible, as he infiltrates an organisation posing as a hitman.",
        "runtimeMinutes": "133"
    },
    "1989_120": {
        "plotSummary": "A young soprano becomes the obsession of a horribly disfigured composer, who has plans for those who oppose him or the young singer.",
        "runtimeMinutes": "93"
    },
    "1989_121": {
        "plotSummary": "A Southern California girl befriends three furry aliens after their spaceship lands in her swimming pool.",
        "runtimeMinutes": "100"
    },
    "1989_122": {
        "plotSummary": "A white middle class South African suburbanite with no interest in politics agrees to help his black gardener find his jailed son. His investigation opens his eyes to the horrors committed by the secret police and turns him into a target.",
        "runtimeMinutes": "106"
    },
    "1989_123": {
        "plotSummary": "Taylor is a man who has no problems with women. So confident is he that he accepts a challenge from his friends: he has to secure proposals of marriage from three women of their choice.See moreTaylor is a man who has no problems with women. So confident is he that he accepts a challenge from his friends: he has to secure proposals of marriage from three women of their choice.  Written by Murray Chapman See less",
        "runtimeMinutes": "103"
    },
    "1989_124": {
        "plotSummary": "When school teacher Harriet Winslow goes to Mexico to teach, she is kidnapped by Gen. Tomas Arroyo and his revolutionaries. An aging American, Ambrose \"Old Gringo\" Bierce also in Mexico, befriends Gen. Arroyo and meets Harriet. Bierce is a...See moreWhen school teacher Harriet Winslow goes to Mexico to teach, she is kidnapped by Gen. Tomas Arroyo and his revolutionaries. An aging American, Ambrose \"Old Gringo\" Bierce also in Mexico, befriends Gen. Arroyo and meets Harriet. Bierce is a famous writer, who knowing that he is dying, wishes to keep his identity secret so he can determine his own fate. Though he likes Arroyo, Bierce tries to provoke the General's anger whenever possible in an attempt to get himself killed, thus avoiding suffering through his illness. Winslow is intrigued by both Bierce and Arroyo, and the men are in turn attracted to her. She becomes romantically involved with Arroyo. When Winslow learns of Bierce's true identity (a writer whose work she has loved and respected for years), she is singlemindedly determined to fulfill his dying wish.  Written by E.W. DesMarais See less",
        "runtimeMinutes": "119"
    },
    "1989_125": {
        "plotSummary": "This film reenacts the Manhattan Project, the secret wartime project in New Mexico where the first atomic bombs were designed and built.",
        "runtimeMinutes": "127"
    },
    "1989_126": {
        "plotSummary": "A police officer suspended and now accused of murder is forced to join forces with his court-appointed attorney to assemble the pieces of a deadly puzzle to find the missing link before time runs out.",
        "runtimeMinutes": "99"
    },
    "1989_127": {
        "plotSummary": "A young girl whose father died in the Vietnam War becomes determined to find out more about him and his experiences.",
        "runtimeMinutes": "120"
    },
    "1989_128": {
        "plotSummary": "A brutal Los Angeles police Lt. is determined to bust up an organization that forces underage girls into prostitution.",
        "runtimeMinutes": "97"
    },
    "1989_129": {
        "plotSummary": "Camille Claude impresses already-famous sculptor Auguste Rodin. He hires her as an assistant, but soon Camille begins to sculpt for herself and she also becomes his mistress. But after a while, she would like to get out of his shadow.",
        "runtimeMinutes": "175"
    },
    "1989_13": {
        "plotSummary": "An old Jewish woman and her African-American chauffeur in the American South have a relationship that grows and improves over the years.",
        "runtimeMinutes": "99"
    },
    "1989_130": {
        "plotSummary": "In the 1960s, two hippies go off into the jungle to evade the FBI. When they come back to New York in the 1980s, their fellow hippie friends have become rich yuppies.",
        "runtimeMinutes": "100"
    },
    "1989_131": {
        "plotSummary": "Despite the police's preemptive strike, the illegal coast-to-coast car race is still on with new drivers. It's a race where fair play, red lights, stop signs, police roadblocks and traffic rules in general have no validity.",
        "runtimeMinutes": "94"
    },
    "1989_132": {
        "plotSummary": "Charley Brewster and Peter Vincent must face more vampires, out for revenge.",
        "runtimeMinutes": "104"
    },
    "1989_133": {
        "plotSummary": "People who dial 976-EVIL receive supernatural powers and turn into satanic killers.",
        "runtimeMinutes": "92"
    },
    "1989_134": {
        "plotSummary": "The adventures of a young cat and a dog as they find themselves accidentally separated and each swept into a hazardous trek.",
        "runtimeMinutes": "90"
    },
    "1989_135": {
        "plotSummary": "A young avid skateboarder uncovers a government conspiracy while investigating his adoptive brother's mysterious death.",
        "runtimeMinutes": "100"
    },
    "1989_136": {
        "plotSummary": "Borneo, 1942: An American soldier escapes WWII and becomes the king of the headhunters in the jungle. Two British soldiers are parachuted into the area to find local support for the battle against the Japanese.",
        "runtimeMinutes": "117"
    },
    "1989_137": {
        "plotSummary": "A manipulative woman and a roguish man conduct a turbulent romance during the American Civil War and Reconstruction periods.",
        "runtimeMinutes": "238"
    },
    "1989_138": {
        "plotSummary": "A French woman returns to her childhood home in Cameroon - formerly a colonial outpost - where she's flooded by memories, particularly of Protee, her servant.",
        "runtimeMinutes": "105"
    },
    "1989_139": {
        "plotSummary": "A teen film about an Italian punk forced to work with an innocent Jewish girl.",
        "runtimeMinutes": "98"
    },
    "1989_14": {
        "plotSummary": "Two NYC cops arrest a Yakuza member and must escort him when he's extradited to Japan.",
        "runtimeMinutes": "125"
    },
    "1989_140": {
        "plotSummary": "The widow's houseboy and the divorcee's chauffeur bet on which will bed the other's employer first.",
        "runtimeMinutes": "103"
    },
    "1989_141": {
        "plotSummary": "Two Vietnam vets, search for the strength to face up to their horrific war experiences and the tragic battle they survived. Their friendship begins to splinter, when one becomes romantically involved with the other's sister.",
        "runtimeMinutes": "102"
    },
    "1989_142": {
        "plotSummary": "A skilled young street fighter battles criminals across the rooftops of New York City.",
        "runtimeMinutes": "98"
    },
    "1989_143": {
        "plotSummary": "A young widower moves with his daughter into a North Carolina mountain town in 1934. He quickly takes up with a young woman with an illegitimate baby. First he must prove himself to her father and her three brothers. He does so first by ...See moreA young widower moves with his daughter into a North Carolina mountain town in 1934. He quickly takes up with a young woman with an illegitimate baby. First he must prove himself to her father and her three brothers. He does so first by joining them on a bear hunt and then by designing a clock tower for the small community. Trouble comes when it is revealed that the baby's father is the demented son of a mean clan across the river and they mean to take the child back.  Written by John Sacksteder See less",
        "runtimeMinutes": "110"
    },
    "1989_144": {
        "plotSummary": "Erik the Viking and his men travel across the sea to find Valhalla to ask the gods to end the Age of Ragnarok. Read more: Synopsis",
        "runtimeMinutes": "107"
    },
    "1989_145": {
        "plotSummary": "Oct.4 and Dec.26 the Strieber family drives from NYC to their cabin in the woods. Both nights there are some powerful lights outside and maybe aliens. The dad is mentally affected by the \"bad dream\", goes to the shrink and is hypnotized.",
        "runtimeMinutes": "109"
    },
    "1989_146": {
        "plotSummary": "Professional thief Ernie takes Mike on as an apprentice, but while Mike clearly has \"larceny in his heart\", it will take him a long time to get as good as Ernie.See moreProfessional thief Ernie takes Mike on as an apprentice, but while Mike clearly has \"larceny in his heart\", it will take him a long time to get as good as Ernie.  Written by Jon Reeves See less",
        "runtimeMinutes": "94"
    },
    "1989_147": {
        "plotSummary": "Paroled labor racketeer \"Dapper\" Dino is sought after by a \"politically ambitious\" prosecutor schemes to put him back in jail and a deceitful partner sizes him up for concrete shoes.",
        "runtimeMinutes": "94"
    },
    "1989_148": {
        "plotSummary": "Carnelle wants to escape her dreary life, so she enters a local beauty contest, much to everyone's dismay.",
        "runtimeMinutes": "102"
    },
    "1989_149": {
        "plotSummary": "Don Wilson plays retired kickboxer Jake Raye, who travels to Manila, where his brother is favored to win a kickboxing competition. His brother is killed, and Jake realizes he must enter the competition himself to flush out his brother's ...See moreDon Wilson plays retired kickboxer Jake Raye, who travels to Manila, where his brother is favored to win a kickboxing competition. His brother is killed, and Jake realizes he must enter the competition himself to flush out his brother's killer.  Written by Concorde - New Horizons (with permission).See less",
        "runtimeMinutes": "85"
    },
    "1989_15": {
        "plotSummary": "The Buckmans are a midwestern family all dealing with their lives: estranged relatives, raising children, pressures of the job, and learning to be a good parent and spouse.",
        "runtimeMinutes": "124"
    },
    "1989_150": {
        "plotSummary": "Detective McCarthy finally catches \"Meat Cleaver Max\", a serial killer, who promises revenge during his execution. Nonetheless, a parapsychologist tells the detective that the only hope of stopping Max for good is to destroy his spirit.",
        "runtimeMinutes": "95"
    },
    "1989_151": {
        "plotSummary": "A team from the United States is going to compete against Korea in a Tae Kwon Do tournament. The team consists of fighters from all over the country - can they overcome their rivalry and work together to win?",
        "runtimeMinutes": "97"
    },
    "1989_152": {
        "plotSummary": "Marlon has a crush on Jessica (running for high school senior class president). Jessica wants to attend Ramsey College. Marlon wants to go wherever Jessica is going. Problem: low SAT score.",
        "runtimeMinutes": "86"
    },
    "1989_153": {
        "plotSummary": "After escaping the insane asylum in which he was incarcerated, Jerry Blake (Terry O'Quinn) impersonates a marriage counselor and manages to win over a patient (Meg Foster) and her young son (Jonathan Brandis).",
        "runtimeMinutes": "93"
    },
    "1989_154": {
        "plotSummary": "Homer struggles to take a family photo as the rest of his family seem to have better things to do",
        "runtimeMinutes": "3"
    },
    "1989_155": {
        "plotSummary": "Donna and Michael are getting married. But first, they have to plan the reception, get the tux, buy the rings, and cope with their own uncertainty about the decision. Michael fears commitment. Donna has her doubts about Michael's ...See moreDonna and Michael are getting married. But first, they have to plan the reception, get the tux, buy the rings, and cope with their own uncertainty about the decision. Michael fears commitment. Donna has her doubts about Michael's immaturity. Both are getting cold feet.  Written by Azure_GirlSee less",
        "runtimeMinutes": "104"
    },
    "1989_156": {
        "plotSummary": "Men seeking relief from the Black Death, guided by a boy's vision, dig a tunnel from 14th century England to 20th century New Zealand.",
        "runtimeMinutes": "92"
    },
    "1989_157": {
        "plotSummary": "The life and work of Archbishop Oscar Romero who opposed, at great personal risk, the tyrannical repression in El Salvador.",
        "runtimeMinutes": "102"
    },
    "1989_158": {
        "plotSummary": "In his spectacular film debut, young Babar, King of the Elephants, must save his homeland from certain destruction by Rataxes and his band of invading rhinos. Read more: Synopsis",
        "runtimeMinutes": "70"
    },
    "1989_159": {
        "plotSummary": "Set in modern day Buenos Aires, the film centers around a relationship between two emotionally crippled roommates. Adrian LeDuc is a lonely sociopath who is forced to rent his insane mother's room due to poor ticket sales at his revival ...See moreSet in modern day Buenos Aires, the film centers around a relationship between two emotionally crippled roommates. Adrian LeDuc is a lonely sociopath who is forced to rent his insane mother's room due to poor ticket sales at his revival movie theater. Jack Carney, the new roommate, appears normal enough at first but it soon becomes apparent that he is hiding something. As their friendship develops, Adrian suppresses his suspicions that Jack may be the government mercenary turned serial killer who has been terrorizing the city. The other eccentric residents of the building begin to worry as Adrian shows increasing signs that his mother's insanity may be hereditary. The shocking climax of this twisted tale of deceit, perversion and murder reveals the darker side of the human psyche.  Written by Kevin JundtSee less",
        "runtimeMinutes": "124"
    },
    "1989_16": {
        "plotSummary": "A detective investigating a series of murders becomes involved with a woman who may be the culprit.",
        "runtimeMinutes": "113"
    },
    "1989_160": {
        "plotSummary": "A teenage girl, who has just finished school feels trapped and aimless in her ordinary Russian family, supported by an alcoholic father, in a dull industrial town.",
        "runtimeMinutes": "128"
    },
    "1989_161": {
        "plotSummary": "Eddie Luca is the youngest son in a family of Italian immigrants who has moved to London. Beginning from nowhere, they open a cafe in an Italian neighborhood. One day their father loses the cafe, the home and his wedding ring by gambling.See moreEddie Luca is the youngest son in a family of Italian immigrants who has moved to London. Beginning from nowhere, they open a cafe in an Italian neighborhood. One day their father loses the cafe, the home and his wedding ring by gambling.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "112"
    },
    "1989_162": {
        "plotSummary": "The life of a working class couple living in London and their complicated relationships with other members of the family.",
        "runtimeMinutes": "108"
    },
    "1989_163": {
        "plotSummary": "As France is nearing the end of the first Indochina War, an open-minded teenage boy finds himself torn between a rebellious urge to discover love, and the ever-present, almost dominating affection of his beloved mother.",
        "runtimeMinutes": "118"
    },
    "1989_164": {
        "plotSummary": "A young man hears a chance phone call telling him that a nuclear war has started and missiles will hit his city in 70 minutes.",
        "runtimeMinutes": "87"
    },
    "1989_165": {
        "plotSummary": "France before 1789: When a widow hears that her lover is to marry her cousin's daughter, she asks the playboy Valmont to take the girl's virginity. But first she bets him, with her body as prize, to seduce a virtuous, young, married woman.",
        "runtimeMinutes": "137"
    },
    "1989_166": {
        "plotSummary": "In order to get out of the snobby clique that is destroying her good-girl reputation, an intelligent teen teams up with a dark sociopath in a plot to kill the cool kids.",
        "runtimeMinutes": "103"
    },
    "1989_167": {
        "plotSummary": "Three young sorority women try to find love with potential men, while worrying about changes in their way of life when integration begins at their college in 1957 segregated Alabama.",
        "runtimeMinutes": "95"
    },
    "1989_168": {
        "plotSummary": "The ghost of John Belushi looks back on his troubled life and career, while journalist Bob Woodward researches Belushi's life as he prepares to write a book about the late comic actor.",
        "runtimeMinutes": "112"
    },
    "1989_169": {
        "plotSummary": "Aging opera singer Joachim Dallayrac retires from the stage and retreats to the countryside to school two young singers, Sophie and Jean. Although the rigorous training takes its toll on both teacher and students, there is plenty of time ...See moreAging opera singer Joachim Dallayrac retires from the stage and retreats to the countryside to school two young singers, Sophie and Jean. Although the rigorous training takes its toll on both teacher and students, there is plenty of time for relationships to develop between the three. Based on their teacher's reputation, Sophie and Jean are invited to participate in a singing contest staged by Prince Scotti. Scotti's protege is set up to get revenge for Scotti's defeat at the hands of Dallayrac in a similar competition many years ago. The young students overcome Scotti's trickery to win the competition.  Written by Kevin Kraynak See less",
        "runtimeMinutes": "100"
    },
    "1989_17": {
        "plotSummary": "A young beautician, newly arrived in a small Louisiana town, finds work at the local salon, where a small group of women share a close bond of friendship, and welcome her into the fold.",
        "runtimeMinutes": "117"
    },
    "1989_170": {
        "plotSummary": "Jake died in Vietnam; his family mourned him, then moved on. When he reappears, quite alive, the question is, what must he do and how will his family respond to him?See moreJake died in Vietnam; his family mourned him, then moved on. When he reappears, quite alive, the question is, what must he do and how will his family respond to him?  Written by Cleo See less",
        "runtimeMinutes": "92"
    },
    "1989_171": {
        "plotSummary": "After a tragic accident, a man conjures up a towering, vengeful demon called Pumpkinhead to destroy a group of unsuspecting teenagers.",
        "runtimeMinutes": "86"
    },
    "1989_172": {
        "plotSummary": "Gavin is thirty-one-years-old and still lives with his parents. He is awfully shy, but before he knows it, there are three women interested in him. Lady Minerva Munday has a casual way of life and lives in a basement, Joan is an over-sexed...See moreGavin is thirty-one-years-old and still lives with his parents. He is awfully shy, but before he knows it, there are three women interested in him. Lady Minerva Munday has a casual way of life and lives in a basement, Joan is an over-sexed millionairess, married to a Greek architect. But Gavin prefers the ugly assistant in the barbershop.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "102"
    },
    "1989_173": {
        "plotSummary": "An expert fighter leads an assault on the island lab of a madman making a virus for terrorists.",
        "runtimeMinutes": "89"
    },
    "1989_174": {
        "plotSummary": "A young boy living in 1950s suburbia suspects his parents are cannibalistic murderers.",
        "runtimeMinutes": "81"
    },
    "1989_175": {
        "plotSummary": "Rick and Melissa are a pair of young lovers hoping to get out of the slums for good and escape the poverty and crime their families and friends have gotten involved in. All this comes to an end when Rick feels he must rejoin his old gang ...See moreRick and Melissa are a pair of young lovers hoping to get out of the slums for good and escape the poverty and crime their families and friends have gotten involved in. All this comes to an end when Rick feels he must rejoin his old gang to avenge the killing of his brother by a rival gang. In the course of getting even, Rick is arrested, leaving Melissa without anyone to protect her. She falls in with a crack dealer and quickly becomes addicted to the drug. When she gets sold to a drug kingpin by a minor dealer to pay off a debt, only Rick can save her.  Written by Jean-Marc Rocher See less",
        "runtimeMinutes": "90"
    },
    "1989_176": {
        "plotSummary": "When a chemical warfare leaves the world barren and filled with mutated monsters, a band of survivors in a underground complex battles one of the creatures who was able to break in.",
        "runtimeMinutes": "88"
    },
    "1989_177": {
        "plotSummary": "A boy discovers an incredible and gruesome world of monsters under his bed.",
        "runtimeMinutes": "100"
    },
    "1989_178": {
        "plotSummary": "The Toxic Avenger is tricked into traveling to Tokyo to search for his estranged father, leaving Tromaville open to complete domination by an evil corporation.",
        "runtimeMinutes": "102"
    },
    "1989_179": {
        "plotSummary": "An in-depth look at various NASA moon landing missions, starting with Apollo 8.",
        "runtimeMinutes": "80"
    },
    "1989_18": {
        "plotSummary": "Harry and Sally have known each other for years, and are very good friends, but they fear sex would ruin the friendship.",
        "runtimeMinutes": "95"
    },
    "1989_180": {
        "plotSummary": "A London art broker goes to Copenhagen where he requires the services of a secretary fluent in Danish, English, and German. He falls deeply in love with the woman, despite the fact that he knows virtually nothing about her. She insists on ...See moreA London art broker goes to Copenhagen where he requires the services of a secretary fluent in Danish, English, and German. He falls deeply in love with the woman, despite the fact that he knows virtually nothing about her. She insists on not being married in a church, and after they are married, some bad things from her past begin surfacing in subtly supernatural ways, and he must find the best way to deal with them without destroying their relationship.  Written by Ed Sutton See less",
        "runtimeMinutes": "119"
    },
    "1989_181": {
        "plotSummary": "After an encounter with a neck-biter, a publishing executive thinks that he's turning into a vampire.",
        "runtimeMinutes": "103"
    },
    "1989_182": {
        "plotSummary": "The lives of an English working-class family are told out of order in a free-associative manner. The first part, \"Distant Voices\", focuses on the father's role in the family. The second part, \"Still Lives\", focuses on his children.",
        "runtimeMinutes": "84"
    },
    "1989_183": {
        "plotSummary": "A servant in the house of Wuthering Heights tells a traveler the unfortunate tale of lovers Cathy and Heathcliff.",
        "runtimeMinutes": "104"
    },
    "1989_184": {
        "plotSummary": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
        "runtimeMinutes": "102"
    },
    "1989_185": {
        "plotSummary": "A Montreal construction worker joins a band and turns out to be a long-lost rock star from 1960s New Jersey - none other than Eddie Wilson, who mysteriously disappeared after a road accident.",
        "runtimeMinutes": "196"
    },
    "1989_186": {
        "plotSummary": "A documentary film about the life of pianist and jazz great Thelonious Sphere Monk. Features live performances by Monk and his band, and interviews with friends and family about the offbeat genius.",
        "runtimeMinutes": "90"
    },
    "1989_187": {
        "plotSummary": "Eleanor lives with the artist Stash. Just like his artist friends, he is completely unknown but is waiting for the big break. Stash is mean to her and finally she leaves him. Ironically, she gets her big break - as a hat designer.See moreEleanor lives with the artist Stash. Just like his artist friends, he is completely unknown but is waiting for the big break. Stash is mean to her and finally she leaves him. Ironically, she gets her big break - as a hat designer.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "124"
    },
    "1989_188": {
        "plotSummary": "A young woman deals in her own personal way with the trials of adolescence and young adulthood in early 1900s England.",
        "runtimeMinutes": "113"
    },
    "1989_189": {
        "plotSummary": "A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psychic psychopath who can only be stopped by two teenagers and a group of psychics.",
        "runtimeMinutes": "124"
    },
    "1989_19": {
        "plotSummary": "A civilian diving team is enlisted to search for a lost nuclear submarine and faces danger while encountering an alien aquatic species.",
        "runtimeMinutes": "140"
    },
    "1989_190": {
        "plotSummary": "A cynical advertising exec has a block at work leading to a meltdown. He's hilariously out of control. Getting a big, talking boil on his shoulder doesn't help.",
        "runtimeMinutes": "90"
    },
    "1989_191": {
        "plotSummary": "In Greece during World War II, a young Jewish boxer, meets regularly with girlfriend Allegra until they and their families are sent to Auschwitz. When the Nazis learn of his boxing, they force him to participate in weekly boxing matches.",
        "runtimeMinutes": "120"
    },
    "1989_192": {
        "plotSummary": "Toxie finds he has nothing to do as a superhero, as he has ridden his city of evil. He decides to go to work for a major corporation, which he discovers may be the evilest of all his adversaries.",
        "runtimeMinutes": "102"
    },
    "1989_193": {
        "plotSummary": "A police detective tracks a serial killer who is stalking young women on a beach front after each game that a baseball pitcher wins.",
        "runtimeMinutes": "95"
    },
    "1989_194": {
        "plotSummary": "Robinson Crusoe is shipwrecked and he finds himself all alone on a tropical island. With a few tools he manages to rescue from the wreck he has to learn to support himself until help arrives.",
        "runtimeMinutes": "91"
    },
    "1989_195": {
        "plotSummary": "Sunny is married to the Ernie; their marriage is about to end as both of them have affairs. One evening drunken Ernie and Dave have a fight which results on Ernie getting knocked out in the fridge where he dies during the night.",
        "runtimeMinutes": "92"
    },
    "1989_196": {
        "plotSummary": "Depicts the struggles of reservation-dwelling Native Americans in the North Central United States. The main character is an introspective and lovable person in a process of seeking pride and identity through traditional and mystical means ...See moreDepicts the struggles of reservation-dwelling Native Americans in the North Central United States. The main character is an introspective and lovable person in a process of seeking pride and identity through traditional and mystical means of gathering power. His high school friend, who is a Vietnam War Veteran, is exerting power as a highly principled social activist, using a modern rational materialist adversarial model of progress.  Written by Stan Detering See less",
        "runtimeMinutes": "88"
    },
    "1989_197": {
        "plotSummary": "A young detective becomes involved with a beautiful woman on the run from the mob and her psychopath boyfriend.",
        "runtimeMinutes": "94"
    },
    "1989_198": {
        "plotSummary": "Celebrity confessions about their first sexual experiences.",
        "runtimeMinutes": "74"
    },
    "1989_199": {
        "plotSummary": "A young girl lost in the loneliness and boredom of reality finds solace in an ill boy, whom she can visit in a surreal dream world that she drew in her school composition book.",
        "runtimeMinutes": "92"
    },
    "1989_2": {
        "plotSummary": "The Dark Knight of Gotham City begins his war on crime with his first major enemy being Jack Napier, a criminal who becomes the clownishly homicidal Joker.",
        "runtimeMinutes": "126"
    },
    "1989_20": {
        "plotSummary": "An Iowa corn farmer, hearing voices, interprets them as a command to build a baseball diamond in his fields; he does, and the 1919 Chicago White Sox come.",
        "runtimeMinutes": "107"
    },
    "1989_200": {
        "plotSummary": "Pierre Sauvage was born in a small village in France in 1944, among what would become as many as 5000 Jews who were helped by the collective efforts of the town, hidden from occupying Nazis by the kindly residents. This is a documentary by...See morePierre Sauvage was born in a small village in France in 1944, among what would become as many as 5000 Jews who were helped by the collective efforts of the town, hidden from occupying Nazis by the kindly residents. This is a documentary by Sauvage that explores the supernatural good will by the people in the village. Archival footage and interviews with surviving villagers illustrate their attitude toward their God, their obedience and the actions that saved the lives of thousands of people.See less",
        "runtimeMinutes": "93"
    },
    "1989_201": {
        "plotSummary": "Widower Guy is transferred to an English coastal town, where he joins an amateur operatic society to \"meet people\" and \"have fun\".",
        "runtimeMinutes": "105"
    },
    "1989_202": {
        "plotSummary": "Charles Highway (Dexter Fletcher) is in control of his life; he is about to finish sixth form college and start at Oxford. He is nineteen and wants an \"older\" woman before he turns twenty. Enter the beautiful Rachel Noyce (Ione Skye), and ...See moreCharles Highway (Dexter Fletcher) is in control of his life; he is about to finish sixth form college and start at Oxford. He is nineteen and wants an \"older\" woman before he turns twenty. Enter the beautiful Rachel Noyce (Ione Skye), and Charles puts his 'master-of-seduction' routines into top gear. Things however get complicated, Charles has a string of exes and a weird brother-in-law. Rachel has a boyfriend named Deforest (James Spader), and Charles' father has a mistress.  Written by Matthew Stanfield See less",
        "runtimeMinutes": "95"
    },
    "1989_203": {
        "plotSummary": "In this tongue-in-cheek sequel, the benevolent bog creature falls for the vegetarian, plant-loving daughter of the evil scientist who created him.",
        "runtimeMinutes": "89"
    },
    "1989_204": {
        "plotSummary": "A rich young boy arranges to be kidnapped so he'll get more attention from his parents.",
        "runtimeMinutes": "90"
    },
    "1989_205": {
        "plotSummary": "A retired British soldier struggles to adjust to everyday life, with increasing difficulty.",
        "runtimeMinutes": "105"
    },
    "1989_206": {
        "plotSummary": "Two NYC guys get jobs starting a nightclub in Smalltown, USA. They don't know it's a spy training model town in USSR .",
        "runtimeMinutes": "94"
    },
    "1989_207": {
        "plotSummary": "A student known for telling stories witnesses a murder, the latest in a series of satanic killings of hookers.",
        "runtimeMinutes": "93"
    },
    "1989_208": {
        "plotSummary": "Nick Rainwood and Allie Yorpin are a modern day Romeo and Juliet living in southern California, separated by the unbridgeable gulf of their backgrounds and torn between loyalty to their \"gangs\" and their real desires.",
        "runtimeMinutes": "103"
    },
    "1989_209": {
        "plotSummary": "Film school grad Nick Chapman thought his career was made after his award winning short film, but discovered Hollywood wasn't as easy as it seems.",
        "runtimeMinutes": "100"
    },
    "1989_21": {
        "plotSummary": "Bachelor and all-round slob Buck babysits his brother's rebellious teenage daughter and her cute younger brother and sister.",
        "runtimeMinutes": "100"
    },
    "1989_210": {
        "plotSummary": "A member of an up and coming motorcycle racing team abandons his teamates to join a rival team. He ends up playing second fiddle to the champion of the new team. Not satisfied, and against the wishes of his new boss, he tries to beat the ...See moreA member of an up and coming motorcycle racing team abandons his teamates to join a rival team. He ends up playing second fiddle to the champion of the new team. Not satisfied, and against the wishes of his new boss, he tries to beat the champion but fails. He leaves racing, eventually to return and reunite with his old friends in an attempt to win the Grand Prix.  Written by FryinghamSee less",
        "runtimeMinutes": "104"
    },
    "1989_211": {
        "plotSummary": "A touching story of life in rural Maine, and the changes brought about by the closing of a town's small boat-building company -- on which many of the residents depended upon for a living.",
        "runtimeMinutes": "90"
    },
    "1989_212": {
        "plotSummary": "Rita and Dana Lund's marriage is in a crisis, Rita's frustrated from being just a housewife. To save their marriage, they set out for a camping trip through California with their son. At a camping site they meet the hitch-hiker Eric, who ...See moreRita and Dana Lund's marriage is in a crisis, Rita's frustrated from being just a housewife. To save their marriage, they set out for a camping trip through California with their son. At a camping site they meet the hitch-hiker Eric, who befriends their son. Against Rita's will, Dana takes him with them, not knowing that he's a brutal psychopath who'll force their son to participate in his nightly trips of vandalism.  Written by Tom Zoerner See less",
        "runtimeMinutes": "93"
    },
    "1989_213": {
        "plotSummary": "A man's story parallels Hitler's rise. Austrian Klaus Schneider, wounded in World War I, recovers in the care of Dr. Emil Bettleheim. Bettleheim discovers that Schneider possesses powers of empathy and of clairvoyance, such that could aid ...See moreA man's story parallels Hitler's rise. Austrian Klaus Schneider, wounded in World War I, recovers in the care of Dr. Emil Bettleheim. Bettleheim discovers that Schneider possesses powers of empathy and of clairvoyance, such that could aid suicidal patients. After the war, with one friend as his manager and another as his lover, Schneider changes his name to Eric Jan Hanussen and goes to Berlin, as a hypnotist and clairvoyant performing in halls and theaters. He always speaks the truth, which brings him to the attention of powerful Nazis. He predicts their rise (good propaganda for them) and their violence (not so good). He's in pain and at risk. What is Hanussen's future?  Written by See less",
        "runtimeMinutes": "140"
    },
    "1989_214": {
        "plotSummary": "A man's enthusiastic penis starts talking to him, getting him into awkward situations and convincing everyone he tells that he's completely insane.See moreA man's enthusiastic penis starts talking to him, getting him into awkward situations and convincing everyone he tells that he's completely insane.  Written by Keith Tyler See less",
        "runtimeMinutes": "93"
    },
    "1989_215": {
        "plotSummary": "A college class, Psychology of Fear, has a new teacher who believes that you have to feel fear to understand it. A group of students convene at the teacher's house, where scary stories are told.",
        "runtimeMinutes": "90"
    },
    "1989_216": {
        "plotSummary": "Bert Rigby lives in the small English town of Langmore, where most people depend on work at the local mine, which is faring poorly. While his mates are on strike once again, he decides to try his luck in show business. His first appearance...See moreBert Rigby lives in the small English town of Langmore, where most people depend on work at the local mine, which is faring poorly. While his mates are on strike once again, he decides to try his luck in show business. His first appearance on stage goes all wrong -- but the audience loves him. Rigby starts a new career as a comedian in a traveling amateur show for $50 a night. One day he gets an offer from an ad director from Hollywood and flies to the United States, expecting a great career and leaving behind his pregnant young wife.  Written by Tom Zoerner/Robert SiegerSee less",
        "runtimeMinutes": "94"
    },
    "1989_217": {
        "plotSummary": "A pair of children befriend an eccentric old man, who lives isolated on the far shore of their island home. But it turns out that the old man knows a terrible secret about the island and the narwhales who sometimes come. Meanwhile, World ...See moreA pair of children befriend an eccentric old man, who lives isolated on the far shore of their island home. But it turns out that the old man knows a terrible secret about the island and the narwhales who sometimes come. Meanwhile, World War I is making life hard in the village.  Written by Kathy LiSee less",
        "runtimeMinutes": "100"
    },
    "1989_218": {
        "plotSummary": "In a small European country, the king is scheduled to visit a small, quiet and \"safe\" village. It turns out that while the village may indeed be small, it's neither as quiet nor as safe as it's expected to be.",
        "runtimeMinutes": "96"
    },
    "1989_219": {
        "plotSummary": "A priest stuck in a rural congregation and burdened with his overwrought spirituality, finds purpose in a troubled woman accused of murder.",
        "runtimeMinutes": "98"
    },
    "1989_22": {
        "plotSummary": "To stop an elusive criminal, a maverick detective enlists the aid of a police dog who's an unusually intelligent smart alec.",
        "runtimeMinutes": "101"
    },
    "1989_220": {
        "plotSummary": "When a little boy witnesses a mob hit, he is kidnapped by two professional assassins who are not what they seem.",
        "runtimeMinutes": "86"
    },
    "1989_221": {
        "plotSummary": "A bunch of city slickers from different backgrounds go into the wild mountains to be one with nature, but basically to have a good time. However, a paramilitary group has chosen the same time to go camping. When one of the soldiers thinks ...See moreA bunch of city slickers from different backgrounds go into the wild mountains to be one with nature, but basically to have a good time. However, a paramilitary group has chosen the same time to go camping. When one of the soldiers thinks their boss has been killed by one of the city slickers, he coaxes his team into exterminating all of them. They will have to rely on their wits and on each other in order to survive.  Written by Steve Richer See less",
        "runtimeMinutes": "96"
    },
    "1989_222": {
        "plotSummary": "Comedy drama about a young journalist (Pamela Reed) who, upon returning to her Minnesota home town, begins to examine her life.",
        "runtimeMinutes": "85"
    },
    "1989_223": {
        "plotSummary": "Ten people are invited to go on an African safari, only to find that an unseen person is killing them one by one. Could one of them be the killer?",
        "runtimeMinutes": "98"
    },
    "1989_224": {
        "plotSummary": "Ira is a nervous playwright waiting and hoping to succeed with his art, which he takes it very seriously. But following his dreams and ambitions isn't something easy to do, specially when he has to consider the points of view his family, ...See moreIra is a nervous playwright waiting and hoping to succeed with his art, which he takes it very seriously. But following his dreams and ambitions isn't something easy to do, specially when he has to consider the points of view his family, his artist friends and his girlfriend will provide to him whenever he exposes his incomprehensible works of art.  Written by Rodrigo AmaroSee less",
        "runtimeMinutes": "85"
    },
    "1989_225": {
        "plotSummary": "This musical is based on four short stories by Damon Runyon. In one tale, gambler Feet Samuels (Randy Quaid) sells his body to science just as he realizes that Hortense Hathaway (Madonna) loves him and that he would rather live than die. ...See moreThis musical is based on four short stories by Damon Runyon. In one tale, gambler Feet Samuels (Randy Quaid) sells his body to science just as he realizes that Hortense Hathaway (Madonna) loves him and that he would rather live than die. In another story, Harriet MacKyle's (Julie Hagerty's) parrot is killed, and she has problems dealing with her loss. Then, there is a gambler, \"Regret\" (Matt Dillon), who has bloodhounds on his trail when he becomes a murder suspect. Finally, \"The Brain\" (Rutger Hauer) is bleeding profusely, and his friends search for a way to save his life through a blood transfusion.  Written by RachaelaSee less",
        "runtimeMinutes": "93"
    },
    "1989_226": {
        "plotSummary": "A sign language scholar's romance is disrupted by a chimp.",
        "runtimeMinutes": "85"
    },
    "1989_227": {
        "plotSummary": "A man returns to his sublet apartment to find the previous tenants, three offbeat young women, still in residence, under the mistaken belief that they have the apartment until the end of New Year's Day.",
        "runtimeMinutes": "88"
    },
    "1989_228": {
        "plotSummary": "A successful family man, who works for an airline, becomes consumed by fear of death after his colleague and best friend dies in front of him from heart attack while telling the setup for the joke: \"Why don't Italians like barbecues?\"",
        "runtimeMinutes": "96"
    },
    "1989_229": {
        "plotSummary": "High school misfit Louise, at a loss for romance, discovers magical abilities, but the teenage witch finds that she cannot conjure herself true love, so what?",
        "runtimeMinutes": "90"
    },
    "1989_23": {
        "plotSummary": "The spirit of a recently deceased expert pilot mentors a newer pilot while watching him fall in love with the girlfriend that he left behind.",
        "runtimeMinutes": "122"
    },
    "1989_230": {
        "plotSummary": "The love story between an Australian woman and a Balinese dancer.",
        "runtimeMinutes": "92"
    },
    "1989_231": {
        "plotSummary": "In the 19th century California, a Sicilian family of able winemakers gets target by a corrupt railroad tycoon after their refusal to leave their land.",
        "runtimeMinutes": "91"
    },
    "1989_232": {
        "plotSummary": "In the distant future, the human race nears extinction and a new race of beast-like creatures rule the earth. The few surviving people live in the City, a huge protected construction with the ability to travel in both space and time. The ...See moreIn the distant future, the human race nears extinction and a new race of beast-like creatures rule the earth. The few surviving people live in the City, a huge protected construction with the ability to travel in both space and time. The City travels back to our time to save humanity...  Written by Chris Makrozahopoulos See less",
        "runtimeMinutes": "87"
    },
    "1989_233": {
        "plotSummary": "A teenage girl and her father driving cross-country become stranded when their car runs out of gas in a remote Nevada desert town and they're forced to stay in a dilapidated trailer park where a serial killer lurks.",
        "runtimeMinutes": "86"
    },
    "1989_234": {
        "plotSummary": "A New York hooker tries to keep her daughter out of the clutches of the mobsters she works for.",
        "runtimeMinutes": "102"
    },
    "1989_235": {
        "plotSummary": "A family man and a mob witness hunt for a hit-man who has mistakenly kidnapped the family man's son.",
        "runtimeMinutes": "87"
    },
    "1989_236": {
        "plotSummary": "A hotshot car racer persuades the class president of a small Minnesota high school to gamble on illegal car races to raise money for their school facing closure.",
        "runtimeMinutes": "106"
    },
    "1989_24": {
        "plotSummary": "The Griswold family's plans for a big family Christmas predictably turn into a big disaster.",
        "runtimeMinutes": "97"
    },
    "1989_25": {
        "plotSummary": "A detective must adopt a rambunctious dog in order to help him find a killer.",
        "runtimeMinutes": "97"
    },
    "1989_26": {
        "plotSummary": "Framed by their ruthless arch-nemesis, a mismatched LAPD crime-fighting duo has to put its differences aside to even the score with the evil kingpin who put them behind bars once and for all.",
        "runtimeMinutes": "104"
    },
    "1989_27": {
        "plotSummary": "During the 1930s, a New York City illegal gambling house owner and his associates must deal with strong competition, gangsters, and corrupt cops in order to stay in business.",
        "runtimeMinutes": "116"
    },
    "1989_28": {
        "plotSummary": "After tragedy strikes, a grieving father discovers an ancient burial ground behind his home with the power to raise the dead.",
        "runtimeMinutes": "103"
    },
    "1989_29": {
        "plotSummary": "Captain Kirk and his crew must deal with Mr. Spock's long-lost half-brother who hijacks the Enterprise for an obsessive search for God at the center of the galaxy.",
        "runtimeMinutes": "107"
    },
    "1989_3": {
        "plotSummary": "After visiting 2015, Marty McFly must repeat his visit to 1955 to prevent disastrous changes to 1985...without interfering with his first trip.",
        "runtimeMinutes": "108"
    },
    "1989_30": {
        "plotSummary": "The new owner of the Cleveland Indians puts together a purposely horrible team so they'll lose and she can move the team. But when the plot is uncovered, they start winning just to spite her.",
        "runtimeMinutes": "107"
    },
    "1989_31": {
        "plotSummary": "An overstressed suburbanite and his neighbors are convinced that the new family on the block are part of a murderous Satanic cult.",
        "runtimeMinutes": "102"
    },
    "1989_32": {
        "plotSummary": "Dave is deaf, and Wally is blind. They witness a murder, but it was Dave who was looking at her, and Wally who was listening.",
        "runtimeMinutes": "103"
    },
    "1989_33": {
        "plotSummary": "A reformed bank robber is taken hostage by a desperate man during a bank hold up, but is forced to go on the run with his captor when they're both mistakenly thought to be in cahoots.",
        "runtimeMinutes": "96"
    },
    "1989_34": {
        "plotSummary": "Two seemingly dumb teens set off on a quest to prepare the ultimate historical presentation with the help of a time machine.",
        "runtimeMinutes": "90"
    },
    "1989_35": {
        "plotSummary": "After receiving an inheritance in Louisiana, Los Angeles reporter Irvin Fletcher heads to the Belle Isle plantation where he gets himself into hilarious trouble.",
        "runtimeMinutes": "95"
    },
    "1989_36": {
        "plotSummary": "Ostracised villain John Kreese attempts to gain revenge on Daniel and Miyagi, with the help of a Vietnam War comrade, the wealthy owner of a toxic waste disposal business.",
        "runtimeMinutes": "112"
    },
    "1989_37": {
        "plotSummary": "The almost-human son of \"Brundlefly\" searches for a cure to his mutated genes while being monitored by a nefarious corporation that wishes to continue his father's experiments.",
        "runtimeMinutes": "105"
    },
    "1989_38": {
        "plotSummary": "On the hottest day of the year on a street in the Bedford-Stuyvesant section of Brooklyn, everyone's hate and bigotry smolders and builds until it explodes into violence.",
        "runtimeMinutes": "120"
    },
    "1989_39": {
        "plotSummary": "The dedicated but tyrannical Joe Clark is appointed the principal of a decaying inner-city school and he is determined to improve by any and all means.",
        "runtimeMinutes": "108"
    },
    "1989_4": {
        "plotSummary": "After a single, career-minded woman is left on her own to give birth to the child of a married man, she finds a new romantic chance in a cab driver. Meanwhile, the point-of-view of the newborn boy is narrated through voice-over.",
        "runtimeMinutes": "93"
    },
    "1989_40": {
        "plotSummary": "An orphan bear cub hooks up with an adult male as they try to dodge human hunters.",
        "runtimeMinutes": "96"
    },
    "1989_41": {
        "plotSummary": "Two losers try to pretend that their murdered employer is really alive, leading the hitman to attempt to track him down to finish him off.",
        "runtimeMinutes": "97"
    },
    "1989_42": {
        "plotSummary": "A tough bouncer is hired to tame a dirty bar.",
        "runtimeMinutes": "114"
    },
    "1989_43": {
        "plotSummary": "Wendy and her brothers are whisked away to the magical world of Neverland with the hero of their stories, Peter Pan.",
        "runtimeMinutes": "77"
    },
    "1989_44": {
        "plotSummary": "Four mental patients on a field trip in New York City must save their caring chaperon, who ends up being taken to a hospital in a coma after accidentally witnessing a murder, before the killers can find him and finish the job.",
        "runtimeMinutes": "113"
    },
    "1989_45": {
        "plotSummary": "While his mom recovers in hospital from a heart attack, John puts his busy life on hold to fly home and help his elderly dad around the house. John's son later joins them and they all truly bond for the first and, tragically, final time.",
        "runtimeMinutes": "117"
    },
    "1989_46": {
        "plotSummary": "A canine angel, Charlie, sneaks back to earth from heaven but ends up befriending an orphan girl who can speak to animals. In the process, Charlie learns that friendship is the most heavenly gift of all.",
        "runtimeMinutes": "84"
    },
    "1989_47": {
        "plotSummary": "Robert Gould Shaw leads the U.S. Civil War's first all-black volunteer company, fighting prejudices from both his own Union Army, and the Confederates.",
        "runtimeMinutes": "122"
    },
    "1989_48": {
        "plotSummary": "A sexually repressed woman's husband is having an affair with her sister. The arrival of a visitor with a rather unusual fetish changes everything.",
        "runtimeMinutes": "100"
    },
    "1989_49": {
        "plotSummary": "The pregnant Alice finds Freddy Krueger striking through the sleeping mind of her unborn child, hoping to be reborn into the real world.",
        "runtimeMinutes": "89"
    },
    "1989_5": {
        "plotSummary": "Maverick teacher John Keating uses poetry to embolden his boarding school students to new heights of self-expression.",
        "runtimeMinutes": "128"
    },
    "1989_50": {
        "plotSummary": "With only six months left of his sentence, inmate Frank Leone is transferred from a minimum security prison to a maximum security prison by a vindictive warden.",
        "runtimeMinutes": "109"
    },
    "1989_51": {
        "plotSummary": "Two couples go to a mutual friend's wedding and end up swapping partners.",
        "runtimeMinutes": "113"
    },
    "1989_52": {
        "plotSummary": "A noble underachiever and a beautiful valedictorian fall in love the summer before she goes off to college.",
        "runtimeMinutes": "100"
    },
    "1989_53": {
        "plotSummary": "Two mice of the Rescue Aid Society search for a little girl kidnapped by unscrupulous treasure hunters.",
        "runtimeMinutes": "78"
    },
    "1989_54": {
        "plotSummary": "A man is framed by two corrupt cops for drugs. After he gets out of prison, he comes after them.",
        "runtimeMinutes": "113"
    },
    "1989_55": {
        "plotSummary": "A womanizing alcoholic writer, whose life seems to be falling apart at the seams, repeatedly finds himself in trouble of one sort or another with the law, ex-girlfriends, and jealous boyfriends.",
        "runtimeMinutes": "101"
    },
    "1989_56": {
        "plotSummary": "A middle-aged Louisiana governor falls in love with a young stripper, which jeopardizes his political career and the radical policies which have made him a controversial figure.",
        "runtimeMinutes": "120"
    },
    "1989_57": {
        "plotSummary": "Phil has writer's block after 30 detective novels. In court for inspiration, he sees a cute Romanian murder suspect. He provides her alibi. She stays with him. Will he live to write another novel?",
        "runtimeMinutes": "94"
    },
    "1989_58": {
        "plotSummary": "During the Vietnam War, a soldier finds himself the outsider of his own squad when they unnecessarily kidnap a female villager.",
        "runtimeMinutes": "113"
    },
    "1989_59": {
        "plotSummary": "A farm girl nurses a wounded reindeer she believes is one of Santa's, hoping to bring it back to health in time for Christmas. Her holiday spirit inspires those around her, something her disheartened father is having trouble understanding.",
        "runtimeMinutes": "103"
    },
    "1989_6": {
        "plotSummary": "Riggs and Murtaugh are on the trail of South African diplomats who are using their immunity to engage in criminal activities.",
        "runtimeMinutes": "114"
    },
    "1989_60": {
        "plotSummary": "The lives of two struggling musicians, who happen to be brothers, inevitably change when they team up with a beautiful, up-and-coming singer.",
        "runtimeMinutes": "114"
    },
    "1989_61": {
        "plotSummary": "An ophthalmologist's mistress threatens to reveal their affair to his wife while a married documentary filmmaker is infatuated with another woman.",
        "runtimeMinutes": "104"
    },
    "1989_62": {
        "plotSummary": "After being sent to the electric chair, a serial killer uses electricity to come back from the dead and carry out his vengeance on the football player who turned him in to the police.",
        "runtimeMinutes": "109"
    },
    "1989_63": {
        "plotSummary": "A reincarnated man unknowingly falls in love with his own daughter from his previous life. Once he realizes this, he tries to end their relationship before angels erase his memory.",
        "runtimeMinutes": "108"
    },
    "1989_64": {
        "plotSummary": "A TV-network boss pits a wrestler called Zeus against a wrestler called Rip in a wrestling match.",
        "runtimeMinutes": "93"
    },
    "1989_65": {
        "plotSummary": "Truman, a Chicago cop, sets out to find the killer of his brother. Meanwhile, another of his brothers, Briar (a hillbilly) decides to find the killer himself.",
        "runtimeMinutes": "108"
    },
    "1989_66": {
        "plotSummary": "An American deep-sea mining colony stumbles upon a sunken Soviet vessel hiding a horrific secret.",
        "runtimeMinutes": "98"
    },
    "1989_67": {
        "plotSummary": "A surprisingly resourceful housewife vows revenge on her husband when he begins an affair with a wealthy romance novelist.",
        "runtimeMinutes": "99"
    },
    "1989_68": {
        "plotSummary": "Christy Brown, born with cerebral palsy, learns to paint and write with his only controllable limb - his left foot.",
        "runtimeMinutes": "103"
    },
    "1989_69": {
        "plotSummary": "Kurt Sloane must learn the ancient kick boxing art of Muay Thai in order to avenge his brother.",
        "runtimeMinutes": "97"
    },
    "1989_7": {
        "plotSummary": "The scientist father of a teenage girl and boy accidentally shrinks his and two other neighborhood teens to the size of insects. Now the teens must fight diminutive dangers as the father searches for them.",
        "runtimeMinutes": "93"
    },
    "1989_70": {
        "plotSummary": "A boatful of graduating high school students headed to Manhattan accidentally pull Jason Voorhees along for the ride.",
        "runtimeMinutes": "100"
    },
    "1989_71": {
        "plotSummary": "A boy and his brother run away from home and hitch cross country with the help of a girl they meet to compete in the ultimate video game championship.",
        "runtimeMinutes": "96"
    },
    "1989_72": {
        "plotSummary": "The life and career of wildly controversial rock 'n' roll star Jerry Lee Lewis.",
        "runtimeMinutes": "108"
    },
    "1989_73": {
        "plotSummary": "An ex professor offers Adam $1,000,000 to \"get\" some plasma from a high tech company's lab. Adam asks his criminal grandpa for help. Can they convince Adam's now honest dad to join?",
        "runtimeMinutes": "110"
    },
    "1989_74": {
        "plotSummary": "Skip tracer Tommy looks for bail-jumper Lou Ann. Her crime is marrying Roy, who left counterfeit money in their mobile home and got her arrested. She leaves Roy in his pink Cadillac full of money. His psycho friends want their money back.",
        "runtimeMinutes": "122"
    },
    "1989_75": {
        "plotSummary": "When an average-looking teenage girl gets a makeover, it's enough to make her father become overprotective of her.",
        "runtimeMinutes": "90"
    },
    "1989_76": {
        "plotSummary": "One year after the events of Halloween 4: The Return of Michael Myers, the Shape returns to Haddonfield once again in an attempt to kill his now-mute niece.",
        "runtimeMinutes": "96"
    },
    "1989_77": {
        "plotSummary": "A fisherman's son goes through medical school with a bad attitude, especially in cadaver class.",
        "runtimeMinutes": "109"
    },
    "1989_78": {
        "plotSummary": "Those bumbling cadets take to the streets when three inept goons successfully orchestrate a metropolitan crime wave.",
        "runtimeMinutes": "84"
    },
    "1989_79": {
        "plotSummary": "Albert Einstein turns the science community upside down with his discoveries including a formula to put bubbles back in beer and rock n' roll.",
        "runtimeMinutes": "91"
    },
    "1989_8": {
        "plotSummary": "The discovery of a massive river of ectoplasm and a resurgence of spectral activity allows the staff of Ghostbusters to revive the business.",
        "runtimeMinutes": "108"
    },
    "1989_80": {
        "plotSummary": "Harry Crumb is a bumbling and inept private investigator who is hired to solve the kidnapping of a young heiress which he's not expected to solve because his employer is the mastermind behind the kidnapping.",
        "runtimeMinutes": "94"
    },
    "1989_81": {
        "plotSummary": "A middle-aged artist obsessed with his pretty young assistant, a precocious 12 year old living in a hotel, and a neurotic lawyer with a possessive mother make up three Gotham tales.",
        "runtimeMinutes": "124"
    },
    "1989_82": {
        "plotSummary": "Experienced Green Beret sergeant Johnny Gallagher is escorting a prisoner, Airborne Ranger Thomas Boyette, back to the US, but Boyette escapes and Gallagher must risk life and limb to catch him.",
        "runtimeMinutes": "108"
    },
    "1989_83": {
        "plotSummary": "Two escaped cons only prayer to escape is to pass themselves off as priests and pass by the police blockade at the border into the safety of Canada.",
        "runtimeMinutes": "106"
    },
    "1989_84": {
        "plotSummary": "A martial artist hunts a killer in a plague-infested urban dump of the future.",
        "runtimeMinutes": "86"
    },
    "1989_85": {
        "plotSummary": "In the midst of the Hundred Years War, the young King Henry V of England embarks on the conquest of France in 1415.",
        "runtimeMinutes": "137"
    },
    "1989_86": {
        "plotSummary": "A lawyer defends a killer, but soon after he wins, he finds out that the killer is guilty.",
        "runtimeMinutes": "117"
    },
    "1989_87": {
        "plotSummary": "Just released from prison, Max Washington must decide which of his previous professions to return to: burglar or tap dancer.",
        "runtimeMinutes": "111"
    },
    "1989_88": {
        "plotSummary": "An undercover cop forms an alliance with a Native American to help him hunt down the criminals who stole an ancient Lakota tribal lance.",
        "runtimeMinutes": "106"
    },
    "1989_89": {
        "plotSummary": "Based on the Profumo Scandal of 1963, an affair between an exotic dancer and the Minister of War shakes up the British government.",
        "runtimeMinutes": "115"
    },
    "1989_9": {
        "plotSummary": "A mermaid princess makes a Faustian bargain in an attempt to become human and win a prince's love.",
        "runtimeMinutes": "83"
    },
    "1989_90": {
        "plotSummary": "A cynical former civil liberties attorney now reduced to \"specializing\" in defending drug dealers becomes transformed by an eight-year-old murder case.",
        "runtimeMinutes": "105"
    },
    "1989_91": {
        "plotSummary": "A soon to be divorced Beverly Hills socialite is determined to prove to her husband and herself that she can finish what she starts out to do, by becoming a den mother to a troop of Beverly Hills Girl Scouts.",
        "runtimeMinutes": "105"
    },
    "1989_92": {
        "plotSummary": "Ted and Susan, an American boy and girl spending six months in Kenya with their scientist parents, adopt a cheetah, only to realize that they must set her loose so that she can learn to hunt and be free. However, when she is captured by ...See moreTed and Susan, an American boy and girl spending six months in Kenya with their scientist parents, adopt a cheetah, only to realize that they must set her loose so that she can learn to hunt and be free. However, when she is captured by poachers planning to race her against greyhounds, Ted and Susan, together with Morogo, a young African goat herder they befriended, head off into the wild to rescue her.  Written by David Mullich See less",
        "runtimeMinutes": "83"
    },
    "1989_93": {
        "plotSummary": "At the bottom of the ocean, the DeepStar Six has just discovered a new and deadly alien menace.",
        "runtimeMinutes": "99"
    },
    "1989_94": {
        "plotSummary": "A man kills a storekeeper and a cop. LASD homicide detective Jerry Beck gets the case. His murder suspect is connected to a heavily armed white supremacy group.",
        "runtimeMinutes": "102"
    },
    "1989_95": {
        "plotSummary": "An account of Baron Munchausen's supposed travels and fantastical experiences with his band of misfits.",
        "runtimeMinutes": "126"
    },
    "1989_96": {
        "plotSummary": "After a tragedy, John Ingram and his wife Rae are spending some time isolated at sea, when they come across a stranger who has abandoned a sinking ship.",
        "runtimeMinutes": "96"
    },
    "1989_97": {
        "plotSummary": "A ghostwriter finds himself romantically involved with his current wife, a married woman and his long-vanished wife.",
        "runtimeMinutes": "119"
    },
    "1989_98": {
        "plotSummary": "Career criminal Frank plans a bank heist and sends for his buddies to help pull the job. Before his buddies arrive, he's caught, forcing his cohorts to pull the job alone. Frank soon escapes, setting off a search by the bumbling cops.",
        "runtimeMinutes": "98"
    },
    "1989_99": {
        "plotSummary": "After General Motors closes its factory in Flint, Michigan, eliminating 35,000 jobs, filmmaker Michael Moore undertakes a quixotic quest to interview General Motors' chairman, Roger B. Smith .",
        "runtimeMinutes": "91"
    }
}