{
    "1990_1": "After a young man is murdered, his spirit stays behind to warn his lover of impending danger, with the help of a reluctant psychic.",
    "1990_10": "A tough cop must pose as a kindergarten teacher in order to locate a dangerous criminal's ex-wife, who may hold the key to putting him behind bars.",
    "1990_100": "The sequel to Chinatown finds J.J. \"Jake\" Gittes investigating adultery and murder, and the money that comes from oil.",
    "1990_101": "An ex-con's first act of freedom is moving to Miami where he restarts his old criminal ways with even more potency.",
    "1990_102": "In 1950s Cuba, a professional gambler falls for a woman heavily involved in the revolution movement.",
    "1990_103": "A troubled young man is drawn to a mythical place called Midian where a variety of friendly monsters are hiding from humanity. Meanwhile, a sadistic serial killer is looking for a patsy.",
    "1990_104": "A developer attempts to sabotage the safety record of a ski resort.",
    "1990_105": "In 1950s Baltimore, a bad boy with a heart of gold wins the love of a good girl, whose boyfriend sets out for revenge.",
    "1990_106": "A rookie in the police force must engage in a cat-and-mouse game with a pistol-wielding psychopath who becomes obsessed with her.",
    "1990_107": "When Duffy Bergman, a New York City cartoonist, meets Meg Lloyd, a gourmet chef, he discovers the love of his life and they marry, yet love alone isn't enough to make them happy. Meg decides she wants to have a baby, a goal that initially ...See moreWhen Duffy Bergman, a New York City cartoonist, meets Meg Lloyd, a gourmet chef, he discovers the love of his life and they marry, yet love alone isn't enough to make them happy. Meg decides she wants to have a baby, a goal that initially makes Duffy frantic, but soon becomes his most important desire as well. When they are unable to have a baby, Meg begins concentrating on her career and the two slowly drift apart, eventually separating. Later, when Duffy is speaking at a convention of the Delta Gamma sorority, he reveals that the Delta Gamma girls have always been his dream girls, his Love Goddesses. There, he meets the young and uninhibited Delta Gamma girl, Daphne Delillo. When Daphne moves to New York City to work as a network sports reporter, their mutual attraction, and Daphne's spontaneity spark an adventurous new relationship for Duffy. Now Duffy must decide which is more valuable to him, the relationship he has given up, or the relationship he has always dreamed of having.See less",
    "1990_108": "At Le Hollandais gourmet restaurant, every night is filled with opulence, decadence, and gluttony. But when the cook, a thief, his wife and her lover all come together, they unleash a shocking torrent of sex, food, murder and revenge.",
    "1990_109": "Set during World War II, an upper-class family begins to fall apart due to the conservative nature of the patriarch and the progressive values of his children.",
    "1990_11": "In November 1984, the Soviet Union's best submarine Captain in their newest sub violates orders and heads for the U.S. Is he trying to defect or to start a war?",
    "1990_110": "A spoiled Manhattan housewife re-evaluates her life after visiting a Chinatown healer.",
    "1990_111": "A small-time crook becomes convinced he is an angel after a traumatic incident and resolves to perform the work of one.",
    "1990_112": "When DEA agents are taken captive by a ruthless South American kingpin, the Delta Force is reunited to rescue them in this sequel to the 1986 film.",
    "1990_113": "In 1989, clean-cut FBI man John Buckner is detailed to escort heavily-bearded Huey Walker back to jail for offenses dating back to his days as a celebrated hippie radical. After Walker dupes Buckner on the train he falls into the hands of ...See moreIn 1989, clean-cut FBI man John Buckner is detailed to escort heavily-bearded Huey Walker back to jail for offenses dating back to his days as a celebrated hippie radical. After Walker dupes Buckner on the train he falls into the hands of a couple of well-meaning refugees from the 60's, the two men with apparently nothing in common find themselves on the run together. But appearances can be deceptive.  Written by Jeremy Perkins {J-26}See less",
    "1990_114": "6 people comically meet in the Kalahari desert: a female NYC lawyer flying with a local zoologist/pilot in a mini-plane, a Cuban and an African soldier taking each other POW, a Boer elephant poacher and a bushman looking for his 2 children.",
    "1990_115": "A mother of two sons finds life considerably difficult on her own after the death of her beloved husband. Due to debt she must move them to Baltimore, and deal with the hardships and all that comes with the city life.See moreA mother of two sons finds life considerably difficult on her own after the death of her beloved husband. Due to debt she must move them to Baltimore, and deal with the hardships and all that comes with the city life.  Written by MasoK See less",
    "1990_116": "The unburied dead return to life and seek human victims.",
    "1990_117": "Famed swordsman and poet Cyrano de Bergerac is in love with his cousin Roxane. He has never expressed his love for her as he his large nose undermines his self-confidence. Then he finds a way to express his love to her, indirectly.",
    "1990_118": "A struggling widow falls in love with an illiterate short-order cook whom she teaches to read and write in her kitchen each night.",
    "1990_119": "A California couple and a survivalist encounter Leatherface and his family.",
    "1990_12": "The comic strip detective finds his life vastly complicated when Breathless Mahoney makes advances towards him while he is trying to battle Big Boy Caprice's united mob.",
    "1990_120": "The head of a cyborg reactivates, rebuilds itself, and goes on a violent rampage in a space marine's girlfriend's apartment.",
    "1990_121": "An unconventional cop who doesn't take any bull, is paired up with an amazing detective to capture some powerful criminals but the cop soon realizes that his by the book partner has split personality disorder.",
    "1990_122": "Tom Reagan, an advisor to a Prohibition-era crime boss, tries to keep the peace between warring mobs but gets caught in divided loyalties.",
    "1990_123": "In a dystopian, polluted right wing religious tyranny, a young woman is put in sexual slavery on account of her now rare fertility.",
    "1990_124": "Two women, black and white, in 1955 Montgomery Alabama, must decide what they are going to do in response to the famous bus boycott lead by Martin Luther King.",
    "1990_125": "The emergence and devastation of the AIDS epidemic is chronicled in the lives of several gay men living during the 1980s.",
    "1990_126": "The unofficial sequel to 'Purple Rain' (1984). The Kid is now club owner and rival to Morris (Morris Day) who get into a fight for the Glam Slam Nightclub. Read more: Synopsis",
    "1990_127": "A Renegade Cop is forced to work with an FBI Agent in order to bring down a group of Drug Dealers with sinister plans.",
    "1990_128": "A flirtatious teenager with an eye for older men gets more than she bargained for when the handsome stranger she's pursuing turns out to be a serial killer.",
    "1990_129": "Kevin Laird is a Beverly Hills school teacher by day and a mystery man by night. Using his lambada dance moves to first earn the kid's respect and acceptance, Kevin then teaches them academics. But when a jealous student exposes Kevin's ...See moreKevin Laird is a Beverly Hills school teacher by day and a mystery man by night. Using his lambada dance moves to first earn the kid's respect and acceptance, Kevin then teaches them academics. But when a jealous student exposes Kevin's double life, his two worlds collide, threatening his job and reputation.  Written by CarolyneSee less",
    "1990_13": "A young hot-shot stock car driver gets his chance to compete at the top level.",
    "1990_130": "Drama set in the 1950s, based on a true story, about a young girl, Sung Neng Yee, who is brought as part of a wealthy Chinese family. She is eager to become part of Mao Tze Tung's \"new society\", but soon becomes disenchanted by the ...See moreDrama set in the 1950s, based on a true story, about a young girl, Sung Neng Yee, who is brought as part of a wealthy Chinese family. She is eager to become part of Mao Tze Tung's \"new society\", but soon becomes disenchanted by the economic misery the changes bring to her family. Before long, the authorities become aware of Neng Yee's feelings and she is taken to a labour camp, overseen by the sadistic Colonel Cheng.  Written by Jonathan Broxton See less",
    "1990_131": "A racist cop receives a heart transplant from a black lawyer he hates, who returns as a ghost to ask the cop to help take down the men who murdered him.",
    "1990_132": "An unbalanced but alluring former mental patient takes a porn star prisoner in the hopes of convincing her to marry him.",
    "1990_133": "The legendary true-story of Capt. Richard Francis Burton and Lt. John Hanning Speke's tumultuous expedition to find the source of the Nile river.",
    "1990_134": "When a police detective thinks he is dying and learns that his life insurance pays out more if he dies in the line of duty, he tries to make that happen.",
    "1990_135": "A small town prepares for the homecoming of superstar Roxy Carmichael, as does a young outsider, who believes Roxy is her mother.",
    "1990_136": "Three life-long friends work the bars in 1980's Atlantic City performing the songs of the 60's girl groups in this self-indulgent comedy.",
    "1990_137": "When you think you're at the top of the corporate ladder and then discover they have managed to pull that ladder away, sometimes you have to take it upon yourself to \"level\" the playing field, both professionally and personally. Sir ...See moreWhen you think you're at the top of the corporate ladder and then discover they have managed to pull that ladder away, sometimes you have to take it upon yourself to \"level\" the playing field, both professionally and personally. Sir Michael Caine delivers an electrifying performance as Graham Marshall, who quickly catches onto the possibilities as he clears all the hurdles to occupy the corner office.  Written by Edgy01See less",
    "1990_138": "A group of young upper-class Manhattanites are blithely passing through the gala debutante season, when an unusual outsider joins them and stirs them up.",
    "1990_139": "An escaped con, on the run from the law, moves into a married couple's house and takes over their lives.",
    "1990_14": "Jack Cates once again enlists the aid of ex-con Reggie Hammond - this time to take down The Iceman, a ruthless drug lord operating in the San Francisco bay area.",
    "1990_140": "A blind Vietnam vet, trained as a swordfighter, comes to America and helps to rescue the son of a fellow soldier.",
    "1990_141": "An ex-boxer is drifting around after escaping from the mental hospital. He meets a widow who convinces him to help fix up the neglected estate her ex-husband left. Her Uncle talks them both into helping kidnap a rich boy for ransom money, ...See moreAn ex-boxer is drifting around after escaping from the mental hospital. He meets a widow who convinces him to help fix up the neglected estate her ex-husband left. Her Uncle talks them both into helping kidnap a rich boy for ransom money, and the ex-fighter must make decisions about his loyalties and what is right.  Written by Ed Sutton See less",
    "1990_142": "A drug kingpin is released from prison and seeks to take total control of the criminal underworld in order to give back to the community.",
    "1990_143": "Lottie is a vice cop in LA posing as a hooker and likes the action. She meets Stan, who's also single. He needs her for a major drug bust.",
    "1990_144": "Three ex-military robots are reprogrammed as teachers and secretly placed in a school where most students are part of organized gangs. They begin to respond violently to unruly students, and their military training starts to take over.",
    "1990_145": "A research project on sexual response leads two doctors into an affair where their deepest passions and darkest fantasies are revealed.",
    "1990_146": "Police Officer Alex Kearney works in a rich, plush suburb of Philadelphia. When he stops an important businessman and his story of the incident is not believed, he is sent to work Downtown, the most dangerous, crime-filled precinct in the ...See morePolice Officer Alex Kearney works in a rich, plush suburb of Philadelphia. When he stops an important businessman and his story of the incident is not believed, he is sent to work Downtown, the most dangerous, crime-filled precinct in the city. Everyone there is sure that this 'by the book', pampered, suburban cop is going to get himself, and whoever is assigned as his partner, killed. Detective Dennis Curren, draws the unfortunate 'babysitting' assignment. But when Alex's best friend is killed investigating a stolen car, Alex throws the book out the window tracking down the killer.  Written by Brian W Martz See less",
    "1990_147": "A thinly fictionalized account of a legendary movie director, whose desire to hunt down an animal turns into a grim situation with his movie crew in Africa.",
    "1990_148": "When a young woman investigates her town's Nazi past, the community turns against her.",
    "1990_149": "The summer of 1984: 32 years after Duane Jackson captained the high school football team and Jacy Farrow was homecoming queen, the small town of Anarene, Texas prepares for its centennial celebration. Oil prices are down, banks are failing...See moreThe summer of 1984: 32 years after Duane Jackson captained the high school football team and Jacy Farrow was homecoming queen, the small town of Anarene, Texas prepares for its centennial celebration. Oil prices are down, banks are failing, and Duane's $12 million in debt. His wife Karla drinks too much, his children are always in trouble, and he tom-cats around with the wives of friends. Jacy's back in town, after a mildly successful acting career, life in Italy, and the death of her son. People assume Duane and Jacy will resume their high school romance. And Sonny is \"tired in his mind,\" causing worries for his safety. Can these friends find equilibrium in middle age?  Written by See less",
    "1990_15": "An old flame discovers her ex-boyfriend from the past is a relocated FBI informant out to stop the bad guys.",
    "1990_150": "The familiar tragic story of Vincent van Gogh is broadened by focusing as well on his brother Theodore, who helped support Vincent. The movie also provides a nice view of the locations which Vincent painted.",
    "1990_151": "An evil succubus is preying on libidinous black men in New York City, and all that stands in her way is a minister-in-training, an aspiring actor, and a cop who specializes in cases involving the supernatural.",
    "1990_152": "A group of young and middle-aged women gather for the birthday party of a friend and talk about their lives and food they cook for their husbands, boyfriends, or themselves.",
    "1990_153": "An American couple travel abroad to revitalize their relationship. But as the trip drags on, their attempt at recovering what they once had seems futile.",
    "1990_154": "This fact-based movie follows the life of the twin crime-lords in London's '60s underworld.",
    "1990_155": "A collection of tales based upon the actual dreams of director Akira Kurosawa.",
    "1990_156": "A New York cop is recruited to return to his hometown and infiltrate the mob ran by his best friend's brother.",
    "1990_157": "A princess in the Amazon rain forest tries to fight a conglomerate threatening the forests by going to Los Angeles. There she links up with a rich kid who tells her that she must get on TV to succeed with her mission. The two come up with ...See moreA princess in the Amazon rain forest tries to fight a conglomerate threatening the forests by going to Los Angeles. There she links up with a rich kid who tells her that she must get on TV to succeed with her mission. The two come up with the idea of winning a lambada dance contest that is getting TV attention.  Written by John Sacksteder See less",
    "1990_158": "New Orleans, 1951: A law student, working at WXBU radio station, falls in love with his cute aunt, who's looking for a third husband. Then Pedro starts writing radio series at WXBU, stirring up things.",
    "1990_159": "An adaption of the classic tale of a girl's dreams turned reality when her new toy turns out to be a young man placed under a curse.",
    "1990_16": "Mario Puzo's THE GODFATHER, Coda: The Death of Michael Corleone follows Michael Corleone, now in his 60s, as he seeks to free his family from crime and find a suitable successor to his empire.",
    "1990_160": "A sharp love triangle is formed by a wealthy businessman.",
    "1990_161": "Set in Brooklyn during the 1950s against a backdrop of union corruption and violence. A prostitute falls in love with one of her customers. Also a disturbed man discovers that he is homosexual.",
    "1990_162": "Together, a weary cop and an all business FBI agent, team up to catch the latest homicidal manic: The Rain Killer. Just when they think that all the clues have been washed away, they find the one last clue; the one that's been in plain ...See moreTogether, a weary cop and an all business FBI agent, team up to catch the latest homicidal manic: The Rain Killer. Just when they think that all the clues have been washed away, they find the one last clue; the one that's been in plain sight.  Written by Concorde - New Horizons (with permission).See less",
    "1990_163": "In a showdown of man versus machine, Martin plunges into a chaotic nightmare trying to save his mind from the megalomaniacal corporation.",
    "1990_164": "A group of actors put on an unorthodox, but acclaimed Passion Play which incites the opposition of the Catholic Church while the actors' lives themselves begin to mirror the Passion itself.",
    "1990_165": "During the events of May 1968 in France, different worldviews of conflicting relatives are collide in their family estate.",
    "1990_166": "A witch is put to death in Colonial America, leaving her husband and infant daughter behind. Seventeen years later, the daughter has grown up and stands to inherit money set up by her mother's family. Now that the stage is set, the mother ...See moreA witch is put to death in Colonial America, leaving her husband and infant daughter behind. Seventeen years later, the daughter has grown up and stands to inherit money set up by her mother's family. Now that the stage is set, the mother wants to return to life by taking over her daughter's body.  Written by Ed Sutton See less",
    "1990_167": "4 LA cops are fighting the war on drugs. Corrupt superiors manage to break up their team when one of them gets killed. The 3 quit LAPD and continue investigating.",
    "1990_168": "The story of runaways living in Venice, California, under the threat of a psychotic cop who is a serial killer of prostitutes.",
    "1990_169": "A boy crash-lands in Canada bear country and survives with a hatchet his divorced mother gave him.",
    "1990_17": "Reluctantly retired from fighting, Rocky takes charge of Mickey's gym and agrees to train a young protege who's hungry for success.",
    "1990_170": "When a field (which has been farmed by the McCabe family for generations) goes up for auction, the patriarch of the McCabe family will stop at nothing to prevent a rich American from buying it.",
    "1990_171": "Vampish miss Dolan hires hardboiled P.I. Harry Dobbs to tail her shady boyfriend. Harry realizes that the man leads a double life but then his client disappears. Harry teams up with his own tail, P.I. Stella Wynkowski, to clear things up.",
    "1990_172": "A recluse is accused of murdering a young woman simply because his neighbors think he is strange.",
    "1990_173": "In this version of \"Heidi,\" a young Swiss girl is sent off to boarding school at the beginning of World War I.",
    "1990_174": "Parody of The Exorcist, with Linda Blair once again possessed by Satan, and Leslie Nielsen as the exorcist.",
    "1990_175": "Bickering siblings are reunited at their Texas home as their father lies on his deathbed.",
    "1990_176": "Angela (Debra Winger) hires/lures a P.I. (Nick Nolte) to prove a convicted teenager is innocent of his uncle's murder.",
    "1990_177": "Cold War drama about two gung-ho border commanders (Roy Scheider, Jurgen Prochnow) who carry out their own private war against each other on the German - Czechoslovakia border.",
    "1990_178": "Upon arriving to a small town, a drifter quickly gets into trouble with the local authorities - and the local women - after he robs a bank.",
    "1990_179": "Kickboxing champion Jake Raye thought his fighting days were over, until a call from an old friend draws him to the Far East and into the hands of a madman. This time Jake's fighting for his life!See moreKickboxing champion Jake Raye thought his fighting days were over, until a call from an old friend draws him to the Far East and into the hands of a madman. This time Jake's fighting for his life!  Written by Concorde - New Horizons (with permission).See less",
    "1990_18": "An artificial man, who was incompletely constructed and has scissors for hands, leads a solitary life. Then one day, a suburban lady meets him and introduces him to her world.",
    "1990_180": "A couple of guys in a spaceship are cruising the surface of a remote planet. One guy wonders if this is indeed Frank's planet, while the other is intent upon running an errand.",
    "1990_181": "In the distant future, mankind has forsaken global wars for battles of single combat. The world has been divided into two opposing super powers, with each side represented by trained champions.",
    "1990_182": "Jackie Cassidy and her friends are stalked by a serial killer while having a slumber party.",
    "1990_183": "A movie resembling Bicycle Thieves is shown on TV, but the real-life world gets muddled with the film and the TV commercials.",
    "1990_184": "The story of a group of third-year students at a Los Angeles medical school and their struggles with love, their studies and one another.",
    "1990_185": "Sandra Bernhard stars in a studio version of her off-Broadway show, blending re-enactments of the original show's pieces with concept vignettes and 'testimonials' to underscore the relationship between a performer and an audience.",
    "1990_186": "Cartoonist Gus has survived cancer treatment and now his romance novelist sister tries to find him a woman and guide him. Will they succeed?",
    "1990_187": "A charismatic old acquaintance drifts into town, stirring up trouble for a mild-mannered family.",
    "1990_188": "Stewart McBain (Coleman) is a real-estate mogul who spends his living blowing up old buildings to make room to erect new buildings. All goes as planned for a new subdivision, until a group of protesters object to the destruction of one ...See moreStewart McBain (Coleman) is a real-estate mogul who spends his living blowing up old buildings to make room to erect new buildings. All goes as planned for a new subdivision, until a group of protesters object to the destruction of one lonely, ugly building, called the Dutch House. Typically, the media is sent to the scene of the protest, and McBain appears on TV in a bad way. His children - Daphne (Thurman), Chloe (Amis), and Jimmy (Hewlett) - ridicule him for appearing on TV, and as a reward for their remarks, he drops them off at the Dutch House with $750 apiece, and tells them they're on their own. They must find jobs if they expect to make money to stay warm. McBain and his wife Jean watch from afar as their children adapt to their new lifestyle, meeting new friends, and inviting others into their new home, including a decrepit bum.  Written by Ari Herzog See less",
    "1990_189": "When an American human rights lawyer is assassinated in Belfast, it remains for the man's girlfriend, as well as a tough, no nonsense, police detective to find the truth.",
    "1990_19": "A young boy is just short of a monster. He is adopted by a loving man and his wacky wife. The laughs keep coming as the boy pushes them to the limits.",
    "1990_190": "In the frantic world of Wall Street, four top executives have a small problem with their boss; he's dead. Now they've got to hide his body for the next 24 hours to pull off the deal of the century.See moreIn the frantic world of Wall Street, four top executives have a small problem with their boss; he's dead. Now they've got to hide his body for the next 24 hours to pull off the deal of the century.  Written by Concorde - New Horizons (with permission).See less",
    "1990_191": "The passionate romance between an Irish-American man and a Japanese-American woman is threatened when the Pearl Harbor attacks happen and the woman is forced into a prison camp because of her ethnicity.",
    "1990_192": "An introspective young woman's life is upturned by the arrival of her maladjusted sister.",
    "1990_193": "In a future where most of mankind and technology is wiped out, six people travel from place to place playing a brutal form of football with a dog skull. They hope one day to play in the league in a city.",
    "1990_194": "Tenant helps landlord fight off local street gang.",
    "1990_195": "A former vaudevillian magician (MacLaine) moves her straight-laced niece (Garr) and her two mischievous children to a small town. When the two kids get in trouble with a neighbor for stealing vegetables from his garden, the aunt concocts ...See moreA former vaudevillian magician (MacLaine) moves her straight-laced niece (Garr) and her two mischievous children to a small town. When the two kids get in trouble with a neighbor for stealing vegetables from his garden, the aunt concocts an illusion of ghosts in revenge. Only trouble is the whole town believes it is real and soon the press is swarming the town and a major magic trick is required for everyone to save face.  Written by John Sacksteder See less",
    "1990_196": "",
    "1990_197": "A unique look at the legendary musician, arranger, composer and producer offers a collage of memories, sounds and intimate interviews with musical greats in a rousing showcase.",
    "1990_198": "A rapid-fire look at life in the city through the eyes of a confused, overwhelmed man. A subway train speeds past, bicycles whiz by. People march to work. It's rhythmic chaos: figures are trapped in small brick rooms. A knife wielding ...See moreA rapid-fire look at life in the city through the eyes of a confused, overwhelmed man. A subway train speeds past, bicycles whiz by. People march to work. It's rhythmic chaos: figures are trapped in small brick rooms. A knife wielding mugger menaces our bewildered man. Then, ancient designs appear and we go back in time to an earlier civilization: drums, dancers with candles, and masked performers appear. But are these old ways any less frenzied?  Written by See less",
    "1990_199": "An expatriate American doctor in London allows herself to lighten up when her freewheeling younger sister and a mysterious man enter her life. Her inhibitions released, the beautiful doctor learns that freedom has its own price.",
    "1990_2": "An eight-year-old troublemaker must protect his house from a pair of burglars when he is accidentally left home alone by his family during Christmas vacation.",
    "1990_20": "Three ex-dads quickly discover how empty life is without their little lady, and go to outrageous lengths in their efforts to win their daughter back in this critically acclaimed and equally charming sequel.",
    "1990_200": "Three bickering brothers who don't get along reluctantly go on a cross country road trip together to deliver a car in time for their mother's birthday.",
    "1990_201": "In this action-packed sequel, a retired drug dealer living in Paris discovers his old partner has been killed and returns to NY to avenge his murder.",
    "1990_202": "Henry, a drifter, commits a series of brutal murders, supposedly operating with impunity.",
    "1990_203": "A kindly but thieving shopaholic tries to turn her mistakes around, but does so by becoming a skilled computer hacker, something that could only get her into more trouble despite her goal to impress her beloved family.",
    "1990_204": "A London accountant on his honeymoon gets swept away by gambling fever.",
    "1990_205": "A nasty comedian's assistant has allergy induced sneezes, giving problems at work, et cetera. He accepts weekly injections after seeing the cute nurse. After a dozen injections, he finally asks her out.",
    "1990_206": "The ultimate weapon, which was meant to be safe for humankind, produces global side-effects, including time slides and disappearances. The scientist behind the project and his car are transported from the year 2031 to 1817's Switzerland, ...See moreThe ultimate weapon, which was meant to be safe for humankind, produces global side-effects, including time slides and disappearances. The scientist behind the project and his car are transported from the year 2031 to 1817's Switzerland, where he finds Dr. Victor Frankenstein and his contemporaries.  Written by Kimmo Ketolainen See less",
    "1990_207": "In 1955 Florida, a Korean vet has a breakdown and is incarcerated in a \"maximum security\" mental health prison, where patients are abused.",
    "1990_208": "A Warband intent on slaughter terrorizes northern Scandinavian villages in 1000 AD.",
    "1990_209": "A medical student sets out to recreate his decapitated fiancee by building her a new body made of Manhattan street prostitutes.",
    "1990_21": "Five medical students experiment with \"near death\" experiences, until the dark consequences of past tragedies begin to jeopardize their lives.",
    "1990_210": "Song writer Mark Devereaux accidentally calls millions of green Martians to invade Earth. No they aren't dangerous, just wise-cracking, intrusive, pain in neck, annoyances. No one can escape their distracting influence. It's up to Mark to ...See moreSong writer Mark Devereaux accidentally calls millions of green Martians to invade Earth. No they aren't dangerous, just wise-cracking, intrusive, pain in neck, annoyances. No one can escape their distracting influence. It's up to Mark to figure out how they got here, and most importantly, how to get rid of them before they drive everyone crazy!  Written by Brian W Martz See less",
    "1990_211": "In 1840, a young Russian aristocrat, Dimitri Sanin, is returning home after a long tour of Europe. In Germany, he falls in love with a beautiful pastry shop girl, Gemma Rosselli, who soon starts sharing his feelings. They decide to get ...See moreIn 1840, a young Russian aristocrat, Dimitri Sanin, is returning home after a long tour of Europe. In Germany, he falls in love with a beautiful pastry shop girl, Gemma Rosselli, who soon starts sharing his feelings. They decide to get married and, in order to finance the wedding, Dimitri goes back to Russia to sell his family estate. Unfortunately he falls prey to a seductress, Princess Maria Nikolaevna, who pretends to be willing to buy his land to come nearer him. Now Sanin is in a fix: should he choose the pure Gemma or the evil but irresistible Maria?  Written by Guy BellingerSee less",
    "1990_212": "In the midst of WWII, a group of half-witted soldiers led by a slightly smarter sergeant, battle the Germans and especially Von Kraut in the desert.See moreIn the midst of WWII, a group of half-witted soldiers led by a slightly smarter sergeant, battle the Germans and especially Von Kraut in the desert.  Written by Steve Richer See less",
    "1990_213": "An American journalist in Puerto Rico in 1978 investigates the death of nationalists who may have been murdered by the police.",
    "1990_214": "During World War II, an American serviceman in London decides to impress his English girlfriend by acting as an American gangster, which soon turns deadly.",
    "1990_215": "A jewel thief steals a sacred ruby which sets off a chase by the police, the Turkish government, nutty American terrorists, and the C.I.A.",
    "1990_216": "A Protestant Irish family is caught up in a conflict between Irish Republicans and the British army.",
    "1990_217": "A struggling actor's job as a hotel custodian is a front for his real job: being rented out as a gigolo by his supervisor. A co-worker is obsessed with him, but he ignores and avoids her. He leaves his acting resume in the hotel room of a ...See moreA struggling actor's job as a hotel custodian is a front for his real job: being rented out as a gigolo by his supervisor. A co-worker is obsessed with him, but he ignores and avoids her. He leaves his acting resume in the hotel room of a screenwriter, who is casting for a TV movie based on the true story of her deceased brother. She hires him to play the lead and the two begin an affair. She becomes increasingly distraught as it becomes evident that the movie's producer is changing her story. Egoyan's trademark tangle of bizarre relationships surrounds the protagonists on their way to a mind-blowing conclusion. A hypnotic, fascinating film.See less",
    "1990_218": "Christopher leaves to pursue a career in writing. Due to a computer mixup he shares a dorm room with Alex whom he presumes is a man. However, Alex is the beautiful Alexandra! When upon first meeting her she gets on his nerves by partying ...See moreChristopher leaves to pursue a career in writing. Due to a computer mixup he shares a dorm room with Alex whom he presumes is a man. However, Alex is the beautiful Alexandra! When upon first meeting her she gets on his nerves by partying and being with different men while at school! She is very outgoing. Christopher tries to get another roommate but while trying to get switched, she helps him in different ways by improving his love life and writing ability. The both of them fall in love with each other, but Alex has a boyfriend Slash who comes back for her. After putting her name on the wall of a men's bathroom, she realizes she is better of with Chris.See less",
    "1990_219": "In 2176, a magnetic storm erases all recorded history, including the U.S. Constitution, so, three time travelers are sent back to July 4, 1776, to retrieve the heritage, but end up in 1976's Bicentennial, while being perceived as aliens.",
    "1990_22": "After a famous author is rescued from a car crash by a fan of his novels, he comes to realize that the care he is receiving is only the beginning of a nightmare of captivity and abuse.",
    "1990_220": "A young man finds out that his parents had been used in an atomic-weapons experiment shortly before he was born, and that the results have had some unexpected effects on him.",
    "1990_221": "Delusional and spoiled Maureen and her eccentric brother Howdy decide to track down and meet their estranged mother, all while the drama of dysfunctional relationships, disastrous weather conditions and a dark family secret ensue.",
    "1990_222": "A surfer enjoys life with drug money together with his gang in 1980s California. His girlfriend is pregnant and will not be in a house with drugs and guns and is going to Portland OR. Can he quit the drugs, the gang and that last big deal?",
    "1990_223": "When the man who left a package in his care is murdered, detective Tim Diamond suddenly has every major gangster in the city after him. With only the package and the help of his little brother, he sets out to unravel the mysterious plot.",
    "1990_224": "When Dolf Beeler enters Bud Bullard's hardware store with his cigar lit and ignores the no-smoking store policy, this small faux pas turns into an escalating fiery feud. However, not all members of the two families hate each other.",
    "1990_23": "A retired DEA agent is out to hunt down and take out a Jamaican drug posse that has targeted he and his family for murder.",
    "1990_24": "The Predator returns to Earth, this time to stake a claim on the war-torn streets of a dystopian Los Angeles.",
    "1990_25": "A species of South American killer spider hitches a lift to the U.S. in a coffin and starts to breed and kill.",
    "1990_26": "The victims of an encephalitis epidemic many years ago have been catatonic ever since, but now a new drug offers the prospect of reviving them.",
    "1990_27": "A brilliant scientist left for dead returns to exact revenge on the people who burned him alive.",
    "1990_28": "This time, a new baby is on the way, and it's a girl. Wrapped together with the standard conflict between mother and father, Mikey engages in a bit of sibling rivalry with his new sister.",
    "1990_29": "Left for dead with his wife killed in their house, L.A. Detective Mason Storm will have to make a quick recovery, expose those behind the murder and take revenge.",
    "1990_3": "A man in a legal but hurtful business needs an escort for some social events, and hires a beautiful prostitute he meets... only to fall in love.",
    "1990_30": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.",
    "1990_31": "Cyborg law enforcer RoboCop returns to protect the citizens of old Detroit but faces a deadly challenge when a rogue OCP member secretly creates a new, evil RoboCop 2.",
    "1990_32": "A couple work hard to renovate their dream house and become landlords to pay for it. Unfortunately, one of their tenants has plans of his own.",
    "1990_33": "Bagheera the Panther and Baloo the Bear have a difficult time trying to convince a boy to leave the jungle for human civilization.",
    "1990_34": "In 1881, cattle baron John Chisum pays a bounty to Patrick Floyd Garrett to kill outlaw Billy the Kid.",
    "1990_35": "The Gremlins are back, and this time, they've taken control of a New York City media mogul's high-tech skyscraper.",
    "1990_36": "When a hypochondriac learns that he is dying, he accepts an offer to throw himself in a volcano at a tropical island, and along the way there, learns to truly live.",
    "1990_37": "A substance-addicted actress tries to look on the bright side even as she is forced to move back in with her mother to avoid unemployment.",
    "1990_38": "A police Lieutenant uncovers more than he bargained for as his investigation of a series of murders, which have all the hallmarks of the deceased Gemini serial killer, leads him to question the patients of a psychiatric ward.",
    "1990_39": "While Andy's mother is admitted to a psychiatric hospital, the young boy is placed in foster care, and Chucky, determined to claim Andy's soul, is not far behind.",
    "1990_4": "Lieutenant John Dunbar, assigned to a remote western Civil War outpost, befriends wolves and Indians, making him an intolerable aberration in the military.",
    "1990_40": "An unconventional single mother relocates with her two daughters to a small Massachusetts town in 1963, where a number of events and relationships both challenge and strengthen their familial bonds.",
    "1990_41": "A young pilot finds himself recruited unwittingly into a covert and corrupt C.I.A. airlift organization operating in Vietnam War-era Laos.",
    "1990_42": "A man wanting to stay in the US enters into a marriage of convenience, but it turns into more than that.",
    "1990_43": "The R.A.S. agents, Miss Bianca and Bernard, race to Australia to save a little boy and a rare golden eagle from a murderous poacher.",
    "1990_44": "An Internal Affairs agent becomes obsessed with bringing down a cop who has managed to maintain a spotless reputation despite being involved in a web of corruption.",
    "1990_45": "Joey gets 2 days to sell 12 cars to keep his job and keep his girlfriends happy. It gets worse. He's juggling 3 buyers when a guy with a machine gun crashes into the car dealership and takes everybody hostage.",
    "1990_46": "In 1943, the crew of a B-17 based in UK prepares for its 25th and last bombing mission over Germany before returning home to the USA.",
    "1990_47": "Kid decides to go to his friend Play's house party, but neither of them can predict what's in store for them on what could be the wildest night of their lives.",
    "1990_48": "Mourning his dead child, a haunted Vietnam War veteran attempts to uncover his past while suffering from a severe case of dissociation. To do so, he must decipher reality and life from his own dreams, delusions, and perceptions of death.",
    "1990_49": "A widowed father tries to support his children after he becomes a ghost in an accident.",
    "1990_5": "When a man goes for virtual vacation memories of the planet Mars, an unexpected and harrowing series of events forces him to go to the planet for real - or is he?",
    "1990_50": "A collection of animated interpretations of great works of Western classical music.",
    "1990_51": "A battle-hardened SEAL Team sets off on a mission to destroy a shipment of US-built Stinger missiles that have fallen into terrorist hands.",
    "1990_52": "Bank janitor Ernest P. Worrell is called to jury duty and soon finds himself in trouble when the lookalike defendant's attorney arranges a switch and has Ernest sent to prison in his client's place.",
    "1990_53": "An all too uptight FBI agent must protect a larger than life mobster with a heart of gold, currently under witness protection in the suburbs.",
    "1990_54": "In 1931 Paris, Anais Nin meets Henry Miller and his wife June. Intrigued by them both, she begins expanding her sexual horizons with her husband Hugo as well as with Henry and others. June shuttles between Paris and New York trying to find...See moreIn 1931 Paris, Anais Nin meets Henry Miller and his wife June. Intrigued by them both, she begins expanding her sexual horizons with her husband Hugo as well as with Henry and others. June shuttles between Paris and New York trying to find acting jobs while Henry works on his first major work, \"Tropic of Cancer,\" a pseudo-biography of June. Anais and Hugo help finance the book, but June is displeased with Henry's portrayal of her, and Anais and Henry have many arguments about their styles of writing on a backdrop of a Bohemian lifestyle in Paris.  Written by Ed Sutton See less",
    "1990_55": "An expatriate British publisher unexpectedly finds himself working for British intelligence to investigate people in Russia.",
    "1990_56": "A dedicated L.A. police detective and a female psychic must stop a demonic serial killer who was given the powers of resurrection, teleportation and possession.",
    "1990_57": "A veteran detective gets stuck with a rookie cop when in pursuit of a German crook.",
    "1990_58": "An N.Y.C. film school student accepts a job with a local mobster who resembles a famous cinema godfather and who takes the young man under his wing, after demanding total loyalty.",
    "1990_59": "A vulgar private detective is hired to find a missing groupie and is drawn into a mystery involving a series of murders tied to the music industry.",
    "1990_6": "Stranded in 1955, Marty McFly learns about the death of Doc Brown in 1885 and must travel back in time to save him. With no fuel readily available for the DeLorean, the two must figure how to escape the Old West before Emmett is murdered.",
    "1990_60": "Sharpshooter Matt Quigley is hired from Wyoming by an Australian rancher paying a very high price. But when Quigley arrives Down Under, all is not as it seems.",
    "1990_61": "A young psychiatric intern unearths secrets about the mental health facility in which he works.",
    "1990_62": "Hamlet, Prince of Denmark, finds out that his uncle Claudius killed his father to obtain the throne, and plans revenge.",
    "1990_63": "George Jetson is forced to uproot his family when Mr. Spacely promotes him to take charge of a new factory on a distant planet.",
    "1990_64": "Chronicling a strong, but eccentric woman's devoted relationship to her daughter through the years.",
    "1990_65": "An uptight advertising exec has his entire life in a filofax organizer which mistakenly ends up in the hands of a friendly convict who poses as him.",
    "1990_66": "The very different Betsy and Jake are getting married. They want a small wedding but their dads want to give a big.",
    "1990_67": "Scrooge McDuck takes Huey, Dewey, and Louie to Egypt to find a pyramid and magic lamp.",
    "1990_68": "A frustrated woman's life gets even more frustrating once she gets into an affair with a man who suffers a fatal heart attack after their fling.",
    "1990_69": "Lust turns to love for a 40-ish working-class woman and a 20-ish yuppie adman with little in common.",
    "1990_7": "John McClane attempts to avert disaster as rogue military operatives seize control of Dulles International Airport in Washington, D.C.",
    "1990_70": "A young couple with a newborn baby don't realize that the nanny they hired is a magical nymph who sacrifices infants to an evil tree.",
    "1990_71": "In a violent and corrupt prison, decorated cop Louis Burke must infiltrate the jail to find answers to a number of inside murders. What he finds is a struggle of life and death tied in to his own past.",
    "1990_72": "Natives of a small isolated town defend themselves against strange underground creatures which are killing them one by one.",
    "1990_73": "A young boy tells three stories of horror to distract a witch who plans to eat him.",
    "1990_74": "Two garbage men uncover a conspiracy involving illegal toxic waste dumping and decide to bring the whole operation down.",
    "1990_75": "Joey Boca (Kevin Kline) owns a pizza parlor, and is married to Rosalie (Tracey Ullman). He's also a serial womanizer. Rosalie goes to extremes when she finds he has been cheating.",
    "1990_76": "Jazz trumpeter Bleek Gilliam makes questionable decisions in his professional and romantic lives.",
    "1990_77": "A Polish-Jewish family comes to the U.S. at the beginning of the twentieth century. There, the family and their children try to make themselves a better future in the so-called promised land.",
    "1990_78": "After his mistress runs over a young teen, a Wall Street hotshot sees his life unravel in the spotlight and attracting the interest of a down and out reporter.",
    "1990_79": "A retired US Navy pilot comes to Mexico, where he falls in love with the wife of a powerful businessman. The consequences will be cruel and unforeseen.",
    "1990_8": "As a lawyer investigates the murder of a colleague, he finds himself more connected to the crime than anyone else.",
    "1990_80": "Wealthy Sunny von Bülow lies brain-dead, husband Claus guilty of attempted murder; but he says he's innocent and hires Alan Dershowitz for his appeal.",
    "1990_81": "Unhappy Larry Burrows sees what his life could've been like, had he made that winning home run as a teenager.",
    "1990_82": "Dimwitted Martians drop into a little Illinois town on the day that the local radio station happens to rebroadcast Orson Welles 1938 \"War Of The Worlds\".",
    "1990_83": "Three thieves successfully rob a New York City bank, but making the escape from the city proves to be almost impossible.",
    "1990_84": "Elite Apache helicopter pilots are tasked with destroying powerful armed drug cartels operating in South America.",
    "1990_85": "Young lovers Sailor and Lula run from the variety of weirdos that Lula's mom has hired to kill Sailor.",
    "1990_86": "Stranded on an island, a group of schoolboys degenerate into savagery.",
    "1990_87": "A small-time conman has torn loyalties between his estranged mother and new girlfriend, both of whom are high-stakes grifters with their own angles to play.",
    "1990_88": "A bitter ad executive who has reached his breaking point, finds himself in a mental institution where his career actually begins to thrive with the help of the hospital's patients.",
    "1990_89": "A soft and hesitant young man is in danger when tries to break toxic relationships with a mysterious stranger claiming to be his friend.",
    "1990_9": "Four teenage mutant ninja turtles emerge from the shadows to protect New York City from a gang of criminal ninjas.",
    "1990_90": "A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship with the cinema's projectionist.",
    "1990_91": "In a very old textile mill with a serious rat infestation, deadly accidents start happening, but the corrupt foreman continues to put his workers in danger, until they discover a horrifying secret deep in the basement.",
    "1990_92": "Mark runs a pirate radio station and causes an uproar when he speaks his mind and enthralls fellow teens.",
    "1990_93": "Two con men hide out in a house while the owner is away; one of them assumes the identity of the absent house sitter when the owner's relatives come to visit, only for further complications to set in.",
    "1990_94": "When dirty cop Mike shoots a man and plants a gun on him, rookie assistant DA Al gets the case. Something in the Q&A of Mike isn't right. Bodies pile up as Al tries to solve the case.",
    "1990_95": "A female lawyer becomes mesmerized by a self-made millionaire during an encounter in Rio setting off a series of erotic encounters.",
    "1990_96": "2 criminals want out but their boss kills those leaving. When the men are ordered to rob the triad, they keep the money and hide from the boss, triad and police at a convent, dressed as nuns.",
    "1990_97": "A Los Angeles Deputy District Attorney is sent to protect a woman who accidentally witnessed a Mafia murder.",
    "1990_98": "A young boy stumbles onto a witch convention and must stop them, even after he has been turned into a mouse.",
    "1990_99": "The adventures of a young cat and a dog as they find themselves accidentally separated and each swept into a hazardous trek."
}