{
    "1991_1": {
        "plotSummary": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her teenage son, John Connor, from a more advanced and powerful cyborg.",
        "runtimeMinutes": "137"
    },
    "1991_10": {
        "plotSummary": "On the verge of turning 40, an unhappy Manhattan yuppie is roped into joining his two friends on a cattle drive in the southwest.",
        "runtimeMinutes": "113"
    },
    "1991_100": {
        "plotSummary": "A tough Alabama cop is blackmailed by the FBI into going undercover in a violent Mississippi biker gang.",
        "runtimeMinutes": "92"
    },
    "1991_101": {
        "plotSummary": "A warlock flees from the 17th to the 20th century, with a witch-hunter in hot pursuit.",
        "runtimeMinutes": "103"
    },
    "1991_102": {
        "plotSummary": "Two young men evading the police for a crime they didn't commit are cryogenically frozen in the early 1960s. The next thing they know is that they are in a strange new world (thirty years on).",
        "runtimeMinutes": "99"
    },
    "1991_103": {
        "plotSummary": "The story of the rise and fall of an African American vocal group.",
        "runtimeMinutes": "121"
    },
    "1991_104": {
        "plotSummary": "A runaway circus dog befriends a young boy who has trouble fitting in with his friends.",
        "runtimeMinutes": "89"
    },
    "1991_105": {
        "plotSummary": "A businessman and his friends are captured by a sadistic judge and his equally odd family in the backwoods of a bizarre mansion.",
        "runtimeMinutes": "94"
    },
    "1991_106": {
        "plotSummary": "In the 17th century, a Jesuit missionary nicknamed Black Robe by the natives and his small party of companions try reaching the Huron tribe in Canada all while facing mistrust, Iroquois warring parties and harsh winter conditions.",
        "runtimeMinutes": "101"
    },
    "1991_107": {
        "plotSummary": "Michael has to take summer class in French, a class trip to France, to graduate high school. He is, however, mistaken for an agent and people try to kill him. There are 007 style cars, cuties, crooks etc.",
        "runtimeMinutes": "88"
    },
    "1991_108": {
        "plotSummary": "Two black friends, one of lighter skin complexion than the other, try to use each other to improve their social and professional positions.",
        "runtimeMinutes": "84"
    },
    "1991_109": {
        "plotSummary": "Forced by the imminent foreclosure of their friend's bar, two lifelong buddies will decide to rob a bank's armored car, not knowing that its cargo is not money but a new street drug.",
        "runtimeMinutes": "98"
    },
    "1991_11": {
        "plotSummary": "A young woman fakes her own death in an attempt to escape her nightmarish marriage, but discovers it is impossible to elude her controlling husband.",
        "runtimeMinutes": "99"
    },
    "1991_110": {
        "plotSummary": "Thrilled by a performance she sees at a fair, Sonora tries to land a spot as a daredevil who rides horses off of high dives.",
        "runtimeMinutes": "88"
    },
    "1991_111": {
        "plotSummary": "Two small-town Texas cops go undercover to catch a major drug dealer and are sucked into the drug culture, compromising their assignment.",
        "runtimeMinutes": "120"
    },
    "1991_112": {
        "plotSummary": "An interstellar hero from a distant world visits Earth, and tries to fit in with a mundane, yet kind, suburban family.",
        "runtimeMinutes": "90"
    },
    "1991_113": {
        "plotSummary": "A lawyer is hired to defend an old college friend accused of murdering her husband.",
        "runtimeMinutes": "104"
    },
    "1991_114": {
        "plotSummary": "Two best friends living on the streets of Portland as hustlers embark on a journey of self discovery and find their relationship stumbling along the way.",
        "runtimeMinutes": "104"
    },
    "1991_115": {
        "plotSummary": "A young woman who exudes sexuality battles temptation.",
        "runtimeMinutes": "112"
    },
    "1991_116": {
        "plotSummary": "Tom's in love with the cute house sitter next door. He's too shy but his older brother visits and helps Tom with the first date. Things don't go as planned.",
        "runtimeMinutes": "97"
    },
    "1991_117": {
        "plotSummary": "A renowned New York playwright is enticed to California to write for the movies and discovers the hellish truth of Hollywood.",
        "runtimeMinutes": "116"
    },
    "1991_118": {
        "plotSummary": "A boy in Nazi Germany, trying to conceal that he is Jewish, joins the Hitler Youth.",
        "runtimeMinutes": "112"
    },
    "1991_119": {
        "plotSummary": "A soap opera writer gets hit on the head and wakes up as a character in his own show.",
        "runtimeMinutes": "96"
    },
    "1991_12": {
        "plotSummary": "Two Chicago firefighter brothers, who don't get along, have to work together while a dangerous arsonist is on the loose.",
        "runtimeMinutes": "137"
    },
    "1991_120": {
        "plotSummary": "A young black reporter begins to lose his identity.",
        "runtimeMinutes": "96"
    },
    "1991_121": {
        "plotSummary": "A terrorist hunter is hired by a scientist to deactivate her android double, a walking, talking, murderous nuclear bomb which has gone amok in the big city and is about to explode.",
        "runtimeMinutes": "99"
    },
    "1991_122": {
        "plotSummary": "This story is about a ne'er do well and his girlfriend search for a thief.",
        "runtimeMinutes": "103"
    },
    "1991_123": {
        "plotSummary": "Convicted felon Nikita, instead of going to jail, is given a new identity and trained, stylishly, as a top secret spy/assassin.",
        "runtimeMinutes": "117"
    },
    "1991_124": {
        "plotSummary": "In order to escape from the mob, an African-American man must disguise himself as a white man.",
        "runtimeMinutes": "93"
    },
    "1991_125": {
        "plotSummary": "A Cop goes undercover as a Hitman to bring down a criminal organization.",
        "runtimeMinutes": "95"
    },
    "1991_126": {
        "plotSummary": "To get to know his girlfriend's son, a working-class good guy volunteers to pick him up from his prep school, only to learn that he isn't the nicest young man.",
        "runtimeMinutes": "107"
    },
    "1991_127": {
        "plotSummary": "When a law student accidentally kills the son of a mob boss in a fight, he finds himself relentlessly pursued by the mob and the police.",
        "runtimeMinutes": "91"
    },
    "1991_128": {
        "plotSummary": "The owner of a failing club seeks infamous Irish singer Josef Locke in order to bring business and success to his club. Read more: Synopsis",
        "runtimeMinutes": "113"
    },
    "1991_129": {
        "plotSummary": "A master of disguise deranged killer begins killing off the college students who are organizing a horror-movie marathon in an abandoned theater.",
        "runtimeMinutes": "91"
    },
    "1991_13": {
        "plotSummary": "A housewife who is unhappy with her life befriends an old lady in a nursing home and is enthralled by the tales she tells of people she used to know.",
        "runtimeMinutes": "130"
    },
    "1991_130": {
        "plotSummary": "A filthy rich businessman bets a corporate rival that he can live on the streets of L.A. without the comforts of home or money, which proves to be tougher than he thought.",
        "runtimeMinutes": "92"
    },
    "1991_131": {
        "plotSummary": "In 1830s France, pianist/composer Frederic Chopin is pursued romantically by the determined, individualistic woman who uses the name George Sand.",
        "runtimeMinutes": "107"
    },
    "1991_132": {
        "plotSummary": "A chronicle of New York's drag scene in the 1980s, focusing on balls, voguing and the ambitions and dreams of those who gave the era its warmth and vitality.",
        "runtimeMinutes": "71"
    },
    "1991_133": {
        "plotSummary": "A young department store intern falls in love with a female store mannequin who is really a peasant girl fallen under a thousand year spell. She comes to life whenever he removes the cursed necklace from her.",
        "runtimeMinutes": "95"
    },
    "1991_134": {
        "plotSummary": "A rodeo rider decides to quit his line of work after a serious injury, but when he visits his family and finds out that his dad is not well, he'll have to risk it one more time. Read more: Synopsis",
        "runtimeMinutes": "106"
    },
    "1991_135": {
        "plotSummary": "A new music teacher in a 1955 West Texas home for wayward boys brings new vision and hope for many of the interned boys.",
        "runtimeMinutes": "89"
    },
    "1991_136": {
        "plotSummary": "A Jewish homicide detective investigates a seemingly minor murder and falls in with a Zionist group as a result.",
        "runtimeMinutes": "102"
    },
    "1991_137": {
        "plotSummary": "A mental out-patient is mistaken for a missing wealthy man and a con man takes advantage of the situation.",
        "runtimeMinutes": "98"
    },
    "1991_138": {
        "plotSummary": "A coming of age story set in the south of the U.S. when Elvis was King.",
        "runtimeMinutes": "99"
    },
    "1991_139": {
        "plotSummary": "In this sequel to The Blue Lagoon, two children are stranded on a beautiful island in the South Pacific. With no adults to guide them, the two make a simple life together and eventually become suntanned teenagers in love.",
        "runtimeMinutes": "102"
    },
    "1991_14": {
        "plotSummary": "On the eve of retirement, Kirk and McCoy are charged with assassinating the Klingon High Chancellor and imprisoned. The Enterprise crew must help them escape to thwart a conspiracy aimed at sabotaging the last best hope for peace.",
        "runtimeMinutes": "110"
    },
    "1991_140": {
        "plotSummary": "A young man living in poverty makes a plan to rob a drug dealer and change the life of his family.",
        "runtimeMinutes": "91"
    },
    "1991_141": {
        "plotSummary": "After developing an addiction to the substance he uses to kill bugs, an exterminator accidentally kills his wife, and becomes involved in a secret government plot being orchestrated by giant bugs in a port town in North Africa.",
        "runtimeMinutes": "115"
    },
    "1991_142": {
        "plotSummary": "Two L.A. cops with opposing views on what is the best way to uphold the law have to work together to bring down the Yakuza, while trying to protect a beautiful woman.",
        "runtimeMinutes": "79"
    },
    "1991_143": {
        "plotSummary": "Frank's been lucky from the day, he was born. So why's he throwing rocks at a church after winning $6,200,000 in 1976 NYC lottery? He tells his story at the police station.",
        "runtimeMinutes": "101"
    },
    "1991_144": {
        "plotSummary": "Charlie Sheen plays a rebellious inmate in an Army stockade. Read more: Synopsis",
        "runtimeMinutes": "97"
    },
    "1991_145": {
        "plotSummary": "Two parallel stories about two identical women; one living in Poland, the other in France. They don't know each other, but their lives are nevertheless profoundly connected.",
        "runtimeMinutes": "98"
    },
    "1991_146": {
        "plotSummary": "A woman married to the brutal and infertile owner of a dye mill in rural China conceives a boy with her husband's nephew but is forced to raise her son as her husband's heir without revealing his parentage in this circular tragedy.",
        "runtimeMinutes": "95"
    },
    "1991_147": {
        "plotSummary": "In nineteenth-century France, the romantic daughter of a country squire marries a dull country doctor. To escape boredom, she throws herself into love affairs with a suave local landowner and a law student, and runs up ruinous debts.",
        "runtimeMinutes": "143"
    },
    "1991_148": {
        "plotSummary": "The slave Spartacus leads a violent revolt against the decadent Roman Republic.",
        "runtimeMinutes": "197"
    },
    "1991_149": {
        "plotSummary": "The magician Prospero attempts to stop his daughter's affair with an enemy.",
        "runtimeMinutes": "124"
    },
    "1991_15": {
        "plotSummary": "With his oldest daughter's wedding approaching, a father finds himself reluctant to let go.",
        "runtimeMinutes": "105"
    },
    "1991_150": {
        "plotSummary": "Matteo decides to take a trip across Italy to go visiting his five children.",
        "runtimeMinutes": "118"
    },
    "1991_151": {
        "plotSummary": "A young boy's life in turn-of-the-century France. Marcel, witnesses the success of his teacher father, as well as the success of his arrogant Uncle Jules. Marcel and family spend their summer vacation in a cottage in Provence, and Marcel ...See moreA young boy's life in turn-of-the-century France. Marcel, witnesses the success of his teacher father, as well as the success of his arrogant Uncle Jules. Marcel and family spend their summer vacation in a cottage in Provence, and Marcel befriends a local boy who teaches him the secrets of the hills in Provence.  Written by Huy D. Huynh See less",
        "runtimeMinutes": "105"
    },
    "1991_152": {
        "plotSummary": "A girl's mother returns after 15 years to find her daughter has married one of her (the mother's) old boyfriends. They try to mend their broken mother/daughter relationship and deal with their common lover.See moreA girl's mother returns after 15 years to find her daughter has married one of her (the mother's) old boyfriends. They try to mend their broken mother/daughter relationship and deal with their common lover.  Written by Ed Sutton See less",
        "runtimeMinutes": "112"
    },
    "1991_153": {
        "plotSummary": "Following the death of publishing tycoon Charles Foster Kane, reporters scramble to uncover the meaning of his final utterance; 'Rosebud'.",
        "runtimeMinutes": "119"
    },
    "1991_154": {
        "plotSummary": "A woman dealing with inconsolable grief over the death of her partner gets another chance when he returns to earth as a ghost.",
        "runtimeMinutes": "106"
    },
    "1991_155": {
        "plotSummary": "A shop assistant, her cook husband, & their twin daughters ponder their lives over a few weeks in a working-class suburb north of London.",
        "runtimeMinutes": "103"
    },
    "1991_156": {
        "plotSummary": "A retired CIA agent is recruited to participate in a prisoner exchange with the Russians.",
        "runtimeMinutes": "98"
    },
    "1991_157": {
        "plotSummary": "Every holiday Marcel and his family go to their cottage in the Provence (France). He likes the hills in this region. Before they arrive at the cottage they have to walk about 5 miles. With the co-operation of an ex-pupil of Marcel's father...See moreEvery holiday Marcel and his family go to their cottage in the Provence (France). He likes the hills in this region. Before they arrive at the cottage they have to walk about 5 miles. With the co-operation of an ex-pupil of Marcel's father, who's a teacher, they only have to walk 1 mile, since they can take a shortcut along a canal, through the backyards of some eccentric people. During one of these holidays he meets Isabelle, a pretty but conceited girl...  Written by Tony Kessen See less",
        "runtimeMinutes": "98"
    },
    "1991_158": {
        "plotSummary": "In 1923, a local resident of British Colonial Nigeria tries to be equal with the colonial administration.",
        "runtimeMinutes": "101"
    },
    "1991_159": {
        "plotSummary": "A friend delivers John Twiller greetings from a long gone high school girlfriend. This makes him open his school's yearbook - his \"Book of Love\" - and remember the old times, way back in 1956, when he was in his last year of high school ...See moreA friend delivers John Twiller greetings from a long gone high school girlfriend. This makes him open his school's yearbook - his \"Book of Love\" - and remember the old times, way back in 1956, when he was in his last year of high school and his family just moved to the town. He hung out with geeky Paul Kayne and tried to get the attention of Lily, who unfortunately was together with bully Angelo.  Written by Tom Zoerner See less",
        "runtimeMinutes": "82"
    },
    "1991_16": {
        "plotSummary": "Lieutenant Frank Drebin discovers that his ex-girlfriend's new beau is involved in a plot to kidnap a scientist who advocates solar energy.",
        "runtimeMinutes": "85"
    },
    "1991_160": {
        "plotSummary": "Martin and Hazel Quarrier are small-town fundamentalist missionaries sent to the jungles of South America to convert the Indians. Their remote mission was previously run by the Catholics, before the natives murdered them all. They are sent...See moreMartin and Hazel Quarrier are small-town fundamentalist missionaries sent to the jungles of South America to convert the Indians. Their remote mission was previously run by the Catholics, before the natives murdered them all. They are sent by the pompous Leslie Huben, who runs the missionary effort in the area but who seems more concerned about competing with his Catholic 'rivals' than in the Indians themselves. Hazel is terrified of the Indians while Martin is fascinated. Soon American pilot Lewis Moon joins the Indian tribe but is attracted by Leslie's young wife, Andy. Can the interaction of these characters and cultures, and the advancing bulldozers of civilization, avoid disaster?  Written by Reid GagleSee less",
        "runtimeMinutes": "189"
    },
    "1991_161": {
        "plotSummary": "An intersecting tale with a multitude of characters living lives which, in one way or another, revolve around an old apartment block scheduled to be demolished.",
        "runtimeMinutes": "129"
    },
    "1991_162": {
        "plotSummary": "Documentary that chronicles how Francis Ford Coppola's Apocalypse Now was plagued by extraordinary script, shooting, budget, and casting problems--nearly destroying the life and career of the celebrated director.",
        "runtimeMinutes": "96"
    },
    "1991_163": {
        "plotSummary": "A telephone operator living an empty, amoral life finds God and loses him again.",
        "runtimeMinutes": "100"
    },
    "1991_164": {
        "plotSummary": "David's brother, Kurt, defeats Po in Kickboxer. A year after Po kills Kurt, David, who has a kickboxing gym in LA, is manipulated into a match against Po.",
        "runtimeMinutes": "90"
    },
    "1991_165": {
        "plotSummary": "A couple retreat to Venice to work on their relationship, but an encounter with a stranger leads them into a world of intrigue - where their darkest desires are in reach.",
        "runtimeMinutes": "107"
    },
    "1991_166": {
        "plotSummary": "A day in the life of Austin, Texas as the camera roams from place to place and provides a brief look at the overeducated, the social misfits, the outcasts and the oddballs.",
        "runtimeMinutes": "97"
    },
    "1991_167": {
        "plotSummary": "A rapper gets stuck in a small town and falls for a local girl whose family is in witness protection.",
        "runtimeMinutes": "91"
    },
    "1991_168": {
        "plotSummary": "Two young Americans, he a journalist and she a photojournalist, experience Red Brigades terrorists close up in Rome, 1978.",
        "runtimeMinutes": "111"
    },
    "1991_169": {
        "plotSummary": "A couple struggling to conceive visit a miracle doctor as a last hope for having a child. The wife gets pregnant, but after the initial joy comes horror, as she slowly discovers the nightmarish truth behind the doctor's success.",
        "runtimeMinutes": "83"
    },
    "1991_17": {
        "plotSummary": "An F.B.I. Agent goes undercover to catch a gang of surfers who may be bank robbers.",
        "runtimeMinutes": "122"
    },
    "1991_170": {
        "plotSummary": "The setting is the Riviera in autumn. A retired English businessman (Sir Dirk Bogarde) has just been through heart surgery, but it has, apparently, done little to relieve his constant pain or improve his long-term survival prospects. ...See moreThe setting is the Riviera in autumn. A retired English businessman (Sir Dirk Bogarde) has just been through heart surgery, but it has, apparently, done little to relieve his constant pain or improve his long-term survival prospects. During his recuperation, Caroline (Jane Birkin), his adult daughter, comes from Paris to be with him and her mother, Miche (Odette Laure), and she and her father begin to communicate as adults for the first time.  Written by Paul Berk See less",
        "runtimeMinutes": "105"
    },
    "1991_171": {
        "plotSummary": "Kafka works during the day at an insurance company, where events lead him to discover a mysterious underground society with strange suppressive goals.",
        "runtimeMinutes": "98"
    },
    "1991_172": {
        "plotSummary": "Janet Frame was a brilliant child who, as a teen, was misdiagnosed with schizophrenia. Explore Janet's discovery of the world and her life in Europe as her books are published to acclaim.",
        "runtimeMinutes": "158"
    },
    "1991_173": {
        "plotSummary": "A night in the life of a cynical prostitute forms the basis of Ken Russell's portrait of the world's oldest profession.",
        "runtimeMinutes": "85"
    },
    "1991_174": {
        "plotSummary": "Plain Jane Hartman hates her life. She's goofy, boring and only has sex if she reads Iris Murdoch novels out loud to her loopy boyfriend. Her oldest friend Antonia McGill knows about everything. She orders the right food; she can complain ...See morePlain Jane Hartman hates her life. She's goofy, boring and only has sex if she reads Iris Murdoch novels out loud to her loopy boyfriend. Her oldest friend Antonia McGill knows about everything. She orders the right food; she can complain and get results. She's beautiful and has a brilliant career. Is it any wonder that they hate each other's guts?  Written by Teresa O'Donnell See less",
        "runtimeMinutes": "71"
    },
    "1991_175": {
        "plotSummary": "A deliciously biting satire about both the world of Grand Opera and United Europe. A Hungarian conductor (Arestrup) attempts to mount a bold new production of Richard Wagner's \"Tannhäuser\" while navigating the snares and pitfalls of ...See moreA deliciously biting satire about both the world of Grand Opera and United Europe. A Hungarian conductor (Arestrup) attempts to mount a bold new production of Richard Wagner's \"Tannhäuser\" while navigating the snares and pitfalls of artistic egos, rampant nationalism, internal company and union politics, and precarious funding.  Written by Dawn M. BarcliftSee less",
        "runtimeMinutes": "119"
    },
    "1991_176": {
        "plotSummary": "The laughs and overlapping love lives of a handful of raunchy stand-up comics at a late-night L.A. comedy club. Dukie's is an L.A. hot-spot featuring a lineup of both novice and notorious comedians who get big laughs with dirty jokes.",
        "runtimeMinutes": "89"
    },
    "1991_177": {
        "plotSummary": "A group of embittered ex-cops use a chemical spill to raid the banks and homes of Beverly Hills.",
        "runtimeMinutes": "96"
    },
    "1991_178": {
        "plotSummary": "Dar is a warrior who can talk to the beasts. He is forced to travel to Earth to stop his evil brother from stealing an atomic bomb and turning their native land from a desert into, well - a desert. Read more: Synopsis",
        "runtimeMinutes": "107"
    },
    "1991_179": {
        "plotSummary": "In praise of a New York deli delivery man, who dodges cars like a matador dodges bulls.",
        "runtimeMinutes": "5"
    },
    "1991_18": {
        "plotSummary": "A nurse falls in love with a terminally ill man.",
        "runtimeMinutes": "111"
    },
    "1991_180": {
        "plotSummary": "The two teenagers Jimmy and Rose spend their vacation at the small Irish sea-resort Bray. Out of boredom they observe other people and imagine wild stories about them. One day they observe the blonde Renee, and Jimmy is immediately ...See moreThe two teenagers Jimmy and Rose spend their vacation at the small Irish sea-resort Bray. Out of boredom they observe other people and imagine wild stories about them. One day they observe the blonde Renee, and Jimmy is immediately fascinated by her and even follows her home. She, too, seems to like him, but for a mysterious reason keeps him at a distance.  Written by Tom Zoerner See less",
        "runtimeMinutes": "97"
    },
    "1991_181": {
        "plotSummary": "In 1999, Claire's life is forever changed after she survives a car crash. She rescues Sam and starts traveling around the world with him. Writer Eugene follows them and writes their story, as a way of recording dreams is being invented.",
        "runtimeMinutes": "158"
    },
    "1991_182": {
        "plotSummary": "A boy shoots his father and flies out the window. A man falls in love with a fellow inmate in prison. A doctor accidentally ingests his experimental sex serum, wrecking havoc on the community.",
        "runtimeMinutes": "85"
    },
    "1991_183": {
        "plotSummary": "Philosophical conversations between a poet, politician, and scientist. No one is psychotic or out for revenge.",
        "runtimeMinutes": "112"
    },
    "1991_184": {
        "plotSummary": "At a farmhouse, a large family cooks mountains of food for the next day's engagement party for Silvia and her city fiance, Angelo. Her parents feud about infidelity; an aging salesman who rents a cottage from them arrives with a young ...See moreAt a farmhouse, a large family cooks mountains of food for the next day's engagement party for Silvia and her city fiance, Angelo. Her parents feud about infidelity; an aging salesman who rents a cottage from them arrives with a young French woman; in Bologna, Angelo's mother frets that her son is marrying beneath him; his sisters are less critical. Early the next morning, the four of them go by train to the farmhouse, joined by Angelo's married, unpregnant sister. The day-long dinner is riotous, couples display affection and impatience, children chase angels. Angelo's family stays the night, and his sister Linda has a visitor. A silver elephant makes the perfect gift.  Written by See less",
        "runtimeMinutes": "92"
    },
    "1991_185": {
        "plotSummary": "Two minor characters from the play 'Hamlet' stumble around unaware of their scripted lives and unable to deviate from them.",
        "runtimeMinutes": "117"
    },
    "1991_186": {
        "plotSummary": "",
        "runtimeMinutes": "105"
    },
    "1991_187": {
        "plotSummary": "In 1880's China, young Lalu is sold into marriage by her impoverished father. Rather than becoming a bride, Lalu ends up in an Idaho gold-mining town, the property of a saloon owner who renames her China Polly and plans to sell her as ...See moreIn 1880's China, young Lalu is sold into marriage by her impoverished father. Rather than becoming a bride, Lalu ends up in an Idaho gold-mining town, the property of a saloon owner who renames her China Polly and plans to sell her as entertainment for the locals. Refusing to become a whore, Lalu ultimately finds her own way in this strange country filled with white demons.  Written by Kelley O.See less",
        "runtimeMinutes": "105"
    },
    "1991_188": {
        "plotSummary": "Outrageous, misogynistic and vulgar-to-the-max comedian Andrew Dice Clay does his stuff in this combination of a stand-up concert video, in a filled-to-capacity performance at Madison Square Gardens, and a series of comedy sketches.",
        "runtimeMinutes": "88"
    },
    "1991_189": {
        "plotSummary": "A group of lifelong friends meet again in Queens for Ray's bachelor party and wedding.",
        "runtimeMinutes": "100"
    },
    "1991_19": {
        "plotSummary": "The Turtles and the Shredder battle once again, this time for the last canister of the ooze that created the Turtles, with which Shredder wants to unleash an army of new mutants.",
        "runtimeMinutes": "88"
    },
    "1991_190": {
        "plotSummary": "Auntie Danielle, supposedly in ailing health but in reality just a nasty old bitch, lives with a paid housekeeper who she regularly abuses. When the housekeeper dies falling off a ladder, Danielle moves in with her great-nephew and his ...See moreAuntie Danielle, supposedly in ailing health but in reality just a nasty old bitch, lives with a paid housekeeper who she regularly abuses. When the housekeeper dies falling off a ladder, Danielle moves in with her great-nephew and his family. She continues using her nastiness to manipulate everyone into doing things her way until the family goes on vacation to Greece. The young housekeeper they hire to watch after her knows what Auntie is doing, and deals with her accordingly, and they begin forming respect for each other.  Written by Ed Sutton See less",
        "runtimeMinutes": "112"
    },
    "1991_191": {
        "plotSummary": "A less-than-qualified and far-from-perfect priest is mistakenly named the new pope. As the pontiff, he must deal with Vatican corruption, the Mob and the reappearance of his old lover.See moreA less-than-qualified and far-from-perfect priest is mistakenly named the new pope. As the pontiff, he must deal with Vatican corruption, the Mob and the reappearance of his old lover.  Written by Michael \"Rabbit\" Hutchison See less",
        "runtimeMinutes": "97"
    },
    "1991_192": {
        "plotSummary": "This filmed version of Lily Tomlin's successful one-woman performance piece is sometimes classified as a \"documentary.\"",
        "runtimeMinutes": "120"
    },
    "1991_193": {
        "plotSummary": "A rich Beverly Hills girl gets a job as a waitress, and falls in love with a rock singer.",
        "runtimeMinutes": "96"
    },
    "1991_194": {
        "plotSummary": "Two African-Americans and two Puerto-Ricans (though one pretends to be Italian) go out on the town on a Friday night. They will be forced to get to know each other, and even worst, learn to like each other as friends.See moreTwo African-Americans and two Puerto-Ricans (though one pretends to be Italian) go out on the town on a Friday night. They will be forced to get to know each other, and even worst, learn to like each other as friends.  Written by Steve Richer See less",
        "runtimeMinutes": "88"
    },
    "1991_195": {
        "plotSummary": "Performance artist/comedian Bogosian brings to hilarious life 10 separate oddball characters in a one-man-show. This profane, smart, crisply edited film will have you screaming for more.",
        "runtimeMinutes": "96"
    },
    "1991_196": {
        "plotSummary": "Three generations' responses to the atomic bombing of Nagasaki.",
        "runtimeMinutes": "98"
    },
    "1991_197": {
        "plotSummary": "Modelling themselves after an idyllic cookie-cutter suburban 1950s family, a colony of insects move from South America into the United States with the intent of getting access to the nation's nuclear resources.",
        "runtimeMinutes": "90"
    },
    "1991_198": {
        "plotSummary": "A former Vietnam War lieutenant reforms his old team in order to help a revolutionary's sister overthrow a ruthless dictator.",
        "runtimeMinutes": "107"
    },
    "1991_199": {
        "plotSummary": "Three generations of women all share the same problem: marriage woes, and they want to put an end to it.",
        "runtimeMinutes": "118"
    },
    "1991_2": {
        "plotSummary": "When Robin and his Moorish companion come to England and the tyranny of the Sheriff of Nottingham, he decides to fight back as an outlaw.",
        "runtimeMinutes": "143"
    },
    "1991_20": {
        "plotSummary": "A troubled man talks to his suicidal sister's psychiatrist about their family history and falls in love with her in the process.",
        "runtimeMinutes": "132"
    },
    "1991_200": {
        "plotSummary": "Best friends from law school to election night, their friendship is sorely tested when one learns of another's betrayal.",
        "runtimeMinutes": "111"
    },
    "1991_201": {
        "plotSummary": "The former famous painter Frenhofer revisits an abandoned project using the girlfriend of a young visiting artist. Questions about truth, life, and artistic limits are explored.",
        "runtimeMinutes": "238"
    },
    "1991_202": {
        "plotSummary": "Before leaving to fight in Vietnam, a group of teenagers play a game where they try to seduce the ugliest girl they can find.",
        "runtimeMinutes": "94"
    },
    "1991_203": {
        "plotSummary": "A sweet-talking con man starts to turn his life around when he falls in love in this family oriented comedy.",
        "runtimeMinutes": "86"
    },
    "1991_204": {
        "plotSummary": "The two American Ninjas, Joe Armstrong and Sean Davidson, team up to do battle against a terrorist and his band of Ninjas.",
        "runtimeMinutes": "99"
    },
    "1991_205": {
        "plotSummary": "After being thrown out of her house, Maria encounters a married woman who complains of not having children. Maria ends up in an abandoned house, where she meets Matthew. When a baby is kidnapped Maria sets out to find the woman.",
        "runtimeMinutes": "107"
    },
    "1991_206": {
        "plotSummary": "Mark Salzman always was interested in Kung-Fu and the Chinese culture, claims to have seen every Kung-Fu movie. 1982, with a degree in Chinese literature, he visits a province university in China for two years to teach Chinese teachers the...See moreMark Salzman always was interested in Kung-Fu and the Chinese culture, claims to have seen every Kung-Fu movie. 1982, with a degree in Chinese literature, he visits a province university in China for two years to teach Chinese teachers the English language. He learns the refinements of correct behavior among Chinese people, makes friends with his pupils, falls in love with the young doctor Ming, learns Wushu (similar Kung-Fu) from the famous teacher Pan... but also learns about political repression, especially when he's forbidden contact with some of his friends.  Written by Tom Zoerner See less",
        "runtimeMinutes": "92"
    },
    "1991_207": {
        "plotSummary": "Two horror tales based on short stories by Edgar Allan Poe directed by two famous horror directors, George A. Romero and Dario Argento. A greedy wife kills her husband, but not completely. A sleazy reporter adopts a strange black cat.",
        "runtimeMinutes": "120"
    },
    "1991_208": {
        "plotSummary": "A group of young British guardsmen have to cover up a hit and run incident that occurred at the end of a night of drunken revelry.",
        "runtimeMinutes": "100"
    },
    "1991_209": {
        "plotSummary": "Virgil Sweet is on the verge of losing his job as a talent scout with the California Angels when he discovers Sammy Bodeen, a country boy with no pro ball experience, but with a pitching arm no one has seen the like of. Money-hungry owners...See moreVirgil Sweet is on the verge of losing his job as a talent scout with the California Angels when he discovers Sammy Bodeen, a country boy with no pro ball experience, but with a pitching arm no one has seen the like of. Money-hungry owners want to make a quick buck while Sammy just wants to play ball. Virgil finds himself caught in the middle.  Written by Lars SkoganSee less",
        "runtimeMinutes": "91"
    },
    "1991_21": {
        "plotSummary": "An action movie star researching a role is allowed to tag along with a hardboiled New York City policeman, who finds him superficial and irritating.",
        "runtimeMinutes": "111"
    },
    "1991_210": {
        "plotSummary": "Pastime is a story of an aging, white pitcher on a minor league baseball team who takes a young, talented, black pitcher under his wing in 1957. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "1991_211": {
        "plotSummary": "The story of a poor Turkish family who try to emigrate illegally to Switzerland.",
        "runtimeMinutes": "105"
    },
    "1991_212": {
        "plotSummary": "In a drab police state, an author of children's books is interrogated by a sadistic, secret policeman. She's under suspicion of embedding anti-government messages in her stories.",
        "runtimeMinutes": "89"
    },
    "1991_213": {
        "plotSummary": "Katie is a free spirited independently minded 21-year-old. The film follows her as she reflects on the men in her life. Along the way we meet her drug addict boyfriend Bobby, her lover Jack, close friend Baldy, and her father.",
        "runtimeMinutes": "92"
    },
    "1991_214": {
        "plotSummary": "Eight animated pieces by eight artists, from the studios of the National Film Board of Canada.",
        "runtimeMinutes": "87"
    },
    "1991_215": {
        "plotSummary": "This is a musical-comedy movie produced and directed by Lewis Gilbert, starring Liza Minnelli, written by Richard Harris, and based on a play also written by Harris. Minnelli plays the role of a has-been Broadway performer who gives tap ...See moreThis is a musical-comedy movie produced and directed by Lewis Gilbert, starring Liza Minnelli, written by Richard Harris, and based on a play also written by Harris. Minnelli plays the role of a has-been Broadway performer who gives tap lesson to a group of misfits who, through their dance classes, bond and realize what they can achieve.See less",
        "runtimeMinutes": "106"
    },
    "1991_216": {
        "plotSummary": "Youth culture meets identity politics in this part-thriller, part-gay love story set in London in 1977, days before the Queen's Silver Jubilee celebrations. The hedonistic world of pirate DJs Chris and Caz is shattered when a close friend ...See moreYouth culture meets identity politics in this part-thriller, part-gay love story set in London in 1977, days before the Queen's Silver Jubilee celebrations. The hedonistic world of pirate DJs Chris and Caz is shattered when a close friend is killed while cruising in the local park. The black community suspect the National Front, but the police pull Chris in as a suspect. This beautifully crafted period piece, a bold and stylish debut feature from Isaac Julien, paints a convincing picture of late-'70s London. The city is a carefully mapped out social landscape, open to all but offering safety to none, as we are taken to a Dalston barber, east London council estates festooned with Union Jacks, West End offices, soul clubs and city parks.See less",
        "runtimeMinutes": "105"
    },
    "1991_217": {
        "plotSummary": "A Vietnam vet comes home to his small town and finds himself in conflict with rules that his brother has vowed to uphold.",
        "runtimeMinutes": "127"
    },
    "1991_218": {
        "plotSummary": "A tangled triangle. In the rural South of the early 20th century, Miss Amelia is the town eccentric, selling corn liquor and dispensing medicine. She takes in her half-sister's son, a diminutive crook-back named Lymon. He suggests they ...See moreA tangled triangle. In the rural South of the early 20th century, Miss Amelia is the town eccentric, selling corn liquor and dispensing medicine. She takes in her half-sister's son, a diminutive crook-back named Lymon. He suggests they open a cafe in the downstairs of her large house. Marvin Macy gets out of prison and returns to town; turns out he was married to Amelia but it wasn't consummated. He pleaded, then got angry. Is he back for revenge? Eventually, Amelia and Marvin stage a no-holds-barred fight in the cafe. Lymon's complicated response to Marvin and to Cousin Amelia figures in the resolution.  Written by See less",
        "runtimeMinutes": "101"
    },
    "1991_219": {
        "plotSummary": "Road-movie from Montana to Wyoming. A gullible, innocent young man (Mulroney) assists a versatile girl (Taylor) on her long quest to get her brother out of jail.",
        "runtimeMinutes": "93"
    },
    "1991_22": {
        "plotSummary": "A successful psychotherapist loses his mind after one of his most dependent patients, an obsessive-compulsive neurotic, tracks him down during his family vacation.",
        "runtimeMinutes": "99"
    },
    "1991_220": {
        "plotSummary": "A hitman heeds a spiritualist's prophesies that he will rise to the head of his family. He starts his ascension by clandestinely executing the heads of the family and casting the blame on others. However, with power comes consequences that...See moreA hitman heeds a spiritualist's prophesies that he will rise to the head of his family. He starts his ascension by clandestinely executing the heads of the family and casting the blame on others. However, with power comes consequences that are also predicted by the seer.  Written by John Sacksteder See less",
        "runtimeMinutes": "113"
    },
    "1991_221": {
        "plotSummary": "An estranged brother and sister begin an intense sexual relationship, behind the curtain of their otherwise normal working-class lives.",
        "runtimeMinutes": "108"
    },
    "1991_222": {
        "plotSummary": "The successful writer and professor of architecture Nick Kaminsky returns from New York to Elderstown to visit his biological mother Lillian Anderson Munnsen that is terminal. Nick does not know Lilian since he was adopted when he was a ...See moreThe successful writer and professor of architecture Nick Kaminsky returns from New York to Elderstown to visit his biological mother Lillian Anderson Munnsen that is terminal. Nick does not know Lilian since he was adopted when he was a child but he pays the bill for her to stay in a private room in the hospital. While walking on the street, Nick stumbles upon his former college friend Paul Kessler, who is demolishing with his team an old department store building where a murder and a suicide happened many years ago. While talking to Paul, there is an accident and Nick saves his life. Paul invites Nick to go to the birthday party of his wife Jane Kessler. Nick feels attracted by the building that is built in cast iron and asks Paul to visit it. Meanwhile Jane, who is a photographer, decides to take photos of the same building. They get close to each other and Nick learns that Jane was also adopted. Along the following days, Jane and Nick have a love affair and Nick discloses hidden secrets from their past.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "112"
    },
    "1991_223": {
        "plotSummary": "Tommaso Scalia is a man who commits three murders: he killed his superior who sacked him, he kills the man who replaced him, and he kills his own wife. He wants a quick trial and an early execution, but an earnest, principled assistant ...See moreTommaso Scalia is a man who commits three murders: he killed his superior who sacked him, he kills the man who replaced him, and he kills his own wife. He wants a quick trial and an early execution, but an earnest, principled assistant judge looks for a way to save the murderer from being shot, because he does not belive in capital punishment. Although he manages to save the man initially, he will pay a high price for it.  Written by L.H. Wong See less",
        "runtimeMinutes": "108"
    },
    "1991_224": {
        "plotSummary": "The true story of Ivan Sanchin, the KGB officer who was Stalin's private film projectionist from 1939 until the dictator's death. Told from Sanchin's view, the sympathetic but tragically flawed hero maintains unwavering faith in his \"...See moreThe true story of Ivan Sanchin, the KGB officer who was Stalin's private film projectionist from 1939 until the dictator's death. Told from Sanchin's view, the sympathetic but tragically flawed hero maintains unwavering faith in his \"Master\" despite the arrest of his neighbors and his involvement with their daughter, his wife's affair with the chilling State Security chief Lavrentii Beria and her tragic decline, and the deadly political machinations within the Kremlin he witnesses firsthand.  Written by Martin H. Booda See less",
        "runtimeMinutes": "137"
    },
    "1991_225": {
        "plotSummary": "In 1950s England, slow-witted Derek Bentley falls in with a group of petty criminals led by Chris Craig, a teenager with a fondness for American gangster movies. Chris and Derek's friendship leads to their involvement in the case which ...See moreIn 1950s England, slow-witted Derek Bentley falls in with a group of petty criminals led by Chris Craig, a teenager with a fondness for American gangster movies. Chris and Derek's friendship leads to their involvement in the case which would forever shake the United Kingdom's belief in capital punishment.  Written by Scott Renshaw See less",
        "runtimeMinutes": "115"
    },
    "1991_226": {
        "plotSummary": "When a young European woman assumes a false identity in 1920s Argentina, she gets more than she bargained for.",
        "runtimeMinutes": "90"
    },
    "1991_227": {
        "plotSummary": "Unemployed Scottish miner Danny Scoular (Liam Neeson) is forced into bare-knuckle boxing to make ends meet.",
        "runtimeMinutes": "116"
    },
    "1991_228": {
        "plotSummary": "A Chinese political refugee tries to make his way to the top as a businessman in Hong Kong while his former radicalism is transformed into cynicism. His past comes back to haunt him.",
        "runtimeMinutes": "131"
    },
    "1991_229": {
        "plotSummary": "The island of Ambon in Indonesia, 1945. During the War, the number of Australian POWs on the island had dropped from 1100 to less than 300 due to abuses by their Japanese captors. Capt. Cooper is the chief prosecutor. In a mass grave, the ...See moreThe island of Ambon in Indonesia, 1945. During the War, the number of Australian POWs on the island had dropped from 1100 to less than 300 due to abuses by their Japanese captors. Capt. Cooper is the chief prosecutor. In a mass grave, the bodies of 300 executed servicemen have been unearthed. Cooper assumes that the massacre was ordered by Baron Takahashi, Japanese commander on Ambon. But the one potential witness has gone mad and is due to be shipped back to Australia. No captured airmen were found alive on the island at all, not even the four-man crew of a reconnaissance plane shot down late in the War. Takahashi is returned to the island in the custody of an American officer, Maj. Beckett. But there is little evidence with which to prosecute the Baron. Cooper thinks he could make a case for the missing airmen if only their bodies could be located. And why does Maj. Beckett appear interested in not seeing Takahashi convicted? Cooper gets a break when Lt. Tanaka, a communications officer and a Christian, surrenders himself...  Written by David StankoSee less",
        "runtimeMinutes": "108"
    },
    "1991_23": {
        "plotSummary": "When a litter of Dalmatian puppies are abducted by the minions of Cruella de Vil, the parents must find them before she uses them for a diabolical fashion statement.",
        "runtimeMinutes": "79"
    },
    "1991_230": {
        "plotSummary": "How the discovery of a father's affair affects each member of his family.",
        "runtimeMinutes": "113"
    },
    "1991_231": {
        "plotSummary": "A man pursues stand-up comedy encouraged by his fellow garbage man. Though his friend, who accompanies him on accordion, continues to tell him how great he is, he actually stinks. When the \"comedian\" grows a third arm out of his back, the ...See moreA man pursues stand-up comedy encouraged by his fellow garbage man. Though his friend, who accompanies him on accordion, continues to tell him how great he is, he actually stinks. When the \"comedian\" grows a third arm out of his back, the friend uses this twist to get him signed up with a sleazy talent agent, and it begins to look like his career is on the move, even though his girlfriend has left him.  Written by Ed Sutton See less",
        "runtimeMinutes": "101"
    },
    "1991_232": {
        "plotSummary": "A compilation of scenes from silent films made between 1905 and 1915 that sat in storage in an Amsterdam cinema for many years. The title refers to the deteriorating nitrate film stock used in these films.",
        "runtimeMinutes": "50"
    },
    "1991_233": {
        "plotSummary": "A renowned actress teeters on the edge of a breakdown as she counts down the days toward a big Broadway opening.",
        "runtimeMinutes": "144"
    },
    "1991_234": {
        "plotSummary": "Rival groups in a skiing school do battle on and off the piste. One gang are rich and serious, the other group are party animals.",
        "runtimeMinutes": "89"
    },
    "1991_235": {
        "plotSummary": "In the 1950's, a young boy living with his troublesome family in rural USA fantasizes that a neighboring widow is actually a vampire, responsible for a number of disappearances in the area.",
        "runtimeMinutes": "96"
    },
    "1991_236": {
        "plotSummary": "Horton Foote's story of a teen-aged boy in the Depression who finds work on an eccentric's sugar plantation and learns life's surprising lessons from the team of convicts who also work there.",
        "runtimeMinutes": "93"
    },
    "1991_237": {
        "plotSummary": "A collection of short stories, made by different animators with \"robot\" as the working title.",
        "runtimeMinutes": "90"
    },
    "1991_238": {
        "plotSummary": "A car thief and a punk rocker fall in love as they become embroiled in deaths attributed to an aphrodisiac.",
        "runtimeMinutes": "99"
    },
    "1991_239": {
        "plotSummary": "A lowly hospital orderly impersonates a recently deceased doctor and goes to work in the busy ER of a small hospital where he meets and befriends a nurse who slowly figures out his secret and helps him maintain his charade.",
        "runtimeMinutes": "105"
    },
    "1991_24": {
        "plotSummary": "A private detective's protected female witness is murdered, prompting him and the victim's boyfriend to investigate the crime that leads to a corrupt politician and a crooked football team owner.",
        "runtimeMinutes": "105"
    },
    "1991_240": {
        "plotSummary": "At age 73, writer and melancholy master of the bon mot, Quentin Crisp (1908-1999), became an Englishman in New York. Rossiter's camera follows Crisp about the streets of Manhattan, where Crisp seems very much at home, wearing eye shadow, ...See moreAt age 73, writer and melancholy master of the bon mot, Quentin Crisp (1908-1999), became an Englishman in New York. Rossiter's camera follows Crisp about the streets of Manhattan, where Crisp seems very much at home, wearing eye shadow, appearing on a makeshift stage, making and repeating wry observations, talking to John Hurt (who played Crisp in the autobiographical TV movie, \"The Naked Civil Servant\"), and dining with friends. Others who know Crisp comment on him, on his life as an openly gay man with an effeminate manner, and on his place in the history of gays' social struggle. The portrait that emerges is of one wit and of suffering.  Written by See less",
        "runtimeMinutes": "85"
    },
    "1991_241": {
        "plotSummary": "Set in a New England prep school on the day after Pearl Harbor, five close friends must choose whether to stay in school or go to war. Their decisions shock themselves and each other as they must grow up faster than they ever imagined.",
        "runtimeMinutes": "92"
    },
    "1991_242": {
        "plotSummary": "Inspector Lavardin is induced to investigate the murder of a province's notable who was taking himself as the moral guardian of his village. The perspective of the inquiry changes when the inspector recognizes the widow as one of his ...See moreInspector Lavardin is induced to investigate the murder of a province's notable who was taking himself as the moral guardian of his village. The perspective of the inquiry changes when the inspector recognizes the widow as one of his youthful loves.  Written by Jean-Marie Berthiaume See less",
        "runtimeMinutes": "100"
    },
    "1991_243": {
        "plotSummary": "After a young woman is attacked in the elevator she meets her neighbours (two brothers) for the first time. One of the brothers has a secret, the other has a crush on her. Her analyst tries to help her over the attack, but when she is ...See moreAfter a young woman is attacked in the elevator she meets her neighbours (two brothers) for the first time. One of the brothers has a secret, the other has a crush on her. Her analyst tries to help her over the attack, but when she is invited to a mysterious apartment things get worse and worse.  Written by Rob HartillSee less",
        "runtimeMinutes": "105"
    },
    "1991_244": {
        "plotSummary": "The owner of a sleazy hotel, along with his friend, decides to videotape a room that is rented by a sexually active couple. Inadvertently recording their murders, the men are soon faced with a dilemma as the killers come looking for the ...See moreThe owner of a sleazy hotel, along with his friend, decides to videotape a room that is rented by a sexually active couple. Inadvertently recording their murders, the men are soon faced with a dilemma as the killers come looking for the tape.  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "1991_25": {
        "plotSummary": "A young girl, on the threshold of her teen years, finds her life turning upside down, when she is accompanied by an unlikely friend.",
        "runtimeMinutes": "102"
    },
    "1991_26": {
        "plotSummary": "Follows the lives of three young males living in the Crenshaw ghetto of Los Angeles, dissecting questions of race, relationships, violence, and future prospects.",
        "runtimeMinutes": "112"
    },
    "1991_27": {
        "plotSummary": "A young doctor on his way across the country to a job interview crashes his car in a small town and is sentenced to work for several days at the town hospital.",
        "runtimeMinutes": "104"
    },
    "1991_28": {
        "plotSummary": "A regular guy from America becomes king of England after a royal wipe-out puts him next in line.",
        "runtimeMinutes": "97"
    },
    "1991_29": {
        "plotSummary": "The story of how Benjamin \"Bugsy\" Siegel started Las Vegas.",
        "runtimeMinutes": "136"
    },
    "1991_3": {
        "plotSummary": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love.",
        "runtimeMinutes": "84"
    },
    "1991_30": {
        "plotSummary": "A crime lord ascends to power and becomes megalomaniacal while a maverick police detective vows to stop him.",
        "runtimeMinutes": "97"
    },
    "1991_31": {
        "plotSummary": "A young pilot stumbles onto a prototype jetpack that allows him to become a high-flying masked hero.",
        "runtimeMinutes": "108"
    },
    "1991_32": {
        "plotSummary": "Two best friends set out on an adventure, but it soon turns around to a terrifying escape from being hunted by the police, as these two girls escape for the crimes they committed.",
        "runtimeMinutes": "130"
    },
    "1991_33": {
        "plotSummary": "Friends and family of a married black architect react in different ways to his affair with an Italian secretary.",
        "runtimeMinutes": "132"
    },
    "1991_34": {
        "plotSummary": "After being shot, a lawyer loses his memory and must relearn speech and mobility, but he has a loving family to support him.",
        "runtimeMinutes": "108"
    },
    "1991_35": {
        "plotSummary": "A former radio DJ, suicidally despondent because of a terrible mistake he made, finds redemption in helping a deranged homeless man who was an unwitting victim of that mistake.",
        "runtimeMinutes": "137"
    },
    "1991_36": {
        "plotSummary": "The fates of several people are intertwining randomly. Their sympathy of each other faces multiple differences in their lifestyles.",
        "runtimeMinutes": "134"
    },
    "1991_37": {
        "plotSummary": "A family of Emigre mice decide to move out to the West, unaware that they are falling into a trap perpetrated by a smooth-talking cat.",
        "runtimeMinutes": "75"
    },
    "1991_38": {
        "plotSummary": "The gruesome murder of a Brooklyn Detective will turn the case into a personal vendetta when the deceased's best friend and fellow officer will unleash an all-out attack against a psychotic Mafia enforcer's brutal gang.",
        "runtimeMinutes": "91"
    },
    "1991_39": {
        "plotSummary": "When a self-centered doctor is diagnosed with cancer, he becomes better able to empathize with his patients and appreciate a life outside his career.",
        "runtimeMinutes": "122"
    },
    "1991_4": {
        "plotSummary": "When Captain James Hook kidnaps his children, an adult Peter Pan must return to Neverland and reclaim his youthful spirit in order to challenge his old enemy.",
        "runtimeMinutes": "142"
    },
    "1991_40": {
        "plotSummary": "A tyrant from the future creates evil android doubles of Bill and Ted and sends them back to eliminate the originals.",
        "runtimeMinutes": "93"
    },
    "1991_41": {
        "plotSummary": "A woman who has lost her memory is taken in by a Los Angeles orphanage, and a private eye is enlisted to track down her identity, but he soon finds that he might have a past life connection to her that endangers their lives.",
        "runtimeMinutes": "107"
    },
    "1991_42": {
        "plotSummary": "An ambitious television soap actress connives with her producer to scuttle the career of the show's long-time star, but nothing works as they plan.",
        "runtimeMinutes": "97"
    },
    "1991_43": {
        "plotSummary": "Dream-haunting Freddy Krueger returns once again to prowl the nightmares of Springwood's last surviving teenager, and of a woman whose personal connection to Krueger may mean his doom.",
        "runtimeMinutes": "89"
    },
    "1991_44": {
        "plotSummary": "Jack London's classic adventure story about the friendship developed between a Yukon gold hunter and the mixed dog-wolf he rescues from the hands of a man who mistreats him.",
        "runtimeMinutes": "107"
    },
    "1991_45": {
        "plotSummary": "The story of the famous and influential 1960s rock band The Doors and its lead singer and composer, Jim Morrison, from his days as a UCLA film student in Los Angeles, to his untimely death in Paris, France at age 27 in 1971.",
        "runtimeMinutes": "140"
    },
    "1991_46": {
        "plotSummary": "A homeless man and his young companion, who survive by conning people, meet a woman who may need them even more than they need her.",
        "runtimeMinutes": "101"
    },
    "1991_47": {
        "plotSummary": "The worst child in the world makes an unthinkable discovery - there is another child even worse than him, and that's a girl.",
        "runtimeMinutes": "91"
    },
    "1991_48": {
        "plotSummary": "Two adults and a juvenile break into a house occupied by a brother and sister and their stolen children. There, they must fight for their lives.",
        "runtimeMinutes": "102"
    },
    "1991_49": {
        "plotSummary": "Twin brothers are separated when their parents are murdered but 25 years later they re-unite in order to avenge their parents' death.",
        "runtimeMinutes": "110"
    },
    "1991_5": {
        "plotSummary": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
        "runtimeMinutes": "118"
    },
    "1991_50": {
        "plotSummary": "Documentary following singer Madonna on her controversial Blond Ambition tour in 1990.",
        "runtimeMinutes": "120"
    },
    "1991_51": {
        "plotSummary": "With the help of a talking freeway billboard, a wacky weatherman tries to win the heart of an English newspaper reporter, who is struggling to make sense of the strange world of early 1990s Los Angeles.",
        "runtimeMinutes": "95"
    },
    "1991_52": {
        "plotSummary": "A man is murdered when checking authenticity of ancient Egyptian jewelry at a museum. Adrienne finds out after the death of her husband, that he was using a fake name. Are the 2 deaths linked?",
        "runtimeMinutes": "104"
    },
    "1991_53": {
        "plotSummary": "An attorney representing a traumatized accident victim finds that his opponent is a very familiar defense attorney - his own daughter.",
        "runtimeMinutes": "110"
    },
    "1991_54": {
        "plotSummary": "Due to NCAA sanctions, the Texas State University Fightin' Armadillos must form a football team from their actual student body, with no scholarships to help, to play their football schedule.",
        "runtimeMinutes": "108"
    },
    "1991_55": {
        "plotSummary": "A corporate raider buys up shares in an undervalued company and falls in love with the founder's son's lawyer/step daughter. Let the battle begin.",
        "runtimeMinutes": "103"
    },
    "1991_56": {
        "plotSummary": "Five siblings are left alone all summer when their mom leaves town and the evil babysitter bites the dust.",
        "runtimeMinutes": "102"
    },
    "1991_57": {
        "plotSummary": "A Chicago cop must balance loyalty to his overbearing mother and a relationship with a shy funeral home worker.",
        "runtimeMinutes": "104"
    },
    "1991_58": {
        "plotSummary": "A single mother raises a child prodigy on her own, struggling to give him every opportunity he needs to express his gift.",
        "runtimeMinutes": "99"
    },
    "1991_59": {
        "plotSummary": "An accountant with super bad luck is sent in search of a missing boss's daughter, also an incredibly unlucky.",
        "runtimeMinutes": "96"
    },
    "1991_6": {
        "plotSummary": "New Orleans District Attorney Jim Garrison discovers there's more to the Kennedy assassination than the official story.",
        "runtimeMinutes": "189"
    },
    "1991_60": {
        "plotSummary": "An Ex-French Soldier begins participating in underground street fights in order to make money for his brother's family.",
        "runtimeMinutes": "108"
    },
    "1991_61": {
        "plotSummary": "A gangster attempts to keep the promise he made to his dying father: that he would give up his life of crime and \"go straight\".",
        "runtimeMinutes": "109"
    },
    "1991_62": {
        "plotSummary": "U.S. entertainer Eddie Sparks wants to bring some fun to the soldiers during World War II and contacts singer/dancer Dixie Leonard for help. They become the perfect team and tour from North Africa to the Pacific to perform for \"the boys.\" ...See moreU.S. entertainer Eddie Sparks wants to bring some fun to the soldiers during World War II and contacts singer/dancer Dixie Leonard for help. They become the perfect team and tour from North Africa to the Pacific to perform for \"the boys.\" They continue their work after the war, but when Eddie fires author Silver for getting involved in McCarthy's campaign, Dixie also turns away from him.  Written by Volker BoehmSee less",
        "runtimeMinutes": "138"
    },
    "1991_63": {
        "plotSummary": "Johnny has just been released from prison, and gets a job in a cafe beside waitress Frankie. Frankie is a bit of a loner, but Johnny is determined their romance will blossom.",
        "runtimeMinutes": "118"
    },
    "1991_64": {
        "plotSummary": "A District Attorney is terrorized by the criminal he put away years ago when he was a cop.",
        "runtimeMinutes": "102"
    },
    "1991_65": {
        "plotSummary": "A special effects man helps his girlfriend's ex, a cop, with a sting operation, where the ex gets killed. Something's off and he investigates with help from an ex-cop PI friend.",
        "runtimeMinutes": "108"
    },
    "1991_66": {
        "plotSummary": "Chucky returns for revenge against Andy, the young boy who defeated him, and now a teenager living in a military academy.",
        "runtimeMinutes": "90"
    },
    "1991_67": {
        "plotSummary": "From start to finish, it's a story of friendship between four street-wise males who don't mind using violence to achieve the lives that they want. They trust no one but each other, which is vital to their success as mobsters.",
        "runtimeMinutes": "104"
    },
    "1991_68": {
        "plotSummary": "When Kid's college money is stolen by a crooked music promoter, Play's solution is to stage the 'mutha' of all pajama parties. Starring Kid 'n Play and Martin Lawrence.",
        "runtimeMinutes": "94"
    },
    "1991_69": {
        "plotSummary": "Two detectives interrogate a hairdresser on two homicides she may or may not have been involved in.",
        "runtimeMinutes": "103"
    },
    "1991_7": {
        "plotSummary": "Con artists plan to fleece an eccentric family using an accomplice who claims to be their long-lost uncle.",
        "runtimeMinutes": "99"
    },
    "1991_70": {
        "plotSummary": "Melanie Griffith and Don Johnson (at the time married to each other) play Lily and Ben Reed, a young couple torn apart by a family tragedy. It would take a miracle to rekindle their love and a miracle arrives in the form of a summer guest ...See moreMelanie Griffith and Don Johnson (at the time married to each other) play Lily and Ben Reed, a young couple torn apart by a family tragedy. It would take a miracle to rekindle their love and a miracle arrives in the form of a summer guest - Willard Young played by Elijah Wood.  Written by Pfyre Caidmon See less",
        "runtimeMinutes": "111"
    },
    "1991_71": {
        "plotSummary": "A young boy with a distant father enters a world of make-believe and magic through a portal within an antique book.",
        "runtimeMinutes": "90"
    },
    "1991_72": {
        "plotSummary": "A cat burglar is forced to steal Da Vinci works of art for a world domination plot.",
        "runtimeMinutes": "100"
    },
    "1991_73": {
        "plotSummary": "In an afterlife way station resembling a block of hotels, the lives of the recently-deceased are examined in a court-like setting.",
        "runtimeMinutes": "112"
    },
    "1991_74": {
        "plotSummary": "In the year 1935, a teen named Billy Bathgate finds first love while becoming the protege of fledgling gangster Dutch Schultz.",
        "runtimeMinutes": "106"
    },
    "1991_75": {
        "plotSummary": "In the future, Highlander Connor MacLeod must prevent the destruction of Earth under an anti-ozone shield.",
        "runtimeMinutes": "91"
    },
    "1991_76": {
        "plotSummary": "A sexist womanizer is killed by one of his former lovers and then reincarnated as a woman.",
        "runtimeMinutes": "103"
    },
    "1991_77": {
        "plotSummary": "A determined student murders his pregnant secret girlfriend and moves onto her twin sister who gradually becomes suspicious of her new lover.",
        "runtimeMinutes": "94"
    },
    "1991_78": {
        "plotSummary": "A young Norwegian boy in 1850s England goes to work as a cabin boy and discovers some of his shipmates are actually pirates.",
        "runtimeMinutes": "92"
    },
    "1991_79": {
        "plotSummary": "A group of troublemaking boys decide to take a stand when terrorists seize control of their boarding school.",
        "runtimeMinutes": "111"
    },
    "1991_8": {
        "plotSummary": "A convicted rapist, released from prison after serving a fourteen-year sentence, stalks the family of the lawyer who originally defended him.",
        "runtimeMinutes": "128"
    },
    "1991_80": {
        "plotSummary": "Jimmy Rabbitte, an unemployed Dublin boy, decides to put together a soul band made up entirely of the Irish working class.",
        "runtimeMinutes": "118"
    },
    "1991_81": {
        "plotSummary": "Renata Bella feels like a failure at life and career. But when Renata attends a seminar on selling real estate, she finally finds True Love. Sam Sharpe, while a top-notch, successful salesman, is much older than Renata. She is swept away ...See moreRenata Bella feels like a failure at life and career. But when Renata attends a seminar on selling real estate, she finally finds True Love. Sam Sharpe, while a top-notch, successful salesman, is much older than Renata. She is swept away by his excessively flamboyant style and irrepressible nature. The very traits she finds romantic, however, lead to repeated conflict with her family, especially her beloved father Joe, leaving Renata trapped in the middle.  Written by Reid GagleSee less",
        "runtimeMinutes": "115"
    },
    "1991_82": {
        "plotSummary": "A brother and sister attempt to bring their divorced parents back together for Christmas.",
        "runtimeMinutes": "92"
    },
    "1991_83": {
        "plotSummary": "An American woman, trapped in Islamic Iran by her brutish husband, must find a way to escape with her daughter as well.",
        "runtimeMinutes": "116"
    },
    "1991_84": {
        "plotSummary": "During the air war over Vietnam, a U.S. Navy A-6 Intruder bomber pilot schemes with a hardened veteran to make an unauthorized air strike on Hanoi.",
        "runtimeMinutes": "115"
    },
    "1991_85": {
        "plotSummary": "Ernest accidentally unleashes an ugly troll that plots to transform children into wooden dolls in the town of Briarville, Missouri.",
        "runtimeMinutes": "91"
    },
    "1991_86": {
        "plotSummary": "An expert in \"kenpo\" karate avenges his Chinatown friend, slain by a mobster in Los Angeles.",
        "runtimeMinutes": "90"
    },
    "1991_87": {
        "plotSummary": "A young woman finds her already unstable life rocked by the presence of a rambunctious imaginary friend from childhood.",
        "runtimeMinutes": "103"
    },
    "1991_88": {
        "plotSummary": "A millionaire playboy goes into Las Vegas and comes out married to a woman he barely knows.",
        "runtimeMinutes": "115"
    },
    "1991_89": {
        "plotSummary": "After a horrific car wreck leaves him an amnesiac, a man slowly begins to unravel his shocking past.",
        "runtimeMinutes": "98"
    },
    "1991_9": {
        "plotSummary": "A parody of Top Gun in which a talented but unstable fighter pilot must overcome the ghosts of his father and save a mission sabotaged by greedy weapons manufacturers.",
        "runtimeMinutes": "84"
    },
    "1991_90": {
        "plotSummary": "Jim is the dorky son of a local cement contractor who lives at home and has no direction. Josie is the gorgeous daughter of a wealthy businessman who dreams of leaving town. They find they have a lot in common.",
        "runtimeMinutes": "83"
    },
    "1991_91": {
        "plotSummary": "An NYPD Detective (Michael Keaton) and his struggle for justice, while taking care of his late partner's three little girls after he is killed in the line of duty.",
        "runtimeMinutes": "114"
    },
    "1991_92": {
        "plotSummary": "A female PI babysitting for a boyfriend gets stuck with his daughter and the case of her murdered father.",
        "runtimeMinutes": "89"
    },
    "1991_93": {
        "plotSummary": "Karma comes into play when a wealthy wisecracking landlord is ordered by a court to live in the filthy building that he runs.",
        "runtimeMinutes": "84"
    },
    "1991_94": {
        "plotSummary": "A beautiful black gangster's moll flees to Harlem with a trunkload of gold after a shootout, unaware that the rest of the gang, and a few other unsavoury characters, are on her trail. A pudgy momma's boy becomes the object of her ...See moreA beautiful black gangster's moll flees to Harlem with a trunkload of gold after a shootout, unaware that the rest of the gang, and a few other unsavoury characters, are on her trail. A pudgy momma's boy becomes the object of her affections and the unlikely hero of the tale.  Written by AnonymousSee less",
        "runtimeMinutes": "115"
    },
    "1991_95": {
        "plotSummary": "TV viewers love seeing the two reporters with opposing views on the show \"He Said, She Said\". Womanizer Dan and Lorie fall for each other. Love?",
        "runtimeMinutes": "115"
    },
    "1991_96": {
        "plotSummary": "A clairvoyant impulsively marries a butcher, moves to New York City and has a positive impact on the people she meets, changing their futures...which in turn changes hers.",
        "runtimeMinutes": "107"
    },
    "1991_97": {
        "plotSummary": "On their 16th anniversary, a married couple's trip to a Beverly Hills mall becomes the stage for personal revelations and deceptions.",
        "runtimeMinutes": "89"
    },
    "1991_98": {
        "plotSummary": "David Merrill (Robert De Niro), a fictitious 1950s Hollywood Director, returns from filming abroad in France to find that his loyalty has been called into question by the House Committee on Un-American Activities, and he is unable to work ...See moreDavid Merrill (Robert De Niro), a fictitious 1950s Hollywood Director, returns from filming abroad in France to find that his loyalty has been called into question by the House Committee on Un-American Activities, and he is unable to work until cleared. Before being called, his highest priority had been his work to the extent of leaving his wife (Annette Bening) and son (Luke Edwards) alone for several months at a time. He initially refuses to implicate others or himself in a private meeting with Roy Cohn and a studio lawyer. This decision initially to stick to his principles first leaves him unable to work in his profession, even with films and producers he never would have worked with before. Harassment by the F.B.I. leaves him unable to work on Broadway, with advertising agencies, or even in a small film repair shop. Finally, having fallen so far, and tempted with a new offer to direct a film from his old studio (if he testifies), he agrees to go before the Committee, initially planning to name his friends. But when confronted with the cruel and tyrannical behavior of the House Committee on Un-American Activities, he realizes that there is a higher priority in his life. There is standing up for what is right, and in doing so, he inspires friends and family to do the same.  Written by Mike Harris See less",
        "runtimeMinutes": "105"
    },
    "1991_99": {
        "plotSummary": "After losing his arm in a car accident, a criminal psychologist has it replaced with a limb that belonged to a serial killer.",
        "runtimeMinutes": "88"
    }
}