{
    "1992_1": "A kindhearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true.",
    "1992_10": "Two slacker friends try to promote their public-access cable show.",
    "1992_100": "Phoebe and a fellow American in Rome find a dog with a $5000 reward. They take a train to the owner in Monte Carlo. She turns up murdered. They run and become suspects just as 3 other Americans on the train.",
    "1992_101": "To impress his new girlfriend, a man agrees to look after her friend's kids, only to find that they are uncontrollably rambunctious.",
    "1992_102": "A madman who believes he's a doctor comes to the town where his crazy father was killed, and soon begins murdering people and becoming infatuated with a teenage girl who has a heart condition.",
    "1992_103": "Genoese navigator overcomes intrigue in the court of King Ferdinand and Queen Isabella of Spain and gains financing for his expedition to the East Indies.",
    "1992_104": "A member of Parliament falls passionately in love with his son's fiancee despite the dangers of discovery.",
    "1992_105": "An Indian family is expelled from Uganda when Idi Amin takes power. They move to Mississippi and time passes. The Indian daughter falls in love with a black man, and the respective families have to come to terms with it.See moreAn Indian family is expelled from Uganda when Idi Amin takes power. They move to Mississippi and time passes. The Indian daughter falls in love with a black man, and the respective families have to come to terms with it.  Written by Ed Sutton See less",
    "1992_106": "South African teenagers fight against apartheid in the Soweto Uprising.",
    "1992_107": "Christopher Columbus' discovery of the Americas and the effect this has on the indigenous people.",
    "1992_108": "Two Cuban brothers bring a new music to the 1950s USA. They are as different as the problems that await them.",
    "1992_109": "Dr. Richard Sturgess leads a team of compassionate doctors at a veteran's hospital. Along with Drs. Morgan, Handleman and Van Dorn, he fights to deliver adequate care to needy veterans in the face of funding cuts and corruption.",
    "1992_11": "When CIA analyst Jack Ryan interferes with an IRA assassination, a renegade faction targets him and his family for revenge.",
    "1992_110": "The story about a cheating and incompetent lawyer (Harry Fabian) who suddenly gets obsessed on becoming a boxing promoter.",
    "1992_111": "A slightly self absorbed yuppie takes in his parents including his senile father, after their home burns down. But his personal and professional life fall apart soon after.",
    "1992_112": "Eliane adopts Camille, whose Vietnamese parents were friends. In 1930, a French navy officer is interested in Eliane (owns 60km2 plantation) and later in Camille. There's an uprising in Vietnam against French colonial power.",
    "1992_113": "Romance and adventure happen during the America's Cup series of yachting races.",
    "1992_114": "A nomadic farm worker looks after his dimwitted, gentle-giant friend during the Great Depression.",
    "1992_115": "In a flooded future London, Detective Harley Stone hunts a serial killer who murdered his partner, and has haunted him ever since. He soon discovers what he is hunting might not be human.",
    "1992_116": "In 1929 French Indochina, a French teenage girl embarks on a reckless and forbidden romance with a wealthy, older Chinese man, each knowing that knowledge of their affair will bring drastic consequences to each other.",
    "1992_117": "Marie is a vampire with a thirst for bad guys. When she fails to properly dispose of one of her victims, a violent mob boss, she bites off more than she can chew and faces a new, immortal danger.",
    "1992_118": "A young woman, Tara Maguire (Robin Wright) scandalizes her provincial Irish village in the 1950s by having a baby out of wedlock, and refusing to name the father. She has a rare beauty and every man in town desires her, especially Sergeant...See moreA young woman, Tara Maguire (Robin Wright) scandalizes her provincial Irish village in the 1950s by having a baby out of wedlock, and refusing to name the father. She has a rare beauty and every man in town desires her, especially Sergeant Hegarty (Albert Finney). The arrival of a dramatic troupe stirs things up even more, especially when she falls in love with one of the \"Playboys\", Tom Casey (Aidan Quinn).  Written by AnonymousSee less",
    "1992_119": "Gabriel Caine has just been released from prison when he sets up a bet with a business man. The business man owns most of a boxing-mad town called Diggstown. The bet is that Gabe can find a boxer that will knock out ten Diggstown men, in a...See moreGabriel Caine has just been released from prison when he sets up a bet with a business man. The business man owns most of a boxing-mad town called Diggstown. The bet is that Gabe can find a boxer that will knock out ten Diggstown men, in a boxing ring, within twenty-four hours. \"Honey\" Roy Palmer is that man, although at forty-eight, many say he is too old. A subplot was thrown in about Charles Macum Diggs, the heavyweight champion that gave the town its name, and who is now confined to a wheelchair.  Written by Colin Tinto See less",
    "1992_12": "After her last encounter, Ellen Ripley crash-lands on Fiorina 161, a maximum security prison. When a series of strange and deadly events occur shortly after her arrival, Ripley realizes that she has brought along an unwelcome visitor.",
    "1992_120": "After an accident leaves her a paraplegic, a former soap opera star struggles to recover both emotionally and mentally, until she meets her newest nurse, who has struggles of her own.",
    "1992_121": "A father recounts a dark period of his childhood when he and his little brother lived in the suburbs.",
    "1992_122": "A blade runner must pursue and terminate four replicants who stole a ship in space, and have returned to Earth to find their creator.",
    "1992_123": "In WW2, an Italian Army unit of misfits occupies an isolated non-strategic Greek island for the duration of the war.",
    "1992_124": "A conservative folk singer turns his hand to politics, running for the US Senate. He is not above dirty tricks and smear campaigns to gain an advantage over his opponent.",
    "1992_125": "Laura Palmer's harrowing final days are chronicled one year after the murder of Teresa Banks, a resident of Twin Peaks' neighboring town.",
    "1992_126": "A sleazy but affable guard dog trainer is blackmailed to steal a manuscript for a tell-all book from one of his clients.",
    "1992_127": "Six former college friends, with two new friends, gather for a New Year's Eve weekend reunion at a large English countryside manor after ten years to reminisce about the good times now long gone.",
    "1992_128": "A bunch of eccentric relatives gather for their patriarch's funeral.",
    "1992_129": "An ignored, small-town librarian confesses to a murder she didn't commit to get attention.",
    "1992_13": "Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner Ned Logan and a young man, The \"Schofield Kid.\"",
    "1992_130": "Jack sleeps with a waitress, who's later murdered. Did Jack's usual lover do it? Palm Beach detectives Jack and Steve investigate. Twists follow.",
    "1992_131": "A U.S. climbing team, funded by millionaire Clairborne is determined to conquer K2.",
    "1992_132": "Several strangers converge on a hotel in Venice, Italy, where a bellboy's bad English sets them up to clash against each other in a hilarious case of mistaken identity.",
    "1992_133": "The story of Monsieur de Sainte Colombe, fierce and somber man, grand master of the viola da gamba and professor of Marin Marais, prestigious musician in the court of Louis XIV.",
    "1992_134": "Story of a 1940s photographer who specializes in crime and is not getting involved until this time.",
    "1992_135": "A 12-year-old boy comes of age in 1969 Key West against the backdrop of the Apollo moon landing, when he begins to sell cocaine so his mother can stop stripping.",
    "1992_136": "A stand-up comic (Julie Kavner) neglects her two daughters in the midst of her newfound fame.",
    "1992_137": "When a simple jewelry heist goes horribly wrong, the surviving criminals begin to suspect that one of them is a police informant.",
    "1992_138": "An English boy, living in Africa during World War II, through his boxing prowess, becomes a symbol of hope, in a time of war.",
    "1992_139": "A musical based on the New York City newsboy strike of 1899. When young newspaper sellers are exploited beyond reason by their bosses they set out to enact change and are met by the ruthlessness of big business.",
    "1992_14": "An ex-Navy Seal turned cook is the only person who can stop a group of terrorists when they seize control of a U.S. battleship.",
    "1992_140": "What seemed to be a simple little trip becomes an international chase, when an extremely rare bottle of wine's discovered (bottled during the appearance of the Great Comet of 1811). Margaret Harwood's sent to retrieve it so it can be ...See moreWhat seemed to be a simple little trip becomes an international chase, when an extremely rare bottle of wine's discovered (bottled during the appearance of the Great Comet of 1811). Margaret Harwood's sent to retrieve it so it can be auctioned. Oliver Plexico is her travel guide/bodyguard, because there's other people who desperately want this bottle, and they'll stop at nothing to get it.  Written by Brian W Martz  [edited]See less",
    "1992_141": "With a serial strangler on the loose, a bookkeeper wanders around town searching for the vigilante group intent on catching the killer.",
    "1992_142": "A young woman becomes the fourth wife of a wealthy lord, and must learn to live with the strict rules and tensions within the household.",
    "1992_143": "Chappy discovers a drug-smuggling scheme at his own air base. It turns out that the lives of some village people in Peru are at stake, and he decides to fly there with ancient airplanes and friends to free them.",
    "1992_144": "Two freethinking teenagers - a boy and a girl - confront with authoritarian teachers in their boarding schools. The other students treat this differently.",
    "1992_145": "A tough female district attorney is investigating a man who picks out women from public places by posing as a famous photographer, then takes pictures of them, then pushes on their submissive tendencies and takes advantage of them ...See moreA tough female district attorney is investigating a man who picks out women from public places by posing as a famous photographer, then takes pictures of them, then pushes on their submissive tendencies and takes advantage of them physically and financially. The trouble is that none of these women want to press charges, because they feel fulfilled in some way by their encounter. The DA arranges to meet him and finds herself in a similar situation as the other victims, and has to come to grips with her own submissive desires.  Written by Ed Sutton See less",
    "1992_146": "A travelling theater group find so much action going on behind-the-scenes, they almost ruin the performances.",
    "1992_147": "A film about the life and work of the cosmologist, Stephen Hawking, who despite his near total paralysis, was one of the great minds of all time.",
    "1992_148": "An alien Overlord plans to blow up the Earth but first, he snatches and proposes to marry an Earthman's wife.",
    "1992_149": "Four teens summon forth a diminuitive, demonic minion from The Other Side to do their bidding and grant their wishes, but of course, they must all ultimately pay the price...",
    "1992_15": "When a woman learns of an immortality treatment, she sees it as a way to outdo her long-time rival.",
    "1992_150": "While investigating a young nun's rape, a corrupt New York City police detective, with a serious drug and gambling addiction, tries to change his ways and find forgiveness and redemption.",
    "1992_151": "An anthology of 5 different cab drivers in 5 American and European cities and their remarkable fares on the same eventful night.",
    "1992_152": "A seductive teen befriends an introverted high school student and schemes her way into the lives of her wealthy family.",
    "1992_153": "Post-apocalyptic surrealist black comedy about the landlord of an apartment building who occasionally prepares a delicacy for his odd tenants.",
    "1992_154": "A film about struggling to deal with paralysis. Author Joel Garcia breaks his neck while hiking, and finds himself in a rehabilitation centre with Raymond, an exaggerating ladies' man, and Bloss, a racist biker. Considerable tension builds...See moreA film about struggling to deal with paralysis. Author Joel Garcia breaks his neck while hiking, and finds himself in a rehabilitation centre with Raymond, an exaggerating ladies' man, and Bloss, a racist biker. Considerable tension builds as each character tries to deal with his new found handicap and the problems that go with it, especially Joel, whose lover Anna is having as difficult a time as he is. As Raymond reveals a dream about dancing on the surface of a lake to stay afloat, it becomes apparent that each of them must find his own Waterdance to survive his tragedy.  Written by Michael Silva See less",
    "1992_155": "A cynical American expatriate struggles to decide whether or not he should help his former lover and her fugitive husband escape French Morocco.",
    "1992_156": "Matthew Broderick goes Out on a Limb in this surprising adventure about a financial whiz who takes a wild detour to come to the aid of his kid sister in the small logging town of Buzzsaw.",
    "1992_157": "Languid look at the Gullah culture of the sea islands off the coast of South Carolina and Georgia where African folk-ways were maintained well into the 20th Century and was one of the last bastions of these mores in America. Set in 1902.See moreLanguid look at the Gullah culture of the sea islands off the coast of South Carolina and Georgia where African folk-ways were maintained well into the 20th Century and was one of the last bastions of these mores in America. Set in 1902.  Written by John Sacksteder See less",
    "1992_158": "A white, hip-hop loving teen falls in love with a black girl.",
    "1992_159": "A small town police chief awaits the arrival of a gang of killers.",
    "1992_16": "A slobbering St. Bernard becomes the center of attention for a loving family, but must contend with a dog-napping veterinarian and his henchmen.",
    "1992_160": "This WW2 psychological drama plays out at Christmas. US GIs hold an isolated cabin in the Ardennes against a handful of Germans cut off from their main force. Combat-weary and short of rations, both sides are determined to survive.",
    "1992_161": "For her entire life, twenty-seven year old Marianne Johnson has been on the move, the decisions which she's made as an adult which have been total failures, such as her second most recent marriage to Curtis Johnson, which brought her to ...See moreFor her entire life, twenty-seven year old Marianne Johnson has been on the move, the decisions which she's made as an adult which have been total failures, such as her second most recent marriage to Curtis Johnson, which brought her to Normal, Wyoming. However, she has an optimistic view of life, always believing that each decision she makes will be the right one. She is a linear thinker and despite being bright in this regard, she has no life or job skills, never having had a paying job besides a short stint in the army where she met Curtis. Conversely, thirty-eight year old Darly Peters wears her failures openly on her sleeve, she bulldozing her way through life. Currently a cocktail waitress in Normal, waitressing which dominates her resume, Darly receives news that her ex-husband, who she left eighteen years ago, has died and has deeded the house which they were building at the time in remote Palmer Valley, Alaska to her. She believes this house will be the first time in her life she will feel settled. Seeing in Marianne a stranger in need, Darly offers Marianne a ride to Portland, where she will be staying with her judgmental sister and brother-in-law. As that move to Portland also proves to be another disaster in Marianne's life, she decides to accept Darly's invitation to go to Alaska with her. Along the way, they get into one adventure after another, meeting people who may affect their view of life. What will also affect their lives is Darly's Alaska past which leads to life in Alaska not quite what they were expecting.  Written by HuggoSee less",
    "1992_162": "After a rich Edwardian widow impulsively marries a handsome but poor Tuscan dentist and dies in childbirth, her English in-laws try to gain custody of the baby.",
    "1992_163": "A former gangster fresh out of prison wants to change his life for the better and must save his 10 year old son who has already chosen a gang life.",
    "1992_164": "Each night, young Nemo goes to Slumberland and has adventures and befriends the king of Slumberland, Morpheus. But one night Nemo discovers Nightmare Land, and the evil nightmare king, throwing Slumberland and Nemo himself into danger.",
    "1992_165": "A waitress lives with her two teen daughters in a trailer park in New Mexico. They all want a boyfriend.",
    "1992_166": "This documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert's of a family of 4 brothers (the other 3 being Roscoe, Lyman and William - Bill, for short), working as semi-literate farmers, and ...See moreThis documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert's of a family of 4 brothers (the other 3 being Roscoe, Lyman and William - Bill, for short), working as semi-literate farmers, and living together in isolation in a ramshackle shack, until William's death. The subsequent police investigation and medical examiner's autopsy suggested Bill may not have died from natural causes, and Delbert was arrested on charges of second-degree murder. Under questioning by police, Delbert appears to have waived his rights and signed a confession, but, it seems he might not have been competent, and was coerced into doing so. The film explores possible motives for the crime, from mercy-killing (Bill was ill at the time), to progressively more outre hypotheses. It also shows how residents of the rural community of Munnsville, NY rallied to the support of one of their own (residents previously considered the Wards as social outcasts), against what they felt were intrusive 'big-city' police and a district attorney involved in an election, who might've used the death to help bolster his candidacy.  Written by Tad Dibbern See less",
    "1992_167": "A compilation of fourteen animated short films from five countries, two of which are Academy Award Winners.",
    "1992_168": "In 1909, poor theology student Henrik falls in love with Anna, the intelligent daughter of a rich family in Uppsala. After marrying Henrik becomes a priest in northern Sweden. Urbane Anna hates living in the county, growing restless.",
    "1992_169": "Thomas and Alfred were born around the same time; a fire in the nursery had nurses scrambling to save the newborns. Because he felt that he deserved Alfred's good fortune at being born into a wealthy family, Thomas conceives the idea that ...See moreThomas and Alfred were born around the same time; a fire in the nursery had nurses scrambling to save the newborns. Because he felt that he deserved Alfred's good fortune at being born into a wealthy family, Thomas conceives the idea that he and Alfred were switched at birth, and he can't help seeing that his unhappiness should be Alfred's, from the loss of his sister to his inability to have a relationship with the woman Evelyne. So, as his life is ending, he formulates a plan of revenge against his bitter enemy, his lifetime adversary, the man who stole his existence.  Written by Gary Dickerson See less",
    "1992_17": "A young Irish couple flee to the States, but subsequently struggle to obtain land and prosper freely.",
    "1992_170": "Antoine has always been fascinated with a hairdresser's delicate touch, the beguiling perfume and the figure of a woman with an opulent bosom, moreover, he knew that he would marry one, fulfilling his dream of a perfect and idealised love.",
    "1992_171": "A French prince who was turned into a frog becomes a secret agent and goes to England to stop an evil plot that begins when famous buildings there start disappearing.",
    "1992_172": "A comedy about a screenwriter (Robert Wuhl), whose old movie script is read by a producer (Martin Landau) and the search for financial backers begins. But it seems that each money source (Danny Aiello, Robert De Niro, and Eli Wallach) has ...See moreA comedy about a screenwriter (Robert Wuhl), whose old movie script is read by a producer (Martin Landau) and the search for financial backers begins. But it seems that each money source (Danny Aiello, Robert De Niro, and Eli Wallach) has his own mistress that he wants put into the film. Gradually, the screenwriter is forced to make changes to his script to accommodate these backers, until he finally sees no semblance of his original ideas in the writing.  Written by BOB STEBBINS See less",
    "1992_173": "Pittsburgh, 1974: A high school history teacher slowly losing it tells his class about his experiences as teenager in England during WWII incl. curious 16 y.o. Mary.",
    "1992_174": "Follow a n all-star cast of legendary skiers that include Billy Kidd, Doug Lewis, Scot Schmidt, Stein Eriksen and many others as they journey and attempt to ski the even steeper and deeper. Grab your gear and come along to places like New ...See moreFollow a n all-star cast of legendary skiers that include Billy Kidd, Doug Lewis, Scot Schmidt, Stein Eriksen and many others as they journey and attempt to ski the even steeper and deeper. Grab your gear and come along to places like New Mexico, Turkey, Chile, and even Hawaii and someday soon maybe you'll be ready to take on the steeper and deeper ski slopes too.See less",
    "1992_175": "A drug dealer reconsiders his profession when his boss plans to go straight and an old flame reappears.",
    "1992_176": "Just after W.W.II, an American takes a railway job in Germany, but finds his position politically sensitive with various people trying to use him.",
    "1992_177": "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.See moreDirector Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.  Written by Murray Chapman See less",
    "1992_178": "An exploration of certain conspiracy theories surrounding the JFK assassination from Jack Ruby's perspective. Ruby owns a run-down strip club in Dallas, and does what he can for credibility, both by giving information to the FBI and by ...See moreAn exploration of certain conspiracy theories surrounding the JFK assassination from Jack Ruby's perspective. Ruby owns a run-down strip club in Dallas, and does what he can for credibility, both by giving information to the FBI and by doing the odd favor for his mafia contacts. When hitman Action Jackson is hit, Louie Vitali asks him to help get crime boss Santos out of a Cuban jail. When they get back, the bosses take his headliner Candy Cane under their wing to develop her career in Vegas. A mysterious government man named Maxwell expresses his displeasure to Ruby over his Cuban activities. Slowly all the pieces of a massive conspiracy begin to emerge to Ruby, who can do nothing to stop it.  Written by Ed Sutton See less",
    "1992_179": "Three manic idiots; a lawyer, cab driver and a handyman team up to run a ballet company to fulfill the will of a millionaire. Tribute to The Marx Brothers, antics result as the trio try to outwit the rich widow and her scheming big-shot ...See moreThree manic idiots; a lawyer, cab driver and a handyman team up to run a ballet company to fulfill the will of a millionaire. Tribute to The Marx Brothers, antics result as the trio try to outwit the rich widow and her scheming big-shot lawyer, who also wants to run the ballet.  Written by Rob HartillSee less",
    "1992_18": "A prep school student needing money agrees to \"babysit\" a blind man, but the job is not at all what he anticipated.",
    "1992_180": "Liberal district attorney decides to seek the death penalty for a man who slaughtered a family at Christmastime, then drank their blood. He escapes, though, and starts killing again.See moreLiberal district attorney decides to seek the death penalty for a man who slaughtered a family at Christmastime, then drank their blood. He escapes, though, and starts killing again.  Written by frankfob2@yahoo.comSee less",
    "1992_181": "A handful of survivors from a disastrous 1528 Spanish expedition to Florida journey across the coast until they reach Mexico.",
    "1992_182": "Reporter Judith Wilkes leaves her husband and two sons in Sydney and goes to Malaysia to cover the story of the Vietnamese boat people. She becomes romantically involved with Kanan, and strikes up a friendship with Lady Minou Hobday, who ...See moreReporter Judith Wilkes leaves her husband and two sons in Sydney and goes to Malaysia to cover the story of the Vietnamese boat people. She becomes romantically involved with Kanan, and strikes up a friendship with Lady Minou Hobday, who keeps a regular vigil at \"Turtle Beach\" where the refugees try to land secretly in the hope that one day her own children will arrive. Accompanying Minou one night, Judith witnesses a brutal massacre by the Malaysians which spurs her on to expose the horrors of the internment camps at Bidong.  Written by Jonathan Ridsdale See less",
    "1992_183": "Two scientists who are hopeless with the opposite sex experiment with a substance that makes them irresistible to anyone who hears them speak.",
    "1992_184": "In this Derek Jarman version of Christopher Marlowe's Elizabethan drama, in modern costumes and settings, Plantagenet king Edward II hands the power-craving nobility the perfect excuse by taking as lover besides his diplomatic wife, the ...See moreIn this Derek Jarman version of Christopher Marlowe's Elizabethan drama, in modern costumes and settings, Plantagenet king Edward II hands the power-craving nobility the perfect excuse by taking as lover besides his diplomatic wife, the French princess Isabel, not an acceptable lady at court but the ambitious Piers Gaveston, who uses his favor in bed even to wield political influence - the stage is set for a palace revolt which sends the gay pair from the throne to a terminal torture dungeon.  Written by KGF VissersSee less",
    "1992_185": "Luke is a gay hustler. Jon is a movie critic. Both are HIV positive. They go on a hedonistic, dangerous journey, their motto \"Fuck the world\".",
    "1992_186": "A kindhearted but bumbling idiot who likes to steal bananas, is passed off for a snitch hiding from the mob.",
    "1992_187": "In 1958 California, a teenage girl goes to work as a prostitute in a high-class brothel after the death of her father.",
    "1992_188": "This film describes the events surrounding a 1975 shootout at the Pine Ridge reservation in S. Dakota where two FBI agents were killed.",
    "1992_189": "The life of a blind photographer who is looked after by a housekeeper is disrupted by the arrival of an agreeable restaurant worker.",
    "1992_19": "Two sisters join the first female professional baseball league and struggle to help it succeed amidst their own growing rivalry.",
    "1992_190": "April 1957: The rational Engineer Faber's plane crashes in Mexico. He learns that he became dad in 1938. He takes a ship from NYC for France and meets cute, young Sabeth. Fate?",
    "1992_191": "The adventures of three teenage friends in 1970s Detroit.",
    "1992_192": "Julia (Rojo) is a phone operator in Mexico City who divides her time between her job, her daughter and the danzon: a cuban dance very popular in Mexico and Central America. Every wednesday Julia does the danzon with Carmelo (Rergis) in the...See moreJulia (Rojo) is a phone operator in Mexico City who divides her time between her job, her daughter and the danzon: a cuban dance very popular in Mexico and Central America. Every wednesday Julia does the danzon with Carmelo (Rergis) in the old \"Salon Colonia\". They've danced for years but barely know each other. One night Carmelo disappears without a trace. Feeling lonely and sad, Julia takes a train to Veracruz, where she knows Carmelo has a brother. That sudden trip will change Julia's life forever.  Written by Maximiliano Maza See less",
    "1992_193": "While investigating his own blackmailing, a young politician uncovers his family's deep secrets.",
    "1992_194": "A reflection about what makes everyone's life unique, through the story of Noah's family. Noah is an adjuster, having sex with his customers. His wife Hera watches pornographic movies for the Board of Censors. They live with their son ...See moreA reflection about what makes everyone's life unique, through the story of Noah's family. Noah is an adjuster, having sex with his customers. His wife Hera watches pornographic movies for the Board of Censors. They live with their son Simon and Hera's sister in a show-flat. One day, they meet Bubba, who wants to make a movie in their house.  Written by YepokSee less",
    "1992_195": "King is a young man, but he's already a veteran of life on the streets of Los Angeles. The leader of a group of runaways, King acts as a mentor to troubled kids such as gay hustler Little J and junkie Greg.",
    "1992_196": "A curious friendship develops between Gombo, a young Mongolian shepherd living with his wife and family in a hut, deep in the wilderness of the steppes, and Sergei, a Russian worker whose truck breaks down not far from Gombo's hut.",
    "1992_197": "This is the story of Spalding Gray and his attempt to write a novel. It is a first person account about writing and living, and dealing with success while trying to be successful.See moreThis is the story of Spalding Gray and his attempt to write a novel. It is a first person account about writing and living, and dealing with success while trying to be successful.  Written by Robbie Smith See less",
    "1992_198": "A film about the true reasons for the 1989 US invasion of Panama and big media complicity in these activities.",
    "1992_199": "A man who doesn't like stable work environments has been away for too many years, and finds out his wife has divorced him and is planning to remarry. He comes home to confront her, trying to convince her not to get married, aided by the ...See moreA man who doesn't like stable work environments has been away for too many years, and finds out his wife has divorced him and is planning to remarry. He comes home to confront her, trying to convince her not to get married, aided by the daughter, who loves him despite his wandering ways. The couple finds out they still have feelings for each other but must decide how best to handle the contradiction of their lifestyles.  Written by Ed Sutton See less",
    "1992_2": "A former Secret Service agent takes on the job of bodyguard to an R&B singer, whose lifestyle is most unlike a President's.",
    "1992_20": "A successful executive and womanizer finds his lifestyle choices have turned back on him when his new female boss turns out to be an even bigger deviant than he is.",
    "1992_200": "At the turn of the century, Henri Gauthier-Villars, a notorious bachelor, marries the young country girl Gabrielle Colette and introduces her to debauched Parisian life. Gabrielle keeps a diary of all her experiences, which Villars, the ...See moreAt the turn of the century, Henri Gauthier-Villars, a notorious bachelor, marries the young country girl Gabrielle Colette and introduces her to debauched Parisian life. Gabrielle keeps a diary of all her experiences, which Villars, the spendthrift heir to a publishing house, prints as the Claudine series under his pen-name of \"Willy\". Villars sets up a threesome with Gabrielle and Polaire, one of his mistresses, but the women become lovers and allies. Gabrielle finally becomes fed up with the duplicity of Villars, and publishes her books under her own name \"Colette\".  Written by Will GilbertSee less",
    "1992_201": "A girl fed up with her quirky, disfunctional family runs away from home, causing all of them to spend time with each other.",
    "1992_202": "Chronicles the six-month strike at Hormel in Austin, Minnesota, in 1985-86. The local union, P-9 of the Food and Commercial Workers, overwhelmingly rejects a contract offer with a $2/hour wage cut. They strike and hire a New York ...See moreChronicles the six-month strike at Hormel in Austin, Minnesota, in 1985-86. The local union, P-9 of the Food and Commercial Workers, overwhelmingly rejects a contract offer with a $2/hour wage cut. They strike and hire a New York consultant to manage a national media campaign against Hormel. Despite support from P-9's rank and file, FCWU's international disagrees with the strategy. In addition to union-company tension, there's union-union in-fighting. Hormel holds firm; scabs, replacement workers, brothers on opposite sides, a union coup d'etat, and a new contract materialize. The film asks, was it worth it, or was the strike a long-term disaster for organized labor?  Written by See less",
    "1992_203": "New Yorker Adolpho Rollo is your classic head-movie auteur. In his mind, he's creating deathless classics of the screen. Back in the real world, he can't pay the rent on the downtown grothole he calls home.",
    "1992_204": "Rock singer John Mellencamp makes his screen and directorial debut in this story by \"Lonesome Dove\" author, Larry McMurtry. The story, not too separated from Mellencamp's real life, finds him as a country music star whose meanderings and ...See moreRock singer John Mellencamp makes his screen and directorial debut in this story by \"Lonesome Dove\" author, Larry McMurtry. The story, not too separated from Mellencamp's real life, finds him as a country music star whose meanderings and philandering has thrown his life into turmoil. Returning to his native Indiana to try to reestablish a normal life. Instead he takes up with an old lover (Lenz), ignoring his loving wife (Hemingway), and duplicating the lifestyle of his womanizing father (Akins).  Written by John Sacksteder See less",
    "1992_205": "In Brighton in 1959, disgraced cop turned private detective Tony Aaron works largely on falsifying adulteries for use as evidence in divorce cases. He involves his wife as the fictional co-respondent for painter Carlo Stasio but the pair ...See moreIn Brighton in 1959, disgraced cop turned private detective Tony Aaron works largely on falsifying adulteries for use as evidence in divorce cases. He involves his wife as the fictional co-respondent for painter Carlo Stasio but the pair are shot dead in the hotel room. In charge of the case is Frank, Tony's ex-partner still on the Brighton force. His most likely suspects are Angeline, Stasio's mistress who is set to inherit his house and pictures, and Tony himself, parts of whose story don't seem to add up.  Written by Jeremy Perkins {J-26}See less",
    "1992_206": "Two adolescent children of wealthy parents deal with the emotional travails of spoiled youth by indulging in self destructive behaviour including but not limited to drugs, parties and teen sex. Friends John (Luke Perry) and Alex (Timothy ...See moreTwo adolescent children of wealthy parents deal with the emotional travails of spoiled youth by indulging in self destructive behaviour including but not limited to drugs, parties and teen sex. Friends John (Luke Perry) and Alex (Timothy Owen) deal with issues of betrayal involving Alex'a girlfriend Stevie (Estee Chandler).See less",
    "1992_207": "The final sixty-seven days of Van Gogh's life are examined.",
    "1992_208": "A man wearing a colorful hat dances on a small island. All is well until the Grim Reaper appears in a small boat, beckoning the dancer to come with him. Does this mean the end for the dancer's joyous footsteps?",
    "1992_209": "An expert on productivity shows wacky workers in 1966 Australia how to run their moccasin factory like clockwork, despite laying off more than half the workforce.",
    "1992_21": "During a cryogenics test, a pilot frozen in 1939 awakes in 1992 but time is running out, as his body starts to age rapidly.",
    "1992_210": "For want of a nail a shoe was lost, for want of a shoe... a young man's life is almost lost, which is exactly what this film is all about: a man barely twenty who wants desperately to pull out of London's drug world by taking a job as a ...See moreFor want of a nail a shoe was lost, for want of a shoe... a young man's life is almost lost, which is exactly what this film is all about: a man barely twenty who wants desperately to pull out of London's drug world by taking a job as a waiter in a 'normal' restaurant. But to do this he must come up with a \"sensible pair of shoes,\" an item that his homeless meanderings hasn't provided him. In fact, the shoes become a symbol of his striving to break away from those, like himself, who are caught up in the tragedy of drugs and lasciviousness which is so aptly described... sometimes graphically, always realistically... in this film.  Written by BOB STEBBINS See less",
    "1992_211": "Debbie and Gerald's lives drastically change after they get a gun. Their mysterious neighbor, Skippy, becomes and important and transforming figure in their lives.See moreDebbie and Gerald's lives drastically change after they get a gun. Their mysterious neighbor, Skippy, becomes and important and transforming figure in their lives.  Written by Jay Thomas See less",
    "1992_212": "Two strangers meet on the road and travel through Nevada on motorcycle to find an elusive spot where they can dump another man's ashes.",
    "1992_213": "Bitter about being double-crossed by the women he loved, (and with the police after him to boot), Bill vows to seduce the next woman he sees, then throw her away. His brother Dennis, meanwhile, is equally determined to track down their ...See moreBitter about being double-crossed by the women he loved, (and with the police after him to boot), Bill vows to seduce the next woman he sees, then throw her away. His brother Dennis, meanwhile, is equally determined to track down their long lost father, a revolutionary who has been in hiding for 20 years. For different reasons, both leave New York and head for Long Island, out of money, and short on ideas. D:\"Long Island is a a terminal moraine.\" B:\"What's that?\" D:\"It's the material left behind when a glacier recedes.\" D:\"Gee, then what the hell are we waiting for?\"  Written by Stuart Criley See less",
    "1992_214": "Federico Fellini accepts the request of a television crew to be interviewed about his career, narrating memories, dreams, realities and fantasies.",
    "1992_215": "Shakes is good at his job as party clown - when he's sober and shows up. Five druggy clowns frame him for the murder of his boss.",
    "1992_216": "An adulterous woman's faith in God is tested when her husband dies and miraculously comes back to life.",
    "1992_217": "A struggling young musician and devoted fan of Ricky Nelson wants to be just like his idol and become a rock star.",
    "1992_218": "A comic book artist struggling with his \"Brenda Starr\" strip decides to draw himself into it when his comic book character is disappointed and leaves the strip.",
    "1992_219": "A little boy, obsessed with blindness and violence, slowly gets trapped in his own delusions.",
    "1992_22": "A security pro finds his past coming back to haunt him, when he and his unique team are tasked with retrieving a particularly important item.",
    "1992_220": "Two friends take their dying buddy on one last road trip.",
    "1992_221": "This is a documentary about the 1992 New Hampshire primaries. It includes much footage of candidates as they meet people, and just before they go \"on-air\".See moreThis is a documentary about the 1992 New Hampshire primaries. It includes much footage of candidates as they meet people, and just before they go \"on-air\".  Written by Philip Apps See less",
    "1992_222": "Three generations of women (Talia Shire, Nina Siemaszko, and Colleen Dewhurst) run a failing bed and breakfast in this gentle romantic comedy. Everything changes when a charming mysterious stranger (Sir Roger Moore) shows up on the scene.See moreThree generations of women (Talia Shire, Nina Siemaszko, and Colleen Dewhurst) run a failing bed and breakfast in this gentle romantic comedy. Everything changes when a charming mysterious stranger (Sir Roger Moore) shows up on the scene.  Written by John Sacksteder See less",
    "1992_223": "Jimmy Boland is a man unjustly accused of a brutal crime. Within the prison he must fight for survival, freedom and justice.",
    "1992_224": "A veteran hit man, Dekker is ready to call it quits and leave the profession. Dekker's final job, however, proves to be trickier than expected when the sadistic Zidzyck recruits the assassin to kill his wife.",
    "1992_225": "An eloping bride is taken into Hell, and her fiance must pursue.",
    "1992_226": "An Italian gentleman and a doctor's wife plot to break up their spouses' tryst in Paris.",
    "1992_227": "Manny tries to get his crack addict brother, Danny, to clean up.",
    "1992_228": "An unsuccessful, nervous businessman gradually comes to befriend an eccentric, asocial nerd on a trip to Utah to bury a deceased cat.",
    "1992_229": "Famous Independent Film written, produced and directed by jefery levy, starring David Warner. Winner of numerous festival awards. Read more: Synopsis",
    "1992_23": "Con artist Gwen moves into Newton's empty home without his knowledge and begins setting up house, posing as his new wife.",
    "1992_230": "Swedish pauper's family is starving. In desperation, he steals his lord's ox. He hopes that the crime will not be revealed, but it happens.",
    "1992_231": "A father/widower and a teenage son live in a seaside town with a serial killer. The son starts hanging out with girls and drug dealers.",
    "1992_232": "Jack and Julie live in a bare flat in Paris. At night, Jack drives a taxi while Julie wanders around the city, and in the day they make love. One day Julie meets Joseph, the daytime driver of the taxi, and soon Julie is spending her nights...See moreJack and Julie live in a bare flat in Paris. At night, Jack drives a taxi while Julie wanders around the city, and in the day they make love. One day Julie meets Joseph, the daytime driver of the taxi, and soon Julie is spending her nights with Joseph and her days with Jack.  Written by Will GilbertSee less",
    "1992_233": "A business man buys a house, but he has a hard time trying to get rid of its previous tenant, a dirty bum.",
    "1992_234": "A coming-of-age tale set in Brooklyn during the late '50s which centers around the high school life of a group of teens that have to deal with racial tensions at their interracial vocational high school.",
    "1992_235": "An uptight, stay-at-home children's novelist has delusions indicating that something will happen to him at eight o'clock.",
    "1992_24": "Black and white basketball hustlers join forces to double their chances of winning money on the street courts and in a basketball tournament.",
    "1992_25": "After her humiliated husband kills himself, an embittered pregnant widow loses her child, and embarks on a mission of vengeance against a woman and her family.",
    "1992_26": "Three trappers protect the daughters of a British Colonel in the midst of the French and Indian War.",
    "1992_27": "A tough police sergeant's overbearing mother comes to visit him and begins to meddle in his life and career.",
    "1992_28": "Two New Yorkers accused of murder in rural Alabama while on their way back to college call in the help of one of their cousins, a loudmouth lawyer with no trial experience.",
    "1992_29": "A British soldier kidnapped by IRA terrorists soon befriends one of his captors, who then becomes drawn into the soldier's world.",
    "1992_3": "One year after Kevin McCallister was left home alone and had to defeat a pair of bumbling burglars, he accidentally finds himself stranded in New York City - and the same criminals are not far behind.",
    "1992_30": "The Szalinski family is back, this time hilarious disaster strikes when an experiment causes their new toddler son to grow many stories tall.",
    "1992_31": "A burglar holds a knife to Karen's throat while her husband does nothing. The couple ends befriending the cop that comes. The friendship ends when the cop beats up the culprit. Karen isn't ready to end it. Things get ugly with the cop.",
    "1992_32": "A living puppet, with the help of a cricket as his conscience, must prove himself worthy to become a real boy.",
    "1992_33": "A self-centered Minnesota lawyer is sentenced to community service coaching a rag tag youth hockey team.",
    "1992_34": "The inseparable duo try to organize a rock concert while Wayne must fend off a record producer who has an eye for his girlfriend.",
    "1992_35": "Biographical epic of the controversial and influential Black Nationalist leader, from his early life and career as a small-time gangster, to his ministry as a member of the Nation of Islam.",
    "1992_36": "A woman advertising for a new roommate finds that something very strange is going on with the tenant who decides to move in.",
    "1992_37": "A conman discovers during a \"job\" that US Congress is where the money is. \"Name recognition\" gets him elected. Will he develop a conscience?",
    "1992_38": "In the beautiful and dangerous Amazon rainforest, dissimilar people must make their choices between business, science, and love.",
    "1992_39": "An airline security expert must take action when he finds himself trapped on a passenger jet when terrorists seize control of it.",
    "1992_4": "A violent police detective investigates a brutal murder that might involve a manipulative and seductive novelist.",
    "1992_40": "An American woman of Irish, Jewish-German parentage goes undercover in Nazi Germany.",
    "1992_41": "The story about two sons of a stern minister -- one reserved, one rebellious -- growing up in rural Montana while devoted to fly fishing.",
    "1992_42": "When they find a frozen caveman in their back yard, two high school outcasts thaw him and introduce him to modern life while he in turn gets them to actually enjoy life.",
    "1992_43": "A petty crook stalks a cute girl into an office building and is taken for a job applicant. Conning gets him the job. It's in the mail room of new credit cards. 2 superiors are worse crooks.",
    "1992_44": "The oncologist wife of a prominent child psychologist suspects her husband has an unhealthy scientific obsession with their child, unaware of what - or who - is really going on inside his head.",
    "1992_45": "Two rival soldiers who were killed in Vietnam are brought back to life in a top secret military experiment that creates superhuman warriors.",
    "1992_46": "Jack loses $65,000 in poker in Las Vegas, where he's marrying Betsy. The wedding will have to wait as the poker winner wants the weekend with Betsy to cancel the debt. She accepts. Whom will she marry?",
    "1992_47": "The magical inhabitants of a rainforest fight to save their home, which is threatened by logging and a polluting force of destruction called Hexxus.",
    "1992_48": "A simple man is turned into a genius through the application of computer science.",
    "1992_49": "The Muppet characters tell their version of the classic tale of an old and bitter miser's redemption on Christmas Eve.",
    "1992_5": "Martin Riggs and Roger Murtaugh pursue a former LAPD officer who uses his knowledge of police procedure and policies to steal and sell confiscated guns and ammunition to local street gangs.",
    "1992_50": "A mother-and-son team of strange supernatural creatures move to a small town to seek out a young virgin to feed on.",
    "1992_51": "The story of the notorious American labor union figure Jimmy Hoffa, who organizes a bitter strike, makes deals with members of the organized crime syndicate and mysteriously disappears in 1975.",
    "1992_52": "Each year, three brothers visit their grandfather for the summer. He is highly skilled in ninjutsu, and for years he has trained the boys in his techniques.",
    "1992_53": "A psychiatrist becomes romantically involved with the sister of one of his patients, but the influence of her controlling gangster husband threatens to destroy them both.",
    "1992_54": "A businessman thwarts his wife's bequest of an estate to another woman.",
    "1992_55": "The Candyman, a murderous soul with a hook for a hand, is accidentally summoned to reality by a skeptic grad student researching the monster's myth.",
    "1992_56": "A temperamental figure skater and a former hockey player try to win Olympic gold as a figure skating pairs team.",
    "1992_57": "Fake faith healer Jonas Nightingale is stranded in a small town where he finds he can't fool all of the people all of the time.",
    "1992_58": "When Lieutenant General Leland Zevo (Sir Michael Gambon) inherits a toymaking company and begins making war toys, his employees band together to stop him before he ruins the name of Zevo Toys forever.",
    "1992_59": "A couple fall in love despite the girl's pessimistic outlook. As they struggle to come to terms with their relationship, something supernatural happens that tests it.See moreA couple fall in love despite the girl's pessimistic outlook. As they struggle to come to terms with their relationship, something supernatural happens that tests it.  Written by Ed Sutton See less",
    "1992_6": "While Batman deals with a deformed man calling himself the Penguin wreaking havoc across Gotham with the help of a cruel businessman, a female employee of the latter becomes the Catwoman with her own vendetta.",
    "1992_60": "A young mixed-blood FBI agent is assigned to work with a cynical veteran investigator on a murder on a poverty-stricken Sioux reservation.",
    "1992_61": "A Chicagoan inherits an old yacht. He, his wife, daughter and son fly to a Caribbean island and hire a dubious Captain Ron to sail them on an adventure to Miami.",
    "1992_62": "A Hollywood studio executive is being sent death threats by a writer whose script he rejected, but which one?",
    "1992_63": "During a joint dinner at the restaurant, the neighbors offer to exchange wives for one night. It was a joke, but only at first.",
    "1992_64": "A woman ditches her small town life for big city Chicago, where she becomes a sensation as a radio show host.",
    "1992_65": "George Kuffs, 21, leaves a pregnant girlfriend. He visits his brother Brad to bum money off him. Brad's shot and George IDs the killer at SFPD but to no avail. He inherits Brad's patrol district. He keeps it to get the killer.",
    "1992_66": "Jack Elliot, once a great baseball player, is forced to play in Japan where his brash, egotistical ways cause friction with his new teammates and friends.",
    "1992_67": "Four inner-city teenagers get caught up in the pursuit of power and happiness, which they refer to as \"the juice\".",
    "1992_68": "Babe Ruth becomes a baseball legend but is unheroic to those who know him.",
    "1992_69": "A not-so-nice man rescues passengers from a crashed airliner, only to see someone else take credit.",
    "1992_7": "Military lawyer Lieutenant Daniel Kaffee defends Marines accused of murder. They contend they were acting under orders.",
    "1992_70": "A group of twenty-something friends most of whom live in the same apartment complex search for love and success in grunge-era Seattle.",
    "1992_71": "At her husband's funeral, Pearl (Shirley MacLaine), Jewish mother of two divorced and antagonistic daughters, meets an old Italian friend (Marcello Mastroianni) of her husband, whose advice years previously had stopped the husband leaving ...See moreAt her husband's funeral, Pearl (Shirley MacLaine), Jewish mother of two divorced and antagonistic daughters, meets an old Italian friend (Marcello Mastroianni) of her husband, whose advice years previously had stopped the husband leaving home. For 23 years he, now a widower, has secretly loved Pearl...  Written by See less",
    "1992_72": "Bounty hunters from the future transport a doomed race car driver to New York City in 2009, where his mind will be replaced with that of a dead billionaire.",
    "1992_73": "A teenage boy and his father move to his recently-deceased mother's hometown, where they encounter the ancient Native American cemetery with the power to raise the dead.",
    "1992_74": "A uniformed cop is recruited by a drug enforcement agent to infiltrate a drug smuggling ring looking to expand its operation.",
    "1992_75": "Flighty teenage girl Buffy Summers learns that she is her generation's destined battler of vampires.",
    "1992_76": "Dusty gets tired of all the smoke and light effects, wonders what happened to doing it the way that made him famous and happy. Takes a walk to find what seems to be missing and finds himself and his music again!",
    "1992_77": "To climb the corporate ladder to success, a guy agrees to coach the company's all girl soccer team with the help of his secret weapon: his fiancee's son.",
    "1992_78": "Set in the 1950s, a star-quarterback is given an opportunity to attend an elite preparatory school but must conceal the fact that he is Jewish.",
    "1992_79": "An American doctor, a British nurse and an illiterate Indian farmer join together to transform a Calcutta ghetto in this uplifting, inspirational movie starring Patrick Swayze and Pauline Collins.",
    "1992_8": "When a worldly singer witnesses a mob crime, the police hide her as a nun in a traditional convent where she has trouble fitting in.",
    "1992_80": "After a freak accident, a yuppie turns invisible and runs from a treacherous CIA official, while trying to cope with his new life.",
    "1992_81": "When student Jake Lo witnesses a killing, he finds himself caught between two feuding drug lords. Betrayed and set up by the federal agents, the only person he can trust is Ryan, a Chicago cop who reminds Jake of his deceased father.",
    "1992_82": "A comic strip femme fatale seeks to seduce her cartoonist creator in order to cross over into the real world.",
    "1992_83": "The life of Buddy Young, a comic legend in flashbacks but an old man looking for work in the present.",
    "1992_84": "Basil, the rodent Sherlock Holmes, investigates the kidnapping of a toy maker and uncovers its link to his archenemy, Professor Ratigan.",
    "1992_85": "A valedictorian and a juvenile delinquent have their school records switched and begin to be treated like the other.",
    "1992_86": "Two firemen in a burning building get a treasure map - stolen gold church items are hidden in a closed down factory in St. Louis. Once there, they're trapped in by a black gang considering it their territory.",
    "1992_87": "Four English women, after World War I, who are unhappy with their lives, and their time away on vacation in a beautiful Italian villa.",
    "1992_88": "A Mexican-American Mafia kingpin is released from prison, falls in love for the first time, and grows introspective about his gangster lifestyle.",
    "1992_89": "An investigative reporter must send the newly unbound Pinhead and his legions back to Hell.",
    "1992_9": "The centuries old vampire Count Dracula comes to England to seduce his barrister Jonathan Harker's fiancee Mina Murray and inflict havoc in the foreign land.",
    "1992_90": "Emily, a tough NYPD cop, is sent to an orthodox Jewish community to investigate a missing person plus $720,000 in missing diamonds. To solve what becomes a murder case, she has to join the community.",
    "1992_91": "In order to defeat the Grand Duke of Owls, a young boy transformed into a cat teams up with a group of barnyard animals to find a rooster who can raise the sun.",
    "1992_92": "John Berlin, a big-city cop from Los Angeles, moves to a small-town police force and immediately finds himself investigating a murder. Using theories rejected by his colleagues John meets a young blind woman named Helena, who he is ...See moreJohn Berlin, a big-city cop from Los Angeles, moves to a small-town police force and immediately finds himself investigating a murder. Using theories rejected by his colleagues John meets a young blind woman named Helena, who he is attracted to. Meanwhile, a serial killer is on the loose and only John knows it.  Written by Rob HartillSee less",
    "1992_93": "Eve tells her shrink, Ann, about kinky sex with a man. Ann learns that it's the same man, she's been seeing lately. Eve finds out and explodes. A murder follows.",
    "1992_94": "A husband and wife are sucked into a hellish television set and have to survive a gauntlet of twisted versions of shows they find themselves in.",
    "1992_95": "An examination of the machinations behind the scenes at a real estate office.",
    "1992_96": "When their best friends announce that they're separating, a professor and his wife discover the faults in their own marriage.",
    "1992_97": "A film about the troubled and controversial life of the master comedy filmmaker Charles Chaplin.",
    "1992_98": "Tommy Riley has moved with his dad to Chicago from a 'nice place'. He keeps to himself, goes to school. However, after a street fight he is noticed and quickly falls into the world of illegal underground boxing - where punches can kill.",
    "1992_99": "A small southwestern town Sheriff finds a body in the desert with a suitcase and five hundred thousand dollars. He impersonates the man and stumbles into an F.B.I. investigation.See moreA small southwestern town Sheriff finds a body in the desert with a suitcase and five hundred thousand dollars. He impersonates the man and stumbles into an F.B.I. investigation.  Written by Ed Sutton See less"
}