{
    "1993_1": {
        "plotSummary": "A pragmatic paleontologist visiting an almost complete theme park is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose.",
        "runtimeMinutes": "127"
    },
    "1993_10": {
        "plotSummary": "A law student uncovers a conspiracy, putting herself and others in danger.",
        "runtimeMinutes": "141"
    },
    "1993_100": {
        "plotSummary": "A sardonic hardware store clerk is accidentally transported to 1300 A.D., where he must retrieve the Necronomicon and battle an army of the dead so he can return home.",
        "runtimeMinutes": "81"
    },
    "1993_101": {
        "plotSummary": "A middle-aged couple suspects foul play when their neighbor's wife suddenly drops dead.",
        "runtimeMinutes": "104"
    },
    "1993_102": {
        "plotSummary": "The two worst barbers in Harlem become cops while a real estate developer forces people out of Harlem.",
        "runtimeMinutes": "85"
    },
    "1993_103": {
        "plotSummary": "Doug's a concierge at a luxury hotel on Manhattan. He saves all his tips towards his plan for a hotel. A potential investor seduces the girl, Doug loves, with false promises of leaving his wife. Doug's dilemma: hotel project or girl?",
        "runtimeMinutes": "96"
    },
    "1993_104": {
        "plotSummary": "When shy, soft-spoken Chicago detective Wayne \"Mad Dog\" Dobie inadvertently saves the life of local gangster Frank Milo, he's the reluctant recipient of an unusual one week \"thank you\" gift - a beautiful bartender named Glory.",
        "runtimeMinutes": "97"
    },
    "1993_105": {
        "plotSummary": "In 1863, the Northern and Southern forces fight at Gettysburg in the decisive battle of the American Civil War.",
        "runtimeMinutes": "271"
    },
    "1993_106": {
        "plotSummary": "Robocop saves the day once more. This time the half man/half robot takes on ruthless developers who want to evict some people on \"their\" land.",
        "runtimeMinutes": "104"
    },
    "1993_107": {
        "plotSummary": "A writer's fictional alter ego wants to take over his life...at any price.",
        "runtimeMinutes": "122"
    },
    "1993_108": {
        "plotSummary": "The dogs can talk at a family of 4, where mom loses her job the same day dad gets a job as pilot for a cute, single boss.",
        "runtimeMinutes": "96"
    },
    "1993_109": {
        "plotSummary": "A pair of sociopath killers take on the police and the mob in order to make one last big score.",
        "runtimeMinutes": "92"
    },
    "1993_11": {
        "plotSummary": "Secret Service agent Frank Horrigan (Clint Eastwood) couldn't save Kennedy, but he's determined not to let a clever assassin take out this president.",
        "runtimeMinutes": "128"
    },
    "1993_110": {
        "plotSummary": "A young man in a small Midwestern town struggles to care for his mentally-disabled younger brother and morbidly obese mother while attempting to pursue his own happiness.",
        "runtimeMinutes": "118"
    },
    "1993_111": {
        "plotSummary": "A Pulitzer prize writer buys a cabin. The neighbors get suspicious when a stranger \"breaks in\". They see a black man and call the police, who start shooting at him. The sheriff tries a cover-up involving a white petty crook. Bad idea.",
        "runtimeMinutes": "96"
    },
    "1993_112": {
        "plotSummary": "Decades later, a son of a killer falls in love with a girl, whose family's horrifying murder he saw in childhood.",
        "runtimeMinutes": "126"
    },
    "1993_113": {
        "plotSummary": "A small-time film promoter releases a kitschy horror film during the Cuban Missile Crisis.",
        "runtimeMinutes": "99"
    },
    "1993_114": {
        "plotSummary": "A time traveling scientist goes back to prehistoric times and feeds dinosaurs a magic cereal that increases their intelligence - next they land in modern New York City for a series of comic adventures.",
        "runtimeMinutes": "72"
    },
    "1993_115": {
        "plotSummary": "In the summer of 1942, two young boys are sent to stay with their stern grandmother and their childlike aunt in Yonkers, New York.",
        "runtimeMinutes": "114"
    },
    "1993_116": {
        "plotSummary": "An evil, sadistic Leprechaun goes on a killing rampage in search of his beloved pot of gold.",
        "runtimeMinutes": "92"
    },
    "1993_117": {
        "plotSummary": "After being arrested during a manic episode, a man who suffers from bipolar disorder is treated by a psychiatrist who begins to develop romantic feelings towards him.",
        "runtimeMinutes": "114"
    },
    "1993_118": {
        "plotSummary": "An autoworker and his buddy exit Detroit, move to Colorado and become popular ski instructors.",
        "runtimeMinutes": "113"
    },
    "1993_119": {
        "plotSummary": "A high school teacher from a troubled inner city Washington D.C. neighborhood becomes a super-powered hero and takes on the gang that has been terrorizing his streets.",
        "runtimeMinutes": "100"
    },
    "1993_12": {
        "plotSummary": "When a Jamaican sprinter is disqualified from the Olympic Games, he enlists the help of a dishonored coach to start the first Jamaican Bobsled Team.",
        "runtimeMinutes": "98"
    },
    "1993_120": {
        "plotSummary": "The adventures of high school and junior high students on the last day of school in May 1976.",
        "runtimeMinutes": "102"
    },
    "1993_121": {
        "plotSummary": "A spoof on thrillers from before 1993 such as Fatal Attraction, Basic Instinct, Chinatown , Cape Fear etc. A cop/lawyer cheats on his wife and she on him and plans to kill him for the insurance.",
        "runtimeMinutes": "91"
    },
    "1993_122": {
        "plotSummary": "A boy develops a disease so rare that nobody is working on a cure, so his father decides to learn all about it and tackle the problem himself.",
        "runtimeMinutes": "129"
    },
    "1993_123": {
        "plotSummary": "A prepubescent chess prodigy refuses to harden himself in order to become a champion like the famous but unlikable Bobby Fischer.",
        "runtimeMinutes": "109"
    },
    "1993_125": {
        "plotSummary": "A journalist and his son travel to Nebraska to investigate the mysterious town of Gatlin where, unbeknownst to them, a murderous cult of children are still waiting in the corn fields.",
        "runtimeMinutes": "92"
    },
    "1993_126": {
        "plotSummary": "To satisfy his nagging parents, a gay landlord and a female tenant agree to a marriage of convenience, but his parents arrive to visit and things get out of hand.",
        "runtimeMinutes": "106"
    },
    "1993_127": {
        "plotSummary": "In a future, private underground prison/Fortress, the inmates are computer controlled with CCTV, dream readers and devices that can cause pain or death. John and his illegally pregnant wife are inside but want to escape before birth.",
        "runtimeMinutes": "95"
    },
    "1993_128": {
        "plotSummary": "The Colosseum is the fighting arena owned by the champion Bracus. Now after the death of their friend, Rhee and Roberts want revenge.",
        "runtimeMinutes": "101"
    },
    "1993_129": {
        "plotSummary": "A young mouse, mole and hedgehog risk their lives to find a cure for their badger friend, who's been poisoned by men.",
        "runtimeMinutes": "71"
    },
    "1993_13": {
        "plotSummary": "When a boy learns that a beloved killer whale is to be killed by the aquarium owners, the boy risks everything to free the whale.",
        "runtimeMinutes": "112"
    },
    "1993_130": {
        "plotSummary": "A woman is released from prison, an expert bank robber who wants to settle down and go straight, but her parole officer and her former employer try to get her to pull one more heist.",
        "runtimeMinutes": "105"
    },
    "1993_131": {
        "plotSummary": "Nice guy junior exec Peter doesn't play dirty but unfortunately, some of his colleagues do. In comes Kris, his new temp, who is bright and efficient and saves him. She's willing to play dirty for Peter.",
        "runtimeMinutes": "96"
    },
    "1993_132": {
        "plotSummary": "An affluent New York City couple finds their lives touched, intruded upon, and compelled by a mysterious young black man who is never quite who he says he is.",
        "runtimeMinutes": "112"
    },
    "1993_133": {
        "plotSummary": "The day-to-day lives of several suburban Los Angeles residents.",
        "runtimeMinutes": "188"
    },
    "1993_134": {
        "plotSummary": "This comedy filled with much Jewish humor is about the widows Doris, Ester and Lucille, whose husbands die one after another in just a few years. Even though the three friends, all in their 50's, react quite differently on their husbands ...See moreThis comedy filled with much Jewish humor is about the widows Doris, Ester and Lucille, whose husbands die one after another in just a few years. Even though the three friends, all in their 50's, react quite differently on their husbands deaths they become even closer than what they were as couples. They frequently visit their husband's graves together and talk about perspective lives.  Written by Tom Zoerner See less",
        "runtimeMinutes": "107"
    },
    "1993_135": {
        "plotSummary": "Two boys meet at an opera training school in Peking in 1924. Their resulting friendship will span nearly 70 years and will endure some of the most troublesome times in China's history.",
        "runtimeMinutes": "171"
    },
    "1993_136": {
        "plotSummary": "During the Viet Nam War, a Viet Namese woman struggles hustling on the streets, where she comes face to face with those involved in the conflict around her.",
        "runtimeMinutes": "140"
    },
    "1993_137": {
        "plotSummary": "Jillian Shanahan, a deaf woman, becomes the target of a ruthless and corrupt cop. The cop is looking for a stolen coin, which he plans to keep for himself. A journalist briefly acquires the coin and hides it in Jillian's appartment, then ...See moreJillian Shanahan, a deaf woman, becomes the target of a ruthless and corrupt cop. The cop is looking for a stolen coin, which he plans to keep for himself. A journalist briefly acquires the coin and hides it in Jillian's appartment, then his car explodes, now the cop is after her.  Written by Rob HartillSee less",
        "runtimeMinutes": "97"
    },
    "1993_138": {
        "plotSummary": "A group of teens adores forbidden music in Nazi Germany just before the outbreak of World War II.",
        "runtimeMinutes": "112"
    },
    "1993_139": {
        "plotSummary": "Batman is wrongly implicated in a series of murders of mob bosses actually done by a new vigilante assassin.",
        "runtimeMinutes": "76"
    },
    "1993_14": {
        "plotSummary": "A farmer returns home from the Civil War, but his wife begins to suspect that the man is an impostor.",
        "runtimeMinutes": "114"
    },
    "1993_140": {
        "plotSummary": "A lesbian hires a male escort to her sister's wedding. She thinks of a scheme to get her ex-girlfriend back: he dates and dumps the ex.",
        "runtimeMinutes": "102"
    },
    "1993_141": {
        "plotSummary": "After Queen Elizabeth I commands him not to grow old, a young nobleman struggles with love and his place in the world.",
        "runtimeMinutes": "94"
    },
    "1993_142": {
        "plotSummary": "Danny DeVito is John Leary, a professional clown, whose wife's death in a car accident has left him to care for his two young boys.",
        "runtimeMinutes": "99"
    },
    "1993_143": {
        "plotSummary": "An electric surge causes a serial killer's soul to end up in a computer system.",
        "runtimeMinutes": "95"
    },
    "1993_144": {
        "plotSummary": "Two boys learn from a mysterious warrior that they are the heirs to the throne of Patusan and set out to overthrow the current monarchy.",
        "runtimeMinutes": "87"
    },
    "1993_145": {
        "plotSummary": "Grandpa Ward gives a horse he found to his grandchildren, who keep it in their tower-block flat in Dublin. The horse is stolen from them, and the two young boys set out to find it and flee on it.",
        "runtimeMinutes": "97"
    },
    "1993_146": {
        "plotSummary": "Based on the true life experiences of poet Jimmy Santiago Baca, the film focuses on step-brothers Paco and Cruz, and their bi-racial cousin Miklo.",
        "runtimeMinutes": "180"
    },
    "1993_147": {
        "plotSummary": "A former professional wrestler is hired to be the bodyguard/nanny for a couple of bratty kids whose inventor father is being stalked by a rival.",
        "runtimeMinutes": "84"
    },
    "1993_148": {
        "plotSummary": "The story about the relationship between a rebellious 1950s teenager and his abusive stepfather, based on the memoirs of writer and literature Professor Tobias Wolff.",
        "runtimeMinutes": "115"
    },
    "1993_149": {
        "plotSummary": "An order of Druids train their children to battle an evil Warlock determined to unleash Satan upon the world by bringing a collection of five mystic rune stones together.",
        "runtimeMinutes": "98"
    },
    "1993_15": {
        "plotSummary": "With the help of a magic ticket, a young movie fan is transported into the fictional world of his favorite action movie character.",
        "runtimeMinutes": "130"
    },
    "1993_150": {
        "plotSummary": "Cat and mouse duo Tom and Jerry reluctantly work together to save a young girl from her evil aunt.",
        "runtimeMinutes": "84"
    },
    "1993_151": {
        "plotSummary": "Adventures of a deadbeat dad who kidnaps his kids from the bus. Based on the true life stories and experiences of Michael J. Hardy.",
        "runtimeMinutes": "95"
    },
    "1993_152": {
        "plotSummary": "A teenage boy comes back from the dead because he is determined to win the most beautiful girl in school.",
        "runtimeMinutes": "85"
    },
    "1993_153": {
        "plotSummary": "Set in Ireland, Sharon Curley is a 20 year old living with her parents and many brothers and sisters. When she gets herself pregnant and refuses to name the father, she becomes the talk of the town.See moreSet in Ireland, Sharon Curley is a 20 year old living with her parents and many brothers and sisters. When she gets herself pregnant and refuses to name the father, she becomes the talk of the town.  Written by Rob HartillSee less",
        "runtimeMinutes": "91"
    },
    "1993_154": {
        "plotSummary": "Snow White and her new friends must rescue the Prince when he is captured by the Wicked Queen's vengeful brother.",
        "runtimeMinutes": "75"
    },
    "1993_155": {
        "plotSummary": "Ex-Special Forces soldier Louis Stevens returns to Miami to find his former high school overrun by drugs and violence. A master of the Brazilian martial art, capoeira, Stevens pledges to straighten out a dozen of the school's worst ...See moreEx-Special Forces soldier Louis Stevens returns to Miami to find his former high school overrun by drugs and violence. A master of the Brazilian martial art, capoeira, Stevens pledges to straighten out a dozen of the school's worst students by teaching them this demanding and highly-disciplined fighting style. Slowly, his program begins to work, giving the students new hope and purpose. But the local drug lord, himself a martial arts expert, vows to stop Stevens' positive influence. Now Stevens must fight to save his own life, as well as the lives of his rebellious young students.  Written by Anthony Pereyra {hypersonic91@yahoo.com}See less",
        "runtimeMinutes": "99"
    },
    "1993_156": {
        "plotSummary": "A duke dies and leaves the title and wealth to his adult son. But who's the real son: the found baby raised in USA or the abandoned baby raised by a Hindi family in London? Comedy follows.",
        "runtimeMinutes": "87"
    },
    "1993_157": {
        "plotSummary": "In an attempt to end alimony payments, a working class man tries to set up his ex wife with potential husbands.",
        "runtimeMinutes": "98"
    },
    "1993_158": {
        "plotSummary": "Mitchell Goosen is sixteen/seventeen-year-old kid from California who loves to surf and roller blade. Yet his parents, who are two zoologists, were given a grant to work in Australia. The only problem was: Mitchell couldn't go with them. ...See moreMitchell Goosen is sixteen/seventeen-year-old kid from California who loves to surf and roller blade. Yet his parents, who are two zoologists, were given a grant to work in Australia. The only problem was: Mitchell couldn't go with them. So, he gets sent to stay with his aunt, uncle, and cousin in Cincinnati, Ohio. When he arrives, he meets his cousin who is also his new roommate for the next six months: Wiley. Mitchell then goes to school and gets on the bad side the high school hockey players. Mitchell and Wiley end up enduring weeks of torture from the guys. Then, the big guys and Mitchell and Wiley have to learn to get along to try to beat the Central High School rivals in a competition down Devil's Backbone.  Written by Meagan OldsSee less",
        "runtimeMinutes": "91"
    },
    "1993_159": {
        "plotSummary": "How would you react if Christ had re-appeared on earth today? Would man kind repeat their mistakes or accept? This movie is about a modernized 2nd coming of Christ. Instead of facing Romans there are different obstacles in these modern ...See moreHow would you react if Christ had re-appeared on earth today? Would man kind repeat their mistakes or accept? This movie is about a modernized 2nd coming of Christ. Instead of facing Romans there are different obstacles in these modern times that he'd have to face.  Written by J. GreenhoodSee less",
        "runtimeMinutes": "97"
    },
    "1993_16": {
        "plotSummary": "Kidnapped boy Phillip Perry (T.J. Lowther) strikes up a friendship with his captor Butch Haynes (Kevin Costner): an escaped convict on the run from the law, while the search is headed up by honorable Texas Ranger \"Red\" Garrett (Clint Eastwood).",
        "runtimeMinutes": "138"
    },
    "1993_160": {
        "plotSummary": "Arctic, 1965: Avik tells his story starting 1931. A mapmaker flies Avik, then a preteen Eskimo boy with TB, to a hospital in Montreal, where he meets Albertine. They meet again when Avik joins WWII in UK.",
        "runtimeMinutes": "109"
    },
    "1993_161": {
        "plotSummary": "A clerk at the same hotel since 18, 30 y.o. Matthew breaks the monotony when his favorite model, Hexina, secretly stays at the hotel. He impersonates a caller and goes on a date with her. Things get deadly.",
        "runtimeMinutes": "90"
    },
    "1993_162": {
        "plotSummary": "Three young men go on an end of the summer trip to Hollywood, California. Their quest: to fulfill the fantasy of meeting Marilyn Monroe.",
        "runtimeMinutes": "90"
    },
    "1993_163": {
        "plotSummary": "Charles Dreyfus encounters Jacques Gambrelli, who reminds him painfully of Inspector Clouseau, the man who drove him insane. With good reason: Gambrelli is Clouseau's son.",
        "runtimeMinutes": "93"
    },
    "1993_164": {
        "plotSummary": "A journalist duo go on a tour of serial killer murder sites with two companions, unaware that one of them is a serial killer himself.",
        "runtimeMinutes": "117"
    },
    "1993_165": {
        "plotSummary": "Charleston, South Carolina. The Odoms have lived a life of the traditions of the American south in their longtime, large family beach front home. That tradition is turned upside down when younger daughter, bright high school senior Lucille...See moreCharleston, South Carolina. The Odoms have lived a life of the traditions of the American south in their longtime, large family beach front home. That tradition is turned upside down when younger daughter, bright high school senior Lucille Odom, arrives home to find a note from her mother, Helen Odom, that note which states that she has left for good. This move has been a long time coming for Helen, although the actual act was somewhat spontaneous based on evidence around the family home. The family patriarch, retired Warren Odom, believes his wife will eventually return. To help with the situation, Warren and Lucille request the return of Warren's eldest daughter/Lucille's older sister, Rae Odom. However, Rae has her own issues as she arrives with her new Yankee husband, Billy McQueen, and news that they got married because she's pregnant, about which she doesn't seem too happy. These goings-on affect impressionable Lucille the most, she who is trying to find her own way in life and love. But as each of the individual adult family members deal with their immediate situations - for Warren which includes if there is a second chance on love, most specifically with hairdresser Vera Delmage - Lucille may come to an understanding of her past and future.  Written by HuggoSee less",
        "runtimeMinutes": "105"
    },
    "1993_166": {
        "plotSummary": "On Christmas Eve, a little girl named Marie (Cohen) falls asleep after a party at her home and dreams herself (or does she?) into a fantastic world where toys become larger than life. Her beloved Nutcracker (Culkin) comes to life and ...See moreOn Christmas Eve, a little girl named Marie (Cohen) falls asleep after a party at her home and dreams herself (or does she?) into a fantastic world where toys become larger than life. Her beloved Nutcracker (Culkin) comes to life and defends her from the Mouse King, then is turned into a Prince after Marie saves his life.  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "1993_167": {
        "plotSummary": "Margaret would really rather become a nun than a housewife, but the wedding is all arranged, the guests have begun to arrive, so what can be done?",
        "runtimeMinutes": "79"
    },
    "1993_168": {
        "plotSummary": "3 unlike couples get to know each other thru a committee at a private NYC school.",
        "runtimeMinutes": "112"
    },
    "1993_169": {
        "plotSummary": "A traveling mariachi is mistaken for a murderous criminal and must hide from a gang bent on killing him.",
        "runtimeMinutes": "81"
    },
    "1993_17": {
        "plotSummary": "\"Rambo\" parody in which Topper Harley leads a rescue team into Iraq to save Iraqi war prisoners and all of their previous rescue teams.",
        "runtimeMinutes": "86"
    },
    "1993_170": {
        "plotSummary": "Alex, a burned out LA cyborg cop, is forced by commissioner Farnsworth to find his former cyborg partner and lover Jared who's about to deliver sensitive data to cyborg terrorists who wish to wage war against humans. Is he being played?",
        "runtimeMinutes": "95"
    },
    "1993_171": {
        "plotSummary": "A pregnant peasant woman seeks redress from the Chinese bureaucracy after the village chief kicks her husband in the groin in this comedy of justice. As she is frustrated by each level of the hierarchy and travels farther and farther away ...See moreA pregnant peasant woman seeks redress from the Chinese bureaucracy after the village chief kicks her husband in the groin in this comedy of justice. As she is frustrated by each level of the hierarchy and travels farther and farther away from the countryside the viewer is also provided with a look at the changing Chinese society through the verite camera used in most scenes.  Written by Keith Loh See less",
        "runtimeMinutes": "100"
    },
    "1993_172": {
        "plotSummary": "Brian, painter Ellen and chef Sam timeshare an apartment on different days. A shift on Mon/Wednesdays causes mistaken identity as Ellen and Sam have never met but leave notes, food etc. behind for each other.",
        "runtimeMinutes": "99"
    },
    "1993_173": {
        "plotSummary": "A surgeon becomes obsessed with the seductive woman he once was in an affair with. Refusing to accept that she has moved on, he amputates her limbs and holds her captive in his mansion.",
        "runtimeMinutes": "107"
    },
    "1993_174": {
        "plotSummary": "Parallel tales of two sexually obsessed men, one hurting and annoying women physically and mentally, one wandering around the city talking to strangers and experiencing dimensions of life.",
        "runtimeMinutes": "132"
    },
    "1993_175": {
        "plotSummary": "A genetically manipulated and very hungry dinosaur escapes from a bioengineering company and reeks havoc on the local desert town. A security guard and a girl environmentalist try to stop both it and the company's doomsday bioweapon.",
        "runtimeMinutes": "83"
    },
    "1993_176": {
        "plotSummary": "Widow Frances Lacey is being sexually harassed by her boss while she tries to provide for her brood of six children. Also, her oldest son, Shayne, is constantly in trouble. When she's fired from her job, she decides to abandon Los Angeles.",
        "runtimeMinutes": "104"
    },
    "1993_177": {
        "plotSummary": "Josh and Sam are two brothers facing change, their mother is about to marry a French accountant and the kids are sent to go live with their father in Florida. Meanwhile Josh tells Sam that he is a \"S.A.M.\" that is going to be sent to ...See moreJosh and Sam are two brothers facing change, their mother is about to marry a French accountant and the kids are sent to go live with their father in Florida. Meanwhile Josh tells Sam that he is a \"S.A.M.\" that is going to be sent to Africa to fight in a war and that Canada is a safe haven for any S.A.M. unwilling to fight. The cross-country journey begins when the 2 boys think they killed a drunk and steal his car en route to Canada where they encounter The Liberty Maid. Will Josh & S.A.M. make it to Canada or will they wish they should have never left home.  Written by Ryan Harder See less",
        "runtimeMinutes": "96"
    },
    "1993_178": {
        "plotSummary": "",
        "runtimeMinutes": "96"
    },
    "1993_179": {
        "plotSummary": "A young female landowner in 1840s Jamaica marries a just-arrived Englishman to avoid losing her property. All seems to be perfect, love arises, and happiness is on the way, but she is hiding an old secret regarding her childhood and her ...See moreA young female landowner in 1840s Jamaica marries a just-arrived Englishman to avoid losing her property. All seems to be perfect, love arises, and happiness is on the way, but she is hiding an old secret regarding her childhood and her mother. Slowly, this secret begins to erode this perfect relationship and, perhaps, her mother's story will begin again...with her.  Written by Luis Carvacho See less",
        "runtimeMinutes": "98"
    },
    "1993_18": {
        "plotSummary": "Beethoven, the St. Bernard dog, becomes a father, but his girlfriend Missy is dognapped, and his puppies are in danger of the same fate.",
        "runtimeMinutes": "89"
    },
    "1993_180": {
        "plotSummary": "Beautiful violin virtuoso Camille has two obsessions: the music of Ravel, and a friend of her husband's who crafts violins. But his heart seems to be as cold as her playing is passionate.See moreBeautiful violin virtuoso Camille has two obsessions: the music of Ravel, and a friend of her husband's who crafts violins. But his heart seems to be as cold as her playing is passionate.  Written by AnonymousSee less",
        "runtimeMinutes": "105"
    },
    "1993_181": {
        "plotSummary": "In 1960s China, French diplomat Rene Gallimard falls in love with an opera singer, Song Liling - but Song is not at all who Gallimard thinks.",
        "runtimeMinutes": "101"
    },
    "1993_182": {
        "plotSummary": "Martha Horgan, a naive woman with an intellectual impairment who lives with her aunt Frances in a small town, is known for always telling the truth. She works at a dry cleaner, where her compulsive truth-telling leads her to report to the ...See moreMartha Horgan, a naive woman with an intellectual impairment who lives with her aunt Frances in a small town, is known for always telling the truth. She works at a dry cleaner, where her compulsive truth-telling leads her to report to the boss that another employee has been stealing from the cash register. The thief, in turn, accuses Martha, and she loses her job. In the mean time, a mysterious stranger named Mackey appears at Martha's residence after learning that Aunt Frances needs her porch repaired. Mackey is hired and becomes intimately involved with Martha... which only leads to tragedy.  Written by A K 4 7 See less",
        "runtimeMinutes": "102"
    },
    "1993_183": {
        "plotSummary": "Buffoonish Ernest and his dimwitted pal Abner unearth a huge cannon reputed to contain the crown jewels of England.",
        "runtimeMinutes": "96"
    },
    "1993_184": {
        "plotSummary": "In Canada's North during the 1930s, a young Inuit kills a White trader and is pursued by the police but his father is determined to protect his fugitive son at any cost.",
        "runtimeMinutes": "112"
    },
    "1993_185": {
        "plotSummary": "A woman struggles to find a way to live her life after the death of her husband and child.",
        "runtimeMinutes": "94"
    },
    "1993_186": {
        "plotSummary": "A collection of vignettes highlighting different aspects of the life, work, and character of the acclaimed Canadian classical pianist.",
        "runtimeMinutes": "98"
    },
    "1993_187": {
        "plotSummary": "A collection of expertly photographed scenes of human life and religion.",
        "runtimeMinutes": "96"
    },
    "1993_188": {
        "plotSummary": "A young boy struggles on his own in a run-down motel after his parents and younger brother are separated from him in 1930s Depression-era Midwest.",
        "runtimeMinutes": "103"
    },
    "1993_189": {
        "plotSummary": "Olivier, the nine-year-old son of Elisabeth and Serge, a country veterinarian, vanishes one afternoon on the way to his grandmother's house. The emotional aftermath of his disappearance sends his father packing from France to Africa and ...See moreOlivier, the nine-year-old son of Elisabeth and Serge, a country veterinarian, vanishes one afternoon on the way to his grandmother's house. The emotional aftermath of his disappearance sends his father packing from France to Africa and nearly destroys his mother, who clings to her remaining child, Nadine, and her devoted neighbor, Marcel. Several years later, having relocated to the city, the police investigator who handled the case meets a Paris rent boy whom he believes to be the missing Olivier. Once he returns to his rural home, the teenager Olivier tries to assuage his mother's now-entrenched grief and heal the rift between his reunited parents. Meanwhile, he must overcome his brooding, adolescent sister's jealousy and doubts about his identity and reconcile his sleazy street life with his picturesque new surroundings. Questions about the tight-lipped Olivier's true motivations continue to crop up, however, threatening to send his mother over the edge for good.  Written by Rotten T.See less",
        "runtimeMinutes": "110"
    },
    "1993_19": {
        "plotSummary": "When his parents have to go out of town, Dennis stays with Mr. and Mrs. Wilson. The little menace is driving Mr. Wilson crazy, but Dennis is just trying to be helpful. Even to the thief who's arrived in town.",
        "runtimeMinutes": "94"
    },
    "1993_190": {
        "plotSummary": "A group of Chicago cops are involved in a raid from which $3,000,000 disappears. The local mob go after them and the body count starts to rise. The new Chief of Police makes it clear to the last remaining officer that he will look the ...See moreA group of Chicago cops are involved in a raid from which $3,000,000 disappears. The local mob go after them and the body count starts to rise. The new Chief of Police makes it clear to the last remaining officer that he will look the other way if he takes the law into his own hands. When the policeman finds he can't follow through on this someone else does and he finds himself and his girl are being hunted by more or less everyone for their own reasons.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "87"
    },
    "1993_191": {
        "plotSummary": "An unemployed man finds a money bag of $1.2 million after it dropped off an armored car.",
        "runtimeMinutes": "100"
    },
    "1993_192": {
        "plotSummary": "A group of newcomers to the country music business seek love and stardom.",
        "runtimeMinutes": "116"
    },
    "1993_193": {
        "plotSummary": "Devastated by President Kennedy's assassination, Dallas-based hairstylist Lurene Hallett boards a bus for the Washington funeral where she meets a perplexing father and his daughter who greatly impact her journey.",
        "runtimeMinutes": "105"
    },
    "1993_194": {
        "plotSummary": "In the world of work-for-hire, \"We love it!!\" may not mean \"We buy it.\" Here is an authentic, real-life story of what happens when the client, executive producer or publisher suggests \"one little change.\"",
        "runtimeMinutes": "6"
    },
    "1993_195": {
        "plotSummary": "A young woman struggles for independence and identity in a small Florida tourist town.",
        "runtimeMinutes": "114"
    },
    "1993_196": {
        "plotSummary": "Antonio, a policeman (carabiniere), has an order to take two children (Rosetta and her brother Luciano) from Milan to Sicily to an orphanage. Their mother has been arrested for forcing Rosetta (11 years old) to work as a prostitute. First ...See moreAntonio, a policeman (carabiniere), has an order to take two children (Rosetta and her brother Luciano) from Milan to Sicily to an orphanage. Their mother has been arrested for forcing Rosetta (11 years old) to work as a prostitute. First the relation between Antonio and the children is tough, but it relaxes so they become temporary friends.  Written by AnonymousSee less",
        "runtimeMinutes": "114"
    },
    "1993_197": {
        "plotSummary": "During a chess tournament, grand master Peter is suspected of murdering Debi after sex. He helps the police as the murders continue.",
        "runtimeMinutes": "116"
    },
    "1993_198": {
        "plotSummary": "A documentary of the Bill Clinton 1992 presidential campaign and the organization who ran it.",
        "runtimeMinutes": "96"
    },
    "1993_199": {
        "plotSummary": "A former cop returns to challenge a plot to escalate gang violence in the streets of Los Angeles.",
        "runtimeMinutes": "91"
    },
    "1993_2": {
        "plotSummary": "After a bitter divorce, an actor disguises himself as a female housekeeper to spend time with his children held in custody by his former wife.",
        "runtimeMinutes": "125"
    },
    "1993_20": {
        "plotSummary": "A woman moves into an exclusive New York City apartment building, which she soon discovers houses tenants with all manner of shocking secrets.",
        "runtimeMinutes": "107"
    },
    "1993_200": {
        "plotSummary": "Vicki returns to her elder sister Beth's house in Australia after an affair in Italy. Beth, with a teenage daughter, has become involved in something of a marriage of convenience with Frenchman J.P., and her rather prickly houseproud ways ...See moreVicki returns to her elder sister Beth's house in Australia after an affair in Italy. Beth, with a teenage daughter, has become involved in something of a marriage of convenience with Frenchman J.P., and her rather prickly houseproud ways are causing frictions counterpointed by Vicki's more laid-back and indolent air. When Beth goes off on vacation to the outback alone with her cantankerous father to see if they can finally get to know each other, relationships in the household start to shift.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "93"
    },
    "1993_201": {
        "plotSummary": "A group of angels in the German capital look longingly upon the life of humans.",
        "runtimeMinutes": "144"
    },
    "1993_202": {
        "plotSummary": "Cameramen and women discuss the craft and art of cinematography, illustrating their points with clips from 100 films, from Birth of a Nation to Do the Right Thing.",
        "runtimeMinutes": "92"
    },
    "1993_203": {
        "plotSummary": "In Nazi-occupied Paris, a young accompanist named Sophie Vasseur gets a job with famed singer Irene Brice. As Irene's husband Charles, a businessman collaborating with the Nazis, wrestles with his conscience, Sophie becomes obsessed with ...See moreIn Nazi-occupied Paris, a young accompanist named Sophie Vasseur gets a job with famed singer Irene Brice. As Irene's husband Charles, a businessman collaborating with the Nazis, wrestles with his conscience, Sophie becomes obsessed with Irene, taking on the role of maid as well as accompanist, living life vicariously through Irene's triumphs and affairs.  Written by Gary Dickerson See less",
        "runtimeMinutes": "102"
    },
    "1993_204": {
        "plotSummary": "Nick is a feckless television salesman who gets fired and impulsively decides that he and his girlfriend, Beth, will move to Butte, MT, which he's read is \"the city of the future.\" \"I read that a while ago, so the future should be there by...See moreNick is a feckless television salesman who gets fired and impulsively decides that he and his girlfriend, Beth, will move to Butte, MT, which he's read is \"the city of the future.\" \"I read that a while ago, so the future should be there by now,\" he enthuses. He waits until the last moment to tell Carol, his ex and Beth's best friend, about the move. While Nick is working his last day, Sid comes to the couple's house to paint it for the next tenants. He quickly develops an interest in Beth. He, Beth, and Carol get stoned and hang out. When Sid hears about the move, he tells Beth that he's never left Enfield, and has no interest in traveling. Meanwhile, Nick decides to take off on his own. When Beth gets word of this from Carol, she finds solace in Sid's arms. Sid proclaims his love the next morning, and implores Beth to stay. Meanwhile, Nick visits his childhood home, looking for his parents, has an epiphany, and decides to return to Carol.  Written by AnonymousSee less",
        "runtimeMinutes": "95"
    },
    "1993_205": {
        "plotSummary": "Unsettling drama about three generations of Italian-American women struggling to get by in post-World War II New York's Little Italy.See moreUnsettling drama about three generations of Italian-American women struggling to get by in post-World War II New York's Little Italy.  Written by John Sacksteder See less",
        "runtimeMinutes": "124"
    },
    "1993_206": {
        "plotSummary": "When superficial David meets Carrie in a Boston bar, he falls in love. She's not interested. She later falls for his charm. Friends observe and comment the relationship.",
        "runtimeMinutes": "86"
    },
    "1993_207": {
        "plotSummary": "Young Leo Lauzon is torn between two worlds - the squalid Montreal tenement that he inhabits with his severely dysfunctional (and largely insane) family, and the imaginative world that he constructs for himself through his writings, where ...See moreYoung Leo Lauzon is torn between two worlds - the squalid Montreal tenement that he inhabits with his severely dysfunctional (and largely insane) family, and the imaginative world that he constructs for himself through his writings, where he's Leolo Lozone, son of a Sicilian peasant (conceived in a bizarre act involving a tomato). And his experiences of growing up (especially his sexual development) affect his response to both these worlds...  Written by Michael Brooke See less",
        "runtimeMinutes": "107"
    },
    "1993_208": {
        "plotSummary": "After her businessman husband dies suspiciously in a Mexican plane crash, his widow begins to investigate his labyrinthine financial dealings, not all of which are legal.",
        "runtimeMinutes": "110"
    },
    "1993_209": {
        "plotSummary": "Andrei Cordescu, NPR journalist, Romanian immigrant, naturalized American citizen, and newly-licensed driver, sets out on a cross- country road trip. He travels from-sea-to-shining-sea in a red 1968 Cadillac ragtop, exploring the meaning ...See moreAndrei Cordescu, NPR journalist, Romanian immigrant, naturalized American citizen, and newly-licensed driver, sets out on a cross- country road trip. He travels from-sea-to-shining-sea in a red 1968 Cadillac ragtop, exploring the meaning of freedom to a variety of Americans in this gently comic, yet poignant, documentary. Highlights include stops in New York, Camden, Detroit, Chicago, Taos, Arizona, Las Vegas, and San Francisco.  Written by Tad Dibbern See less",
        "runtimeMinutes": "82"
    },
    "1993_21": {
        "plotSummary": "When an escort girl is found dead in the offices of a Japanese company in Los Angeles, detectives Web Smith and John Connor act as liaison between the company's executives and the investigating cop Tom Graham.",
        "runtimeMinutes": "125"
    },
    "1993_210": {
        "plotSummary": "After being thrown out of her home, a young woman decides to disguise herself as a man to survive the ruthless Wild West.",
        "runtimeMinutes": "121"
    },
    "1993_211": {
        "plotSummary": "Marc Huestis edits interviews with 15 men, including himself, around a set of topics starting with \"what is sex?\" The men are gay, living in or near San Francisco. They talk about their first sexual experiences, the gay scene in San ...See moreMarc Huestis edits interviews with 15 men, including himself, around a set of topics starting with \"what is sex?\" The men are gay, living in or near San Francisco. They talk about their first sexual experiences, the gay scene in San Francisco in the late 1970s, the pall cast by AIDS, the safe-sex movement, getting into serious relationships, the illness and death of partners, pornography, S/M and pain, race and stereotypes, personal fantasies, and bliss. Huestis has a thesis, that sex is going to be with us, so how best do we embrace it? His 15 subjects, archival footage, clips from porn films, and close-up looks at men loving men flesh out various answers.  Written by See less",
        "runtimeMinutes": "82"
    },
    "1993_212": {
        "plotSummary": "With hopes of becoming a doctor and not a product of her environment, a Brooklyn teenager is faced with numerous challenges that threaten her dreams.",
        "runtimeMinutes": "92"
    },
    "1993_213": {
        "plotSummary": "A collection of tales set on the Adriatic coast.",
        "runtimeMinutes": "118"
    },
    "1993_214": {
        "plotSummary": "An ex-convict is tracked down by his estranged teenage son, and the pair try to build a relationship and life together in Seattle.",
        "runtimeMinutes": "113"
    },
    "1993_215": {
        "plotSummary": "A widow tries to find out why her daughter's strange behavior, a reaction to her father's death, is progressively worsening.",
        "runtimeMinutes": "109"
    },
    "1993_216": {
        "plotSummary": "A thrill seeker agrees to help a shady professional gambler win a high stakes poker game. However, they lose and become captives of two eccentric rich men who decide to forcibly keep them on their remote gated ranch as indentured servants.",
        "runtimeMinutes": "98"
    },
    "1993_217": {
        "plotSummary": "A new pastor arrives in a stark Vermont village and is intrigued by crippled, misshapen Ethan Frome living on an isolated, hardscrabble farm with his sickly wife Zeena.",
        "runtimeMinutes": "99"
    },
    "1993_218": {
        "plotSummary": "The story of Stevie, a construction worker, and his girlfriend, an unemployed pop singer, serves to show the living conditions of the British poor classSee moreThe story of Stevie, a construction worker, and his girlfriend, an unemployed pop singer, serves to show the living conditions of the British poor class  Written by Michel Rudoy See less",
        "runtimeMinutes": "95"
    },
    "1993_219": {
        "plotSummary": "Twins, separated at birth and living opposite lives, are about to learn of each other- and the substantial inheritance they are entitled to.",
        "runtimeMinutes": "110"
    },
    "1993_22": {
        "plotSummary": "A young black woman discovers that her father was a sperm donor, and if that weren't bad enough, he's white.",
        "runtimeMinutes": "111"
    },
    "1993_220": {
        "plotSummary": "Two lonely, retired septuagenarians, an unkempt, hard-drinking Irish sea captain, and a fussy, well-mannered Cuban barber form an uneasy friendship.",
        "runtimeMinutes": "123"
    },
    "1993_221": {
        "plotSummary": "A submissive hooker goes about her trade, suffering abuse at the hands of Japanese salarymen and Yakuza types. She's unhappy about her work, and is apparently trying to find some sort of appeasement for the fact that her lover has married.See moreA submissive hooker goes about her trade, suffering abuse at the hands of Japanese salarymen and Yakuza types. She's unhappy about her work, and is apparently trying to find some sort of appeasement for the fact that her lover has married.  Written by Ed Sutton See less",
        "runtimeMinutes": "135"
    },
    "1993_222": {
        "plotSummary": "Three bored Long Island buddies seek excitement on the streets, with perilous results.",
        "runtimeMinutes": "86"
    },
    "1993_223": {
        "plotSummary": "A young man's mother is bitten by a Sumatran rat-monkey. She gets sick and dies, at which time she comes back to life, killing and eating dogs, nurses, friends, and neighbors.",
        "runtimeMinutes": "104"
    },
    "1993_224": {
        "plotSummary": "A civilian diving team is enlisted to search for a lost nuclear submarine and faces danger while encountering an alien aquatic species.",
        "runtimeMinutes": "140"
    },
    "1993_225": {
        "plotSummary": "Two bickering mercenaries are hired by the CIA to overthrow a South East Asian dictator.",
        "runtimeMinutes": "101"
    },
    "1993_226": {
        "plotSummary": "In this story of a black policeman during South African apartheid, Danny Glover plays the cop, who believes he's trying to help his people, even while serving as a pawn of the racist government. When his son gets involved in the ...See moreIn this story of a black policeman during South African apartheid, Danny Glover plays the cop, who believes he's trying to help his people, even while serving as a pawn of the racist government. When his son gets involved in the anti-apartheid movement, he finds himself torn between his family (including long-suffering wife Alfre Woodard) and what he believes is his duty.  Written by MSee less",
        "runtimeMinutes": "120"
    },
    "1993_227": {
        "plotSummary": "A film crew follows a ruthless thief and heartless killer as he goes about his daily routine. But complications set in when the film crew lose their objectivity and begin lending a hand.",
        "runtimeMinutes": "95"
    },
    "1993_228": {
        "plotSummary": "A group of skinheads become alarmed at the way their neighbourhood is changing.",
        "runtimeMinutes": "94"
    },
    "1993_229": {
        "plotSummary": "A tough L.A. cop and the teen sister of the ballerina whose murder he's investigating become targeted by a sinister cult that secretly runs the city.",
        "runtimeMinutes": "98"
    },
    "1993_23": {
        "plotSummary": "A woman hires a drifter as her guide through New Orleans in search of her father, who has gone missing. They discover a deadly game of cat and mouse behind his disappearance in the process.",
        "runtimeMinutes": "97"
    },
    "1993_230": {
        "plotSummary": "A homeless schizophrenic seeks the help of a streetwise combat veteran as they attempt to overcome cruel life on the streets.",
        "runtimeMinutes": "103"
    },
    "1993_231": {
        "plotSummary": "Joseph K. (Kyle MacLachlan) awakens one morning, to find two strange men in his room, telling him he has been arrested. Joseph is not told, with what he is charged, and despite being \"arrested\", is allowed to remain free and go to work. ...See moreJoseph K. (Kyle MacLachlan) awakens one morning, to find two strange men in his room, telling him he has been arrested. Joseph is not told, with what he is charged, and despite being \"arrested\", is allowed to remain free and go to work. But, despite the strange nature of his arrest, Joseph soon learns that his trial, however odd, is very real, and tries desperately to spare himself from the court's judgement.  Written by Mike Myers See less",
        "runtimeMinutes": "120"
    },
    "1993_232": {
        "plotSummary": "Billy, a hopeless romantic, robs banks wearing business suits, in a desperate attempt to hold on to his three-timing girl friend, Selina. Billy believes Selina only likes him for the thrill that his bank robberies offer, and the gifts he ...See moreBilly, a hopeless romantic, robs banks wearing business suits, in a desperate attempt to hold on to his three-timing girl friend, Selina. Billy believes Selina only likes him for the thrill that his bank robberies offer, and the gifts he bestows upon her. Wanting to give up his criminal life, he plans a final bank heist in order to buy a sailboat and sail away with Selina. Billy dons a business suit and pulls off the robbery. However, he fails to dismantle a security camera, and his face is recorded. Billy hides out at the nearby \"Heartbreak Hotel,\" and sees his image on the television news. Before long, hotel clerks, delivery men, and drug dealers recognize Billy, and extort him for money. Meanwhile, he becomes depressed when he realizes that Selina has been unfaithful. Billy consoles himself in the arms of a prostitute named Priscilla, who soon falls in love with him.  Written by Larry B.See less",
        "runtimeMinutes": "91"
    },
    "1993_233": {
        "plotSummary": "A trashy teen murders her sexually abusive step-father, then helps get her reformed prison pen-pal released on good behavior so that she can re-corrupt him.",
        "runtimeMinutes": "97"
    },
    "1993_234": {
        "plotSummary": "On the way to interview a novelist, Lane and Christina are involved in a car crash which leaves literary critic Christina brain-damaged. Lane undertakes the assignment and becomes attracted to the novelist's 15 year old daughter, leading ...See moreOn the way to interview a novelist, Lane and Christina are involved in a car crash which leaves literary critic Christina brain-damaged. Lane undertakes the assignment and becomes attracted to the novelist's 15 year old daughter, leading to stormy emotions.  Written by Michael Crew See less",
        "runtimeMinutes": "97"
    },
    "1993_235": {
        "plotSummary": "A story about the life of a twenty dollar bill as it weaves in and out of the various lives of several people.",
        "runtimeMinutes": "91"
    },
    "1993_236": {
        "plotSummary": "A documentary about Orson Welles's unfinished three-part film about South America.",
        "runtimeMinutes": "87"
    },
    "1993_237": {
        "plotSummary": "Two brothers with the secret power of starting fires with their minds, reunite after years apart, only to find conflict with their differing lifestyles.",
        "runtimeMinutes": "109"
    },
    "1993_238": {
        "plotSummary": "Harry Stone (Danny Aiello), a formerly top notch director, has had three disastrous movies in a row. Facing dismissal from the top perch of Hollywood and finacial ruin from back taxes, he is forced to take on a very commercial and, he ...See moreHarry Stone (Danny Aiello), a formerly top notch director, has had three disastrous movies in a row. Facing dismissal from the top perch of Hollywood and finacial ruin from back taxes, he is forced to take on a very commercial and, he believes, ridiculous movie. Now as he faces the film's release and, he believes, another total flop which will complete his ruin, he meets up with his son and daughter and his former wives (which includes Dyan Cannon) to examine his life and his future. The film examines the turmoil a movie director goes through with a film release. His agent (Jerry Stiller) assures him that he has a hit, while those around him wince (as does the audience) at the thought of the movie within the movie. The movie is \"The Pickle\", a supposedly social satire where a bunch of super-white kids from Kansas take vegetables into space via a super cucumber and land on an Earth-like planet where everyone lives only on beef and die at age 49. As shown in the excerpts of the film, Little Richard stars as the President of the planet who has 6 months to live, Ally Sheedy heads up the Kansas contingent, and Griffin Dunne is the President's aide who falls in love with Sheedy.  Written by John Sacksteder See less",
        "runtimeMinutes": "103"
    },
    "1993_239": {
        "plotSummary": "Martina is a professional lady whose clients are harmless if eccentric; she sees herself as a social worker. Shy Maurizio dubs sound for cartoons while his outgoing brother dubs more saucy material and gets the girls. After Maurizio ...See moreMartina is a professional lady whose clients are harmless if eccentric; she sees herself as a social worker. Shy Maurizio dubs sound for cartoons while his outgoing brother dubs more saucy material and gets the girls. After Maurizio accidentally helps Martina on some of her assignations she decides to find out if he wants to help regularly. Whether or not it's the possibility of romance, Maurizio is horrified to find on their first date that his hands have been replaced by cartoon ones with minds of their own.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "94"
    },
    "1993_24": {
        "plotSummary": "A weatherman finds himself inexplicably living the same day over and over again.",
        "runtimeMinutes": "101"
    },
    "1993_240": {
        "plotSummary": "A drunken self-destructive woman called Betty wanders through bars and meets a man that drives her to a restaurant outside Paris called Le Trou (The Hole). She meets the middle-aged alcoholic Laure from Lyon, who is the lover of the Le ...See moreA drunken self-destructive woman called Betty wanders through bars and meets a man that drives her to a restaurant outside Paris called Le Trou (The Hole). She meets the middle-aged alcoholic Laure from Lyon, who is the lover of the Le Trou's owner Mario. Laure decides to take care of Betty and brings her to the room next-door in her hotel. Along the days, Betty tells the story of her bourgeois life and her unhappy marriage to Laure and also recalls moments of her promiscuous life.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "103"
    },
    "1993_241": {
        "plotSummary": "Having recently witnessed the horrific results of a top secret project to bring the dead back to life, a distraught youth performs the operation on his girlfriend after she's killed in a motorcycle accident.",
        "runtimeMinutes": "97"
    },
    "1993_242": {
        "plotSummary": "Mac is the ambitious, overbearing, irresistible oldest of three brothers who struggle against all odds to scrape together enough money to start their own business in Queens, New York.",
        "runtimeMinutes": "117"
    },
    "1993_243": {
        "plotSummary": "The history of post-World War II popular dance up to the mid-sixties is explored with the focus being on the Twist.",
        "runtimeMinutes": "74"
    },
    "1993_244": {
        "plotSummary": "A vain actor, his best friend, and an activist end up at a mutant freak farm run by a weirdo scientist.",
        "runtimeMinutes": "86"
    },
    "1993_245": {
        "plotSummary": "An ex-convict who is on parole is accused of murdering a loose woman in the town where he works.",
        "runtimeMinutes": "96"
    },
    "1993_246": {
        "plotSummary": "A young Pakistani, living in England thinks that he is a cowboy and dreams of leading his country music band to success in Nashville. He meets a young woman who leaves her abusive husband and joins their group as a singer, but when they ...See moreA young Pakistani, living in England thinks that he is a cowboy and dreams of leading his country music band to success in Nashville. He meets a young woman who leaves her abusive husband and joins their group as a singer, but when they get a break with a record company, the company is only interested in her. Taking the proceeds of the sale of their family home, they finally set out to achieve their dream in Nashville. There are several comic sub-plots as well, the main one revolving around a biker gang out to get the family.  Written by Blair Stannard See less",
        "runtimeMinutes": "85"
    },
    "1993_247": {
        "plotSummary": "A New York City film director working on his latest movie in Los Angeles begins to reflect the actions in his movie and real life, especially when he begins an affair with the lead actress.",
        "runtimeMinutes": "108"
    },
    "1993_248": {
        "plotSummary": "Reverend Francis Ashby (Sir Michael Palin), a senior Oxford don on vacation alone in the Alps, meets vacationing American Miss Caroline Hartley (Connie Booth) and her companion Miss Elinor Hartley (Trini Alvarado), the blossoming ...See moreReverend Francis Ashby (Sir Michael Palin), a senior Oxford don on vacation alone in the Alps, meets vacationing American Miss Caroline Hartley (Connie Booth) and her companion Miss Elinor Hartley (Trini Alvarado), the blossoming Irish-American girl she adopted many years before. Ashby finds he enjoys their company, particularly that of Elinor, and both of the women are drawn to him. Back at Oxford he is nevertheless taken aback when they arrive unannounced. Women are not allowed in the College grounds, let alone the rooms. Indeed any liaison, however innocent, is frowned on by the upstanding Fellows.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "95"
    },
    "1993_249": {
        "plotSummary": "Long Island, NY, summer 1961: Preteen Alice follows, from across the street, the glamorous love life of Sheryl, 17, with bowling alley Rick. A friendship develops as Alice helps Sheryl see Rick.",
        "runtimeMinutes": "89"
    },
    "1993_25": {
        "plotSummary": "A lifelong feud between two neighbors since childhood only gets worse when a new female neighbor moves across the street.",
        "runtimeMinutes": "103"
    },
    "1993_250": {
        "plotSummary": "When Joe loses his dad in a sting, he contacts his dad's twin, Lou, who has a major sting planned. Lou's helper feels threatened by Joe. Who's conning who?",
        "runtimeMinutes": "98"
    },
    "1993_251": {
        "plotSummary": "Robert Downey, Jr. gives reports and interviews with other stars in this documentary about the Democratic National Convention in 1992.",
        "runtimeMinutes": "96"
    },
    "1993_252": {
        "plotSummary": "A ten year-old boy runs away from his abusive parents, steals a Mustang, and a pursues a promotional card game sold at gas stations.",
        "runtimeMinutes": "90"
    },
    "1993_253": {
        "plotSummary": "Housewife Annie Marsh (Dame Helen Mirren) suspects her husband might be The Hawk, a brutal serial killer. Complicating matters is the fact that she once was incarcerated in a psychiatric hospital. When she discovers she does not have the ...See moreHousewife Annie Marsh (Dame Helen Mirren) suspects her husband might be The Hawk, a brutal serial killer. Complicating matters is the fact that she once was incarcerated in a psychiatric hospital. When she discovers she does not have the happy marriage she always believed and begins to piece together the times and dates of her husband's frequent absences, her fears begin to take hold, and her sanity deteriorates.  Written by Winona KentSee less",
        "runtimeMinutes": "88"
    },
    "1993_254": {
        "plotSummary": "A mysterious man, Suba, gets himself a job at a fencing academy, and as he learns the way of the students, the school, and its maestro, they learn that there's more to him than meets the eye. He gains (or regains?) his fencing skills and ...See moreA mysterious man, Suba, gets himself a job at a fencing academy, and as he learns the way of the students, the school, and its maestro, they learn that there's more to him than meets the eye. He gains (or regains?) his fencing skills and his philosophy of teaching clashes with the maestro's. As they are thrown into conflict, Suba and the maestro's past appear to be linked. And the resolution of their mysterious relationship may be a duel to the death.  Written by Kathy LiSee less",
        "runtimeMinutes": "91"
    },
    "1993_255": {
        "plotSummary": "3 women and a gay man in their 20s share a house in LA. Boyfriends and a kid brother come and go.",
        "runtimeMinutes": "114"
    },
    "1993_256": {
        "plotSummary": "David Herdeg's participation in a failed 1943 experiment in radar invisibility has propelled him 40 years into the future. An aberration in his genetic makeup enabled him to pass through the portal of time. It has also made him sensitive ...See moreDavid Herdeg's participation in a failed 1943 experiment in radar invisibility has propelled him 40 years into the future. An aberration in his genetic makeup enabled him to pass through the portal of time. It has also made him sensitive to any alteration to the time continuum. Another disasterous experiment in 1993 sends a stealth aircraft through the time portal, into 1943 Germany. Simultaneously, Herdeg is pulled into the portal, and finds himself in the terrifying 1993 that resulted from a Nazi victory in World War II.  Written by Kevin Ackley See less",
        "runtimeMinutes": "97"
    },
    "1993_257": {
        "plotSummary": "In 1961, Robert Young and Michael Roemer shot a gritty documentary in Palermo's Cortile Cascino, a slum reserved for rag pickers and scavengers. Thirty years later, Young's son and daughter-in-law go back to Sicily to pick up the story of ...See moreIn 1961, Robert Young and Michael Roemer shot a gritty documentary in Palermo's Cortile Cascino, a slum reserved for rag pickers and scavengers. Thirty years later, Young's son and daughter-in-law go back to Sicily to pick up the story of Angela Capra, her now ex-husband, and their children. Black and white footage from 1961 is intercut with color footage from the 90's. Much has changed: Angela's leaving her husband gives her a sense of rebirth. And much is the same: unemployment, petty crimes, and early death. Throughout, family members credit the power of \"destina\" (fate) to determine their lives.  Written by See less",
        "runtimeMinutes": "85"
    },
    "1993_26": {
        "plotSummary": "A man's coerced confession to an I.R.A. bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them.",
        "runtimeMinutes": "133"
    },
    "1993_27": {
        "plotSummary": "A Puerto Rican former convict, just released from prison, pledges to stay away from drugs and violence despite the pressure around him and lead on to a better life outside of N.Y.C.",
        "runtimeMinutes": "144"
    },
    "1993_28": {
        "plotSummary": "A fictionalized account of the life of the martial arts superstar.",
        "runtimeMinutes": "120"
    },
    "1993_29": {
        "plotSummary": "An uncanny Presidential lookalike named Dave is recruited by the Secret Service to become a momentary stand-in for the President of the United States.",
        "runtimeMinutes": "110"
    },
    "1993_3": {
        "plotSummary": "Dr. Richard Kimble, unjustly accused of murdering his wife, must find the real killer while being the target of a nationwide manhunt led by a seasoned U.S. Marshal.",
        "runtimeMinutes": "130"
    },
    "1993_30": {
        "plotSummary": "A young boy stays with his aunt and uncle and befriends his cousin, a boy of the same age who shows increasing signs of violent and psychopathic behavior.",
        "runtimeMinutes": "87"
    },
    "1993_31": {
        "plotSummary": "A police officer is brought out of suspended animation in prison to pursue an old ultra-violent nemesis who is loose in a non-violent future society.",
        "runtimeMinutes": "115"
    },
    "1993_32": {
        "plotSummary": "A feature adaptation of the classic television show, when nice guy redneck Jed Clampett strikes it rich when he finds black oil, and moves him and his kin to posh Beverly Hills.",
        "runtimeMinutes": "92"
    },
    "1993_33": {
        "plotSummary": "Showgirl Deloris Van Cartier returns as Sister Mary Clarence to teach music to a group of Catholic students whose run-down school is slated for closure.",
        "runtimeMinutes": "107"
    },
    "1993_34": {
        "plotSummary": "A successful lawman's plans to retire anonymously in Tombstone, Arizona are disrupted by the kind of outlaws he was famous for eliminating.",
        "runtimeMinutes": "130"
    },
    "1993_35": {
        "plotSummary": "When an accident miraculously gives a boy an incredibly powerful pitching arm, he becomes a major league pitcher for the Chicago Cubs.",
        "runtimeMinutes": "103"
    },
    "1993_36": {
        "plotSummary": "France, 1625: Young d'Artagnan heads to Paris to join the Musketeers but the evil cardinal has disbanded them - save 3. He meets the 3, Athos, Porthos and Aramis, and joins them on their quest to save the king and country.",
        "runtimeMinutes": "105"
    },
    "1993_37": {
        "plotSummary": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
        "runtimeMinutes": "76"
    },
    "1993_38": {
        "plotSummary": "The Addams Family try to rescue their beloved Uncle Fester from his gold-digging new love, a black widow named Debbie.",
        "runtimeMinutes": "94"
    },
    "1993_39": {
        "plotSummary": "A tale about a happily married couple who would like to have children. Tracy teaches art, Andy's a college dean. Things are never the same after she is taken to hospital and operated upon by Jed, a \"know all\" doctor.",
        "runtimeMinutes": "107"
    },
    "1993_4": {
        "plotSummary": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "runtimeMinutes": "195"
    },
    "1993_40": {
        "plotSummary": "When their closest friend April O'Neil discovers an ancient scepter with magical powers, the turtles must cow-a-bunga their way back to 17th century Japan to rescue her from the evil clutches of Lord Norinaga.",
        "runtimeMinutes": "96"
    },
    "1993_41": {
        "plotSummary": "A fun-loving American bulldog pup, a hilarious Himalayan cat, and a wise old golden retriever embark on a long trek through the rugged wilderness of the Sierra Nevada mountains in a quest to reach home and their beloved owners.",
        "runtimeMinutes": "84"
    },
    "1993_42": {
        "plotSummary": "Exiled into the dangerous forest by her wicked stepmother, a princess is rescued by seven dwarf miners who make her part of their household.",
        "runtimeMinutes": "83"
    },
    "1993_43": {
        "plotSummary": "An ordinary man frustrated with the various flaws he sees in society begins to psychotically and violently lash out against them.",
        "runtimeMinutes": "113"
    },
    "1993_44": {
        "plotSummary": "After witnessing a murder, a young boy named Devon refuses to testify unless he is given the chance to be a policeman.",
        "runtimeMinutes": "97"
    },
    "1993_45": {
        "plotSummary": "In the mid-19th century, a mute woman is sent to New Zealand along with her young daughter and prized piano for an arranged marriage to a wealthy landowner, but is soon lusted after by a local worker on the plantation.",
        "runtimeMinutes": "121"
    },
    "1993_46": {
        "plotSummary": "A curious youngster moves to Salem, where he struggles to fit in before awakening a trio of diabolical witches that were executed in the 17th century.",
        "runtimeMinutes": "96"
    },
    "1993_47": {
        "plotSummary": "The story of singer Tina Turner's rise to stardom and how she gained the courage to break free from her abusive husband, Ike Turner.",
        "runtimeMinutes": "118"
    },
    "1993_48": {
        "plotSummary": "A Uruguayan rugby team stranded in the snow swept Andes are forced to use desperate measures to survive after a plane crash.",
        "runtimeMinutes": "120"
    },
    "1993_49": {
        "plotSummary": "Having gotten a taste of college life, a drastically changed farm girl returns home for Thanksgiving break with her best friend, a flamboyant party animal who is clearly a fish out of water in a small farm town.",
        "runtimeMinutes": "95"
    },
    "1993_5": {
        "plotSummary": "A young lawyer joins a prestigious law firm only to discover that it has a sinister dark side.",
        "runtimeMinutes": "154"
    },
    "1993_50": {
        "plotSummary": "A spoof of Robin Hood in general, and Robin Hood: Prince of Thieves in particular.",
        "runtimeMinutes": "104"
    },
    "1993_51": {
        "plotSummary": "In the summer of 1962, a new kid in town is taken under the wing of a young baseball prodigy and his rowdy team, resulting in many adventures.",
        "runtimeMinutes": "101"
    },
    "1993_52": {
        "plotSummary": "The life histories of four Asian women and their daughters reflect and guide each other.",
        "runtimeMinutes": "139"
    },
    "1993_53": {
        "plotSummary": "A tale of nineteenth-century New York high society in which a young lawyer falls in love with a woman separated from her husband, while he is engaged to the woman's cousin.",
        "runtimeMinutes": "139"
    },
    "1993_54": {
        "plotSummary": "A young, recently-orphaned girl is sent to England after living in India all of her life. Once there, she begins to explore her new, seemingly-isolated surroundings, and its secrets.",
        "runtimeMinutes": "101"
    },
    "1993_55": {
        "plotSummary": "A government fakes the death of a criminal to turn this young woman into a killer on its service.",
        "runtimeMinutes": "109"
    },
    "1993_56": {
        "plotSummary": "A spoof on Lethal Weapon, other movies, TV commercials etc. 2 unlike LA cops investigate a cocaine in girl scout cookies case.",
        "runtimeMinutes": "84"
    },
    "1993_57": {
        "plotSummary": "A young street hustler attempts to escape the rigors and temptations of the ghetto in a quest for a better life.",
        "runtimeMinutes": "97"
    },
    "1993_58": {
        "plotSummary": "A terminally ill man prepares for his death.",
        "runtimeMinutes": "117"
    },
    "1993_59": {
        "plotSummary": "In this movie, we see the world through the eyes of main character Justice (Janet Jackson), a young African-American poet. A mail carrier invites a few friends along for a long overnight delivery run.",
        "runtimeMinutes": "109"
    },
    "1993_6": {
        "plotSummary": "A billionaire offers one million dollars to a young married couple for one night with the wife.",
        "runtimeMinutes": "117"
    },
    "1993_60": {
        "plotSummary": "C.S. Lewis, a world-renowned Christian theologian, writer and professor, leads a passionless life until he meets spirited poet Joy Gresham from the U.S.",
        "runtimeMinutes": "131"
    },
    "1993_61": {
        "plotSummary": "Chuck wants to leave home but can't make the grade for boarding school. Then he finds out the disfigured recluse living nearby is an ex-teacher.",
        "runtimeMinutes": "115"
    },
    "1993_62": {
        "plotSummary": "Coming from a police family, Tom Hardy ends up fighting his uncle after the murder of his father. Tom believes the killer is another cop and goes on the record with his allegations. Demoted then to river duty, the killer taunts Tom.",
        "runtimeMinutes": "102"
    },
    "1993_63": {
        "plotSummary": "In Missouri, during the 1840s, young Huck Finn fearful of his drunkard father and yearning for adventure, leaves his foster family and joins with runaway slave Jim in a voyage down the Mississippi River toward slavery free states.",
        "runtimeMinutes": "108"
    },
    "1993_64": {
        "plotSummary": "A mentally ill young woman finds her love in an eccentric man who models himself after Buster Keaton.",
        "runtimeMinutes": "98"
    },
    "1993_65": {
        "plotSummary": "A butler who sacrificed body and soul to service in the years leading up to World War II realizes too late how misguided his loyalty was to his lordly employer.",
        "runtimeMinutes": "134"
    },
    "1993_66": {
        "plotSummary": "Several players from different backgrounds try to cope with the pressures of playing football at a major university. Each deals with the pressure differently, some turn to drinking, others to drugs, and some to studying.",
        "runtimeMinutes": "112"
    },
    "1993_67": {
        "plotSummary": "A female lawyer takes an accused wife-murderer as a client, but finds herself morally compelled to betray him one way or another.",
        "runtimeMinutes": "107"
    },
    "1993_68": {
        "plotSummary": "Rudy has always been told that he was too small to play college football. But he is determined to overcome the odds and fulfill his dream of playing for Notre Dame.",
        "runtimeMinutes": "114"
    },
    "1993_69": {
        "plotSummary": "Young lovers Hero and Claudio, soon to wed, conspire to get verbal sparring partners and confirmed singles Benedick and Beatrice to wed as well.",
        "runtimeMinutes": "111"
    },
    "1993_7": {
        "plotSummary": "A botched mid-air heist results in suitcases full of cash being searched for by various groups throughout the Rocky Mountains.",
        "runtimeMinutes": "113"
    },
    "1993_70": {
        "plotSummary": "Sam, an escaped convict, lands up on a farmland owned by a widow. When he learns that a ruthless contractor is trying to take over her land, he helps her to fight against the injustice. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "1993_71": {
        "plotSummary": "When tradition prevents her from marrying the man she loves, a young woman discovers she has a unique talent for cooking.",
        "runtimeMinutes": "105"
    },
    "1993_72": {
        "plotSummary": "Aliens with conical crania crash-land on Earth.",
        "runtimeMinutes": "88"
    },
    "1993_73": {
        "plotSummary": "Two Brooklyn plumbers, Mario and Luigi, must travel to another dimension to rescue a princess from the evil dictator King Koopa and stop him from taking over the world.",
        "runtimeMinutes": "104"
    },
    "1993_74": {
        "plotSummary": "Two immature detectives are joined by a pesky assistant district attorney in staking out a lakeside home where a Mafia trial witness is believed to be heading.",
        "runtimeMinutes": "108"
    },
    "1993_75": {
        "plotSummary": "An Arizona logger mysteriously disappears for five days in an alleged encounter with a flying saucer in 1975. His co-workers endure ridicule and contempt as they are wrongly accused of murder.",
        "runtimeMinutes": "109"
    },
    "1993_76": {
        "plotSummary": "A US Marine sniper is partnered with a SWAT member to take out rebel leaders in the jungles of Panama.",
        "runtimeMinutes": "98"
    },
    "1993_77": {
        "plotSummary": "A waitress hardly notices a shy busboy who secretly loves her; until one night she's attacked and he comes to her rescue. From there a relationship sparks but one secret could mean disaster for these fated lovers.",
        "runtimeMinutes": "102"
    },
    "1993_78": {
        "plotSummary": "The story of the Apache chief and his armed resistance to the U.S. Government's subjugation of his people.",
        "runtimeMinutes": "115"
    },
    "1993_79": {
        "plotSummary": "In 1898 Cuba, five Buffalo Soldiers find a gold cache, desert and return to America where they help defend a black town from the KKK, all the while trying to avoid capture by lawmen and military authorities alike.",
        "runtimeMinutes": "111"
    },
    "1993_8": {
        "plotSummary": "A recently widowed man's son calls a radio talk-show in an attempt to find his father a partner.",
        "runtimeMinutes": "105"
    },
    "1993_80": {
        "plotSummary": "A guy makes a documentary of the rap band CB4 by following them. CB4 got popular by stealing Gusto's name, background and image. He wants them dead.",
        "runtimeMinutes": "89"
    },
    "1993_81": {
        "plotSummary": "A businessman comes to Washington with his ex Vegas showgirl girlfriend, and after some embarrassments, he hires a reporter as tutor to smarten her up. She turns out to be smart, sucks up knowledge and questions things. Trouble?",
        "runtimeMinutes": "100"
    },
    "1993_82": {
        "plotSummary": "A father becomes worried when a local gangster befriends his son in the Bronx in the 1960s.",
        "runtimeMinutes": "121"
    },
    "1993_83": {
        "plotSummary": "A bullied teen who fantasizes about being Chuck Norris' sidekick trains in martial arts to fulfill his dreams.",
        "runtimeMinutes": "101"
    },
    "1993_84": {
        "plotSummary": "An unhappy businessman finds a new sense of purpose after he's tasked with helping a quartet of ghosts fulfill their last wishes before moving on to the afterlife.",
        "runtimeMinutes": "104"
    },
    "1993_85": {
        "plotSummary": "Serial killer Jason Voorhees' supernatural origins are revealed.",
        "runtimeMinutes": "87"
    },
    "1993_86": {
        "plotSummary": "A mysterious new shop opens in a small town which always seems to stock the deepest desires of each shopper, with a price far heavier than expected.",
        "runtimeMinutes": "120"
    },
    "1993_87": {
        "plotSummary": "Seven friends reunite for a week-long reunion at a summer camp in Ontario they used to attend as children which is now threatened with being closed down.",
        "runtimeMinutes": "97"
    },
    "1993_88": {
        "plotSummary": "The boyfriend of an abducted woman never gives up the search as the abductor looks on.",
        "runtimeMinutes": "109"
    },
    "1993_89": {
        "plotSummary": "A journalist becomes the unwanted center of attention for a 14-year-old girl, who proceeds to sabotage his life after he refuses her sexual advances.",
        "runtimeMinutes": "89"
    },
    "1993_9": {
        "plotSummary": "When a man with HIV is fired by his law firm because of his condition, he hires a homophobic small time lawyer as the only willing advocate for a wrongful dismissal suit.",
        "runtimeMinutes": "125"
    },
    "1993_90": {
        "plotSummary": "A lawyer defends a woman accused of killing her older lover by having sex with him.",
        "runtimeMinutes": "99"
    },
    "1993_91": {
        "plotSummary": "In Detroit, a lonely pop culture geek marries a call girl, steals cocaine from her pimp, and tries to sell it in Hollywood. Meanwhile, the owners of the cocaine, the Mob, track them down in an attempt to reclaim it.",
        "runtimeMinutes": "119"
    },
    "1993_92": {
        "plotSummary": "A genetically engineered dog escapes from the science facility where it was created. A family takes it in unaware of its deadly instincts which soon emerge. The scientist who created the dog tries to find it before its too late.",
        "runtimeMinutes": "87"
    },
    "1993_93": {
        "plotSummary": "When a gang of African poachers raid her family's farm, young Nonni, visiting American teenager Harry Winslow and a local bushman guide must escape into the Kalahari desert and reach the nearest town.",
        "runtimeMinutes": "100"
    },
    "1993_94": {
        "plotSummary": "Larry and Richard use a voodoo-revived corpse to track down hidden money to clear their names.",
        "runtimeMinutes": "97"
    },
    "1993_95": {
        "plotSummary": "Four friends on their way to a boxing match get caught in heavy traffic, so they take a shortcut in order to get there faster, unfortunately it leads to them witnessing a murder which leaves them running for their lives.",
        "runtimeMinutes": "110"
    },
    "1993_96": {
        "plotSummary": "A once-popular actor who now runs a talent agency specializing in child acts is trying to discover the next star. He gets more than he bargained for when he recruits a child pickpocket.",
        "runtimeMinutes": "91"
    },
    "1993_97": {
        "plotSummary": "A spy couple on maternity leave in New Orleans, entertained by a mugger named Muerte, is called in when Novacek steals explosives.",
        "runtimeMinutes": "90"
    },
    "1993_98": {
        "plotSummary": "A maverick dancer risks his career by performing an unusual routine and sets out to succeed with a new partner.",
        "runtimeMinutes": "94"
    },
    "1993_99": {
        "plotSummary": "A San Francisco poet who fears commitment suspects his girlfriend may have a knack for killing off her significant others.",
        "runtimeMinutes": "93"
    }
}