{
    "1994_1": {
        "plotSummary": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.",
        "runtimeMinutes": "88"
    },
    "1994_10": {
        "plotSummary": "CIA Analyst Jack Ryan is drawn into an illegal war fought by the US government against a Colombian drug cartel.",
        "runtimeMinutes": "141"
    },
    "1994_100": {
        "plotSummary": "A young boy is bequeathed the ownership of a professional baseball team.",
        "runtimeMinutes": "119"
    },
    "1994_101": {
        "plotSummary": "A film following the lives of two inner-city Chicago boys who struggle to become college basketball players on the road to going professional.",
        "runtimeMinutes": "170"
    },
    "1994_102": {
        "plotSummary": "Young martial artists face their grandfather's foes when they accompany him to Japan to deliver a priceless dagger.",
        "runtimeMinutes": "93"
    },
    "1994_103": {
        "plotSummary": "A cat burglar is forced to take a bickering, dysfunctional family hostage on Christmas Eve.",
        "runtimeMinutes": "96"
    },
    "1994_104": {
        "plotSummary": "A counterfeiter with a habit of \"eliminating\" the competition moves in next door to the Robbersons. Two cops move in with the Robbersons for a stakeout.",
        "runtimeMinutes": "93"
    },
    "1994_105": {
        "plotSummary": "This retelling of the Hans Christian Andersen classic fairy tale has the digit-sized heroine evading the clutches of various toads, moles, and beetles before she can proceed with her courtship with her dream lover, Prince Cornelius.",
        "runtimeMinutes": "86"
    },
    "1994_106": {
        "plotSummary": "A chronicle of the interconnected lives of a group of people in the lead up to Paris Fashion Week.",
        "runtimeMinutes": "133"
    },
    "1994_107": {
        "plotSummary": "Two drag performers and a transgender woman travel across the desert to perform their unique style of cabaret.",
        "runtimeMinutes": "104"
    },
    "1994_108": {
        "plotSummary": "A group of junior high kids don't want to go to summer camps chosen by their parents. They make their own adult-free camp and \"hire\" an ex drama teacher to help.",
        "runtimeMinutes": "96"
    },
    "1994_109": {
        "plotSummary": "An aspiring actor has his life turned upside down when his ex-wife dumps off their bossy, wild daughter into his custody.",
        "runtimeMinutes": "115"
    },
    "1994_11": {
        "plotSummary": "A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life.",
        "runtimeMinutes": "128"
    },
    "1994_110": {
        "plotSummary": "Stand up comedy by Martin Lawrence, filmed in the Majestic Theater in New York City. Martin Lawrence talks about everything from racism, to relationships, to his childhood.",
        "runtimeMinutes": "84"
    },
    "1994_111": {
        "plotSummary": "When a family of 4 moves from Baltimore to a farm in rural Virginia, they adopt an abandoned collie. The dog becomes the son's companion and protector, helping him adapt to rural life.",
        "runtimeMinutes": "94"
    },
    "1994_112": {
        "plotSummary": "The life and death of the legendary Ludwig van Beethoven. Besides all the work he is known for, the composer once wrote a famous love letter to a nameless beloved, and the movie tries to find out who this beloved was--not easy, as ...See moreThe life and death of the legendary Ludwig van Beethoven. Besides all the work he is known for, the composer once wrote a famous love letter to a nameless beloved, and the movie tries to find out who this beloved was--not easy, as Beethoven has had many women in his life.  Written by Smoothhoney1265See less",
        "runtimeMinutes": "121"
    },
    "1994_113": {
        "plotSummary": "A power-hungry sorcerer curses a princess to live as a swan by day in this tale of everlasting love.",
        "runtimeMinutes": "93"
    },
    "1994_114": {
        "plotSummary": "Angie lives in Bensonhurst Brooklyn, and dreams of a better life. When she finds out she's pregnant - by her boyfriend, Vinnie, she decides she'll have the baby; but not Vinnie as a husband. This turns the entire close-knit neighborhood ...See moreAngie lives in Bensonhurst Brooklyn, and dreams of a better life. When she finds out she's pregnant - by her boyfriend, Vinnie, she decides she'll have the baby; but not Vinnie as a husband. This turns the entire close-knit neighborhood upside-down and starts Angie on a journey of self-discovery. On her way, she meets a new lover interest.  Written by Tony Fontana See less",
        "runtimeMinutes": "107"
    },
    "1994_115": {
        "plotSummary": "A shy, troubled young man who set his own house on fire and has an imaginary friend, is sent to a vineyard where he finds himself in the middle of his political-arguing, party-loving family and his love torn between two girls.",
        "runtimeMinutes": "110"
    },
    "1994_116": {
        "plotSummary": "In order to rescue one of the last surviving Alaskan Native tribes, Fang joins in with a friend of his master to stop miners from destroying an ancient sacred land.",
        "runtimeMinutes": "106"
    },
    "1994_117": {
        "plotSummary": "The Earth is invaded by stingray-shaped alien \"slugs\" that ride on people's backs and control their minds.",
        "runtimeMinutes": "109"
    },
    "1994_118": {
        "plotSummary": "Death and violence anger a twelve-year-old drug courier, who sets his employers against each other.",
        "runtimeMinutes": "114"
    },
    "1994_119": {
        "plotSummary": "A simpleton inventor becomes a superhero with a bulletproof costume and a low budget.",
        "runtimeMinutes": "92"
    },
    "1994_12": {
        "plotSummary": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "runtimeMinutes": "154"
    },
    "1994_120": {
        "plotSummary": "Escaped convict Jack Hammond takes a woman hostage and sets off for the Mexican border with the police hot on his tail.",
        "runtimeMinutes": "97"
    },
    "1994_121": {
        "plotSummary": "She's the perfect all-American parent: a great cook and homemaker, a devoted recycler, and a woman who'll literally kill to keep her children happy.",
        "runtimeMinutes": "95"
    },
    "1994_122": {
        "plotSummary": "When a painting is termed blasphemous, a young minister and his wife visit the artist... and the three sexually playful models living with him.",
        "runtimeMinutes": "98"
    },
    "1994_123": {
        "plotSummary": "A homeless man is hired as a survival guide for a group of wealthy businessmen on a hunting trip in the mountains, unaware that they are killers who hunt humans for sport, and that he is their new prey.",
        "runtimeMinutes": "96"
    },
    "1994_124": {
        "plotSummary": "A bratty 10-year-old boy is obsessed with visiting a dinosaur-themed amusement park; his uptight uncle takes the wily tyke in for a week and barely lives to regret it.",
        "runtimeMinutes": "90"
    },
    "1994_125": {
        "plotSummary": "A private eye who suffers total amnesia every twenty-four hours is deeply entangled in a complicated murder and theft case.",
        "runtimeMinutes": "107"
    },
    "1994_126": {
        "plotSummary": "A senior chef lives with his three grown daughters; the middle one finds her future plans affected by unexpected events and the life changes of the other household members.",
        "runtimeMinutes": "124"
    },
    "1994_127": {
        "plotSummary": "Ted, a stuffy white guy from Illinois working in sales for the Barcelona office of a US corporation, is paid an unexpected visit by his somewhat less stuffy cousin Fred, who is an officer in the US Navy. Over the next few months, both ...See moreTed, a stuffy white guy from Illinois working in sales for the Barcelona office of a US corporation, is paid an unexpected visit by his somewhat less stuffy cousin Fred, who is an officer in the US Navy. Over the next few months, both their lives are irrevocably altered by the events which follow Fred's arrival, events which are the trivial stuff of a comedy of manners at first but which gradually grow increasingly dramatic.  Written by Tim Horrigan See less",
        "runtimeMinutes": "101"
    },
    "1994_128": {
        "plotSummary": "Sick of the neglect he receives from his mom and dad, a young boy leaves home and travels the world in search of new parents.",
        "runtimeMinutes": "87"
    },
    "1994_129": {
        "plotSummary": "Valerie is a juror in the trial of a mob boss. When her young son's life is threatened, she has no option other than to see that justice isn't done.",
        "runtimeMinutes": "107"
    },
    "1994_13": {
        "plotSummary": "An interstellar teleportation device, found in Egypt, leads to a planet with humans resembling ancient Egyptians who worship the god Ra.",
        "runtimeMinutes": "116"
    },
    "1994_130": {
        "plotSummary": "Elliot heads for the sexual fantasy island, Eden. He takes some photos of diamond smugglers. They and undercover cops want the photos and follow him to Eden.",
        "runtimeMinutes": "113"
    },
    "1994_131": {
        "plotSummary": "The events focus around a crisis hotline business on one crazy night during the Christmas holidays.",
        "runtimeMinutes": "97"
    },
    "1994_132": {
        "plotSummary": "A story about the ins and outs of one unusual health facility in the early twentieth century, run by the eccentric Dr. John Harvey Kellogg.",
        "runtimeMinutes": "118"
    },
    "1994_133": {
        "plotSummary": "A rancher, his clairvoyant wife and their family face turbulent years in South America in this adaptation of Isabel Allende's best-seller.",
        "runtimeMinutes": "140"
    },
    "1994_134": {
        "plotSummary": "In 1934, an English widow moves to Widows' Peak, Ireland. She befriends other widows and the son of one. Hostility escalates between her and an Irish spinster.",
        "runtimeMinutes": "101"
    },
    "1994_135": {
        "plotSummary": "Residents of a friendly Pennsylvania town foil three brothers' plan to rob a bank on Christmas Eve.",
        "runtimeMinutes": "111"
    },
    "1994_136": {
        "plotSummary": "Ambitious but troubled movie director Edward D. Wood Jr. tries his best to fulfill his dreams, despite his lack of talent.",
        "runtimeMinutes": "127"
    },
    "1994_137": {
        "plotSummary": "A devious sexpot steals her husband's drug money and hides out in a small town where she meets the perfect dupe for her next scheme.",
        "runtimeMinutes": "110"
    },
    "1994_138": {
        "plotSummary": "Three band members hoping for a big break head to a radio station to play their demo tape and wind up holding everyone hostage with plastic guns when the head D.J. refuses to play them.",
        "runtimeMinutes": "92"
    },
    "1994_139": {
        "plotSummary": "A 1931 Spanish military deserter finds himself on a lonely farm until the farmer's four daughters pay a visit and he falls for all of them.",
        "runtimeMinutes": "109"
    },
    "1994_14": {
        "plotSummary": "When a man inadvertently makes Santa fall off of his roof on Christmas Eve, he finds himself magically recruited to take his place.",
        "runtimeMinutes": "97"
    },
    "1994_140": {
        "plotSummary": "After the death of Lama Dorje, Tibetan Buddhist monks find three children - one American and two Nepalese - who may be the rebirth of their great teacher.",
        "runtimeMinutes": "123"
    },
    "1994_141": {
        "plotSummary": "The fates of horses, and the people who own and command them, are revealed as Black Beauty narrates the circle of his life.",
        "runtimeMinutes": "88"
    },
    "1994_142": {
        "plotSummary": "In the 1860's Wild West, when a ragged bunch of misfit settlers decide they cannot stand living in their current situation, they hire a grizzled cowboy to take them on a journey back to their hometowns east.",
        "runtimeMinutes": "107"
    },
    "1994_143": {
        "plotSummary": "A teenager is part of an interactive video game where he kills innocent victims. Later, the murders become real.",
        "runtimeMinutes": "96"
    },
    "1994_144": {
        "plotSummary": "A high school senior visits college for the weekend, and stays at the wildest house on campus.",
        "runtimeMinutes": "79"
    },
    "1994_145": {
        "plotSummary": "A failing actor living in crime infested Los Angeles, frustrated with his career, decides to take the law into his own hands, and becomes the leader of a mock-vigilante group that videotapes criminals and turns them over to the police.",
        "runtimeMinutes": "112"
    },
    "1994_146": {
        "plotSummary": "A foul-mouthed finishing school graduate mistakenly winds up on an ill-fated fishing boat and faces the wrath of a crew that considers him bad luck.",
        "runtimeMinutes": "80"
    },
    "1994_147": {
        "plotSummary": "A model discovers a retired judge is keen on invading people's privacy.",
        "runtimeMinutes": "99"
    },
    "1994_148": {
        "plotSummary": "His life was emotionally closed off from the world, until an orphaned baby showed up at his house.",
        "runtimeMinutes": "106"
    },
    "1994_149": {
        "plotSummary": "USD400,000,000 is stolen and a drug lord wants it back. The killed thief's brother is broken out of prison by a DEA bounty hunter to help find the money boat. The body count continues in Latin America.",
        "runtimeMinutes": "94"
    },
    "1994_15": {
        "plotSummary": "Bret Maverick, needing money for a poker tournament, faces various comic mishaps and challenges, including a charming woman thief.",
        "runtimeMinutes": "127"
    },
    "1994_150": {
        "plotSummary": "Jessica Lange stars in a period drama about a family moving to a military base, and she quickly becomes part of a cover-up involving nuclear bomb tests.",
        "runtimeMinutes": "101"
    },
    "1994_151": {
        "plotSummary": "Fictional chronicle of Squanto's life prior to and including the arrival of the \"Mayflower\" in 1620.",
        "runtimeMinutes": "102"
    },
    "1994_152": {
        "plotSummary": "A womanizing, crooked cop on the payroll of the mafia is confronted with the reality of his double life after he is asked to kill a beautiful and ruthless Russian gangster.",
        "runtimeMinutes": "110"
    },
    "1994_153": {
        "plotSummary": "Mousie and Sad Girl are childhood best friends in a contemporary Los Angeles poor Hispanic neighborhood. But when Sad Girl becomes pregnant by Mousie's boyfriend, a drug dealer named Ernesto, the two become bitter enemies. While their ...See moreMousie and Sad Girl are childhood best friends in a contemporary Los Angeles poor Hispanic neighborhood. But when Sad Girl becomes pregnant by Mousie's boyfriend, a drug dealer named Ernesto, the two become bitter enemies. While their dispute escalates towards violence, the violence of the world around them soon also impacts their lives.  Written by Reid GagleSee less",
        "runtimeMinutes": "92"
    },
    "1994_154": {
        "plotSummary": "An autistic boy witnesses his parents' double murder. A controversial therapist seeks to probe the child's mind in order to solve the case.",
        "runtimeMinutes": "101"
    },
    "1994_155": {
        "plotSummary": "A day in the lives of two convenience clerks named Dante and Randal as they annoy customers, discuss movies, and play hockey on the store roof.",
        "runtimeMinutes": "92"
    },
    "1994_156": {
        "plotSummary": "With 15 year reunion coming up, Kathy has sexual fantasies of her high school sweetheart. She's married, so she sends her BFF to check him out and report back. Things get complicated.",
        "runtimeMinutes": "97"
    },
    "1994_157": {
        "plotSummary": "A political activist is convinced that her guest is a man who once tortured her for the government.",
        "runtimeMinutes": "103"
    },
    "1994_158": {
        "plotSummary": "A mysterious young woman speaking a strange language shows up in an English village, where she is taken in by aristocrats who assume she is a foreign princess",
        "runtimeMinutes": "97"
    },
    "1994_159": {
        "plotSummary": "Two teenage girls share a unique bond; their parents, concerned that the friendship is too intense, separate them, and the girls take revenge.",
        "runtimeMinutes": "99"
    },
    "1994_16": {
        "plotSummary": "A woman entices a bomb expert she's involved with into destroying the mafia that killed her family.",
        "runtimeMinutes": "110"
    },
    "1994_160": {
        "plotSummary": "Detective Kyle Bodine falls for Rachel Munro who is trapped in a violent marriage. After shooting her husband, Kyle reluctantly agrees to help hide the body, but Kyle's partner is showing an unusual flair for finding clues.",
        "runtimeMinutes": "99"
    },
    "1994_161": {
        "plotSummary": "A naive business graduate is installed as president of a manufacturing company as part of a stock scam.",
        "runtimeMinutes": "111"
    },
    "1994_162": {
        "plotSummary": "The story of a baseball scout who discovers a talented but troubled baseball player.",
        "runtimeMinutes": "101"
    },
    "1994_163": {
        "plotSummary": "Upon arriving to a small town, a drifter is mistaken for a hitman, but when the real hitman arrives, complications ensue.",
        "runtimeMinutes": "98"
    },
    "1994_164": {
        "plotSummary": "A dramatization of the Hamburg, Germany phase of The Beatles' early history.",
        "runtimeMinutes": "100"
    },
    "1994_165": {
        "plotSummary": "Two brothers have half of a powerful ancient Chinese talisman. An evil gang leader has the other half, and determines to get the brothers' half and have a complete medallion so he can gain absolute power.",
        "runtimeMinutes": "96"
    },
    "1994_166": {
        "plotSummary": "After Fugui and Jiazhen lose their personal fortunes, they raise a family and survive difficult cultural changes during 1940s to 1970s China.",
        "runtimeMinutes": "133"
    },
    "1994_167": {
        "plotSummary": "In a West African nation, the womanizing British 1st Secretary of the High Commissioner deals with different issues.",
        "runtimeMinutes": "94"
    },
    "1994_168": {
        "plotSummary": "On his one thousandth birthday, an evil leprechaun selects the descendant of one of his slaves to have as his bride, leaving it up to the girl's boyfriend to save her.",
        "runtimeMinutes": "85"
    },
    "1994_169": {
        "plotSummary": "Bruce Brown, king of surfing documentaries, returns after nearly thirty years to trace the steps of two young surfers to top surfing spots around the world. Along the way we see many of the people and locales Bruce visited during the ...See moreBruce Brown, king of surfing documentaries, returns after nearly thirty years to trace the steps of two young surfers to top surfing spots around the world. Along the way we see many of the people and locales Bruce visited during the filming of Endless Summer (1966).  Written by Rick Morton See less",
        "runtimeMinutes": "109"
    },
    "1994_17": {
        "plotSummary": "In the early 1900s, three brothers and their father living in the remote wilderness of Montana are affected by betrayal, history, love, nature, and war.",
        "runtimeMinutes": "133"
    },
    "1994_170": {
        "plotSummary": "Dorothy Parker remembers the heyday of the Algonquin Round Table, a circle of friends whose barbed wit, like hers, was fueled by alcohol and flirted with despair.See moreDorothy Parker remembers the heyday of the Algonquin Round Table, a circle of friends whose barbed wit, like hers, was fueled by alcohol and flirted with despair.  Written by Cleo See less",
        "runtimeMinutes": "125"
    },
    "1994_171": {
        "plotSummary": "A naive princess, her beloved cat and a poor mining boy team up to save their kingdom from a nasty underground realm of bad-mannered goblins.",
        "runtimeMinutes": "82"
    },
    "1994_172": {
        "plotSummary": "Kika, a cute cosmetologist, prepares Ramon for funeral when he revives. He proposes to the much older Kika who has his dad as lover. Did Ramon's dad murder his mom? What about the escaped rapist and the PSYCHOlogist video reporter?",
        "runtimeMinutes": "114"
    },
    "1994_173": {
        "plotSummary": "",
        "runtimeMinutes": "92"
    },
    "1994_174": {
        "plotSummary": "After hearing stories of her, a passenger on a cruise ship develops an irresistible infatuation with an eccentric paraplegic's wife.",
        "runtimeMinutes": "139"
    },
    "1994_175": {
        "plotSummary": "Lisette and husband Chino face marital difficulties. She is fed up with the kids, while he has job troubles. His mother Rosaria hates Lisette and the neighborhood tramp has designs on Chino. Things get even worse when Chino goes to jail ...See moreLisette and husband Chino face marital difficulties. She is fed up with the kids, while he has job troubles. His mother Rosaria hates Lisette and the neighborhood tramp has designs on Chino. Things get even worse when Chino goes to jail and Lisette gets a good job uptown. Can this marriage be saved?  Written by Reid GagleSee less",
        "runtimeMinutes": "104"
    },
    "1994_176": {
        "plotSummary": "New York actors rehearse Chekhov's \"Uncle Vanya\" in a dilapidated theatre.",
        "runtimeMinutes": "119"
    },
    "1994_177": {
        "plotSummary": "Sissy Hankshaw (Uma Thurman) is born with enormous thumbs that help her hitchhiking through the U.S. from a young age. She becomes a model in advertising, and her New York agent, \"the Countess\" (Sir John Hurt), sends her to his ranch in ...See moreSissy Hankshaw (Uma Thurman) is born with enormous thumbs that help her hitchhiking through the U.S. from a young age. She becomes a model in advertising, and her New York agent, \"the Countess\" (Sir John Hurt), sends her to his ranch in California to shoot a commercial, set against the background of mating whooping cranes. There, she befriends Bonanza Jellybean (Rain Phoenix), one of the cowgirls at the beauty ranch. The cowgirls take command of the ranch from the Countess and drug the cranes with peyote. The Police besiege the ranch.  Written by Pieter van Scherpenberg See less",
        "runtimeMinutes": "106"
    },
    "1994_178": {
        "plotSummary": "Paul Kersey is back at working vigilante justice when his fiancee, Olivia, has her business threatened by mobsters.",
        "runtimeMinutes": "95"
    },
    "1994_179": {
        "plotSummary": "A Vietnamese servant girl, Mui, observes lives within two different Saigon families: the first, a woman textile seller with three boys and a frequently absent husband; the second, a handsome young pianist with his fiancee.",
        "runtimeMinutes": "104"
    },
    "1994_18": {
        "plotSummary": "Publisher Will Randall becomes a werewolf and has to fight to keep his job.",
        "runtimeMinutes": "125"
    },
    "1994_180": {
        "plotSummary": "A mother with seven sons feels like she's losing control of her life and her family. But personal pain and a troubled marriage fade into the background as news comes that one of her sons might have died in an accident.See moreA mother with seven sons feels like she's losing control of her life and her family. But personal pain and a troubled marriage fade into the background as news comes that one of her sons might have died in an accident.  Written by Susan Southall See less",
        "runtimeMinutes": "98"
    },
    "1994_181": {
        "plotSummary": "A hapless Navy sailor is assigned SP duty. The catch: he must escort a beautiful female prisoner on her way to prison for going UA. She in turn will try anything to escape.See moreA hapless Navy sailor is assigned SP duty. The catch: he must escort a beautiful female prisoner on her way to prison for going UA. She in turn will try anything to escape.  Written by Tony Bridges See less",
        "runtimeMinutes": "102"
    },
    "1994_182": {
        "plotSummary": "One man must learn the meaning of courage across four lifetimes centuries apart.",
        "runtimeMinutes": "122"
    },
    "1994_183": {
        "plotSummary": "A med student is forced by his traveling salesman dad to cancel a top summer internship and look after his hot mom, who's bedridden with a broken leg. Applying lotion to her legs arouses him.",
        "runtimeMinutes": "100"
    },
    "1994_184": {
        "plotSummary": "A series of mysterious crimes confuses existence of a radio network.",
        "runtimeMinutes": "108"
    },
    "1994_185": {
        "plotSummary": "Young Queen Margot finds herself trapped in an arranged marriage amidst a religious war between Catholics and Protestants. She hopes to escape with a new lover, but finds herself imprisoned by her powerful and ruthless family.",
        "runtimeMinutes": "159"
    },
    "1994_186": {
        "plotSummary": "Brash NYC policeman Officer Gunther Toody is partnered with stiff, by-the-book Officer Francis Muldoon to protect an important mafia witness prior to testifying against orgainzed crime in Brooklyn, all the while dealing with their personal...See moreBrash NYC policeman Officer Gunther Toody is partnered with stiff, by-the-book Officer Francis Muldoon to protect an important mafia witness prior to testifying against orgainzed crime in Brooklyn, all the while dealing with their personal lives, overbearing spouses, common criminals, arms dealers, and their officious boss Captain Anderson.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "1994_187": {
        "plotSummary": "After his wife divorces him, a Polish immigrant plots to get even with her.",
        "runtimeMinutes": "92"
    },
    "1994_188": {
        "plotSummary": "Romantic comedy about an honest Mexican immigrant who struggles without a green card by selling oranges on a street corner. One day a limousine pulls up and he is handed a check for $1,000,000 with instructions that he is to give the check...See moreRomantic comedy about an honest Mexican immigrant who struggles without a green card by selling oranges on a street corner. One day a limousine pulls up and he is handed a check for $1,000,000 with instructions that he is to give the check back in 30 days. Initially he uses the check to convince people to extend credit to him. In the meantime he also attracts a woman who is in a dead end relationship with a bossy businessman. At the end of the 30 days, he finds his life in turmoil, the things he got on credit is repossessed, and he is being evicted from his dwelling and being sent back to Mexico.  Written by John Sacksteder See less",
        "runtimeMinutes": "97"
    },
    "1994_189": {
        "plotSummary": "A teacher must deal with the underworld of Naples and the family problems of his students.",
        "runtimeMinutes": "100"
    },
    "1994_19": {
        "plotSummary": "Axel Foley, while investigating a car theft ring, comes across something much bigger than that: the same men who killed his boss are running a counterfeit money ring out of a theme park in Los Angeles.",
        "runtimeMinutes": "104"
    },
    "1994_190": {
        "plotSummary": "Jake meets Joanne in college. He's into theater, writing plays. She's into photography. They move in together etc. She meets Elliot, owner of a big gallery, works for him and things change.",
        "runtimeMinutes": "95"
    },
    "1994_191": {
        "plotSummary": "A reporter hired to write the 'official' biography of Ty Cobb discovers just how dark the baseball legend's real story is.",
        "runtimeMinutes": "128"
    },
    "1994_192": {
        "plotSummary": "Alfred Byrne (Albert Finney) is a middle-aged bus conductor in Dublin, Ireland in 1963. He would appear to live a life of quiet desperation: he's gay, but firmly closeted, and his sister is always trying to find him \"the right girl\". His ...See moreAlfred Byrne (Albert Finney) is a middle-aged bus conductor in Dublin, Ireland in 1963. He would appear to live a life of quiet desperation: he's gay, but firmly closeted, and his sister is always trying to find him \"the right girl\". His passion is Oscar Wilde, his hobby is putting on amateur theatre productions in the local church hall. We follow him as he struggles with temptation, friendship, disapproval, and the conservative yet oddly lyrical world of Ireland in the early 1960s.  Written by Michael C. Berch See less",
        "runtimeMinutes": "99"
    },
    "1994_193": {
        "plotSummary": "Jude Madigan abandons her husband Robert and her three sons without any explanation. Three years later Jude inexplicably returns to reunite her family. However Robert and his new lover Callie see Jude for the true psychopath she is and try...See moreJude Madigan abandons her husband Robert and her three sons without any explanation. Three years later Jude inexplicably returns to reunite her family. However Robert and his new lover Callie see Jude for the true psychopath she is and try their best to protect their sons. Jude embarks on a non stop stalking and harassment campaign against the family, and even seduces her eldest son Kess into committing her acts of violence.  Written by Volker BoehmSee less",
        "runtimeMinutes": "96"
    },
    "1994_194": {
        "plotSummary": "Political satire about an underground militant group that kidnaps African-Americans who have sold out their race. The story follows as the group led Curtis-Hall and Rhames kidnaps an advertising executive (La Salle) who has been providing ...See morePolitical satire about an underground militant group that kidnaps African-Americans who have sold out their race. The story follows as the group led Curtis-Hall and Rhames kidnaps an advertising executive (La Salle) who has been providing advertising programs that belittles blacks and women. One advertisement features Spike Lee endorsing Gospelpak Fried Chicken which comes in a bucket with the Confederate flag draped all over it.  Written by John Sacksteder See less",
        "runtimeMinutes": "86"
    },
    "1994_195": {
        "plotSummary": "A young Hutterite boy must marry his late brother's wife who comes from outside the community.",
        "runtimeMinutes": "93"
    },
    "1994_196": {
        "plotSummary": "A bitter story of a young man's crisis.",
        "runtimeMinutes": "126"
    },
    "1994_197": {
        "plotSummary": "A mysterious device designed to provide its owner with eternal life resurfaces after four hundred years, leaving a trail of destruction in its path.",
        "runtimeMinutes": "94"
    },
    "1994_198": {
        "plotSummary": "In medieval France, young lawyer Richard Courtois leaves Paris for the simpler life in the country. However, he is soon drawn into amorous and political intrigues. At the same time, he is pushed to defend a pig, owned by the mysterious ...See moreIn medieval France, young lawyer Richard Courtois leaves Paris for the simpler life in the country. However, he is soon drawn into amorous and political intrigues. At the same time, he is pushed to defend a pig, owned by the mysterious gypsy Samira. The pig has been arrested for the murder of a young boy.  Written by Reid GagleSee less",
        "runtimeMinutes": "152"
    },
    "1994_199": {
        "plotSummary": "In 1927, in Kingdom County, Vermont, a large dam is to be built, however, Noel Lord, a logger and cedar-oil harvester, won't give up his lifetime lease on land that will be flooded. The dam company increases its offer of cash, but Noel ...See moreIn 1927, in Kingdom County, Vermont, a large dam is to be built, however, Noel Lord, a logger and cedar-oil harvester, won't give up his lifetime lease on land that will be flooded. The dam company increases its offer of cash, but Noel refuses. He asks for a trade: a stand of pines for his lease. The company rejects that deal, but offers to make Noel a Ranger in a new park. Noel, meanwhile, talks with his Indian mate, the spirited Bangor, about their moving to Oregon and buying a saw mill. She wants him to take the company's money, but he's pig-headed. Is Noel headed for confrontation with the company and the law, or can Bangor prevail to affect a truce?  Written by See less",
        "runtimeMinutes": "106"
    },
    "1994_2": {
        "plotSummary": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate and other historical events unfold through the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
        "runtimeMinutes": "142"
    },
    "1994_20": {
        "plotSummary": "With the help of long presumed dead Captain Kirk, Captain Picard must stop a deranged scientist willing to murder on a planetary scale in order to enter a space matrix.",
        "runtimeMinutes": "118"
    },
    "1994_200": {
        "plotSummary": "In 1915, T.S. (Tom) Eliot and Vivienne Haigh-Wood elope, but her longstanding gynecological and emotional problems disrupt their planned honeymoon. Her father is angry because Tom's poetry doesn't bring in enough to live on, but her mother...See moreIn 1915, T.S. (Tom) Eliot and Vivienne Haigh-Wood elope, but her longstanding gynecological and emotional problems disrupt their planned honeymoon. Her father is angry because Tom's poetry doesn't bring in enough to live on, but her mother is happy Viv has found a tender and discreet husband.  Written by mama.sylviaSee less",
        "runtimeMinutes": "125"
    },
    "1994_201": {
        "plotSummary": "In Providence's Italian neighborhood, Federal Hill, five young men face their choices as they become adults. Bobby, who's sort of dim, owes $30,000 to a counterfeiter who's demanding payment; he asks Ralph, a gifted cat burglar, to help ...See moreIn Providence's Italian neighborhood, Federal Hill, five young men face their choices as they become adults. Bobby, who's sort of dim, owes $30,000 to a counterfeiter who's demanding payment; he asks Ralph, a gifted cat burglar, to help and Ralph comes up with a plan. Later, Frank's dad, who is one of the Hill's top mobsters, wants to have a talk with Ralph about some of this plan. Meanwhile, Ralph's best friend Nicky falls hard for Wendy, a rich blond from Brown, and Nicky begins to imagine a future with her away from Providence. Ralph thinks Nicky's making a big mistake and sets out to prove it. When Ralph insults Frank's dad, things come to a head.  Written by See less",
        "runtimeMinutes": "97"
    },
    "1994_202": {
        "plotSummary": "On the verge of forced resignation, a strict old-fashioned teacher rethinks his life.",
        "runtimeMinutes": "97"
    },
    "1994_203": {
        "plotSummary": "Colonel Chabert has been severely wounded in the French-Russian Napoleonic war to the point that the medical examiner has signed his death certificate. When he regains his health and memory, he goes back to Paris, where his \"widow\", Anne ...See moreColonel Chabert has been severely wounded in the French-Russian Napoleonic war to the point that the medical examiner has signed his death certificate. When he regains his health and memory, he goes back to Paris, where his \"widow\", Anne has married the Count Ferraud and is financing his rise to power using Chabert's money. Chabert hires a lawyer to help him get back his money and his honor.  Written by Dragomir R. Radev See less",
        "runtimeMinutes": "110"
    },
    "1994_204": {
        "plotSummary": "A documentary about the life and work of Leni Riefenstahl, a German film director most notorious for making the most effective propaganda films for the Nazis.",
        "runtimeMinutes": "183"
    },
    "1994_205": {
        "plotSummary": "A teenage girl and her father discover alien clones are replacing humans on a remote U.S. military base in Alabama.",
        "runtimeMinutes": "87"
    },
    "1994_206": {
        "plotSummary": "The cab driver sets American Zed up with Zoe in his Paris hotel. Despite FFR1000 charged, she's an art student with day jobs e.g. bank. Safecracker Zed meets his junkie friend after 11 years to rob a bank.",
        "runtimeMinutes": "96"
    },
    "1994_207": {
        "plotSummary": "A brash 22-year-old FBI agent trumps up charges of Communist spying against a Chinese laundryman. Ten years later, he wants to make amends to the man and his teenage daughter.",
        "runtimeMinutes": "91"
    },
    "1994_208": {
        "plotSummary": "Recounts the life and loves of the physician, astrologer, and famed prognosticator; his encounters with medieval science and the Inquisition; and his early struggles with his visions of the future. This movie is set in France in the ...See moreRecounts the life and loves of the physician, astrologer, and famed prognosticator; his encounters with medieval science and the Inquisition; and his early struggles with his visions of the future. This movie is set in France in the sixteenth century during one of the periodic plague outbreaks (as opposed to the Black Death (mid fourteenth century Europe) or the Black Plague (mid seventeenth century London, England)). This movie depicts Michel Nostradamus' (Tcheky Karyo's) rise in influence, because of his success in treating the plague and his predictions, culminating in his appointment as court physician to Charles IX of France.  Written by LyleSee less",
        "runtimeMinutes": "119"
    },
    "1994_209": {
        "plotSummary": "Four children live with their terminally ill mother. After she dies, they try to hold things together. In their isolated house, they begin to deteriorate mentally, whilst they hide their mom's decomposing corpse in a makeshift concrete sarcophagus.",
        "runtimeMinutes": "105"
    },
    "1994_21": {
        "plotSummary": "A young boy who witnessed the suicide of a mafia lawyer hires an attorney to protect him when the District Attorney tries to use him to take down a mob family.",
        "runtimeMinutes": "119"
    },
    "1994_210": {
        "plotSummary": "Three children have had it with their mother, and magically make her disappear. The kids then head out to the \"Mommy Market\" for a replacement mom.",
        "runtimeMinutes": "85"
    },
    "1994_211": {
        "plotSummary": "Stocholm in the 1920s. Young Roland lives with his socialist father, Jewish mother and a boxing brother. His mother sells condoms illegally, and from them, Roland makes slingshots which he sells. His rebellious ways has gotten him the ...See moreStocholm in the 1920s. Young Roland lives with his socialist father, Jewish mother and a boxing brother. His mother sells condoms illegally, and from them, Roland makes slingshots which he sells. His rebellious ways has gotten him the special attention of his school teacher, who always makes sure that Roland is punished. Roland also tries to make extra money by repairing bicycles, a successful business that in the end lands him in hot water.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "102"
    },
    "1994_212": {
        "plotSummary": "Love between the representatives of two warring tribes changes the balance of power on the whole remote island.",
        "runtimeMinutes": "107"
    },
    "1994_213": {
        "plotSummary": "A professional assassin, having just \"cleaned up\" a botched \"job,\" is pressured into another new assignment by his boss. He is beginning to find himself off-balanced and self-questioning about his chosen career, when he is thrown into ...See moreA professional assassin, having just \"cleaned up\" a botched \"job,\" is pressured into another new assignment by his boss. He is beginning to find himself off-balanced and self-questioning about his chosen career, when he is thrown into complete turmoil by the unusual nature of this latest \"hit.\" A prominant woman has accumulated a massive amount of bad debt from shady characters and threatened them with police exposure, yet seems resigned to her fate when informed of a contract on her life. In fact, she even seems to look forward to her own demise. Why? As the killer tries to understand and resolve the situation, he begins to feel emotions long suppressed, perhaps, that he didn't even know he possessed. Before he can straighten out this upside-down, backwards, and inverted, crazy situation, his boss turns up the heat. Having his driver around, who is an old friend but unreliable and twitchy, nonetheless, does little to settle his jangly nerves. Finally, an impasse is reached with dire consequences for all....  Written by Tad Dibbern See less",
        "runtimeMinutes": "95"
    },
    "1994_214": {
        "plotSummary": "Third installment in the \"That's Entertainment\" series, featuring scenes from \"The Hollywood Revue of 1929,\" \"Brigadoon,\" \"Singin' In The Rain,\" and many more MGM films.",
        "runtimeMinutes": "113"
    },
    "1994_215": {
        "plotSummary": "An insane general triggers a path to nuclear holocaust that a War Room full of politicians and generals frantically tries to stop.",
        "runtimeMinutes": "95"
    },
    "1994_216": {
        "plotSummary": "Lola is pregnant. But she does not know who the father is : Jamal, the black muslim, son of diplomats, or Felix, the pennyless jewish messenger. Jamal and Felix meet at Lola's, and the race begins.See moreLola is pregnant. But she does not know who the father is : Jamal, the black muslim, son of diplomats, or Felix, the pennyless jewish messenger. Jamal and Felix meet at Lola's, and the race begins.  Written by YepokSee less",
        "runtimeMinutes": "94"
    },
    "1994_217": {
        "plotSummary": "A successful businessman tries to uncover what is wrong with his wife.",
        "runtimeMinutes": "103"
    },
    "1994_218": {
        "plotSummary": "Episodic story about a yuppie couple who're going broke, and can't decide if they want to stay together - but openly sleep around and experiment with different lifestyles, or not.",
        "runtimeMinutes": "112"
    },
    "1994_219": {
        "plotSummary": "A mockumentary chronicling the rise and fall of NWH, a not particularly talented--or particularly bright but always controversial--hip-hop group.",
        "runtimeMinutes": "88"
    },
    "1994_22": {
        "plotSummary": "When the brilliant but unorthodox scientist Dr. Victor Frankenstein rejects the artificial man that he has created, the Creature escapes and later swears revenge.",
        "runtimeMinutes": "123"
    },
    "1994_220": {
        "plotSummary": "An immortal, bigoted, unethical taxidermist is doing research on \"Patient Zero\", the gay flight attendant who allegedly was the first to bring AIDS to North America, for a museum show about contagious diseases, helped by the man's ghost.",
        "runtimeMinutes": "97"
    },
    "1994_221": {
        "plotSummary": "Sarah, Joseph and Frank are BFFs. Joseph and Sarah get married but the evening before she tells Frank with a kiss that it could've been him. Frank continues to have a thing for Sarah.",
        "runtimeMinutes": "86"
    },
    "1994_222": {
        "plotSummary": "Two Manhattan slacker dudes, best friends, want to make a movie about their lives. Splick drives a hack, Jason tends bar; each has a stuttering relationship with a down-to-earth woman. But neither has a clue how to make a movie. A friend ...See moreTwo Manhattan slacker dudes, best friends, want to make a movie about their lives. Splick drives a hack, Jason tends bar; each has a stuttering relationship with a down-to-earth woman. But neither has a clue how to make a movie. A friend in the industry sets up meetings for them with producers, which they blow. Things look up when Phoebe Cates and Martha Plimpton agree to star, but then they leave the city for other projects. Splick and Jason argue. Things look bleak. Will they repair their friendship? Will they reconnect to their lovers?  Written by See less",
        "runtimeMinutes": "84"
    },
    "1994_223": {
        "plotSummary": "This Ken Loach docu-drama relates the story of a British woman's fight with Social Services over the care of her children. Maggie has a history of bouncing from one abusive relationship to another. She has four children, of four different ...See moreThis Ken Loach docu-drama relates the story of a British woman's fight with Social Services over the care of her children. Maggie has a history of bouncing from one abusive relationship to another. She has four children, of four different fathers, who came to the attention of Social Services when they were injured in a fire. Subsequently, Maggie was found to be an \"unfit mother\" and her children were removed from her care. She finally meets the man of her dreams, a Paraguayan expatriate, and they start a family together. Unfortunately, Social Services seems unwilling to accept that her life has changed and rends them from their new children. She and Jorge together, and separately, fight Social Services, Immigration, and other government bureaucrats in a desperate battle to make their family whole again.  Written by Tad Dibbern See less",
        "runtimeMinutes": "101"
    },
    "1994_224": {
        "plotSummary": "A dedicated, tightly-knit group of bodyguards take on additional duties while safeguarding an honest judge designated to investigate official corruption in Sicily.",
        "runtimeMinutes": "96"
    },
    "1994_225": {
        "plotSummary": "Doctors at an ultramodern hospital in Denmark become convinced, by way of weird, inexplicable happenings, that the place is haunted.",
        "runtimeMinutes": "561"
    },
    "1994_226": {
        "plotSummary": "The Russian government hires the veterans of the Police Academy to help deal with the Mafia.",
        "runtimeMinutes": "83"
    },
    "1994_227": {
        "plotSummary": "When a student visits her professor to discuss how she failed his course, the discussion takes an awkward turn.",
        "runtimeMinutes": "89"
    },
    "1994_228": {
        "plotSummary": "Graduates of a Los Angeles high school in 1965 see America's culture and politics gradually change.",
        "runtimeMinutes": "99"
    },
    "1994_229": {
        "plotSummary": "Six queer teenagers struggle to get along with each other and with life in the face of varying obstacles.",
        "runtimeMinutes": "78"
    },
    "1994_23": {
        "plotSummary": "As part of a fertility research project, a male scientist agrees to carry a pregnancy in his own body.",
        "runtimeMinutes": "109"
    },
    "1994_230": {
        "plotSummary": "Mario and Ana, in voluntary exile from Buenos Aires, live in a remote Argentine valley with their 12-year-old son Ernesto. Mario runs a school and a wool cooperative; Ana, a doctor, heads a clinic with Nelda, a progressive nun. Into this ...See moreMario and Ana, in voluntary exile from Buenos Aires, live in a remote Argentine valley with their 12-year-old son Ernesto. Mario runs a school and a wool cooperative; Ana, a doctor, heads a clinic with Nelda, a progressive nun. Into this idealistic family comes Hans, a jaded Spanish geological engineer -- surveying the land for the local patron, to see if it can be dammed for hydro-electric power, which would drive the peasants from the land into the cities.  Written by See less",
        "runtimeMinutes": "120"
    },
    "1994_231": {
        "plotSummary": "An editor asks Deven, a teacher who loves Urdu poetry, to interview poet Nur Shahjehanabadi, an aging whale of a man. Deven goes to Bhopal from Mirpur to meet Nur, of whom he is in awe. He finds him living with feuding wives, visited by ...See moreAn editor asks Deven, a teacher who loves Urdu poetry, to interview poet Nur Shahjehanabadi, an aging whale of a man. Deven goes to Bhopal from Mirpur to meet Nur, of whom he is in awe. He finds him living with feuding wives, visited by sycophants who drink his whisky and eat his food. Deven wants to record Nur for posterity and seeks funds to buy an aged tape recorder, to bribe Safiya, the elder wife, to get Nur into a room at a brothel for a week for the recording, and to feed Nur's pals who show up. Nur's beautiful second wife, Imtiaz, wants to be taken seriously as a poetess. Dever dismisses her and ignores his own wife and child much as Nur does. In the end, what is preserved?  Written by See less",
        "runtimeMinutes": "126"
    },
    "1994_232": {
        "plotSummary": "This Ken Loach film tells the story of a man devoted to his family and his religion. Proud, though poor, Bob wants his little girl to have a beautiful (and costly) brand-new dress for her First Communion. His stubbornness and determination...See moreThis Ken Loach film tells the story of a man devoted to his family and his religion. Proud, though poor, Bob wants his little girl to have a beautiful (and costly) brand-new dress for her First Communion. His stubbornness and determination get him into trouble as he turns to more and more questionable measures, in his desperation to raise the needed money. This tragic flaw leads him to risk all that he loves and values, his beloved family, indeed even his immortal soul and salvation, in blind pursuit of that goal.  Written by Tad Dibbern See less",
        "runtimeMinutes": "90"
    },
    "1994_233": {
        "plotSummary": "A recently widowed, small-time hustler struggles to raise his two teenage daughters on his own, and still make a dishonest living in 1950s Indiana.",
        "runtimeMinutes": "107"
    },
    "1994_234": {
        "plotSummary": "Graham, a lonely Welsh postal worker, adopts James, a troubled ten-year-old boy. Graham always wanted a son, but James loves his biological father too much to give Graham a chance. Will the two be able to accept each other as family?",
        "runtimeMinutes": "105"
    },
    "1994_235": {
        "plotSummary": "Reuben is a drinker and brawler who runs afoul of the law and lands a long prison term. He leaves behind Roberta (Kelly Lynch), his wife and mother of nine. Also part of the extended family is Beal (Patrick McGaw), who becomes Roberta's ...See moreReuben is a drinker and brawler who runs afoul of the law and lands a long prison term. He leaves behind Roberta (Kelly Lynch), his wife and mother of nine. Also part of the extended family is Beal (Patrick McGaw), who becomes Roberta's sometime lover and possesses the famous Bean short fuse. All this is observed by Earlene (Martha Plimpton), a neighbor under the thumb of a strict religious father. Her dad warns her against any contact, but, despite the Beans' crude ways, the young woman is drawn to them. Their earthiness, directness, and unity stand in sharp contrast to her oppressive family life.See less",
        "runtimeMinutes": "99"
    },
    "1994_236": {
        "plotSummary": "An evil Queen banishes a flower loving troll named Stanley (Dom DeLuise) to New York City, where he befriends two young children.",
        "runtimeMinutes": "76"
    },
    "1994_237": {
        "plotSummary": "Chronicles the Mississippi voter registration drive from 1961- 64.",
        "runtimeMinutes": "105"
    },
    "1994_238": {
        "plotSummary": "It is now summer in the Parker family and the usual number of events is happening in their separate lives. Ralphie is searching for the perfect top to use to beat the school bully, the Old Man is in battle with their hillbilly neighbors (...See moreIt is now summer in the Parker family and the usual number of events is happening in their separate lives. Ralphie is searching for the perfect top to use to beat the school bully, the Old Man is in battle with their hillbilly neighbors (the Bumpuses) while eagerly awaiting the discovery of the perfect fishing spot, and Mother is attempting to collect all of the pieces of a glass china set at a local movie theater.  Written by Richard WebnerSee less",
        "runtimeMinutes": "85"
    },
    "1994_239": {
        "plotSummary": "A boy born the size of a small doll is kidnapped by a genetic lab and must find a way back to his father in this inventive adventure filmed using stop motion animation techniques. Tom meets a variety of strange creatures and eventually ...See moreA boy born the size of a small doll is kidnapped by a genetic lab and must find a way back to his father in this inventive adventure filmed using stop motion animation techniques. Tom meets a variety of strange creatures and eventually discovers a race of miniature humans like himself.  Written by Keith Loh See less",
        "runtimeMinutes": "60"
    },
    "1994_24": {
        "plotSummary": "A goofy detective specializing in animals goes in search of the missing mascot of the Miami Dolphins.",
        "runtimeMinutes": "86"
    },
    "1994_240": {
        "plotSummary": "Mad with grief after the death of his Kiowa wife, Talbot awaits death under a tree with her body beside him. She begins to haunt him because he won't burn her. His father, who bought him the wife, thinks her sister might reason with him.",
        "runtimeMinutes": "102"
    },
    "1994_241": {
        "plotSummary": "The comedic misadventures of a person of indeterminate gender.",
        "runtimeMinutes": "77"
    },
    "1994_242": {
        "plotSummary": "A documentary on the making of a big budget Bible picture. This is a spoof that shows the inside action on a film set where everything that could possibly go wrong goes wrong.See moreA documentary on the making of a big budget Bible picture. This is a spoof that shows the inside action on a film set where everything that could possibly go wrong goes wrong.  Written by Josh Pasnak See less",
        "runtimeMinutes": "82"
    },
    "1994_243": {
        "plotSummary": "Traces the music and sounds from its Appalachian roots to the present. The rise, fall, and consistent revival of bluegrass chronicled through oral history and visual record.",
        "runtimeMinutes": "95"
    },
    "1994_244": {
        "plotSummary": "At the end of the Civil War, Frank and Jesse James and other former guerillas who rode with Quantrill and Bill Anderson take the oath of allegiance to the Union. Feeling oppressed by Chicago railroad investors, the James and Younger ...See moreAt the end of the Civil War, Frank and Jesse James and other former guerillas who rode with Quantrill and Bill Anderson take the oath of allegiance to the Union. Feeling oppressed by Chicago railroad investors, the James and Younger brothers, Bob and Charlie Ford, Clell Miller and Arch Clements take to robbing banks, trains and coaches, with Pinkerton sworn to bringing them to justice.  Written by Jeff Hole See less",
        "runtimeMinutes": "105"
    },
    "1994_245": {
        "plotSummary": "Lucy (Leslie Hope), her husband Michael (Victor Ertmanis), and their business partner William (Dan Left) are the owners of a small publishing company in Toronto. The stability of their lives are thrown into an emotional maelstrom with the ...See moreLucy (Leslie Hope), her husband Michael (Victor Ertmanis), and their business partner William (Dan Left) are the owners of a small publishing company in Toronto. The stability of their lives are thrown into an emotional maelstrom with the arrival of Sloan (Peter Outerbrige), a former boxer-turned-writer whose first book (based on a serial killer) is about to be published by their company. Sloan gets in over his head when he embarks on a steamy affair with the sexually ravenous and frustrated Lucy, who longs to re-create her S&M-filled days in Paris gone by. But Sloan soon embarks on another affair of his own with the openly gay William which leads to sexual confusion for the writer. All in the while, Lucy's befuddled husband, Michael, slowly goes crazy over learning of his wife and business partner's dalliance with his client until he decides to join in on their bed-jumping as well.  Written by Larry B.See less",
        "runtimeMinutes": "112"
    },
    "1994_246": {
        "plotSummary": "Paul, an irritable and stressed-out hotel manager, begins to gradually develop paranoid delusions about his wife's infidelity. As he succumbs to green-eyed jealousy, his life starts to crumble. Each step on his downward spiral to madness ...See morePaul, an irritable and stressed-out hotel manager, begins to gradually develop paranoid delusions about his wife's infidelity. As he succumbs to green-eyed jealousy, his life starts to crumble. Each step on his downward spiral to madness seems to accelerate, driving him further along the path to a personal hell. Finally, the former shell of his personality cracks completely, with tragic consequences.  Written by Tad Dibbern See less",
        "runtimeMinutes": "102"
    },
    "1994_247": {
        "plotSummary": "A woman who grew up in a small town in Alaska goes to the public library to try and find out who her parents were. She was brought to town as a baby in a cardboard box with \"Kotzebue\" on it, which is the name of the town and also the name ...See moreA woman who grew up in a small town in Alaska goes to the public library to try and find out who her parents were. She was brought to town as a baby in a cardboard box with \"Kotzebue\" on it, which is the name of the town and also the name of the family that founded the town. She eventually befriends the librarian, an East German immigrant who lost her husband while escaping from behind the Iron Curtain. They help each other try to find closure to the events in their past.  Written by Ed Sutton See less",
        "runtimeMinutes": "95"
    },
    "1994_248": {
        "plotSummary": "A small time crook flees to Mexico to evade the authorities, loan sharks, and his murderous ex-partner with only his fiance and a trusted Colt .45.",
        "runtimeMinutes": "101"
    },
    "1994_249": {
        "plotSummary": "This gritty police drama shows us the underbelly of the Parisian drug trade. Lulu is a tough streetwise narcotics cop who, like a Frank Serpico or a Dirty Harry Callahan, doesn't play by the rules or kowtow to his weak and/or corrupt ...See moreThis gritty police drama shows us the underbelly of the Parisian drug trade. Lulu is a tough streetwise narcotics cop who, like a Frank Serpico or a Dirty Harry Callahan, doesn't play by the rules or kowtow to his weak and/or corrupt superiors. Lulu thrives in this violent world, where sheer guts can overcome his squad's deficiencies of money and equipment. Despite the ruthless environment that he lives and works in every day, he still manages somehow to maintain his humanity.  Written by Tad Dibbern See less",
        "runtimeMinutes": "145"
    },
    "1994_25": {
        "plotSummary": "In a remote woodland cabin, a small town doctor discovers Nell - a beautiful young hermit woman with many secrets.",
        "runtimeMinutes": "112"
    },
    "1994_250": {
        "plotSummary": "The life and work of Allen Ginsberg, the greatest of the Beat Generation poets is put in focus in this film",
        "runtimeMinutes": "82"
    },
    "1994_251": {
        "plotSummary": "In this scathing and subversive social comedy, life in post riot Los Angeles is dissected under the sardonic eye of John Boyz, an unemployed thirty nothing flounderer on Venice Beach who is trying to figure out what to do with his life. ...See moreIn this scathing and subversive social comedy, life in post riot Los Angeles is dissected under the sardonic eye of John Boyz, an unemployed thirty nothing flounderer on Venice Beach who is trying to figure out what to do with his life. John can't be bothered with apathy, but no matter how much he wants to help people, he is too immobilized to do anything useful. Haunted by chronic insomnia and impending sense of doom, all he can do is watch, and John is an avid observer. Through his voyeuristic binoculars, he struggles to make sense of all the alienation and disaffection he sees in his neighborhood. In his journal he meticulously chronicles the mundane down to steadfast march of ants across his kitchen counter. John is desperately trying to keep one meaningless day from blending into next. He compulsively watches homemade videos of LA riots looking for a clue. But everywhere around him the city's social fabric is coming apart at the seams, and now it is John Boys's own threadbare life that's about to unravel.  Written by Strand releasing See less",
        "runtimeMinutes": "96"
    },
    "1994_252": {
        "plotSummary": "Katherine Coleridge (Joanne Whalley-Kilmer) is a basically miserable and mentally unstable woman who is married to even-aged Isobel's father, Robert (Peter Whitaker), who is the only one willing to give Katherine the unconditional love ...See moreKatherine Coleridge (Joanne Whalley-Kilmer) is a basically miserable and mentally unstable woman who is married to even-aged Isobel's father, Robert (Peter Whitaker), who is the only one willing to give Katherine the unconditional love that she craves lest her inner chaos should wholly consume her. For any kind of peace of mind, she is consequently entirely dependent on him. As, however, her husband dies (of natural causes), Katherine quite instinctively transfers her primal need for all-encompassing care to his daughter, Isobel (Juliet Stevenson). As this is a serious intrusion upon her and her boyfriend's private life, Isobel rejects Katherine, at first. She soon realizes that Katherine needs her attention more than her boyfriend, whom she then opts to leave, to go and live with Katherine in her father's countryside cottage. The last scenes of the movie, not to be revealed here, raises the question of who, after all, were the more needful of Isobel's love.  Written by Tue Sorensen See less",
        "runtimeMinutes": "97"
    },
    "1994_253": {
        "plotSummary": "Jack sets himself up in the Hotel St James to work on his book on prostitution in New York. Along the way he meets and grows fond of Mary Lou.",
        "runtimeMinutes": "85"
    },
    "1994_254": {
        "plotSummary": "An absent-minded-professor father and his son bond during a symbolic road trip through the Western U.S. while his wife tries to overcome her neuroses to save the family.See moreAn absent-minded-professor father and his son bond during a symbolic road trip through the Western U.S. while his wife tries to overcome her neuroses to save the family.  Written by Steve Derby See less",
        "runtimeMinutes": "108"
    },
    "1994_255": {
        "plotSummary": "Paul Reisner, a young doctor, becomes a researcher in a prestigious medical institute. He feels he has a chance to be part of a movement of unending progress in science and civilization. Then he begins to discover the dark side of the ...See morePaul Reisner, a young doctor, becomes a researcher in a prestigious medical institute. He feels he has a chance to be part of a movement of unending progress in science and civilization. Then he begins to discover the dark side of the institute, which foreshadows the dark side of the 20th century.  Written by Cleo See less",
        "runtimeMinutes": "112"
    },
    "1994_26": {
        "plotSummary": "Max Walker, an officer for a security agency that regulates time travel, must fend for his life against a shady politician who's intent on changing the past to control the future.",
        "runtimeMinutes": "99"
    },
    "1994_27": {
        "plotSummary": "Col. Guile and various other martial arts heroes fight against the tyranny of Dictator M. Bison and his cohorts.",
        "runtimeMinutes": "102"
    },
    "1994_28": {
        "plotSummary": "Rafting expert Gail takes on a pair of armed killers while navigating a spectacularly violent river.",
        "runtimeMinutes": "111"
    },
    "1994_29": {
        "plotSummary": "Alfalfa is wooing Darla and his \"He-Man-Woman-Hating\" friends attempt to sabotage the relationship.",
        "runtimeMinutes": "82"
    },
    "1994_3": {
        "plotSummary": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used-car salesman while terrorists smuggle nuclear war heads into the United States.",
        "runtimeMinutes": "141"
    },
    "1994_30": {
        "plotSummary": "Frank Drebin (Leslie Nielsen) comes out of retirement to help Police Squad infiltrate a gang of terrorists planning to detonate a bomb at the Academy Awards.",
        "runtimeMinutes": "83"
    },
    "1994_31": {
        "plotSummary": "A man brutally murdered comes back to life as an undead avenger of his and his fiancee's murder.",
        "runtimeMinutes": "102"
    },
    "1994_32": {
        "plotSummary": "Two victims of traumatized childhoods become lovers and psychopathic serial murderers irresponsibly glorified by the mass media.",
        "runtimeMinutes": "118"
    },
    "1994_33": {
        "plotSummary": "When a boy prays for a chance to have a family if the California Angels win the pennant, angels are assigned to make that possible.",
        "runtimeMinutes": "102"
    },
    "1994_34": {
        "plotSummary": "The March sisters live and grow in post-Civil War America.",
        "runtimeMinutes": "115"
    },
    "1994_35": {
        "plotSummary": "The seemingly perfect relationship between a man and his wife is tested as a result of her alcoholism. Read more: Synopsis",
        "runtimeMinutes": "126"
    },
    "1994_36": {
        "plotSummary": "New York City tabloid editor Henry's faced with tough decisions while he faces several serious life challenges, and a tempting job offer.",
        "runtimeMinutes": "112"
    },
    "1994_37": {
        "plotSummary": "In 1930s New York City, The Shadow (Alec Baldwin) battles his nemesis, Shiwan Khan (John Lone), who is building an atomic bomb.",
        "runtimeMinutes": "108"
    },
    "1994_38": {
        "plotSummary": "A lawyer and a little girl must prove that a man claiming to be Santa Claus is the real thing.",
        "runtimeMinutes": "114"
    },
    "1994_39": {
        "plotSummary": "Can Gordon's team win the Junior Goodwill Games in California in spite of all the set-backs?",
        "runtimeMinutes": "106"
    },
    "1994_4": {
        "plotSummary": "Bank clerk Stanley Ipkiss is transformed into a manic superhero when he wears a mysterious mask.",
        "runtimeMinutes": "101"
    },
    "1994_40": {
        "plotSummary": "One year after their first adventure, Mitch Robbins and his friends discover a treasure map that belonged to their late trail guide Curly and they set out to discover its secrets.",
        "runtimeMinutes": "116"
    },
    "1994_41": {
        "plotSummary": "Rudyard Kipling's classic tale of Mowgli, the orphaned jungle boy raised by wild animals, and how he becomes king of the jungle.",
        "runtimeMinutes": "111"
    },
    "1994_42": {
        "plotSummary": "A stubborn man past his prime reflects on his life of strict independence and seeks more from himself.",
        "runtimeMinutes": "110"
    },
    "1994_43": {
        "plotSummary": "A mystical martial artist/environmental Agent takes on a ruthless oil corporation.",
        "runtimeMinutes": "101"
    },
    "1994_44": {
        "plotSummary": "A rich young boy finds his family targeted in an inside job and must use his cunning to save them.",
        "runtimeMinutes": "95"
    },
    "1994_45": {
        "plotSummary": "A police officer promises to share his lottery ticket with a waitress in lieu of a tip.",
        "runtimeMinutes": "101"
    },
    "1994_46": {
        "plotSummary": "A documentary filmmaker and her fellow Generation X graduates face life after college, looking for work and love in Houston.",
        "runtimeMinutes": "99"
    },
    "1994_47": {
        "plotSummary": "Peter Brackett and Sabrina Peterson are two competing Chicago newspaper reporters who join forces to unravel the mystery behind a train derailment.",
        "runtimeMinutes": "123"
    },
    "1994_48": {
        "plotSummary": "The Indians are now a World Series contender. But last year's hunger is now replaced with complacency, and bad decisions by the new owner threaten to tear the team apart.",
        "runtimeMinutes": "105"
    },
    "1994_49": {
        "plotSummary": "After a bike accident, a young boy inadvertently gains possession of a check for $1 million and proceeds to spend it, unaware that the gangsters to whom it belongs are in pursuit.",
        "runtimeMinutes": "93"
    },
    "1994_5": {
        "plotSummary": "A young police officer must prevent a bomb exploding aboard a city bus by keeping its speed above 50 mph.",
        "runtimeMinutes": "116"
    },
    "1994_50": {
        "plotSummary": "An Irish bomber escapes from prison and targets a member of the Boston bomb squad.",
        "runtimeMinutes": "121"
    },
    "1994_51": {
        "plotSummary": "An ex-con and his devoted wife must flee from danger when a heist doesn't go as planned.",
        "runtimeMinutes": "115"
    },
    "1994_52": {
        "plotSummary": "An ex-cop, now a private detective, takes on the search for the millions stolen by a drug lord.",
        "runtimeMinutes": "108"
    },
    "1994_53": {
        "plotSummary": "Two misguided youths join the reserves to make some money for their entrepreneurial dreams. No sooner than they finish basic training are they called up to do their part to save the free world.",
        "runtimeMinutes": "91"
    },
    "1994_54": {
        "plotSummary": "A tough cop teams up with a professional skydiver to capture a renegade computer hacker on the run from the law.",
        "runtimeMinutes": "101"
    },
    "1994_55": {
        "plotSummary": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
        "runtimeMinutes": "142"
    },
    "1994_56": {
        "plotSummary": "A former U.S. First Lady wants a particular Secret Service agent to head her bodyguard detail, even though he can't stand her.",
        "runtimeMinutes": "96"
    },
    "1994_57": {
        "plotSummary": "A mechanic romances the mathematician niece of physicist Albert Einstein, with help from him and his friends.",
        "runtimeMinutes": "100"
    },
    "1994_58": {
        "plotSummary": "A teenage girl on vacation in the Bahamas with her divorced father tries to impress a potential boyfriend by saying that her father is actually her lover.",
        "runtimeMinutes": "90"
    },
    "1994_59": {
        "plotSummary": "From Wichita to Dodge City to the O.K. Corral in Tombstone, a man becomes a myth in this thrilling journey of romance, adventure and desperate, heroic action.",
        "runtimeMinutes": "191"
    },
    "1994_6": {
        "plotSummary": "In a parallel modern-day Stone Age world, a working-class family, the Flintstones, are set up for an executive job. But they learn that money can't buy happiness.",
        "runtimeMinutes": "91"
    },
    "1994_60": {
        "plotSummary": "A young lawyer, Richard Goodwin, investigates a potentially fixed game show. Charles Van Doren, a big time show winner, is under Goodwin's investigation.",
        "runtimeMinutes": "133"
    },
    "1994_61": {
        "plotSummary": "A failed businessman is hired by the army to teach a group of underachieving recruits in order to help them pass basic training.",
        "runtimeMinutes": "128"
    },
    "1994_62": {
        "plotSummary": "A college basketball coach is forced to break the rules in order to get the players he needs to stay competitive.",
        "runtimeMinutes": "108"
    },
    "1994_63": {
        "plotSummary": "While driving on a remote highway, a man is torn between choosing to reunite with his estranged wife or taking up with his lovers",
        "runtimeMinutes": "98"
    },
    "1994_64": {
        "plotSummary": "Jimmy Dolan is a college basketball coach who wants a big promotion. To get it, he needs to make a dramatic find. He ends up deep in Africa, hoping to recruit Saleh, a huge basketball prodigy Jimmy glimpsed in a home movie. But Saleh is ...See moreJimmy Dolan is a college basketball coach who wants a big promotion. To get it, he needs to make a dramatic find. He ends up deep in Africa, hoping to recruit Saleh, a huge basketball prodigy Jimmy glimpsed in a home movie. But Saleh is the chief's son and has responsibilities at home, since the tribe's land is threatened by a mining company with its own hotshot basketball team.  Written by Reid GagleSee less",
        "runtimeMinutes": "107"
    },
    "1994_65": {
        "plotSummary": "A brave young man is thrust into adulthood as he and his courageous team of sled dogs embark on a grueling and treacherous cross-country marathon.",
        "runtimeMinutes": "108"
    },
    "1994_66": {
        "plotSummary": "Two brothers, survivors of family tragedy, take different life paths: one falls for a high-spirited waitress and dreams of success, the other follows a life of petty crime. Their lives reconnect in shattering fashion.",
        "runtimeMinutes": "119"
    },
    "1994_67": {
        "plotSummary": "Two political speechwriters fall in love before they find out they are working for candidates on opposite sides.",
        "runtimeMinutes": "99"
    },
    "1994_68": {
        "plotSummary": "As they visit New York City, a pair of cowboys have to become unlikely heroes when their friend is kidnapped.",
        "runtimeMinutes": "102"
    },
    "1994_69": {
        "plotSummary": "In 1959, a widower hires a kindly housekeeper/nanny to care for his seven-year-old daughter.",
        "runtimeMinutes": "115"
    },
    "1994_7": {
        "plotSummary": "After a woman leaves a briefcase at the airport terminal, a dumb limo driver and his dumber friend set out on a hilarious cross-country road trip to Aspen to return it.",
        "runtimeMinutes": "107"
    },
    "1994_70": {
        "plotSummary": "As a teen, Faith was told that her destiny is a man named Damon Bradley. Years later - Faith is about to marry another man - a Damon Bradley calls to wish them all the best. Faith blows off the wedding and follows Damon to Italy.",
        "runtimeMinutes": "109"
    },
    "1994_71": {
        "plotSummary": "Convinced his thesis will have him graduate with honors from Harvard University, a stuffy student finds himself at the mercy of a homeless man's demands when he holds the papers hostage.",
        "runtimeMinutes": "101"
    },
    "1994_72": {
        "plotSummary": "A color-blind psychiatrist Bill Capa is stalked by an unknown killer after taking over his murdered friend's therapy group, all of whom have a connection to a mysterious young woman that Capa begins having intense sexual encounters with.",
        "runtimeMinutes": "121"
    },
    "1994_73": {
        "plotSummary": "A demonic force has chosen Freddy Krueger as its portal to the real world. Can Heather Langenkamp play the part of Nancy one last time and trap the evil trying to enter our world?",
        "runtimeMinutes": "112"
    },
    "1994_74": {
        "plotSummary": "This movie chronicles the life of Lane Frost, 1987 PRCA Bull Riding World Champion, his marriage and his friendships with Tuff Hedeman (three-time World Champion) and Cody Lambert.",
        "runtimeMinutes": "105"
    },
    "1994_75": {
        "plotSummary": "Mathilda, a 12-year-old girl, is reluctantly taken in by Leon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes his protegee and learns the assassin's trade.",
        "runtimeMinutes": "110"
    },
    "1994_76": {
        "plotSummary": "Misfits form their own opposing team to an elite peewee football team, coached by the elite team coach's brother.",
        "runtimeMinutes": "107"
    },
    "1994_77": {
        "plotSummary": "Kid, after a lifetime 'playing the field', is about to get married. 'Play' plans to throw the best bachelor party ever - until 'Kid's' three wise-crackin' nephews come to town, intent on showing them what parties are all about.",
        "runtimeMinutes": "100"
    },
    "1994_78": {
        "plotSummary": "A thief's son cons his father into spending more time with him.",
        "runtimeMinutes": "109"
    },
    "1994_79": {
        "plotSummary": "Ex-football star Mike Gambril meets Terry McKay on a flight to Sydney, which is forced to land on a small atoll. Both engaged to others, they become romantic on board the ship sent to take the passengers to a larger island. They agree to ...See moreEx-football star Mike Gambril meets Terry McKay on a flight to Sydney, which is forced to land on a small atoll. Both engaged to others, they become romantic on board the ship sent to take the passengers to a larger island. They agree to meet in New York City three months later to see if the attraction is real. One shows up, the other doesn't, but they run into each other afterwards.  Written by Ron Kerrigan See less",
        "runtimeMinutes": "108"
    },
    "1994_8": {
        "plotSummary": "Over the course of five social occasions, a committed bachelor must consider the notion that he may have discovered love.",
        "runtimeMinutes": "117"
    },
    "1994_80": {
        "plotSummary": "A drug dealer tries to get out of the life and start anew with his girlfriend, but the transition is tragically difficult.",
        "runtimeMinutes": "123"
    },
    "1994_81": {
        "plotSummary": "A group of young boys befriend a prostitute named, V.",
        "runtimeMinutes": "110"
    },
    "1994_82": {
        "plotSummary": "Vada Sultenfuss must go to LA to stay with her Uncle Phil to do some research on her mother's life, but finds much more.",
        "runtimeMinutes": "99"
    },
    "1994_83": {
        "plotSummary": "An emotionally fractured Vietnam vet returns to his family in rural Mississippi, counseling his kids when they have to fight their own neighborhood battle. From the director of Fried Green Tomatoes.",
        "runtimeMinutes": "126"
    },
    "1994_84": {
        "plotSummary": "After three kidnappers lose the baby they have kidnapped, both the cops and kidnappers go looking for the baby.",
        "runtimeMinutes": "99"
    },
    "1994_85": {
        "plotSummary": "Lightning Jack Kane is an Australian outlaw in the wild west. During a bungled bank robbery he picks up mute Ben Doyle as a hostage. The two become good friends, with Jack teaching Ben how to rob banks, while they plan Jack's last heist.See moreLightning Jack Kane is an Australian outlaw in the wild west. During a bungled bank robbery he picks up mute Ben Doyle as a hostage. The two become good friends, with Jack teaching Ben how to rob banks, while they plan Jack's last heist.  Written by Rob HartillSee less",
        "runtimeMinutes": "98"
    },
    "1994_86": {
        "plotSummary": "The true story of how a seal named Andre befriended a little girl and her family, circa 1962.",
        "runtimeMinutes": "95"
    },
    "1994_87": {
        "plotSummary": "Emma, a blind violinist who had recently undergone a revolutionary surgery, joins with a police detective to track a serial killer after she was an inadvertent witness to his latest crime.",
        "runtimeMinutes": "106"
    },
    "1994_88": {
        "plotSummary": "A maverick skydiver and a former KGB agent team up to stop the Russian mafia from stealing gold.",
        "runtimeMinutes": "102"
    },
    "1994_89": {
        "plotSummary": "A young girl's life turns hairy when her new pet monkey turns out to be a trained pickpocket on the run from a scheming Gypsy.",
        "runtimeMinutes": "96"
    },
    "1994_9": {
        "plotSummary": "A vampire tells his epic life story: love, betrayal, loneliness, and hunger.",
        "runtimeMinutes": "123"
    },
    "1994_90": {
        "plotSummary": "Story of a promising high school basketball star and his relationships with two brothers, one a drug dealer and the other a former basketball star fallen on hard times and now employed as a security guard.",
        "runtimeMinutes": "96"
    },
    "1994_91": {
        "plotSummary": "Mr. Miyagi is back and he takes a new pupil under his wing; a troubled adolescent girl.",
        "runtimeMinutes": "107"
    },
    "1994_92": {
        "plotSummary": "A soldier convicted for murdering his commanding officer is dumped and left to die on a prison island inhabited by two camps of convicts.",
        "runtimeMinutes": "118"
    },
    "1994_93": {
        "plotSummary": "Four prostitutes join together to travel the Old West.",
        "runtimeMinutes": "99"
    },
    "1994_94": {
        "plotSummary": "When King George III goes mad, his Lieutenants try to adjust the rules to run the country without his participation.",
        "runtimeMinutes": "110"
    },
    "1994_95": {
        "plotSummary": "A girl named Alex is by mistake housed with 2 guys, Stuart and Eddy, in a college dorm suite. After initial problems they become friends. Stuart has the hots for Alex, Alex for Eddy and Eddy for Stuart. Can it work?",
        "runtimeMinutes": "93"
    },
    "1994_96": {
        "plotSummary": "A cowardly boy, who buries himself in accident statistics, enters a library to escape a storm, only to be transformed into an animated illustration by the Pagemaster. He has to work through obstacles from classic books to return to real-life.",
        "runtimeMinutes": "80"
    },
    "1994_97": {
        "plotSummary": "Spike Lee's vibrant semi-autobiographical portrait of a school teacher, her stubborn jazz musician husband and their five kids living in Brooklyn in 1973. Read more: Synopsis",
        "runtimeMinutes": "115"
    },
    "1994_98": {
        "plotSummary": "In New York in 1928, a struggling playwright is forced to cast a mobster's talentless girlfriend in his latest drama in order to get it produced.",
        "runtimeMinutes": "98"
    },
    "1994_99": {
        "plotSummary": "Rich, old uncle Joe is surrounded by relatives waiting/hoping for him to die while trying to look good and backstabbing the competition. What should he do?",
        "runtimeMinutes": "113"
    }
}