{
    "1995_1": {
        "plotSummary": "John McClane and a Harlem store owner are targeted by German terrorist Simon Gruber in New York City, where he plans to rob the Federal Reserve Building.",
        "runtimeMinutes": "128"
    },
    "1995_10": {
        "plotSummary": "When two kids find and play a magical board game, they release a man trapped in it for decades - and a host of dangers that can only be stopped by finishing the game.",
        "runtimeMinutes": "104"
    },
    "1995_100": {
        "plotSummary": "A biographical story of former U.S. President Richard Nixon, from his days as a young boy, to his eventual Presidency, which ended in shame.",
        "runtimeMinutes": "192"
    },
    "1995_101": {
        "plotSummary": "A Little League player is sent back into medieval times where he is given the task of saving Camelot.",
        "runtimeMinutes": "89"
    },
    "1995_102": {
        "plotSummary": "A private detective gets more than he bargains for when he encounters Philip Swan, a performer whose amazing illusions captive the world, but they are not really what everyone thinks.",
        "runtimeMinutes": "109"
    },
    "1995_103": {
        "plotSummary": "Young drug pushers in the projects of Brooklyn live hard dangerous lives, trapped between their drug bosses and the detectives out to stop them.",
        "runtimeMinutes": "128"
    },
    "1995_104": {
        "plotSummary": "Deceived that he had won the Prize, Connor MacLeod awakens from a peaceful life when an entombed immortal magician comes seeking the Highlander.",
        "runtimeMinutes": "99"
    },
    "1995_105": {
        "plotSummary": "Hatch gets a special resuscitative medicine after \"dying\" in a car accident. His wife and daughter only get minor injuries. He gets strange nightmares such as killing a teen girl. Is it just dreams?",
        "runtimeMinutes": "106"
    },
    "1995_106": {
        "plotSummary": "An elderly yet young-at-heart man moves in with his grandson and both their lives turn upside-down.",
        "runtimeMinutes": "108"
    },
    "1995_107": {
        "plotSummary": "A story about the family breakup of three divorced men. The film presented their perspective and it reveals their relationship with their children, ex-wives, girl friends, male friendships, and their identities as divorced men.",
        "runtimeMinutes": "106"
    },
    "1995_108": {
        "plotSummary": "A funeral director tells four strange tales of horror with an African American focus to three drug dealers he traps in his place of business.",
        "runtimeMinutes": "98"
    },
    "1995_109": {
        "plotSummary": "Teenage Angus adopts a stray dog and names him Yellow. Several days later, while traveling along the coast of British Columbia with Angus' father, John, the boy and dog become stranded when turbulent waters capsize their boat. Angus's ...See moreTeenage Angus adopts a stray dog and names him Yellow. Several days later, while traveling along the coast of British Columbia with Angus' father, John, the boy and dog become stranded when turbulent waters capsize their boat. Angus's parents relentlessly badger rescue teams. Angus, schooled by his father in wilderness survival skills, and assisted by the intelligent Yellow Dog, tries to attract rescuers.  Written by Ray Hamel See less",
        "runtimeMinutes": "81"
    },
    "1995_11": {
        "plotSummary": "Babe, a pig raised by sheepdogs, learns to herd sheep with a little help from Farmer Hoggett.",
        "runtimeMinutes": "91"
    },
    "1995_110": {
        "plotSummary": "Max Kirkpatrick is a cop who protects Kate McQuean, a civil law attorney, from a renegade KGB team out to terminate her. Written by Starlight",
        "runtimeMinutes": "91"
    },
    "1995_111": {
        "plotSummary": "An outcast Husky risks his life with other sled dogs to prevent a deadly epidemic from ravaging Nome, Alaska.",
        "runtimeMinutes": "78"
    },
    "1995_112": {
        "plotSummary": "A man makes his way from Mexico to L.A. in the 1920s, gets married and raises a big family there. The movie follows the children until they, too, get married and have children in the 1960s.",
        "runtimeMinutes": "128"
    },
    "1995_113": {
        "plotSummary": "A young boy's imagination summons cowboy legend Pecos Bill, who helps him save the family farm from a greedy land-grabber. With the help of a lumberjack and a railroad worker, they all embark on a surprise-filled adventure.",
        "runtimeMinutes": "96"
    },
    "1995_114": {
        "plotSummary": "When an English cartographer must tell a Welsh village that their mountain is only a hill, the offended community sets out to change that.",
        "runtimeMinutes": "99"
    },
    "1995_115": {
        "plotSummary": "Mel Brooks ' parody of the classic vampire story and its famous film adaptations.",
        "runtimeMinutes": "88"
    },
    "1995_116": {
        "plotSummary": "Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.",
        "runtimeMinutes": "98"
    },
    "1995_117": {
        "plotSummary": "An affair between a young woman and a pastor has disastrous consequences.",
        "runtimeMinutes": "135"
    },
    "1995_118": {
        "plotSummary": "A female pirate and her companion race against their rivals to find a hidden island that contains a fabulous treasure.",
        "runtimeMinutes": "124"
    },
    "1995_119": {
        "plotSummary": "A young girl is relegated to servitude at a boarding school when her father goes missing and is presumed dead.",
        "runtimeMinutes": "97"
    },
    "1995_12": {
        "plotSummary": "Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England.",
        "runtimeMinutes": "178"
    },
    "1995_120": {
        "plotSummary": "A bright assistant D.A. investigates a gruesome hatchet murder and hides a clue he found at the crime scene. Under professional threats and an attempt on his life, he goes on heartbroken because evidence point to the woman he still loves.",
        "runtimeMinutes": "95"
    },
    "1995_121": {
        "plotSummary": "Seven junior-high-school girls organize a daycare camp for children while at the same time experiencing classic adolescent growing pains.",
        "runtimeMinutes": "94"
    },
    "1995_122": {
        "plotSummary": "A small town's women give birth to unfriendly alien children posing as humans.",
        "runtimeMinutes": "98"
    },
    "1995_123": {
        "plotSummary": "An insurance investigator begins discovering that the impact a horror writer's books have on his fans is more than inspirational.",
        "runtimeMinutes": "95"
    },
    "1995_124": {
        "plotSummary": "A Brooklyn smoke shop is the center of neighborhood activity, and the stories of its customers.",
        "runtimeMinutes": "112"
    },
    "1995_125": {
        "plotSummary": "An unimpressive, everyday man is forced into a situation where he is told to kill a politician to save his kidnapped daughter.",
        "runtimeMinutes": "90"
    },
    "1995_126": {
        "plotSummary": "A former cop turned street-hustler accidentally uncovers a conspiracy in Los Angeles in 1999.",
        "runtimeMinutes": "145"
    },
    "1995_127": {
        "plotSummary": "Steven Lidz, unhappy with his home life since his mother got sick, goes and lives with his two crazy Uncles. There he changes and gets closer to his Uncles, but his parents want him home even though he is finally happy and popular.See moreSteven Lidz, unhappy with his home life since his mother got sick, goes and lives with his two crazy Uncles. There he changes and gets closer to his Uncles, but his parents want him home even though he is finally happy and popular.  Written by Todd Weiser See less",
        "runtimeMinutes": "93"
    },
    "1995_128": {
        "plotSummary": "On the run from authorities, a sleazy courier poses as a Scout leader on a camping trip. But he has no idea what he's in for when he must actually take charge of a group of kids.",
        "runtimeMinutes": "90"
    },
    "1995_129": {
        "plotSummary": "The biological and adoptive mothers of a young boy are involved in a bitter, controversial custody battle.",
        "runtimeMinutes": "111"
    },
    "1995_13": {
        "plotSummary": "Ace Ventura, Pet Detective, returns from a spiritual quest to investigate the disappearance of a rare white bat, the sacred animal of a tribe in Africa.",
        "runtimeMinutes": "90"
    },
    "1995_130": {
        "plotSummary": "Hackers are blamed for making a virus that will capsize five oil tankers.",
        "runtimeMinutes": "105"
    },
    "1995_131": {
        "plotSummary": "When two unemployed telephone pranksters decide to use their vocal \"talents\" to impersonate a Chicago mob boss and curry favor with organized crime in New York, the trouble begins. It isn't long before Johnny and Kamal (the \"Jerky Boys\" of...See moreWhen two unemployed telephone pranksters decide to use their vocal \"talents\" to impersonate a Chicago mob boss and curry favor with organized crime in New York, the trouble begins. It isn't long before Johnny and Kamal (the \"Jerky Boys\" of crank call fame) are wanted by the local mafia, the police, and their neighbor.  Written by Steve Derby See less",
        "runtimeMinutes": "82"
    },
    "1995_132": {
        "plotSummary": "A young American boy visiting in China helps his zoologist father rescue a panda cub from unscrupulous poachers while his panda reserve is threatened with closure from officious bureaucrats.",
        "runtimeMinutes": "84"
    },
    "1995_133": {
        "plotSummary": "A day in the life of a group of teens as they travel around New York City skating, drinking, smoking and deflowering virgins.",
        "runtimeMinutes": "91"
    },
    "1995_134": {
        "plotSummary": "In an unexplained act of charity, Jeanne Holman, picks up an injured, apparent tramp and takes him home to care for him little realizing who he was, or the effect he would have on her life and those of her family.",
        "runtimeMinutes": "115"
    },
    "1995_135": {
        "plotSummary": "A Montana bounty hunter and an anthropologist discover a tribe of Native Americans living in a settlement isolated from the rest of the world.",
        "runtimeMinutes": "118"
    },
    "1995_136": {
        "plotSummary": "Sarah Taylor, a criminal psychologist, embarks on a torrid affair with a seductive stranger. However, she begins doubting whether she can trust him when a mysterious stalker begins harassing her.",
        "runtimeMinutes": "86"
    },
    "1995_137": {
        "plotSummary": "A dramatized account of the story of The Black Panther Party of Self-Defense.",
        "runtimeMinutes": "124"
    },
    "1995_138": {
        "plotSummary": "A New Yorker on business in Nagoya meets a lady in the hotel bar. Returning to her room, 3 ninjas kill her and wound him. He sees the ninja boss' face. Ninjas try to kill him again but new samurai friends help, hide and train him.",
        "runtimeMinutes": "111"
    },
    "1995_139": {
        "plotSummary": "When he discovers his adopted son is a genius, a New York sportswriter seeks out the boy's birth mother: a ditzy porn star and prostitute.",
        "runtimeMinutes": "95"
    },
    "1995_14": {
        "plotSummary": "Army doctors struggle to find a cure for a deadly virus spreading throughout a California town that was brought to America by an African monkey.",
        "runtimeMinutes": "127"
    },
    "1995_140": {
        "plotSummary": "Young Fiona lives with her grandparents in a small fishing village where she takes an active role to unravel the mysterious secrets.",
        "runtimeMinutes": "103"
    },
    "1995_141": {
        "plotSummary": "A city girl teams up with a tomboy to solve the mystery of Bear Mountain, Molly Morgan, and the buried treasure as well as learn about true friendships.",
        "runtimeMinutes": "94"
    },
    "1995_142": {
        "plotSummary": "In 1972 Vietnam, a group of United States Marines are sent in to rescue several POW officers. The Landing Zone (LZ) which should have been \"cold\" actually turns out to indeed be very \"hot\" (characterized by violent and forceful activity or...See moreIn 1972 Vietnam, a group of United States Marines are sent in to rescue several POW officers. The Landing Zone (LZ) which should have been \"cold\" actually turns out to indeed be very \"hot\" (characterized by violent and forceful activity or movement ; very intense). Soon, after a short fight, only four of the soldiers are left alive. Later, the platoon which they were to meet the next day is entirely wiped out with the exception of one nut-case. The small group then arrives at the conclusion that they are all expendable decoys. Between all of the walking, talking, arguing and assaulting between the four soldiers, there are flashbacks to all of their contrite lives before serving in the Corps.  Written by Tony Fontana See less",
        "runtimeMinutes": "88"
    },
    "1995_143": {
        "plotSummary": "John Netherwood and his wife Leann are fugitives who are both wanted for murder. They have a young daughter named Janie. John and Leann are in the process of robbing a house when the two residents of the house show up. John kills the two ...See moreJohn Netherwood and his wife Leann are fugitives who are both wanted for murder. They have a young daughter named Janie. John and Leann are in the process of robbing a house when the two residents of the house show up. John kills the two residents and heads back to the car with Leann - only to discover the police waiting for them. John and Leann get away after a cop shoots John, and Janie is placed up for adoption. Janie is soon adopted by southern California carpenter Russell Clifton and his wife Dana - and what they don't know is that they're in for the fight of their lives. John and Leann are trying to locate Janie and will stop at nothing to find her, even if it means killing whoever is in their way. When John and Leann discover that Janie was adopted by Russell and Dana, they plot to kill Russell and Dana and take Janie, but one thing they don't expect is for Russell and Dana to fight back with all they've got, because Russell and Dana are willing to do whatever it takes to hold on to the new daughter that they have grown to love.  Written by Todd Baldridge See less",
        "runtimeMinutes": "99"
    },
    "1995_144": {
        "plotSummary": "Laura is trying to pick up the pieces of her life after the murder of her husband and son, and goes on vacation with her sister to Burma. After losing her passport at a political rally, she is left on her own for a few days, during which ...See moreLaura is trying to pick up the pieces of her life after the murder of her husband and son, and goes on vacation with her sister to Burma. After losing her passport at a political rally, she is left on her own for a few days, during which time she falls in with students fighting for democracy. She and their leader, U Aung Ko, travel through Burma, whilst witnessing many bloody acts of repression by the dictatorship, in an attempt to escape to Thailand. Based on a true story.  Written by James Hastie See less",
        "runtimeMinutes": "100"
    },
    "1995_145": {
        "plotSummary": "A young man and woman meet on a train in Europe, and wind up spending one evening together in Vienna. Unfortunately, both know that this will probably be their only night together.",
        "runtimeMinutes": "101"
    },
    "1995_146": {
        "plotSummary": "Eight years ago, Anne Elliot rejected Frederick Wentworth, the man she loved, out of a sense of duty and obedience. Now an ignored and faded spinster, she follows her financially stricken family from their home, only to be reintroduced to ...See moreEight years ago, Anne Elliot rejected Frederick Wentworth, the man she loved, out of a sense of duty and obedience. Now an ignored and faded spinster, she follows her financially stricken family from their home, only to be reintroduced to the now successful and wealthy Captain Frederick Wentworth. With their roles reversed and Captain Wentworth the eligible and wealthy bachelor, Anne navigates the scheming society that still tries to keep them apart.See less",
        "runtimeMinutes": "107"
    },
    "1995_147": {
        "plotSummary": "Gwyn begins doubting her \"yes\" to Matt's wedding proposal, when she hears about her parents' and brother's adultery.",
        "runtimeMinutes": "95"
    },
    "1995_148": {
        "plotSummary": "With his cop companion shot and killed by terrorists, Reno The Dog pairs up with tough cop Jake in thwarting the criminal organization.",
        "runtimeMinutes": "86"
    },
    "1995_149": {
        "plotSummary": "A miserable fat teenager secretly has a crush on the class beauty, ends up becoming the surprising participant to dance with her at a high school dance, meaning he's got to get his act together with the help of his best friend.",
        "runtimeMinutes": "90"
    },
    "1995_15": {
        "plotSummary": "A group of professional bank robbers start to feel the heat from police when they unknowingly leave a clue at their latest heist.",
        "runtimeMinutes": "170"
    },
    "1995_150": {
        "plotSummary": "To embarrass his rival, a scheming senator uses nitwit Ohio teens who are invited to a Washington gathering on educational failure.",
        "runtimeMinutes": "91"
    },
    "1995_151": {
        "plotSummary": "Four interlocking tales that take place in a fading hotel on New Year's Eve.",
        "runtimeMinutes": "98"
    },
    "1995_152": {
        "plotSummary": "A man plagued by neuroses frequents the club Exotica in an attempt to find solace, but even there his past is never far away.",
        "runtimeMinutes": "103"
    },
    "1995_153": {
        "plotSummary": "A homosexual Catholic priest finds out during confessional that a young girl is being sexually abused by her father, and has to decide how to deal with both that secret and his own.",
        "runtimeMinutes": "105"
    },
    "1995_154": {
        "plotSummary": "A girl is among the few survivors of a dystopian Earth. Riding a war tank, she fights against the tyranny of a mega-corporation that dominates the remaining potable water supply of the planet.",
        "runtimeMinutes": "104"
    },
    "1995_155": {
        "plotSummary": "A frigid young housewife decides to spend her midweek afternoons as a prostitute.",
        "runtimeMinutes": "100"
    },
    "1995_156": {
        "plotSummary": "The exiled royal physician to King Charles II devotes himself to helping Londoners suffering from the plague, and in the process falls in love with an equally poor woman.",
        "runtimeMinutes": "117"
    },
    "1995_157": {
        "plotSummary": "After a man dies in a car crash, he is reincarnated as a dog and attempts to reconnect with his family.",
        "runtimeMinutes": "96"
    },
    "1995_158": {
        "plotSummary": "A lovable but introverted penguin named Hubie (Martin Short) plans to present his betrothal pebble to the bird of his dreams.",
        "runtimeMinutes": "74"
    },
    "1995_159": {
        "plotSummary": "A talking pig named Gordy becomes involved in a quest to save his family from the slaughterhouse.",
        "runtimeMinutes": "90"
    },
    "1995_16": {
        "plotSummary": "A hopelessly romantic Chicago Transit Authority token collector is mistaken for the fiancee of a coma patient.",
        "runtimeMinutes": "103"
    },
    "1995_160": {
        "plotSummary": "In an alternative America where African-Americans and White Americans have reversed cultural roles, a white factory worker kidnaps a black factory owner for dismissing him over perceived disdain.",
        "runtimeMinutes": "89"
    },
    "1995_161": {
        "plotSummary": "Rick Heller is a juvenile delinquent who keeps getting himself into trouble. To keep him out of trouble his mother puts him to work cleaning the cage of a gorilla named Katie which she is teaching to communicate through the use of sign ...See moreRick Heller is a juvenile delinquent who keeps getting himself into trouble. To keep him out of trouble his mother puts him to work cleaning the cage of a gorilla named Katie which she is teaching to communicate through the use of sign language. When the owner of the gorilla takes her back to become a flea market freak Rick takes it upon himself to break Katie out and take her on an adventureous journey to get her out of the country.  Written by Christopher D. Ryan See less",
        "runtimeMinutes": "100"
    },
    "1995_162": {
        "plotSummary": "Nelson Crowe is a CIA operative under the thumb of the Company for a disputed delivery of $50,000 in gold. They blackmail him into working for the Grimes Organization, which is set up as a private company for hire, to blackmail prominent ...See moreNelson Crowe is a CIA operative under the thumb of the Company for a disputed delivery of $50,000 in gold. They blackmail him into working for the Grimes Organization, which is set up as a private company for hire, to blackmail prominent individuals. Crowe, working with Margaret Wells (another former Covert Operations operative), blackmails and bribes a State Supreme Court judge, but the deal sours. One of Crowe's co-workers, Tod Stapp, discovers Crowe's current CIA involvement in a plot to overthrow Grimes, and blackmails him to be cut in on the deal. More blackmail occurs as Wells manipulates Crowe to kill Grimes, then the CIA uses that discovery to blackmail Wells into killing Crowe. Who can you trust???  Written by Tad Dibbern See less",
        "runtimeMinutes": "108"
    },
    "1995_163": {
        "plotSummary": "Jason and Midget are two young, black teenagers living in Newark,New Jersey, the unofficial car theft capital of the world. Their favourite pastime is that of everybody in their neighbourhood: stealing cars and joyriding. The trouble ...See moreJason and Midget are two young, black teenagers living in Newark,New Jersey, the unofficial car theft capital of the world. Their favourite pastime is that of everybody in their neighbourhood: stealing cars and joyriding. The trouble starts when they steal a police car and the cops launch a violent offensive that involves beating and even shooting suspects.  Written by Robert Zeithammel See less",
        "runtimeMinutes": "98"
    },
    "1995_164": {
        "plotSummary": "Jeffrey, a young gay man in New York, decides that sex is too much and decides to become celibate. He immediately meets the man of his dreams and must decide whether or not love is worth the danger of a boyfriend dying.See moreJeffrey, a young gay man in New York, decides that sex is too much and decides to become celibate. He immediately meets the man of his dreams and must decide whether or not love is worth the danger of a boyfriend dying.  Written by Trena Cormier See less",
        "runtimeMinutes": "92"
    },
    "1995_165": {
        "plotSummary": "Two cops become compelled to act against corruption and discrimination within their police precinct.",
        "runtimeMinutes": "109"
    },
    "1995_166": {
        "plotSummary": "The platonic relationship between artist Dora Carrington (Dame Emma Thompson) and writer Lytton Strachey (Jonathan Pryce) in the early twentieth century.",
        "runtimeMinutes": "121"
    },
    "1995_167": {
        "plotSummary": "Ruben and Robby are twin brothers, adopted by Mona, one of the wealthiest - and most eccentric - women in Santa Barbara. Ruben is devoted to Mona, but Robby is more devoted to her money. So when Mona leaves her fortune and estate to Ruben ...See moreRuben and Robby are twin brothers, adopted by Mona, one of the wealthiest - and most eccentric - women in Santa Barbara. Ruben is devoted to Mona, but Robby is more devoted to her money. So when Mona leaves her fortune and estate to Ruben it starts a battle between brothers that soon leads to madness, mayhem, and even attempted murder. On Ruben's side is Lou Perilli an ex-Chicago cop and used car dealer who knows the law - and how to get around it. On Robby's side is ruthless businessman Reed Tyler, who is out to turn a swift profit on Mona's property. Walking a shifty line between them is Eddie Agopian, the family lawyer, who doesn't care which side wins as long as he's on the winner's side. But whether they're stealing big or stealing little, they're all stealing in this hilarious comedy about greed, power... and brotherly love.  Written by AnonymousSee less",
        "runtimeMinutes": "135"
    },
    "1995_168": {
        "plotSummary": "An intimate portrait of controversial cartoonist Robert Crumb and his traumatized family.",
        "runtimeMinutes": "119"
    },
    "1995_169": {
        "plotSummary": "One of the most successful designers in high fashion plans his fall 1994 collection. Follow the behind-the-scenes look at the creative side of fashion.",
        "runtimeMinutes": "73"
    },
    "1995_17": {
        "plotSummary": "Photographer Robert Kincaid (Clint Eastwood) wanders into the life of housewife Francesca Johnson (Meryl Streep) for four days in the 1960s.",
        "runtimeMinutes": "135"
    },
    "1995_170": {
        "plotSummary": "The Moorish General Othello is manipulated into thinking that his new wife Desdemona has been carrying on an affair with his Lieutenant Michael Cassio, when in reality, it is all part of the scheme of a bitter Ensign named Iago.",
        "runtimeMinutes": "123"
    },
    "1995_171": {
        "plotSummary": "In an attempt to secure a sponsor, an unlikely group of Cuban refugees become a \"family\" as the U.S. Immigration and Naturalization Service gives families priority over others. In the process, a political prisoner who hasn't seen his wife ...See moreIn an attempt to secure a sponsor, an unlikely group of Cuban refugees become a \"family\" as the U.S. Immigration and Naturalization Service gives families priority over others. In the process, a political prisoner who hasn't seen his wife for twenty years and a disaffected sugarcane cutter fall in love. An excitable brother and a lovestruck cop contribute to the general confusion. The inevitable humorous romantic entaglements ensue as a final confrontation is set up.  Written by Tad Dibbern See less",
        "runtimeMinutes": "113"
    },
    "1995_172": {
        "plotSummary": "A scientist creating perfumes inherits his great grandfather Dr. Jekyll's formula and decides to use modern technology to improve it. He ends up as an ambitious, ruthless woman. She tries to prevent returning into the spineless man.",
        "runtimeMinutes": "100"
    },
    "1995_173": {
        "plotSummary": "A documentary about the culture of hip-hop. Through interviews with some of hip-hops biggest names, the film makers attempt to find out why it has become so popular.See moreA documentary about the culture of hip-hop. Through interviews with some of hip-hops biggest names, the film makers attempt to find out why it has become so popular.  Written by Guy JohnsSee less",
        "runtimeMinutes": "93"
    },
    "1995_174": {
        "plotSummary": "The classic Shakespearean play about the murderously scheming 15th-century king is reimagined in an alternative setting of 1930s England as clouds of fascism gather.",
        "runtimeMinutes": "110"
    },
    "1995_175": {
        "plotSummary": "Two siblings find out about a mythical aquatic monster and try to a save a remote Canadian lake from being used as a dump site for toxic waste.",
        "runtimeMinutes": "98"
    },
    "1995_176": {
        "plotSummary": "Erik, a loner, finds a friend in Dexter, an eleven-year-old boy with AIDS. They vow to find a cure for AIDS together and save Dexter's life in an eventful summer.",
        "runtimeMinutes": "97"
    },
    "1995_177": {
        "plotSummary": "A young widow still grieving over the death of her husband finds herself being comforted by a local housepainter.",
        "runtimeMinutes": "105"
    },
    "1995_178": {
        "plotSummary": "One of the obsessive speculations in American history is whether Thomas Jefferson, in the years before he became president, had an affair with (and fathered a child with) his 15-year-old slave Sally Hemings. JEFFERSON IN PARIS follows ...See moreOne of the obsessive speculations in American history is whether Thomas Jefferson, in the years before he became president, had an affair with (and fathered a child with) his 15-year-old slave Sally Hemings. JEFFERSON IN PARIS follows Jefferson to France (as the U.S. ambassador to the court of Louis XVI), following the death of his wife his friendships and flirtations with the French, his relationship with his daughters and slaves from home (especially Sally), against the backdrop of the beginning of the French Revolution.  Written by Michael C. Berch See less",
        "runtimeMinutes": "139"
    },
    "1995_179": {
        "plotSummary": "A teenager finds his dreams of becoming a basketball star threatened after he free falls into the harrowing world of drug addiction.",
        "runtimeMinutes": "102"
    },
    "1995_18": {
        "plotSummary": "An ex-Marine turned teacher struggles to connect with her students in an inner city school.",
        "runtimeMinutes": "99"
    },
    "1995_180": {
        "plotSummary": "In the Soviet Union in 1936, shadow of Stalin's repressions lie on a famous revolution hero. The accusations of being him a foreign spy are nonsense, and all known that, but a slow process of his life's downfall is already running.",
        "runtimeMinutes": "135"
    },
    "1995_181": {
        "plotSummary": "An adventurous love story between two young women of different social and economic backgrounds who find themselves going through all the typical struggles of a new romance.",
        "runtimeMinutes": "94"
    },
    "1995_182": {
        "plotSummary": "The early career of legendary lawman Wild Bill Hickock is telescoped and culminates in his relocation in Deadwood and a reunion with Calamity Jane.",
        "runtimeMinutes": "98"
    },
    "1995_183": {
        "plotSummary": "Both dumped by their girlfriends, two best friends seek refuge in the local mall.",
        "runtimeMinutes": "94"
    },
    "1995_184": {
        "plotSummary": "At a Lake Como resort, Miss Bentley, an attractive older guest, meets a handsome, well-to-do bachelor. But when he's more interested in a beautiful young flirt, the mischievous Miss Bentley goes to outrageous lengths to reel in her catch.",
        "runtimeMinutes": "92"
    },
    "1995_185": {
        "plotSummary": "A provincial boy related to a Shanghai crime family is recruited by his uncle into cosmopolitan Shanghai in the 1930s to be a servant to a ganglord's mistress.",
        "runtimeMinutes": "108"
    },
    "1995_186": {
        "plotSummary": "This Oscar nominated film is the story of two men who are opposites, one gay, the other straight, one a fierce communist, the other a fierce individualist, one suspicious, the other accepting, and how they come to love each other.",
        "runtimeMinutes": "108"
    },
    "1995_187": {
        "plotSummary": "Three friends discover their new flatmate dead but loaded with cash.",
        "runtimeMinutes": "89"
    },
    "1995_188": {
        "plotSummary": "Find out what it would be like if winter lasted all year long and have all your dreams come true in Warren Miller's Endless Winter. Tag along with other skiers and riders who feel the same way you do about winter including Craig Kelly, ...See moreFind out what it would be like if winter lasted all year long and have all your dreams come true in Warren Miller's Endless Winter. Tag along with other skiers and riders who feel the same way you do about winter including Craig Kelly, Terje Haakonsen, AJ Kitt, Tommy Moe and many others. Take an adventure chasing snow all year long from New York to Bolivia and Argentina, and all the way across the world to the land of the rising sun in Japan.See less",
        "runtimeMinutes": "93"
    },
    "1995_189": {
        "plotSummary": "A scientist in a surrealist society kidnaps children to steal their dreams, hoping that they slow his aging process.",
        "runtimeMinutes": "112"
    },
    "1995_19": {
        "plotSummary": "In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.",
        "runtimeMinutes": "129"
    },
    "1995_190": {
        "plotSummary": "A laundry-folding machine has been possessed by a demon, causing it to develop homicidal tendencies.",
        "runtimeMinutes": "106"
    },
    "1995_191": {
        "plotSummary": "A family descended from Maori warriors is bedeviled by a violent father and the societal problems of being treated as outcasts.",
        "runtimeMinutes": "102"
    },
    "1995_192": {
        "plotSummary": "The story of castrato opera singer Carlo Broschi, who enthralled 18th century European audiences under his stage name Farinelli.",
        "runtimeMinutes": "111"
    },
    "1995_193": {
        "plotSummary": "In a time of war and disease, a young officer gallantly tries to help a young woman find her husband.",
        "runtimeMinutes": "135"
    },
    "1995_194": {
        "plotSummary": "Brooklyn Cigar Store is a neighborhood hangout in Brooklyn with Auggie Wren/H.Keitel as center. Some people are interviewed about Brooklyn, spiced up with statistics on Brooklyn.",
        "runtimeMinutes": "83"
    },
    "1995_195": {
        "plotSummary": "Riyo marries a man more than twice her age. She is devastated and labors in the sugar cane field. At the end she is able to love her husband.",
        "runtimeMinutes": "94"
    },
    "1995_196": {
        "plotSummary": "After 3 years in prison, Julian breaks out and returns to Vegas to get his half from the bank robbery and see Lucille again. The Devil took the loot and Tuerto took Lucille.",
        "runtimeMinutes": "102"
    },
    "1995_197": {
        "plotSummary": "A mute make-up artist working on a slasher movie being shot in Moscow, is locked in the studio after hours. While there, she witnesses a brutal murder, and must escape capture.",
        "runtimeMinutes": "95"
    },
    "1995_198": {
        "plotSummary": "This ultimate tribute to all independent filmmakers takes place during one day on the set of a non-budget movie.",
        "runtimeMinutes": "90"
    },
    "1995_199": {
        "plotSummary": "Sadie is desperately looking up to her older sister Georgia who is a famous C&W artist. Her desperate need to be accepted by her sister is constantly complicated by her drug and alcohol problems.",
        "runtimeMinutes": "115"
    },
    "1995_2": {
        "plotSummary": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.",
        "runtimeMinutes": "81"
    },
    "1995_20": {
        "plotSummary": "On a U.S. nuclear missile sub, a young First Officer stages a mutiny to prevent his trigger happy Captain from launching his missiles before confirming his orders to do so.",
        "runtimeMinutes": "116"
    },
    "1995_200": {
        "plotSummary": "Early 1990s drama about a family of Soviet Jews living in Brooklyn's Brighton Beach ocean-side neighborhood nicknamed Little Odessa.",
        "runtimeMinutes": "98"
    },
    "1995_201": {
        "plotSummary": "A psychiatrist asks one of her psychology students, an ex-police detective, to shadow her a few nights. She fears she has split personality and may have killed someone. The student has a crush on his cute teacher and says yes.",
        "runtimeMinutes": "102"
    },
    "1995_202": {
        "plotSummary": "A self-help advocate struggles to put his dysfunctional family in its place.",
        "runtimeMinutes": "95"
    },
    "1995_203": {
        "plotSummary": "Freddy Gale is a seedy jeweller who has sworn to kill the drunk driver who killed his little girl.",
        "runtimeMinutes": "111"
    },
    "1995_204": {
        "plotSummary": "The fates of two homosexual partners are divided.",
        "runtimeMinutes": "110"
    },
    "1995_205": {
        "plotSummary": "Filmed entirely on location in East Hampton, Long Island, \"Last Summer in the Hamptons\" concerns a large theatrical family spending the last weekend of their summer together at the decades-old family retreat which economic circumstances ...See moreFilmed entirely on location in East Hampton, Long Island, \"Last Summer in the Hamptons\" concerns a large theatrical family spending the last weekend of their summer together at the decades-old family retreat which economic circumstances have forced them to put on the market. Victoria Foyt plays a young Hollywood actress whose visit wreaks havoc on the stellar group of family and friends - led by matriarch Viveca Lindfors and made up of an extraordinary mix of prominent New York actors, directors, and playwrights. In the course of a very unusual weekend, comic as well as serious situations arise, and the family's secrets - of which there are many - begin to unravel.  Written by RainbowSee less",
        "runtimeMinutes": "108"
    },
    "1995_206": {
        "plotSummary": "A widowed father has to deal with two complex issues: while he is searching for \"Miss Right,\" his son, who is in his 20s and gay, is searching for \"Mr. Right.\"",
        "runtimeMinutes": "100"
    },
    "1995_207": {
        "plotSummary": "Three interconnected stories of love under the threat of civil war in Macedonia and London.",
        "runtimeMinutes": "113"
    },
    "1995_208": {
        "plotSummary": "Story of a young Chinese-Canadian woman caught between traditional and modern societies.",
        "runtimeMinutes": "87"
    },
    "1995_209": {
        "plotSummary": "An amnesiac wakes up on an NYC alley. He meets Isabelle, an ex nun now erotic writer, at a diner and follows her home. She helps him find his identity. Then there's Sofia, the porn star.",
        "runtimeMinutes": "105"
    },
    "1995_21": {
        "plotSummary": "When an expedition to the African Congo ends in disaster, a new team is assembled to find out what went wrong.",
        "runtimeMinutes": "109"
    },
    "1995_210": {
        "plotSummary": "A variation on Victor Hugo's classic novel by means of the story of a man whose life is affected by and somewhat duplicated by the Hugo story of the beleaguered Jean Valjean.",
        "runtimeMinutes": "175"
    },
    "1995_211": {
        "plotSummary": "A bunch of guys hang around their college for months after graduation, continuing a life much like the one before graduation.",
        "runtimeMinutes": "96"
    },
    "1995_212": {
        "plotSummary": "Documentary/Concert film covering the annual Drag festival in New York City. Highlights include a performance by drag diva, Ru Paul, and the infamous Lypsinca.See moreDocumentary/Concert film covering the annual Drag festival in New York City. Highlights include a performance by drag diva, Ru Paul, and the infamous Lypsinca.  Written by R. John Berggren See less",
        "runtimeMinutes": "85"
    },
    "1995_213": {
        "plotSummary": "A South African preacher goes to search for his wayward son, who has committed a crime in the big city.",
        "runtimeMinutes": "106"
    },
    "1995_214": {
        "plotSummary": "A lonely princess and a poor cobbler fall in love while trying to retrieve three magical orbs that were stolen by a bumbling thief, all while outwitting a powerful sorcerer as adventure and comedic pop culture references abound.",
        "runtimeMinutes": "90"
    },
    "1995_215": {
        "plotSummary": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
        "runtimeMinutes": "145"
    },
    "1995_216": {
        "plotSummary": "Loretta is a successful lesbian writer of cartoons with problems in her romantic life with Annie. She is a habitue of a lesbian bar. One day she meets Rachel and they start a new life together. When J.R. starts flirting with Rachel, all ...See moreLoretta is a successful lesbian writer of cartoons with problems in her romantic life with Annie. She is a habitue of a lesbian bar. One day she meets Rachel and they start a new life together. When J.R. starts flirting with Rachel, all the insecurity of Loretta rises in a jealousy situation.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "93"
    },
    "1995_217": {
        "plotSummary": "Set in a dreary urban landscape of Edmonton, LOVE AND HUMAN REMAINS is a dark comedy about a group of twentysomethings looking for love and meaning in the '90s. The film focuses on roommates David, a gay waiter who has has given up on his ...See moreSet in a dreary urban landscape of Edmonton, LOVE AND HUMAN REMAINS is a dark comedy about a group of twentysomethings looking for love and meaning in the '90s. The film focuses on roommates David, a gay waiter who has has given up on his acting career, and Candy, a book reviewer who is also David's ex-lover. David and Candy's lives are entangled with those of David's friends (a busboy, a psychic dominatrix, and a misogynistic civil-servant) and Candy's dates (a male bartender and a lesbian schoolteacher). Meanwhile, a serial killer menaces the concrete and asphalt neighbourhood in which David and Candy live.  Written by Michael StewartSee less",
        "runtimeMinutes": "100"
    },
    "1995_218": {
        "plotSummary": "A recovering gambling addict attempts to reconcile with his family and friends but finds trouble and temptation when caught between feelings for his ex-wife and her dangerous hoodlum boyfriend.",
        "runtimeMinutes": "99"
    },
    "1995_219": {
        "plotSummary": "An unsuccessful comedian uncovers a family secret and learns the true price of letting inherent talent shine.",
        "runtimeMinutes": "128"
    },
    "1995_22": {
        "plotSummary": "Two hip detectives protect a witness to a murder while investigating a case of stolen heroin from the evidence storage room from their police precinct.",
        "runtimeMinutes": "119"
    },
    "1995_220": {
        "plotSummary": "Five different criminals face imminent death after botching a job quite badly.",
        "runtimeMinutes": "115"
    },
    "1995_221": {
        "plotSummary": "The documentary compiles interviews of all the top jazz musicians in NYC in the year 1958, for a piece in Esquire magazine.",
        "runtimeMinutes": "60"
    },
    "1995_222": {
        "plotSummary": "A young engineer is sent to post World War II Berlin to help the Americans, in spying on the Russians. In a time and place where discretion is still a man's best friend, he falls in love with a mysterious woman, who will take him on the ...See moreA young engineer is sent to post World War II Berlin to help the Americans, in spying on the Russians. In a time and place where discretion is still a man's best friend, he falls in love with a mysterious woman, who will take him on the dark side of evil.  Written by Steve Richer See less",
        "runtimeMinutes": "119"
    },
    "1995_223": {
        "plotSummary": "An affluent and unexceptional homemaker in the suburbs develops multiple chemical sensitivity.",
        "runtimeMinutes": "119"
    },
    "1995_224": {
        "plotSummary": "Party girl Mary gets bailed out of jail by her librarian godmother. She starts working at the library, slowly fills her empty brain.",
        "runtimeMinutes": "94"
    },
    "1995_225": {
        "plotSummary": "This ultra-hip, post-modern vampire tale is set in contemporary New York City. Members of a dysfunctional family of vampires are trying to come to terms with each other, in the wake of their father's death. Meanwhile, they are being hunted...See moreThis ultra-hip, post-modern vampire tale is set in contemporary New York City. Members of a dysfunctional family of vampires are trying to come to terms with each other, in the wake of their father's death. Meanwhile, they are being hunted by Dr. Van Helsing and his hapless nephew. As in all good vampire movies, forces of love are pitted against forces of destruction.  Written by Tad Dibbern See less",
        "runtimeMinutes": "93"
    },
    "1995_226": {
        "plotSummary": "In this movie Rocky, Colt and TumTum must battle an evil wealthy toxic waste dumper in order to save a local Indian tribe and their friend Jo. The 3 Ninjas must help find Jo's father and find a secret disk that contains evidence that could...See moreIn this movie Rocky, Colt and TumTum must battle an evil wealthy toxic waste dumper in order to save a local Indian tribe and their friend Jo. The 3 Ninjas must help find Jo's father and find a secret disk that contains evidence that could stop the toxic landfill that is destroying the Indian community. However the town is owned by the rich man and he controls the police and even the mayor. They must fight a motorcycle gang and renegade cowboys in this non-stop ninja adventure.  Written by David See less",
        "runtimeMinutes": "85"
    },
    "1995_227": {
        "plotSummary": "The story of the bandit queen Phoolan Devi who was sent to prison in 1983 and got free in 1994.",
        "runtimeMinutes": "119"
    },
    "1995_228": {
        "plotSummary": "A satire about desperate hustling, pop philosophy and big money.",
        "runtimeMinutes": "90"
    },
    "1995_229": {
        "plotSummary": "A young, naive Hollywood studio assistant finally turns the tables on his incredibly abusive producer boss.",
        "runtimeMinutes": "93"
    },
    "1995_23": {
        "plotSummary": "When he finds out his longtime girlfriend is pregnant, a commitment-phobe realizes he might have to change his lifestyle for better or much, much worse.",
        "runtimeMinutes": "103"
    },
    "1995_230": {
        "plotSummary": "A pastry boy and the son of a hair-piece mogul become involved in an arson scandal. Sergio (John Leguizamo) is offered a bribe in exchange for taking the blame for the fire that destroyed his workplace. Garet (William Baldwin), the real ...See moreA pastry boy and the son of a hair-piece mogul become involved in an arson scandal. Sergio (John Leguizamo) is offered a bribe in exchange for taking the blame for the fire that destroyed his workplace. Garet (William Baldwin), the real arsonist, is apalled that someone else would try to take credit for his act of love. Before long, Sergio and Garet become entangled in a zany love-quadrangle involving Hattie (Sadie Frost) and Stephanie (Erika Eleniak).  Written by Brian Whiting See less",
        "runtimeMinutes": "94"
    },
    "1995_231": {
        "plotSummary": "Young, wild poet Arthur Rimbaud and his mentor Paul Verlaine engage in a fierce, forbidden romance while feeling the effects of a hellish artistic lifestyle.",
        "runtimeMinutes": "111"
    },
    "1995_232": {
        "plotSummary": "A New York philosophy grad student turns into a vampire after getting bitten by one, and then tries to come to terms with her new lifestyle and frequent craving for human blood.",
        "runtimeMinutes": "82"
    },
    "1995_233": {
        "plotSummary": "A look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item, junkie and hag. Many faces for the same woman, ...See moreA look into the many lives of Christa Päffgen, otherwise known as Nico; from cutie German mädchen to the first of the supermodels, to glamorous diva of the Velvet Underground, to cult item, junkie and hag. Many faces for the same woman, whom, you realize, just couldn't bring herself to care enough to live.  Written by Miguel Cane See less",
        "runtimeMinutes": "70"
    },
    "1995_234": {
        "plotSummary": "After an abandoned young woman in late 19th Century England is taken in by a rural couple with three handsome sons, tragic consequences result.",
        "runtimeMinutes": "116"
    },
    "1995_235": {
        "plotSummary": "Jordan White and Amy Blue, two troubled teens, pick up an adolescent drifter, Xavier Red. Together, the threesome embark on a sex-and-violence-filled journey through an America of psychos and quickie marts.",
        "runtimeMinutes": "83"
    },
    "1995_236": {
        "plotSummary": "Twenty-four hours in the lives of the young employees at Empire Records when they all grow up and become young adults thanks to each other and the manager. They all face the store joining a chain store with strict rules.",
        "runtimeMinutes": "90"
    },
    "1995_237": {
        "plotSummary": "Set right after World War II, a naive teenage girl joins a shabby theatre troupe in Liverpool. During a winter production of Peter Pan, the play quickly turns into a dark metaphor for youth as she becomes drawn into a web of sexual ...See moreSet right after World War II, a naive teenage girl joins a shabby theatre troupe in Liverpool. During a winter production of Peter Pan, the play quickly turns into a dark metaphor for youth as she becomes drawn into a web of sexual politics and intrigue.  Written by Alex BrewerSee less",
        "runtimeMinutes": "112"
    },
    "1995_238": {
        "plotSummary": "A documentary about the inventor of the first electronic synthesiser instrument and his subsequent life after he was abducted by the KGB as well as a history of his instrument.",
        "runtimeMinutes": "83"
    },
    "1995_239": {
        "plotSummary": "Tommie is a young guy in Manhattan with a dead-end job handing out fliers in Times Square. At the beginning of a fateful summer, he has a chance encounter with a friend who tells Tommie that he's headed to Provincetown, on the Cape, for a ...See moreTommie is a young guy in Manhattan with a dead-end job handing out fliers in Times Square. At the beginning of a fateful summer, he has a chance encounter with a friend who tells Tommie that he's headed to Provincetown, on the Cape, for a long weekend. Tommie is inspired to make his own trek to P-town, where he goes on a summer long, balls-out quest for Mr. Right, even though he has no money and holds his breath each time he uses his American Express card. In the course of the summer, Tommie looks for a work as a house boy at various inns, works several jobs, benefits from the kindness of a stranger, and gets involved with a series of men. Is it all worth it?  Written by See less",
        "runtimeMinutes": "84"
    },
    "1995_24": {
        "plotSummary": "Rich Mr. Dashwood dies, leaving his second wife and her three daughters poor by the rules of inheritance. The two eldest daughters are the title opposites.",
        "runtimeMinutes": "136"
    },
    "1995_240": {
        "plotSummary": "Two sisters separated in childhood reunite years later as servants at a household in France. Their happiness to be reunited spirals into an incestuous relationship.",
        "runtimeMinutes": "89"
    },
    "1995_241": {
        "plotSummary": "Onoff is a famous writer who hasn't published any new books for quite some time and has become a recluse. When he is picked up by the police one stormy night, without any identification, out of breath and running madly, without clear ...See moreOnoff is a famous writer who hasn't published any new books for quite some time and has become a recluse. When he is picked up by the police one stormy night, without any identification, out of breath and running madly, without clear memory of recent events, the Inspector is suspicious. Through interrogatory dialectic, the head of this lonely, isolated, broken-down police station tries to establish what has happened, by delving into the mind of his writer-hero, and clearing up a mysterious killing.  Written by Tad Dibbern See less",
        "runtimeMinutes": "108"
    },
    "1995_242": {
        "plotSummary": "Four vignettes about the lives of the Cuban people set during the pre-revolutionary era.",
        "runtimeMinutes": "141"
    },
    "1995_243": {
        "plotSummary": "The U.S. President, low in the opinion polls, gets talked into raising his popularity by trying to start a cold war against Canada.",
        "runtimeMinutes": "91"
    },
    "1995_244": {
        "plotSummary": "The story follows a group of German soldiers, from their Italian R&R in the summer of 1942 to the frozen steppes of Soviet Russia and ending with the battle for Stalingrad.",
        "runtimeMinutes": "134"
    },
    "1995_245": {
        "plotSummary": "All the while, Master Chu tries to find his place in the foreign American world.",
        "runtimeMinutes": "105"
    },
    "1995_246": {
        "plotSummary": "Gallo Morales is the proud patriach returning home after a seven-year stint for manslaughter. Seeking to re-establish his legendary status as a champion breeder, he comes back for the rooster bred by his father. But it is Hector, his son ...See moreGallo Morales is the proud patriach returning home after a seven-year stint for manslaughter. Seeking to re-establish his legendary status as a champion breeder, he comes back for the rooster bred by his father. But it is Hector, his son who inherits the prize-winning bird and neither are about to give in. The fall-out from their conflict has consequences for the whole family, especially for Angela, the sensitive 14-year-old daughter unable to cope with the brutal world that surrounds her and her own emerging womanhood, despite the best efforts of Juana, her strong but long-suffering mother.  Written by L.H. Wong See less",
        "runtimeMinutes": "110"
    },
    "1995_247": {
        "plotSummary": "A young New Yorker goes to Arizona where he finds freedom to both love and dream.",
        "runtimeMinutes": "142"
    },
    "1995_248": {
        "plotSummary": "A writer with dwarfism shares the story of his unconventional, though not altogether bad, upbringing as his mother struggled to raise him in the mid 20th century, with the help of a surrogate father.",
        "runtimeMinutes": "101"
    },
    "1995_249": {
        "plotSummary": "A story of desperate search for oil.",
        "runtimeMinutes": "109"
    },
    "1995_25": {
        "plotSummary": "Lancelot falls in love with Guinevere, who is due to be married to King Arthur. Meanwhile, a violent warlord tries to seize power from Arthur and his Knights of the Round Table.",
        "runtimeMinutes": "134"
    },
    "1995_250": {
        "plotSummary": "The story of 2 lifelong nannies and the two families they worked for in Manhattan and Greenwich, Connecticut from the 1940's up to the 1990's. A film that shows the flip side of the privileged lifestyle.",
        "runtimeMinutes": "78"
    },
    "1995_251": {
        "plotSummary": "A story of life on a First Nations reserve in Ontario: Silas and Frank are trying to get into college to train to be mechanics but they find themselves having to deal with girls, family ... and murder.See moreA story of life on a First Nations reserve in Ontario: Silas and Frank are trying to get into college to train to be mechanics but they find themselves having to deal with girls, family ... and murder.  Written by See less",
        "runtimeMinutes": "84"
    },
    "1995_252": {
        "plotSummary": "An alienated and misanthropic teenager gains sudden and unwanted celebrity status after he's taken hostage by terrorists where his indifference to their threats to kill him makes news headlines.",
        "runtimeMinutes": "96"
    },
    "1995_253": {
        "plotSummary": "A struggling American writer (England) and a fellow American expatriate (Mandylor) begin a sordid affair among the chaos and discord of 1940 Paris, France on the brink of World War II.",
        "runtimeMinutes": "102"
    },
    "1995_254": {
        "plotSummary": "A film about the work of the artist most famous for her monuments such as the Vietnam Memorial Wall and the Civil Rights Fountain Memorial.",
        "runtimeMinutes": "105"
    },
    "1995_255": {
        "plotSummary": "In this offshoot of the 1950s \"claymation\" cartoon series, the crazy Blockheads threaten to ruin Gumby's benefit concert by replacing the entire city of Clokeytown with robots.See moreIn this offshoot of the 1950s \"claymation\" cartoon series, the crazy Blockheads threaten to ruin Gumby's benefit concert by replacing the entire city of Clokeytown with robots.  Written by HiphatsSee less",
        "runtimeMinutes": "90"
    },
    "1995_256": {
        "plotSummary": "In an alternative Earth, a young astronaut participates in a controversial fledgling space program.",
        "runtimeMinutes": "121"
    },
    "1995_257": {
        "plotSummary": "Ballot Measure 9 was an anti-gay amendment proposed to Oregon voters in 1992 by the conservative group, Oregon Citizen's Alliance. This documentary goes behind the scenes of the fight to stop Measure 9. It contains portions of anti-gay ...See moreBallot Measure 9 was an anti-gay amendment proposed to Oregon voters in 1992 by the conservative group, Oregon Citizen's Alliance. This documentary goes behind the scenes of the fight to stop Measure 9. It contains portions of anti-gay videos produced by the Citizen's Alliance as well as news clips and interviews with the people who successfully fought passage of Measure 9.  Written by Travis See less",
        "runtimeMinutes": "72"
    },
    "1995_258": {
        "plotSummary": "The film is a documentary about the demonstrations of students in Peking on the 4th of June 1989 for more democracy in the People's Republic which were ended by army forces. The story is told from students point of view.See moreThe film is a documentary about the demonstrations of students in Peking on the 4th of June 1989 for more democracy in the People's Republic which were ended by army forces. The story is told from students point of view.  Written by Volker BoehmSee less",
        "runtimeMinutes": "83"
    },
    "1995_259": {
        "plotSummary": "A group of teenagers get into a car crash in the Texas woods on prom night, and then wander into an old farmhouse that is home to Leatherface (Robert Jacks) and his insane family of cannibalistic psychopaths.",
        "runtimeMinutes": "87"
    },
    "1995_26": {
        "plotSummary": "Three unknowing martial artists are summoned to a mysterious island to compete in a tournament whose outcome will decide the fate of the world.",
        "runtimeMinutes": "101"
    },
    "1995_260": {
        "plotSummary": "A comic love triangle wherein Alexander falls in love with his younger brother's wife.",
        "runtimeMinutes": "105"
    },
    "1995_261": {
        "plotSummary": "Brother Minister reveals the mystery surrounding the assassination of Malcolm X at the Audubon Ballroom in New York City on February 21, 1965. It probes the innocence of two of the convicted assassins, reveals the true identity of the ...See moreBrother Minister reveals the mystery surrounding the assassination of Malcolm X at the Audubon Ballroom in New York City on February 21, 1965. It probes the innocence of two of the convicted assassins, reveals the true identity of the killers, examines the FBI and NYPD clandestine roles in the assassination, and discovers the secret origin of the Nation of Islam and its political and religious legacy in America.  Written by Jack BaxterSee less",
        "runtimeMinutes": "115"
    },
    "1995_262": {
        "plotSummary": "A documentary about the Israel Defense Forces.",
        "runtimeMinutes": "316"
    },
    "1995_263": {
        "plotSummary": "A twenty-something drag queen dies of A.I.D.S., but when his adoring ghost returns to the side of his surviving lover, he finds his lover doesn't exactly miss him.",
        "runtimeMinutes": "101"
    },
    "1995_264": {
        "plotSummary": "After a man suffering from schizophrenia is released from a mental institution, he attempts to get his daughter back from her adoptive family.",
        "runtimeMinutes": "79"
    },
    "1995_265": {
        "plotSummary": "Gennaro lives with his ailing grandpa, who sits outside holding tight to his last quarter. But grandpa's not ready to die, he has some unfinished business with a woman from his past and he enlists Gennaro to act as his emissary.",
        "runtimeMinutes": "85"
    },
    "1995_266": {
        "plotSummary": "Georgina throws a sleepover party for her friend Jamie, a moderately successful actress, on the night of Jamie's fiancee's bachelor party. Jill, Jamie, Marcy, Rachel, and Georgina have been friends since childhood, and as the evening ...See moreGeorgina throws a sleepover party for her friend Jamie, a moderately successful actress, on the night of Jamie's fiancee's bachelor party. Jill, Jamie, Marcy, Rachel, and Georgina have been friends since childhood, and as the evening progresses they talk about a variety of topics: Georgina's heterosexual fantasies and her uncertainties about Chris, her live-in lover; Jamie's doubts and insecurities about marriage; and all of their attitudes toward sex and sexual fantasies.  Written by James Meek See less",
        "runtimeMinutes": "95"
    },
    "1995_267": {
        "plotSummary": "Three young and good-looking brothers live with and support their parents in Manila; they dance at the male Club Exotica and work as \"call boys.\" Joel has a wife and child; he and Dennis are saving money to buy back lost family land. Sonny...See moreThree young and good-looking brothers live with and support their parents in Manila; they dance at the male Club Exotica and work as \"call boys.\" Joel has a wife and child; he and Dennis are saving money to buy back lost family land. Sonny has dropped out of university and sees dancing as a way to make money for now. Joel has a regular boyfriend as well; Sonny spends time with Michelle, a transvestite; Dennis and his pals steal car radios. When their nanay takes in a homeless youth who is not what he appears to be, a chain of events is set in motion that brings tragedy. Is there any salvation in this late-night world of \"macho dancing\" and prostitution?  Written by See less",
        "runtimeMinutes": "100"
    },
    "1995_268": {
        "plotSummary": "A bookie is promoted to Hitman and seemingly excels at his new found job.",
        "runtimeMinutes": "92"
    },
    "1995_269": {
        "plotSummary": "A biography of the Portuguese-Brazilian singer Carmen Miranda, whose most distinctive feature was her tutti frutti hat. She came to the US as the \"Brazilian Bombshell\" and was a Broadway and Hollywood star in the 1940s.See moreA biography of the Portuguese-Brazilian singer Carmen Miranda, whose most distinctive feature was her tutti frutti hat. She came to the US as the \"Brazilian Bombshell\" and was a Broadway and Hollywood star in the 1940s.  Written by Will GilbertSee less",
        "runtimeMinutes": "91"
    },
    "1995_27": {
        "plotSummary": "A tale of greed, deception, money, power, and murder occur between two best friends: a mafia enforcer and a casino executive compete against each other over a gambling empire, and over a fast living and fast loving socialite.",
        "runtimeMinutes": "178"
    },
    "1995_270": {
        "plotSummary": "A police detective goes undercover in the underground S&M gay subculture of New York City to catch a serial killer who is preying on gay men.",
        "runtimeMinutes": "102"
    },
    "1995_271": {
        "plotSummary": "The Journey of August King is a multi-dimensional drama about a North Carolina farmer in April 1815. August King, a widower, is on his way home as he does every year after selling his produce and purchasing the stock and goods he will need...See moreThe Journey of August King is a multi-dimensional drama about a North Carolina farmer in April 1815. August King, a widower, is on his way home as he does every year after selling his produce and purchasing the stock and goods he will need for the coming year. On his journey, he comes upon a run-away slave, a 17 year old young woman and August King must decide to violate the law and help this slave to freedom or leave her to be hunted down and,ultimately, returned to her slave owner. But the drama turns into a question of whether either soul will gain freedom.  Written by Joel Schesser See less",
        "runtimeMinutes": "91"
    },
    "1995_272": {
        "plotSummary": "The children of Ballydowse and Carrickdowse engage in battles where they cut of the buttons, shoe-laces and underwear of their captured opponents. This is to get the boys in trouble with their parents. They go to battle in mass groups of ...See moreThe children of Ballydowse and Carrickdowse engage in battles where they cut of the buttons, shoe-laces and underwear of their captured opponents. This is to get the boys in trouble with their parents. They go to battle in mass groups of dozens, throwing stones and cutting off their opponents buttons etc. And sometimes they go to battle completely naked and exposed. In one such scene about 30 boys return from a battle to celebrate victory at a barn-house only to find some girls waiting for them and they get very embarrassed at losing their privacy.  Written by yusufpiskinSee less",
        "runtimeMinutes": "94"
    },
    "1995_273": {
        "plotSummary": "Michel Negroponte, a documentary filmmaker, meets Maggie one day in Central Park. Maggie claims to be married to the god Jupiter and the daughter of actor Robert Ryan. Michel gets to know Maggie over the next couple of years, and attempts ...See moreMichel Negroponte, a documentary filmmaker, meets Maggie one day in Central Park. Maggie claims to be married to the god Jupiter and the daughter of actor Robert Ryan. Michel gets to know Maggie over the next couple of years, and attempts to use her often outlandish stories as clues to reconstruct her past.  Written by James Meek See less",
        "runtimeMinutes": "87"
    },
    "1995_274": {
        "plotSummary": "A gay jewish man speaks out about living with and dying from AIDS. He also discusses how being gay has affected his identity as a jew and his relationship with his parents.",
        "runtimeMinutes": "54"
    },
    "1995_275": {
        "plotSummary": "A film about black experiences with a \"backdrop of Creole cooking.\" Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "1995_276": {
        "plotSummary": "This is the story of the lovely Kate Swallow and the loves of her life. At the start she is with Alec Bolton, a noted author, who discourages her when she wants to write a novel. Later she is swept off her feet by Alecs publisher, Vanni ...See moreThis is the story of the lovely Kate Swallow and the loves of her life. At the start she is with Alec Bolton, a noted author, who discourages her when she wants to write a novel. Later she is swept off her feet by Alecs publisher, Vanni Corso, and leaves Alec for Vanni. She writes another novel and Vanni tells her he doesn't think the book will sell. Both of their actions are an indication of their vanity and fear of losing her.  Written by Richard Jones See less",
        "runtimeMinutes": "102"
    },
    "1995_277": {
        "plotSummary": "The sequel to 1988's Outrageous Animation anthology, Too Outrageous Animation is a compilation of 27 cartoon shorts from nine countries. According to executive producer Terry Thoren, its subject matter includes: \"Blood, guts, hospitals, ...See moreThe sequel to 1988's Outrageous Animation anthology, Too Outrageous Animation is a compilation of 27 cartoon shorts from nine countries. According to executive producer Terry Thoren, its subject matter includes: \"Blood, guts, hospitals, sex, amputation, masturbation, extraterrestrials, killers, animal torture, drunkenness, butt jokes, penises, sexual inadequacy, rock and roll, electrocution, nymphomania, oral sex, auto-eroticism, taxes, witchcraft, internal organs, bird feces, vomiting, tooth decay, parking tickets, birth defects, scabs, farting and people of East Indian descent.\"  Written by Michael WalshSee less",
        "runtimeMinutes": "88"
    },
    "1995_278": {
        "plotSummary": "\"Lamb\" focuses on the relationship between Brother Michael Lamb (Liam Neeson), a teacher in a Roman Catholic-run institution for troubled boys in Ireland, and 10-year-old Owen Kane (Hugh O'Conor), the school's most unruly pupil. Dumped ...See more\"Lamb\" focuses on the relationship between Brother Michael Lamb (Liam Neeson), a teacher in a Roman Catholic-run institution for troubled boys in Ireland, and 10-year-old Owen Kane (Hugh O'Conor), the school's most unruly pupil. Dumped into the institution by his abusive mother, Owen is an incorrigible mess who smokes cigarettes, curses, wets his bed, picks fights and has epileptic seizures.  Written by mrwarcriminalSee less",
        "runtimeMinutes": "110"
    },
    "1995_28": {
        "plotSummary": "A mobster travels to Hollywood to collect a debt, and discovers that the movie business is much the same as his current job.",
        "runtimeMinutes": "105"
    },
    "1995_29": {
        "plotSummary": "In a dystopian future, Joseph Dredd, the most famous Judge (a police officer with instant field judiciary powers), is convicted for a crime he did not commit and must face his murderous counterpart.",
        "runtimeMinutes": "96"
    },
    "1995_3": {
        "plotSummary": "NASA must devise a strategy to return Apollo 13 to Earth safely after the spacecraft undergoes massive internal damage putting the lives of the three astronauts on board in jeopardy.",
        "runtimeMinutes": "140"
    },
    "1995_30": {
        "plotSummary": "A group of scientists try to track down and trap a killer alien seductress before she successfully mates with a human.",
        "runtimeMinutes": "108"
    },
    "1995_31": {
        "plotSummary": "A computer programmer stumbles upon a conspiracy, putting her life and the lives of those around her in great danger.",
        "runtimeMinutes": "114"
    },
    "1995_32": {
        "plotSummary": "A widowed U.S. President running for reelection and an environmental lobbyist fall in love. It's all above-board, but \"politics is perception,\" and sparks fly anyway.",
        "runtimeMinutes": "114"
    },
    "1995_33": {
        "plotSummary": "A frustrated composer finds fulfillment as a high school music teacher.",
        "runtimeMinutes": "143"
    },
    "1995_34": {
        "plotSummary": "Casey Ryback hops on a Colorado to LA train to start a vacation with his niece. Early into the trip, terrorists board the train and use it as a mobile HQ to hijack a top secret destructive US satellite.",
        "runtimeMinutes": "100"
    },
    "1995_35": {
        "plotSummary": "A woman flies to France to confront her straying fiancee, but gets into trouble when the charming crook seated next to her uses her for smuggling.",
        "runtimeMinutes": "111"
    },
    "1995_36": {
        "plotSummary": "Based on Terry McMillan's novel, this film follows four very different African-American women and their relationships with the male gender.",
        "runtimeMinutes": "124"
    },
    "1995_37": {
        "plotSummary": "George Banks must deal not only with the pregnancy of his daughter, but also with the unexpected pregnancy of his wife.",
        "runtimeMinutes": "106"
    },
    "1995_38": {
        "plotSummary": "John and Max resolve to save their beloved bait shop from turning into an Italian restaurant, just as its new female owner catches Max's attention.",
        "runtimeMinutes": "101"
    },
    "1995_39": {
        "plotSummary": "A psychiatrist must cure a young patient that presents himself as Don Juan, the greatest lover in the world.",
        "runtimeMinutes": "97"
    },
    "1995_4": {
        "plotSummary": "Years after a friend and fellow 00 agent is killed on a joint mission, a secret space based weapons program known as \"GoldenEye\" is stolen. James Bond sets out to stop a Russian crime syndicate from using the weapon.",
        "runtimeMinutes": "130"
    },
    "1995_40": {
        "plotSummary": "A giant egg is unearthed at a construction site and soon opened, releasing the terrible Ivan Ooze, who wreaks vengeance on Zordon for imprisoning him millennia ago. With Zordon dying and their powers lost, the Rangers head to a distant ...See moreA giant egg is unearthed at a construction site and soon opened, releasing the terrible Ivan Ooze, who wreaks vengeance on Zordon for imprisoning him millennia ago. With Zordon dying and their powers lost, the Rangers head to a distant planet to find the mystic warrior Dulcea.See less",
        "runtimeMinutes": "95"
    },
    "1995_41": {
        "plotSummary": "A former fireman takes on a group of terrorists holding the Vice President and others hostage during the seventh game of the NHL Stanley Cup finals.",
        "runtimeMinutes": "111"
    },
    "1995_42": {
        "plotSummary": "Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other.",
        "runtimeMinutes": "97"
    },
    "1995_43": {
        "plotSummary": "An ugly duckling having undergone a remarkable change, still harbors feelings for her crush: a carefree playboy, but not before his business-focused brother has something to say about it.",
        "runtimeMinutes": "127"
    },
    "1995_44": {
        "plotSummary": "A woman's world is rocked when she discovers her husband is cheating on her.",
        "runtimeMinutes": "106"
    },
    "1995_45": {
        "plotSummary": "A married soldier returning from World War II poses as a pregnant woman's husband to save her from her father's anger and honor.",
        "runtimeMinutes": "102"
    },
    "1995_46": {
        "plotSummary": "Three drag queens travel cross-country until their car breaks down, leaving them stranded in a small town.",
        "runtimeMinutes": "109"
    },
    "1995_47": {
        "plotSummary": "The original 70s TV family is now placed in the 1990s, where they're even more square and out of place than ever.",
        "runtimeMinutes": "90"
    },
    "1995_48": {
        "plotSummary": "Bride-to-be Finn Dodd hears tales of romance and sorrow from her elders as they construct a quilt.",
        "runtimeMinutes": "117"
    },
    "1995_49": {
        "plotSummary": "A young boy refuses to accept his mother's new boyfriend, a lawyer, despite the man's attempts to win his respect. Meanwhile, disgruntled relative of a criminal he prosecuted seek revenge.",
        "runtimeMinutes": "96"
    },
    "1995_5": {
        "plotSummary": "An English soldier and the daughter of an Algonquin chief share a romance when English colonists invade seventeenth century Virginia.",
        "runtimeMinutes": "81"
    },
    "1995_50": {
        "plotSummary": "A nun, while comforting a convicted killer on death row, empathizes with both the killer and his victim's families.",
        "runtimeMinutes": "122"
    },
    "1995_51": {
        "plotSummary": "People from all different walks of life, encounter racial tension, rape, responsibility, and the meaning of an education on a university campus.",
        "runtimeMinutes": "127"
    },
    "1995_52": {
        "plotSummary": "Four 12-year-old girls grow up together during an eventful small-town summer in 1970.",
        "runtimeMinutes": "100"
    },
    "1995_53": {
        "plotSummary": "A Harvard professor is lured back into the courtroom after twenty-five years to take the case of a young black man condemned to death for the horrific murder of a child.",
        "runtimeMinutes": "102"
    },
    "1995_54": {
        "plotSummary": "Omri, a young boy growing up in Brooklyn, receives an odd variety of presents for his birthday: a wooden cabinet from his older brother, a set of antique keys from his mother and a tiny plastic model of an Indian from his best friend Patrick.",
        "runtimeMinutes": "96"
    },
    "1995_55": {
        "plotSummary": "A vengeful New York City transit cop decides to steal a trainload of subway fares. His foster brother, a fellow cop, tries to protect him.",
        "runtimeMinutes": "110"
    },
    "1995_56": {
        "plotSummary": "When Max makes a preposterous promise to a girl he has a crush on, his chances to fulfilling it seem hopeless when he is dragged onto a cross-country trip with his embarrassing father, Goofy.",
        "runtimeMinutes": "78"
    },
    "1995_57": {
        "plotSummary": "Mickey, an NBA referee, meets Ellen, an American airline official, in Paris. It develops into a relationship of ups and downs.",
        "runtimeMinutes": "101"
    },
    "1995_58": {
        "plotSummary": "After his auto-parts tycoon father dies, the overweight, underachieving son teams up with a snide accountant to try and save the family business.",
        "runtimeMinutes": "97"
    },
    "1995_59": {
        "plotSummary": "An agoraphobic psychologist and a female detective must work together to take down a serial killer who copies serial killers from the past.",
        "runtimeMinutes": "123"
    },
    "1995_6": {
        "plotSummary": "Batman must battle former district attorney Harvey Dent, who is now Two-Face and Edward Nygma, The Riddler with help from an amorous psychologist and a young circus acrobat who becomes his sidekick, Robin.",
        "runtimeMinutes": "121"
    },
    "1995_60": {
        "plotSummary": "Ben Sanderson, a Hollywood screenwriter who lost everything because of his alcoholism, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.",
        "runtimeMinutes": "111"
    },
    "1995_61": {
        "plotSummary": "In 1713 Scotland, Rob Roy MacGregor is wronged by a nobleman and his nephew, becomes an outlaw in search of revenge while fleeing the Redcoats, and faces charges of being a Jacobite.",
        "runtimeMinutes": "139"
    },
    "1995_62": {
        "plotSummary": "An off the charts genius who is home schooled and shunned after his last relative dies shows the unconscious residents of his town about connection awareness and the generosity of the spirit.",
        "runtimeMinutes": "111"
    },
    "1995_63": {
        "plotSummary": "Professional hit-man Robert Rath wants to fulfill a few more contracts before retiring but unscrupulous ambitious newcomer hit-man Miguel Bain keeps killing Rath's targets.",
        "runtimeMinutes": "132"
    },
    "1995_64": {
        "plotSummary": "A recently discharged Major finds himself commanding a group of mismatched Cadets.",
        "runtimeMinutes": "95"
    },
    "1995_65": {
        "plotSummary": "Teenager Jesse becomes reunited with Willy two years after the whale's jump to freedom as the teenager tries to rescue the killer whale and other orcas from an oil spill.",
        "runtimeMinutes": "95"
    },
    "1995_66": {
        "plotSummary": "Two homies, Smokey and Craig Jones, smoke a dope dealer's weed and try to figure a way to get the two hundred dollars they owe to the dealer by 10 p.m. that same night.",
        "runtimeMinutes": "91"
    },
    "1995_67": {
        "plotSummary": "In order to inherit his fed up father's hotel empire, an immature and lazy man must repeat grades 1-12 all over again.",
        "runtimeMinutes": "89"
    },
    "1995_68": {
        "plotSummary": "In hot water with the mob over an unpaid debt, a con man poses as a family friend in an affluent Pennsylvania suburb.",
        "runtimeMinutes": "113"
    },
    "1995_69": {
        "plotSummary": "Former musician and gunslinger El Mariachi arrives at a small Mexican border town after being away for a long time. His past quickly catches up with him and he soon gets entangled with the local drug kingpin Bucho and his gang.",
        "runtimeMinutes": "104"
    },
    "1995_7": {
        "plotSummary": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
        "runtimeMinutes": "127"
    },
    "1995_70": {
        "plotSummary": "To keep the loyalty of a village during the Vietnam war, a U.S. Army officer and his unit struggle to deliver it a live elephant.",
        "runtimeMinutes": "107"
    },
    "1995_71": {
        "plotSummary": "A big-city reporter travels to the small town where her mother has been arrested for the murder of an elderly woman that she works for as a maid.",
        "runtimeMinutes": "132"
    },
    "1995_72": {
        "plotSummary": "A Vietnam vet adjusts to life after the war while trying to support his family, but the chance of a better life may involve crime and bloodshed.",
        "runtimeMinutes": "119"
    },
    "1995_73": {
        "plotSummary": "When a virtual reality simulation created using the personalities of multiple serial killers manages to escape into the real world, an ex-cop is tasked with stopping its reign of terror.",
        "runtimeMinutes": "106"
    },
    "1995_74": {
        "plotSummary": "Two best friends witness a murder and embark on a series of adventures in order to prove the innocence of the man wrongly accused of the crime.",
        "runtimeMinutes": "97"
    },
    "1995_75": {
        "plotSummary": "Robin shares a ride in her car with Jane from New York to Los Angeles. They stop at Jane's friend Holly's place in Pittsburgh and take her with them west, making a long stop in Tucson. The three very different women become close friends.",
        "runtimeMinutes": "115"
    },
    "1995_76": {
        "plotSummary": "3 women, who've been friends since kids, meet at university in Dublin in 1957. Student and boyfriend life begins.",
        "runtimeMinutes": "103"
    },
    "1995_77": {
        "plotSummary": "A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which began when five criminals met at a seemingly random police lineup.",
        "runtimeMinutes": "106"
    },
    "1995_78": {
        "plotSummary": "A simple Italian postman learns to love poetry while delivering mail to a famous poet, and then uses this to woo local beauty Beatrice.",
        "runtimeMinutes": "108"
    },
    "1995_79": {
        "plotSummary": "A beautiful but naïve aspiring television personality films a documentary on teenagers with a darker ulterior motive.",
        "runtimeMinutes": "106"
    },
    "1995_8": {
        "plotSummary": "An afterlife therapist and his daughter meet a friendly young ghost when they move into a crumbling mansion in order to rid the premises of wicked spirits.",
        "runtimeMinutes": "100"
    },
    "1995_80": {
        "plotSummary": "A man on the run is hunted by a demon known as the Collector.",
        "runtimeMinutes": "92"
    },
    "1995_81": {
        "plotSummary": "Nomi, a young drifter, arrives in Las Vegas to become a dancer and soon sets about clawing and pushing her way to become the top of the Vegas showgirls.",
        "runtimeMinutes": "128"
    },
    "1995_82": {
        "plotSummary": "A ship sails into Brooklyn with all its crew dead. But something gets off and the killing continues on land. The vampire is looking for a specific woman - half-human, half-vampire. Rita's the cop detective investigating the many killings.",
        "runtimeMinutes": "100"
    },
    "1995_83": {
        "plotSummary": "Alyssa and Amanda are two little girls who are identical, but complete strangers, that accidentally meet one day.",
        "runtimeMinutes": "101"
    },
    "1995_84": {
        "plotSummary": "A data courier, literally carrying a data package inside his head, must deliver it before he dies from the burden or is killed by the Yakuza.",
        "runtimeMinutes": "103"
    },
    "1995_85": {
        "plotSummary": "A female gunfighter returns to a frontier town where a dueling tournament is being held, which she enters in an effort to avenge her father's death.",
        "runtimeMinutes": "107"
    },
    "1995_86": {
        "plotSummary": "A teacher on exchange from England is placed in an underachieving Texan school, where she coaches the children in soccer, improving their self esteem and leading to unexpected success.",
        "runtimeMinutes": "100"
    },
    "1995_87": {
        "plotSummary": "Plump kids are lured into joining a posh fat camp with the promise of quick weight loss and good times, only to find that the facility is a woodland hellhole run by a psycho ex-fitness instructor.",
        "runtimeMinutes": "100"
    },
    "1995_88": {
        "plotSummary": "After losing her job, making out with her soon-to-be former boss, and finding out that her daughter plans to spend Thanksgiving with her boyfriend, Claudia Larson faces spending the holiday with her family.",
        "runtimeMinutes": "103"
    },
    "1995_89": {
        "plotSummary": "An eager and idealistic young attorney defends an Alcatraz prisoner accused of murdering a fellow inmate. The extenuating circumstances: his client had just spent over three years in solitary confinement.",
        "runtimeMinutes": "122"
    },
    "1995_9": {
        "plotSummary": "In a future where the polar ice-caps have melted and Earth is almost entirely submerged, a mutated mariner fights starvation and outlaw \"smokers,\" and reluctantly helps a woman and a young girl try to find dry land.",
        "runtimeMinutes": "135"
    },
    "1995_90": {
        "plotSummary": "Jobless loser Tommy Collins is sequestered to be a juror in a serial killer trial. He does everything he can to prolong the trial and deliberations to take full advantage of the free lodging and food.",
        "runtimeMinutes": "88"
    },
    "1995_91": {
        "plotSummary": "An African-American man is hired to find a woman, and gets mixed up in a murderous political scandal.",
        "runtimeMinutes": "102"
    },
    "1995_92": {
        "plotSummary": "At the scene of a bizarre murder, L.A. homicide detective Thomas Dagget discovers a lethal heavenly prophecy now being fulfilled on earth. In his fight to stop the forces of evil, he finds an unlikely ally in an elementary school teacher.",
        "runtimeMinutes": "98"
    },
    "1995_93": {
        "plotSummary": "A young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all immigrants in former times. Thomas is searching for...See moreA young Russian boy, Thomas Minton, travels to New York as a passenger on a Russian freighter. Close to Ellis Island he gets off and thus starts his journey to America the same way as all immigrants in former times. Thomas is searching for the family of one of his ancestors, who had emigrated decades ago, but once sent a letter home together with a sample of his new profession: 3D-Photography. The boy follows his relative's traces by counter-checking the old 3D-Photographs of New York (using an antique viewer) with the same places and how they look today. This way, the audience gets to see the Big Apple in former times as well as today.  Written by Julian Reischl See less",
        "runtimeMinutes": "51"
    },
    "1995_94": {
        "plotSummary": "A young social outcast in Australia steals money from her parents to finance a vacation where she hopes to find happiness, and perhaps love.",
        "runtimeMinutes": "106"
    },
    "1995_95": {
        "plotSummary": "The wild and sexy story of two passionate young people who take to the road for the incredible adventure of their lives.",
        "runtimeMinutes": "93"
    },
    "1995_96": {
        "plotSummary": "Six years after Michael Myers last terrorized Haddonfield, he returns there in pursuit of his niece, Jamie Lloyd, who has escaped with her newborn child, for which Michael and a mysterious cult have sinister plans.",
        "runtimeMinutes": "87"
    },
    "1995_97": {
        "plotSummary": "While flying mail across the Andean mountains, Henri Guillaumet's plane has to crash-land, he must trek back to civilizatin on foot.",
        "runtimeMinutes": "50"
    },
    "1995_98": {
        "plotSummary": "A reformed convict goes undercover with the help of an angry detective to ensnare a psychotic mobster.",
        "runtimeMinutes": "101"
    },
    "1995_99": {
        "plotSummary": "The Candyman arrives in New Orleans and sets his sights on a young woman whose family was ruined by the immortal killer years before.",
        "runtimeMinutes": "95"
    }
}