{
    "1996_1": {
        "plotSummary": "The aliens are coming and their goal is to invade and destroy Earth. Fighting superior technology, mankind's best weapon is the will to survive.",
        "runtimeMinutes": "145"
    },
    "1996_10": {
        "plotSummary": "A Witness Protection specialist becomes suspicious of his co-workers when dealing with a case involving high-tech weapons.",
        "runtimeMinutes": "115"
    },
    "1996_100": {
        "plotSummary": "Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends.",
        "runtimeMinutes": "93"
    },
    "1996_101": {
        "plotSummary": "A Hong Kong detective teams up with his female Red Chinese counterpart to stop a Chinese drug czar.",
        "runtimeMinutes": "96"
    },
    "1996_102": {
        "plotSummary": "An obese attorney is cursed by a gypsy to rapidly and uncontrollably lose weight.",
        "runtimeMinutes": "93"
    },
    "1996_103": {
        "plotSummary": "One of puppet-maker Geppetto's creations comes magically to life. This puppet named Pinocchio has one major desire, to become a real boy someday, but he has to learn to act responsibly.",
        "runtimeMinutes": "96"
    },
    "1996_104": {
        "plotSummary": "Mercenary Shale's team is retired after a (not so) covert mission in Cuba. He becomes substitute teacher at his teacher fiancee's Miami high school to get those behind kneecapping her. His team helps him.",
        "runtimeMinutes": "114"
    },
    "1996_105": {
        "plotSummary": "A young man, his wife, and his incompetent case worker travel across country to find his birth parents.",
        "runtimeMinutes": "92"
    },
    "1996_106": {
        "plotSummary": "A cop/flic discovers that he had a twin who just got murdered in Nice, France. In order to find out who did it, he takes his place including the cute girlfriend in Little Odessa, NYC.",
        "runtimeMinutes": "101"
    },
    "1996_107": {
        "plotSummary": "Zane, an astronomer, discovers intelligent alien life. But the aliens are keeping a deadly secret, and will do anything to stop Zane from learning it.",
        "runtimeMinutes": "115"
    },
    "1996_108": {
        "plotSummary": "Moronic best friends get themselves locked inside the Bio-Dome, a science experiment, along with a group of environmental scientists for one year.",
        "runtimeMinutes": "88"
    },
    "1996_109": {
        "plotSummary": "Following the death of her adoptive parents, a successful young black optometrist establishes contact with her biological mother -- a lonely white factory worker living in poverty in East London.",
        "runtimeMinutes": "136"
    },
    "1996_11": {
        "plotSummary": "At the close of World War II, a young nurse tends to a badly-burned plane crash victim. His past is shown in flashbacks, revealing an involvement in a fateful love affair.",
        "runtimeMinutes": "162"
    },
    "1996_110": {
        "plotSummary": "A Mississippi district attorney and the widow of Medgar Evers struggle to finally bring a white racist to justice for the 1963 murder of the civil rights leader.",
        "runtimeMinutes": "130"
    },
    "1996_111": {
        "plotSummary": "A comedy about making it on Wall Street. Prejudices are hard to break and Laurel Ayres quickly learns that in order for people to take her seriously she has to work for an older white man or be one.",
        "runtimeMinutes": "114"
    },
    "1996_112": {
        "plotSummary": "A single and lonely woman finds the seemingly perfect man to date, but soon regrets it when his deranged and possessive other personality emerges and worst still, she cannot convince anyone else of his Jekyll and Hyde true nature.",
        "runtimeMinutes": "96"
    },
    "1996_113": {
        "plotSummary": "After seventeen years, a fiercely independent woman and her rebellious son return home and together they turn the family she left behind upside down.",
        "runtimeMinutes": "98"
    },
    "1996_114": {
        "plotSummary": "Continuing the story of Aurora Greenway in her latter years. After the death of her daughter, Aurora struggled to keep her family together, but has one grandson in jail, a rebellious granddaughter, and another grandson living just above ...See moreContinuing the story of Aurora Greenway in her latter years. After the death of her daughter, Aurora struggled to keep her family together, but has one grandson in jail, a rebellious granddaughter, and another grandson living just above the poverty line.  Written by R. John Berggren See less",
        "runtimeMinutes": "129"
    },
    "1996_115": {
        "plotSummary": "Percy, upon being released from prison, goes to the small town of Gillead, to find a place where she can start over again. She is taken in by Hannah, to help out at her place, the Spitfire Grill. Percy brings change to the small town, ...See morePercy, upon being released from prison, goes to the small town of Gillead, to find a place where she can start over again. She is taken in by Hannah, to help out at her place, the Spitfire Grill. Percy brings change to the small town, stirring resentment and fear in some, and growth in others.  Written by Erich Boleyn See less",
        "runtimeMinutes": "117"
    },
    "1996_116": {
        "plotSummary": "When the skeleton of his murdered predecessor is found, Sheriff Sam Deeds unearths many other long-buried secrets in his Texas border town.",
        "runtimeMinutes": "135"
    },
    "1996_117": {
        "plotSummary": "A housemaid falls in love with Dr. Henry Jekyll and his darkly mysterious counterpart, Mr. Edward Hyde.",
        "runtimeMinutes": "108"
    },
    "1996_118": {
        "plotSummary": "New Jersey, 1950s. Two brothers run an Italian restaurant. Business is not going well as a rival Italian restaurant is out-competing them. In a final effort to save the restaurant, the brothers plan to put on an evening of incredible food.",
        "runtimeMinutes": "109"
    },
    "1996_119": {
        "plotSummary": "While searching for their missing father in the mountains of Alaska, two siblings come across a baby polar bear on the run from a pair of poachers.",
        "runtimeMinutes": "109"
    },
    "1996_12": {
        "plotSummary": "In a desperate attempt to win a basketball match and earn their freedom, the Looney Tunes seek the aid of retired basketball champion, Michael Jordan.",
        "runtimeMinutes": "88"
    },
    "1996_120": {
        "plotSummary": "In 1950's Los Angeles, a special crime squad of the LAPD investigates the murder of a young woman.",
        "runtimeMinutes": "107"
    },
    "1996_121": {
        "plotSummary": "48 hours of intersecting lives and crimes in Los Angeles.",
        "runtimeMinutes": "104"
    },
    "1996_122": {
        "plotSummary": "Neil Jordan's historical biopic of Irish revolutionary Michael Collins, the man who led a guerrilla war against the UK, helped negotiate the creation of the Irish Free State, and led the National Army during the Irish Civil War.",
        "runtimeMinutes": "133"
    },
    "1996_123": {
        "plotSummary": "A couple steals a Matisse painting on contract. They manage to escape the police. The sale takes place 4 days later on an island. Things don't go as planned.",
        "runtimeMinutes": "96"
    },
    "1996_124": {
        "plotSummary": "A piano player at a crossroads in his life returns home to his friends and their own problems with life and love.",
        "runtimeMinutes": "112"
    },
    "1996_125": {
        "plotSummary": "Teenage boys discover discipline and camaraderie on an ill-fated sailing voyage.",
        "runtimeMinutes": "129"
    },
    "1996_126": {
        "plotSummary": "A white school teacher takes over a talented, but undisciplined black high school basketball team and turns them into a winning team.",
        "runtimeMinutes": "99"
    },
    "1996_127": {
        "plotSummary": "Earl Pilcher, Jr., runs an equipment rental outfit in Arkansas, lives with his wife and kids and parents, and rarely takes off his gimme cap. His mother dies, leaving a letter explaining he's not her natural son, but the son of a black ...See moreEarl Pilcher, Jr., runs an equipment rental outfit in Arkansas, lives with his wife and kids and parents, and rarely takes off his gimme cap. His mother dies, leaving a letter explaining he's not her natural son, but the son of a black woman who died in childbirth. Plus, he has a half-brother Ray, in Chicago, she wants him to visit. Earl makes the trip, initially receiving a cold welcome from Ray and Ray's son, Virgil. His birth mother's sister, Aunt T., an aged and blind matriarch, takes Earl in tow and insists that the family open up to him.  Written by See less",
        "runtimeMinutes": "109"
    },
    "1996_128": {
        "plotSummary": "Connie, unwed and pregnant, is heading to Boston by train when she meets wealthy newlyweds Hugh and Patricia. The train crashes, and when Connie comes to in the hospital, she is mistaken for Patricia, who died in the crash with Hugh.",
        "runtimeMinutes": "105"
    },
    "1996_129": {
        "plotSummary": "A young boy befriends a larcenous orangutan in a luxury hotel.",
        "runtimeMinutes": "88"
    },
    "1996_13": {
        "plotSummary": "An uptight FBI Special Agent is paired with a foul-mouthed Boston cop to take down a ruthless drug lord.",
        "runtimeMinutes": "117"
    },
    "1996_130": {
        "plotSummary": "A New York girl sets her father up with a beautiful woman in a troubled marriage while her stepsister gets engaged.",
        "runtimeMinutes": "101"
    },
    "1996_131": {
        "plotSummary": "The love lives of two brothers, Mickey and Francis, interconnect as Francis cheats on his wife with Mickey's ex-girlfriend, while Mickey impulsively marries a stranger.",
        "runtimeMinutes": "96"
    },
    "1996_132": {
        "plotSummary": "In the 22nd century, a scientist attempts to right the wrong his ancestor created: the puzzle box that opens the gates of Hell and unleashes Pinhead and his Cenobite legions.",
        "runtimeMinutes": "85"
    },
    "1996_133": {
        "plotSummary": "Two over-loyal Celtic fans kidnap their opponent's star player in order to guarantee their team the championship.",
        "runtimeMinutes": "91"
    },
    "1996_134": {
        "plotSummary": "Two parents deal with the effects when their son is accused of murdering his girlfriend.",
        "runtimeMinutes": "108"
    },
    "1996_135": {
        "plotSummary": "Charlie and Itchy return to Earth to find Gabriel's Horn, but along the way meet up with a young boy named David, who ran away from home.",
        "runtimeMinutes": "82"
    },
    "1996_136": {
        "plotSummary": "A rich man's wife goes on a trip to a cabin with her husband. He's preoccupied with business and leaves early. A man she meets offers to kill her husband. He's crazy and she leaves. He later tracks down the couple.",
        "runtimeMinutes": "95"
    },
    "1996_137": {
        "plotSummary": "A motivational speaker discovers that the inheritance his father left for him is in the form of an elephant.",
        "runtimeMinutes": "93"
    },
    "1996_138": {
        "plotSummary": "The boxing champ's promoter thinks, change is needed. He finds the one man, who's beaten his black champ (at 17), a white man now in a rock band. Like Rocky, he trains heavily whereas the champ slacks.",
        "runtimeMinutes": "91"
    },
    "1996_139": {
        "plotSummary": "A Salem resident attempts to frame her ex-lover's wife for being a witch in the middle of the 1692 witchcraft trials.",
        "runtimeMinutes": "124"
    },
    "1996_14": {
        "plotSummary": "A gay cabaret owner and his drag queen companion agree to put up a false straight front so that their son can introduce them to his fiancee's right-wing moralistic parents.",
        "runtimeMinutes": "117"
    },
    "1996_140": {
        "plotSummary": "When letters written to God start getting results, and replies, people everywhere are amazed. The post office, however, is annoyed.",
        "runtimeMinutes": "112"
    },
    "1996_141": {
        "plotSummary": "A group of children, desperate to keep their various parents from getting divorces, kidnap them and hold them prisoner in a basement in order to force them to reconcile.",
        "runtimeMinutes": "108"
    },
    "1996_142": {
        "plotSummary": "A lawyer assigned to the clemency case of a woman on death row finds himself forming a deep friendship with her while he tries to prevent her impending execution.",
        "runtimeMinutes": "103"
    },
    "1996_143": {
        "plotSummary": "The Crypt Keeper returns to tell the story of a funeral parlor that moonlights as a vampire bordello.",
        "runtimeMinutes": "87"
    },
    "1996_144": {
        "plotSummary": "A disparate group of African-American men travel by bus to Washington, DC for the Million Man March.",
        "runtimeMinutes": "120"
    },
    "1996_145": {
        "plotSummary": "A military commander stationed off planet during an interplanetary war travels through the devastated landscape to negotiate a peace treaty, but discovers that the primitive robots they built to kill enemy combatants have gained sentience.",
        "runtimeMinutes": "108"
    },
    "1996_146": {
        "plotSummary": "A recently orphaned young woman goes to live with eccentric relatives in Sussex, where she sets about improving their gloomy lives.",
        "runtimeMinutes": "105"
    },
    "1996_147": {
        "plotSummary": "A young man's life is thrown into a loop when he is asked to be a pallbearer for the funeral of a classmate he doesn't remember, and his old high school crush temporarily returns to town.",
        "runtimeMinutes": "98"
    },
    "1996_148": {
        "plotSummary": "Jane Eyre is an orphan cast out as a young girl by her aunt, Mrs. Reed, and sent to be raised in a harsh charity school for girls. There she learns to become a teacher and eventually seeks employment outside of the school. Her ...See moreJane Eyre is an orphan cast out as a young girl by her aunt, Mrs. Reed, and sent to be raised in a harsh charity school for girls. There she learns to become a teacher and eventually seeks employment outside of the school. Her advertisement is answered by the housekeeper of Thornfield Hall, Mrs. Fairfax.  Written by Volker BoehmSee less",
        "runtimeMinutes": "112"
    },
    "1996_149": {
        "plotSummary": "Mario Van Peebles stars as an android killing weapon designed by the military and utilized to enter into a Latin American war to destroy the rebels - natives fighting simply to maintain their freedom. Contrary to his programming, he ...See moreMario Van Peebles stars as an android killing weapon designed by the military and utilized to enter into a Latin American war to destroy the rebels - natives fighting simply to maintain their freedom. Contrary to his programming, he develops an affinity for the villagers and decides to help them fight back. This lets his creators bring him back and ultimately leads to one of them being given more powerful circuitry to defeat him.  Written by John Sacksteder See less",
        "runtimeMinutes": "94"
    },
    "1996_15": {
        "plotSummary": "Reunited by the death of a college friend, three divorced women seek revenge on the husbands who left them for younger women.",
        "runtimeMinutes": "103"
    },
    "1996_150": {
        "plotSummary": "A hardened New Orleans cop, Dave Robicheaux, finally tosses in the badge and settles into life on the bayou with his wife. But a bizarre plane crash draws him back into the fray when his family is viciously threatened.",
        "runtimeMinutes": "132"
    },
    "1996_151": {
        "plotSummary": "An aspiring actress disappointed by her treatment in the movie industry turns to phone sex to make a living.",
        "runtimeMinutes": "108"
    },
    "1996_152": {
        "plotSummary": "After her mother commits suicide, a young woman travels to Italy in search of love, truth and a deeper connection with herself.",
        "runtimeMinutes": "118"
    },
    "1996_153": {
        "plotSummary": "Hamlet, Prince of Denmark, returns home to find his father murdered and his mother remarrying the murderer, his uncle. Meanwhile, war is brewing.",
        "runtimeMinutes": "242"
    },
    "1996_154": {
        "plotSummary": "A nice guy has just moved to New York and discovers that he must share his run-down apartment with a couple thousand singing, dancing cockroaches.",
        "runtimeMinutes": "80"
    },
    "1996_155": {
        "plotSummary": "An awkward seventh-grader struggles to cope with inattentive parents, snobbish class-mates, a smart older brother, an attractive younger sister and her own insecurities in suburban New Jersey.",
        "runtimeMinutes": "88"
    },
    "1996_156": {
        "plotSummary": "A wannabe actor has a hard time moving on from a break-up, but he is lucky to have supportive friends.",
        "runtimeMinutes": "96"
    },
    "1996_157": {
        "plotSummary": "A trained chimpanzee plays third base for a minor-league baseball team.",
        "runtimeMinutes": "94"
    },
    "1996_158": {
        "plotSummary": "Recently orphaned, a young boy is taken in by his godmother who is shocked to realize that she can see the boy's imaginary friend: a flamboyant, French magician named Bogus.",
        "runtimeMinutes": "110"
    },
    "1996_159": {
        "plotSummary": "A Dutch matron establishes and, for several generations, oversees a close-knit, matriarchal community where feminism and liberalism thrive.",
        "runtimeMinutes": "102"
    },
    "1996_16": {
        "plotSummary": "A year after the murder of her mother, a teenage girl is terrorized by a new killer, who targets the girl and her friends by using horror films as part of a deadly game.",
        "runtimeMinutes": "111"
    },
    "1996_160": {
        "plotSummary": "David's wife died 2 years ago. He, his teen daughter Rachel, her cute friend and 2 in-laws trying to fix him up with a friend, are all spending the weekend at his beach house. David still \"talks to his wife\" and neglects Rachel.",
        "runtimeMinutes": "93"
    },
    "1996_161": {
        "plotSummary": "Oilman Jan is paralyzed in an accident. His wife, who prayed for his return, feels guilty; even more, when Jan urges her to have sex with another.",
        "runtimeMinutes": "159"
    },
    "1996_162": {
        "plotSummary": "Tough ex-con Corky and her lover Violet concoct a scheme to steal millions of stashed mob money and pin the blame on Violet's crooked boyfriend Caesar.",
        "runtimeMinutes": "109"
    },
    "1996_163": {
        "plotSummary": "During the Second American Civil War in 2017, Barb Wire owns a nightclub called the Hammerhead. Things become complicated when her ex-lover Axel Hood, who is married to the fugitive Corrina Devonshire, re-enters her life.",
        "runtimeMinutes": "98"
    },
    "1996_164": {
        "plotSummary": "When a gang shoots his father, Bookman (Fred Williamson) returns to his hometown, rounds up some of his own people and begins an all-out war to restore the neighborhood to its rightful sense of justice.",
        "runtimeMinutes": "99"
    },
    "1996_165": {
        "plotSummary": "An American girl inherits a fortune and falls into a misguided relationship with a gentleman confidence artist whose true nature, including a barbed and covetous disposition, turns her life into a nightmare.",
        "runtimeMinutes": "144"
    },
    "1996_166": {
        "plotSummary": "A blackout leaves those affected to consider what is necessary, what is legal, and what is questionable, in order to survive in a predatory environment.",
        "runtimeMinutes": "94"
    },
    "1996_167": {
        "plotSummary": "The daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive Priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London. Further ...See moreThe daughter of a thief, young Moll is placed in the care of a nunnery after the execution of her mother. However, the actions of an abusive Priest lead Moll to rebel as a teenager, escaping to the dangerous streets of London. Further misfortunes drive her to accept a job as a prostitute from the conniving Mrs. Allworthy. It is there that Moll first meets Hibble, who is working as Allworthy's servant, but takes a special interest in the young woman's well-being. With his help, she retains hope for the future, ultimately falling in love with an unconventional artist who promises the possibility of romantic happiness.See less",
        "runtimeMinutes": "123"
    },
    "1996_168": {
        "plotSummary": "In the 1800s a naturalist marries into a family of British country gentry.",
        "runtimeMinutes": "116"
    },
    "1996_169": {
        "plotSummary": "When his wife falls sick, a father finds himself having to carpool for the neighborhood school children and being taken hostage by a bank robber.",
        "runtimeMinutes": "89"
    },
    "1996_17": {
        "plotSummary": "After a prank goes disastrously wrong, a group of boys are sent to a detention center where they are brutalized. Thirteen years later, an unexpected random encounter with a former guard gives them a chance for revenge.",
        "runtimeMinutes": "147"
    },
    "1996_170": {
        "plotSummary": "An ex-convict and his bumbling crook brother fight for the same woman.",
        "runtimeMinutes": "99"
    },
    "1996_171": {
        "plotSummary": "The brief life of Jean Michel Basquiat, a world renowned New York street artist struggling with fame, drugs and his identity.",
        "runtimeMinutes": "107"
    },
    "1996_172": {
        "plotSummary": "A medical examiner, who was suspected of murdering his wife, is trying an experimental drug to retrieve his wife's and others' memory and maybe find the killer and the mass murderer in a related present case.",
        "runtimeMinutes": "117"
    },
    "1996_173": {
        "plotSummary": "A documentary of the 1974 heavyweight championship bout in Zaire, \"The Rumble in the Jungle,\" between champion George Foreman and underdog challenger Muhammad Ali.",
        "runtimeMinutes": "88"
    },
    "1996_174": {
        "plotSummary": "After getting into a serious car accident, a TV director discovers an underground sub-culture of scarred, omnisexual car-crash victims who use car accidents and the raw sexual energy they produce to try to rejuvenate his sex life with his wife.",
        "runtimeMinutes": "100"
    },
    "1996_175": {
        "plotSummary": "A pharmaceutical scientist creates a pill that makes people remember their happiest memory, and although it's successful, it has unfortunate side effects.",
        "runtimeMinutes": "89"
    },
    "1996_176": {
        "plotSummary": "An incredibly dull-witted family unknowingly stumble upon an illegal weapons deal while on the trail of their \"stolen\" garbage.",
        "runtimeMinutes": "94"
    },
    "1996_177": {
        "plotSummary": "Two NYC roomies have a pact to jump off Brooklyn Bridge, if they haven't found life partners before she's 30. That's less than a month away.",
        "runtimeMinutes": "92"
    },
    "1996_178": {
        "plotSummary": "Jobe is resuscitated by Jonathan Walker. He wants Jobe to create a special computer chip that would connect all the computers in the world into one network, which Walker would control and use. But what Walker doesn't realize is a group of ...See moreJobe is resuscitated by Jonathan Walker. He wants Jobe to create a special computer chip that would connect all the computers in the world into one network, which Walker would control and use. But what Walker doesn't realize is a group of teenage hackers are on to him and out to stop his plan.  Written by ACSee less",
        "runtimeMinutes": "93"
    },
    "1996_179": {
        "plotSummary": "A narrator tells the story of his childhood years in a tightly knit Afro-American community in the deep south under racial segregation.",
        "runtimeMinutes": "115"
    },
    "1996_18": {
        "plotSummary": "Disaster in a New York tunnel as explosions collapse both ends of it. One hero tries to help the people inside find their way to safety.",
        "runtimeMinutes": "114"
    },
    "1996_180": {
        "plotSummary": "A depressed housewife whose husband is having an affair contemplates suicide, but changes her mind when she faces death by a killer hired to do her in.",
        "runtimeMinutes": "91"
    },
    "1996_181": {
        "plotSummary": "Nothing beats the original; Warren Miller's Snowriders is the definition of epic. With skiers and riders like John Egan, Brad Vancour, Jeremy Bloom, and JT Holmes you're definitely going to learn a thing or two. Travel along from Italy and...See moreNothing beats the original; Warren Miller's Snowriders is the definition of epic. With skiers and riders like John Egan, Brad Vancour, Jeremy Bloom, and JT Holmes you're definitely going to learn a thing or two. Travel along from Italy and China up to the highlands of Scotland and all the way down under to Australia to find out how the original Snowriders get it done.See less",
        "runtimeMinutes": "96"
    },
    "1996_182": {
        "plotSummary": "A writer returns to his hometown where he faces the childhood nemesis whose life he ultimately ruined, only the bully wants to relive their painful past by torturing him once again.",
        "runtimeMinutes": "90"
    },
    "1996_183": {
        "plotSummary": "The passionate Merchant Ivory drama tells the story of Françoise Gilot (Natascha McElhone), the only lover of Pablo Picasso (Sir Anthony Hopkins) who was strong enough to withstand his ferocious cruelty, and move on with her life.",
        "runtimeMinutes": "125"
    },
    "1996_184": {
        "plotSummary": "To get royal backing on a needed drainage project, a poor French lord must learn to play the delicate games of wit at court at Versailles.",
        "runtimeMinutes": "102"
    },
    "1996_185": {
        "plotSummary": "A former police detective juggles wrestling with his personal demons and becoming obsessed with a hauntingly beautiful woman.",
        "runtimeMinutes": "128"
    },
    "1996_186": {
        "plotSummary": "A bunch of high school misfits in Hawaii, introduced by their new teacher, attend a science fair in which they draw up inspiration to build their own solar car and win a trip to compete in the 1990 World Solar Challenge in Australia.",
        "runtimeMinutes": "100"
    },
    "1996_187": {
        "plotSummary": "This is the story of Valerie Solanas who was a 60s radical preaching hatred toward men in her \"Scum\" manifesto. She wrote a screenplay for a film that she wanted Andy Warhol to produce. After many times of ignoring her, Valerie shot him.",
        "runtimeMinutes": "103"
    },
    "1996_188": {
        "plotSummary": "Jamie is a shy teenager, often bullied at school. His neighbour Ste has a rough time at home, being beaten by his father and brother. This issues bring them together and they find that what they feel for each other is more than friendship.",
        "runtimeMinutes": "90"
    },
    "1996_189": {
        "plotSummary": "A documentary on insect life in meadows and ponds.",
        "runtimeMinutes": "80"
    },
    "1996_19": {
        "plotSummary": "In Canton, Mississippi, a fearless young lawyer and his assistant defend a black man accused of murdering two white men who raped his ten-year-old daughter, inciting violent retribution and revenge from the Ku Klux Klan.",
        "runtimeMinutes": "149"
    },
    "1996_190": {
        "plotSummary": "Al Pacino's deeply-felt rumination on Shakespeare's significance and relevance to the modern world through interviews and an in-depth analysis of \"Richard III.\"",
        "runtimeMinutes": "112"
    },
    "1996_191": {
        "plotSummary": "A documentary surveying the various Hollywood screen depictions of homosexuals and the attitudes behind them throughout the history of North American film.",
        "runtimeMinutes": "102"
    },
    "1996_192": {
        "plotSummary": "A hefty homeboy borrows his dad's Mercedes and goes to the beach with his friends for wild sun & fun.",
        "runtimeMinutes": "89"
    },
    "1996_193": {
        "plotSummary": "A pair of kidnappings expose the complex power dynamics within the corrupt and unpredictable workings of 1930s Kansas City.",
        "runtimeMinutes": "116"
    },
    "1996_194": {
        "plotSummary": "Balbuena finds himself forced to find an American wife in order to get legal residence before the new immigration laws take effect.",
        "runtimeMinutes": "102"
    },
    "1996_195": {
        "plotSummary": "Using previously unreleased archival material in addition to contemporary interviews, this academy award-winning documentary tells the story of the Frank family and presents the first fully-rounded portrait of their brash and free-spirited...See moreUsing previously unreleased archival material in addition to contemporary interviews, this academy award-winning documentary tells the story of the Frank family and presents the first fully-rounded portrait of their brash and free-spirited daughter Anne, perhaps the world's most famous victim of the Holocaust.  Written by Dawn M. BarcliftSee less",
        "runtimeMinutes": "117"
    },
    "1996_196": {
        "plotSummary": "Just as Amelia thinks she's over her anxiety and insecurity, her best friend announces her engagement, bringing her anxiety and insecurity right back.",
        "runtimeMinutes": "86"
    },
    "1996_197": {
        "plotSummary": "After the funeral of one of their own, a criminal family decides to embark on an emotionally unnerving journey in an attempt to exact bloody revenge.",
        "runtimeMinutes": "99"
    },
    "1996_198": {
        "plotSummary": "A young gallerist is in love with two sisters at the same time. In order to solve the problem he decides to invent his own twin-brother.",
        "runtimeMinutes": "118"
    },
    "1996_199": {
        "plotSummary": "After being bitten by a werewolf in the jungle, Ted looks for a cure. His lawyer sister, with a son and dog, invites him to park his camper by her house in the woods and live out of her fridge.",
        "runtimeMinutes": "80"
    },
    "1996_2": {
        "plotSummary": "Bill and Jo Harding, advanced storm chasers on the brink of divorce, must join together to create an advanced weather alert system by putting themselves in the cross-hairs of extremely violent tornadoes.",
        "runtimeMinutes": "113"
    },
    "1996_20": {
        "plotSummary": "An ordinary man sees a bright light descend from the sky, and discovers he now has super-intelligence and telekinesis.",
        "runtimeMinutes": "123"
    },
    "1996_200": {
        "plotSummary": "On the run after murdering a man, accountant William Blake encounters a strange aboriginal American man named Nobody who prepares him for his journey into the spiritual world.",
        "runtimeMinutes": "121"
    },
    "1996_201": {
        "plotSummary": "Leo writes trashy romance novels under a pseudonym but as she struggles in her relationship with her husband, she finds her output becoming darker.",
        "runtimeMinutes": "103"
    },
    "1996_202": {
        "plotSummary": "After learning of her husband's infidelities, a housewife invites an itinerant lesbian to move in with them. None of their lives will ever be the same again.",
        "runtimeMinutes": "104"
    },
    "1996_203": {
        "plotSummary": "The fates of four different people - a thief, a cop, a female professor of philosophy, a suicidal girl - unexpectedly collide.",
        "runtimeMinutes": "117"
    },
    "1996_204": {
        "plotSummary": "",
        "runtimeMinutes": "73"
    },
    "1996_205": {
        "plotSummary": "Mike Nelson and his robot companions watch and give their comments about This Island Earth.",
        "runtimeMinutes": "73"
    },
    "1996_206": {
        "plotSummary": "A mentally unstable veteran works as a nighttime taxi driver in New York City, where the perceived decadence and sleaze fuels his urge for violent action by attempting to liberate a presidential campaign worker and an underage prostitute.",
        "runtimeMinutes": "114"
    },
    "1996_207": {
        "plotSummary": "When Nelly, a woman being just divorced, meets by chance M. Arnaud, a mature salesman just retired, begins a strange and special relationship between the two personalities.See moreWhen Nelly, a woman being just divorced, meets by chance M. Arnaud, a mature salesman just retired, begins a strange and special relationship between the two personalities.  Written by Volker BoehmSee less",
        "runtimeMinutes": "106"
    },
    "1996_208": {
        "plotSummary": "The life of an overweight, unhappy cook is changed after a kind, beautiful college drop-out comes to work as a waitress at his and his mother's road-side restaurant.",
        "runtimeMinutes": "105"
    },
    "1996_209": {
        "plotSummary": "Several people try to help a little girl to find the money her mom gave her to buy a goldfish with.",
        "runtimeMinutes": "85"
    },
    "1996_21": {
        "plotSummary": "Terrorists steal nuclear warheads from the U.S. military but don't count on a pilot and park ranger spoiling their plans.",
        "runtimeMinutes": "108"
    },
    "1996_210": {
        "plotSummary": "Old woman Berthe leaves her house to live in her daugter Emilie's one. Emilie and her brother Antoine have fallen out three years ago and have not seen each other since, but Emilie invites him for Christmas. Memories will come up, and will...See moreOld woman Berthe leaves her house to live in her daugter Emilie's one. Emilie and her brother Antoine have fallen out three years ago and have not seen each other since, but Emilie invites him for Christmas. Memories will come up, and will be depicted both Berthe's destiny and the strange relationship between Emilie and Antoine.  Written by YepokSee less",
        "runtimeMinutes": "127"
    },
    "1996_211": {
        "plotSummary": "A newly hired maid for a rich countryside family befriends a post-office clerk who encourages her to rebel against her employers.",
        "runtimeMinutes": "112"
    },
    "1996_212": {
        "plotSummary": "Berlin 1920: Die seit sieben Jahren verheiratete Anwaltsgattin Evelyne Droste (Claude Jade) verliebt sich in den Amerikaner Frank Davis (Barry Stokes) und folgt ihm heimlich für ein Wochenende nach Paris. Damit setzt Evelyne ihre ...See moreBerlin 1920: Die seit sieben Jahren verheiratete Anwaltsgattin Evelyne Droste (Claude Jade) verliebt sich in den Amerikaner Frank Davis (Barry Stokes) und folgt ihm heimlich für ein Wochenende nach Paris. Damit setzt Evelyne ihre bürgerliche Existenz aufs Spiel. Nach dem Roman von Vicki Baum.  Written by Cisnadie See less",
        "runtimeMinutes": "104"
    },
    "1996_213": {
        "plotSummary": "Tommy is an unemployed mechanic who spends most of his time in a bar (Trees Lounge) in a small blue collar town. He seems to always be thinking, \"If only X then I could stop drinking\".",
        "runtimeMinutes": "95"
    },
    "1996_214": {
        "plotSummary": "A group of homosexual people try to live with dignity and self-respect while events build to the opening battle in the major gay rights movement.",
        "runtimeMinutes": "99"
    },
    "1996_215": {
        "plotSummary": "A talented street fighter ends up in a torturous prison camp - where he meets Sun, who teaches him humility, self-respect, and the deadliest fighting discipline: The Iron Hand. He promises Sun upon his release, he will fight in The Kumite.",
        "runtimeMinutes": "90"
    },
    "1996_216": {
        "plotSummary": "The 1981 hunger strike in an Irish prison, in which I.R.A. prisoner Bobby Sands led a protest against their treatment as criminals rather than as prisoners of war. It focuses on the mothers of two of the strikers, and their struggle.",
        "runtimeMinutes": "112"
    },
    "1996_217": {
        "plotSummary": "Long-repressed feelings of bitterness and betrayal explode when three inner-city losers plot the robbery of a valuable coin in a seedy second-hand junk shop.",
        "runtimeMinutes": "88"
    },
    "1996_218": {
        "plotSummary": "An aspiring singer, Denise Waverly/Edna Buxton, sacrifices her own singing career to write hit songs that launch the careers of other singers. The film follows her life from her first break, through the pain of rejection from the recording...See moreAn aspiring singer, Denise Waverly/Edna Buxton, sacrifices her own singing career to write hit songs that launch the careers of other singers. The film follows her life from her first break, through the pain of rejection from the recording industry and a bad marriage, to her final triumph.  Written by John Deming See less",
        "runtimeMinutes": "116"
    },
    "1996_219": {
        "plotSummary": "A medieval knight and his servant ask a familiar wizard to move them back in time to prevent father-in-law's accidentally killing. Instead, they fly away to the 20th century.",
        "runtimeMinutes": "107"
    },
    "1996_22": {
        "plotSummary": "Shakespeare's famous play is updated to the hip modern suburb of Verona still retaining its original dialogue.",
        "runtimeMinutes": "120"
    },
    "1996_220": {
        "plotSummary": "Nick \"Eric Roberts\", is nearing the end of a 3-year battle with AIDS and makes arrangements to die. He hosts a party to say goodbye to friends and family. His ex-partner, Brandon \"Gregory Harrison\", attends and things get complicated.",
        "runtimeMinutes": "110"
    },
    "1996_221": {
        "plotSummary": "After a series of bizarre actions, Loris is mistaken for a serial killer. Jessica, a policewoman in undercover, will try to induce him to commit a murder.",
        "runtimeMinutes": "112"
    },
    "1996_222": {
        "plotSummary": "Two melancholy Hong Kong policemen fall in love: one with a mysterious female underworld figure, the other with a beautiful and ethereal server at a late-night restaurant he frequents.",
        "runtimeMinutes": "102"
    },
    "1996_223": {
        "plotSummary": "Shakespeare's comedy of gender confusion, in which a girl disguises herself as a man to be near the count she adores, only to be pursued by the woman he loves.",
        "runtimeMinutes": "134"
    },
    "1996_224": {
        "plotSummary": "Three friends plan to pull off a simple robbery and go on the run.",
        "runtimeMinutes": "91"
    },
    "1996_225": {
        "plotSummary": "Becoming an orphan in 1935, Collin moves to his dad's cousins Verena and Dolly. Verena is a rich, bossy businesswoman. Dolly, Collin and the maid revolt, moving to a tree house.",
        "runtimeMinutes": "107"
    },
    "1996_226": {
        "plotSummary": "A glowing green orb - which embodies ultimate evil - terrorizes a young girl with an anthology of bizarre and fantastic stories of dark fantasy, eroticism and horror.",
        "runtimeMinutes": "86"
    },
    "1996_227": {
        "plotSummary": "This film is based on a true story about a British teenager who allegedly poisoned family, friends, and co-workers. Graham is highly intelligent, but completely amoral. He becomes interested in science, especially chemistry, and begins to ...See moreThis film is based on a true story about a British teenager who allegedly poisoned family, friends, and co-workers. Graham is highly intelligent, but completely amoral. He becomes interested in science, especially chemistry, and begins to read avidly. Something of a social misfit, he is fascinated by morbid subjects such as poisons and murder. His family environment is intolerable to him and, in particular, his stepmother torments him. He decides to poison those who annoy him, first with antimony and later with thallium. He smugly thinks himself cleverer than all those around him, but nevertheless he is caught and sentenced to 'rehabilitation' at a psychiatric institution. Once there, he undertakes to deceive the new eminent psychiatrist sent there to 'cure' him, thereby securing his release.  Written by Tad Dibbern See less",
        "runtimeMinutes": "99"
    },
    "1996_228": {
        "plotSummary": "Patty Vare falls off a horse and is found unconscious by preparatory school student John Baker. He takes her to his dormitory. As he quickly discovers, she is hiding from something. For John this becomes a road to maturity and for Patty, ...See morePatty Vare falls off a horse and is found unconscious by preparatory school student John Baker. He takes her to his dormitory. As he quickly discovers, she is hiding from something. For John this becomes a road to maturity and for Patty, it's a way back to love and tenderness.  Written by Mattias ThuressonSee less",
        "runtimeMinutes": "86"
    },
    "1996_229": {
        "plotSummary": "A cyborg policewoman and her partner hunt a mysterious and powerful hacker called the Puppet Master.",
        "runtimeMinutes": "83"
    },
    "1996_23": {
        "plotSummary": "The Borg travel back in time intent on preventing Earth's first contact with an alien species. Captain Picard and his crew pursue them to ensure that Zefram Cochrane makes his maiden flight reaching warp speed.",
        "runtimeMinutes": "111"
    },
    "1996_230": {
        "plotSummary": "A look at a group of girl friends coming-of-age during their senior year of high school in urban America. Nikki and Emma have a heart to heart talk one evening about how much they'll miss each other at college next year, but the next day, ...See moreA look at a group of girl friends coming-of-age during their senior year of high school in urban America. Nikki and Emma have a heart to heart talk one evening about how much they'll miss each other at college next year, but the next day, Nikki doesn't show up at school: she's committed suicide. The friends steal Nikki's journal and discover that she'd been raped. The rest of the movie shows our heroines growing closer in the wake of Nikki's death and the relevation of her secret (Emma reveals that she's also been raped), taking revenge on the men who oppress them, and trying to grow up and move on with their lives. Emma has to deal with a shallow boyfriend, Angela with an overbearing mother, and Patti is trying to finish high school while trying to raise a child and avoid the child's loser father.  Written by Martin Lewison See less",
        "runtimeMinutes": "90"
    },
    "1996_231": {
        "plotSummary": "A pregnant teen and her younger sister run away from foster homes and kidnap a woman whom they believe can help with the pregnancy.",
        "runtimeMinutes": "88"
    },
    "1996_232": {
        "plotSummary": "A group of theater actors plays \"Hamlet\" in a provincial village, faced with their own temptations, disappointments, and joys.",
        "runtimeMinutes": "99"
    },
    "1996_233": {
        "plotSummary": "Thrown out by his girlfriend from her apartment, Axel lives for a while with Norbert, a gay man he met some days before.",
        "runtimeMinutes": "93"
    },
    "1996_234": {
        "plotSummary": "A group of idealistic, but frustrated, liberals succumb to the temptation of murdering rightwing pundits for their political beliefs.",
        "runtimeMinutes": "92"
    },
    "1996_235": {
        "plotSummary": "Gustavo is a young Havana Communist who believes in the revolution; he hopes for a scholarship to study aeronautical engineering in Prague. But his faith in the new Cuba is tested: his father, a psychiatrist, can make four times as much ...See moreGustavo is a young Havana Communist who believes in the revolution; he hopes for a scholarship to study aeronautical engineering in Prague. But his faith in the new Cuba is tested: his father, a psychiatrist, can make four times as much playing piano at a hotel for foreigners; his sweetheart, Yolanda, wants a career as a dancer and longs for the riches of Miami; his younger brother Bobby simply wants to play rock music, and as a result is in constant trouble with the authorities. When Bobby takes a shocking step of revolt and Gustavo is refused service at a foreigners-only bar, the contradictions in his resolve to become a \"new man\" push him to the breaking point.  Written by See less",
        "runtimeMinutes": "105"
    },
    "1996_236": {
        "plotSummary": "Late 19th century England; Jude, an intelligent but unworldly stonemason, looks to escape rural poverty by gaining a university education. Toward this goal, when his wife Arabella leaves him, he moves to Christminster where he meets and ...See moreLate 19th century England; Jude, an intelligent but unworldly stonemason, looks to escape rural poverty by gaining a university education. Toward this goal, when his wife Arabella leaves him, he moves to Christminster where he meets and falls recklessly in love with Sue, his beautiful and intelligent cousin. Though the two realize their destinies are intertwined, when he reveals his previous marriage, she is deeply hurt and in a perverse act of retaliation, marries another man. Broke and denied entrance to the university, he returns to his hometown. Some time later, at the funeral for their common aunt, Sue reveals to Jude that she's desperately unhappy. Soon an illicit romance begins between them until Sue's husband steps aside finally allowing Jude and Sue to be together openly. The two have children and live together as an unmarried couple. Though they must endure social and financial hardship, the two finally find happiness together, until tragedy strikes.  Written by WikiSee less",
        "runtimeMinutes": "123"
    },
    "1996_237": {
        "plotSummary": "An American spy behind the lines during WWII serves as a Nazi propagandist, a role he cannot escape in his future life as he can never reveal his real role in the war.",
        "runtimeMinutes": "114"
    },
    "1996_238": {
        "plotSummary": "In 1933 Texas, a schoolteacher and aspiring writer meets a pulp fiction writer, and a relationship soon develops between the two, but it is doomed by his slavishly devotion to his ailing mother and insistence on his freedom.",
        "runtimeMinutes": "111"
    },
    "1996_239": {
        "plotSummary": "A photographer and the types of people he encounters.",
        "runtimeMinutes": "113"
    },
    "1996_24": {
        "plotSummary": "The hit musical based on the life of Evita Duarte, a B-picture Argentinian actress who eventually became the wife of Argentinian president Juan Perón, and the most beloved and hated woman in Argentina.",
        "runtimeMinutes": "135"
    },
    "1996_240": {
        "plotSummary": "Jerry and his two pals, Russ and Syd, are just looking for some easy money to help them break out of their nowhere lives in their nowhere town. Despite a bungled jewelry store heist which exposes their incompetence as criminals, a fateful ...See moreJerry and his two pals, Russ and Syd, are just looking for some easy money to help them break out of their nowhere lives in their nowhere town. Despite a bungled jewelry store heist which exposes their incompetence as criminals, a fateful event (and an old black-and-white film) convinces them that they can pull off an armored-truck robbery. While they are busy plotting their caper, their dysfunctional families spin out of control all around them.  Written by Tad Dibbern See less",
        "runtimeMinutes": "92"
    },
    "1996_241": {
        "plotSummary": "A twisted take on \"Little Red Riding Hood\", with a teenage juvenile delinquent on the run from a social worker travelling to her grandmother's house and being hounded by a charming, but sadistic, serial killer and pedophile.",
        "runtimeMinutes": "102"
    },
    "1996_242": {
        "plotSummary": "Joseph Svenden is a middle-aged school-teacher who lives on a farm with his dying mother. In his simple life there are no excitements, even in long-time relationship with a widow. However, when seventeen-year-old beauty enrolls in his ...See moreJoseph Svenden is a middle-aged school-teacher who lives on a farm with his dying mother. In his simple life there are no excitements, even in long-time relationship with a widow. However, when seventeen-year-old beauty enrolls in his class, Joseph would soon end up in her arms. After that, Joseph is torn between the passion and feeling that he is doing something wrong.  Written by Dragan Antulov See less",
        "runtimeMinutes": "109"
    },
    "1996_243": {
        "plotSummary": "An irresponsible, drug-addicted, recently impregnated woman finds herself in the middle of an abortion debate when both parties attempt to sway her to their respective sides.",
        "runtimeMinutes": "106"
    },
    "1996_244": {
        "plotSummary": "When a poor bicycle-taxi driver has his cyclo stolen, he is forced into a life of crime. Meanwhile, his sister becomes a sex worker.",
        "runtimeMinutes": "123"
    },
    "1996_245": {
        "plotSummary": "24 hours in the lives of three young men in the French suburbs the day after a violent riot.",
        "runtimeMinutes": "98"
    },
    "1996_246": {
        "plotSummary": "",
        "runtimeMinutes": "90"
    },
    "1996_247": {
        "plotSummary": "Character study about Mildred, an elderly woman who has spent her life caring for others. When her daughter finally leaves home, she finds that, for the first time in her life, she has nobody to worry about - but soon becomes involved in ...See moreCharacter study about Mildred, an elderly woman who has spent her life caring for others. When her daughter finally leaves home, she finds that, for the first time in her life, she has nobody to worry about - but soon becomes involved in the life of Monica, a young mother whose husband has left her to look after her young son J.J.. As the relationship blossoms, Monica teaches Mildred that there is more to life than taking care of others.  Written by Jonathan Broxton See less",
        "runtimeMinutes": "103"
    },
    "1996_248": {
        "plotSummary": "Legs Sadovsky gets four other high school girls to think for themselves and react to a teacher's sexual harassment, which gets them suspended. They bond, and rebel, at an abandoned house.",
        "runtimeMinutes": "102"
    },
    "1996_249": {
        "plotSummary": "The same situation is played out in different cities (New York, Berlin and Tokyo). A lover has to choose whether to commit to a partner who is returning home. In each case there are other people involved, an ex-partner and someone else in ...See moreThe same situation is played out in different cities (New York, Berlin and Tokyo). A lover has to choose whether to commit to a partner who is returning home. In each case there are other people involved, an ex-partner and someone else in a \"permanent\" relationship, what do they choose to do?  Written by David Morgans See less",
        "runtimeMinutes": "85"
    },
    "1996_25": {
        "plotSummary": "A father vows to get his son a Turbo Man action figure for Christmas. However, every store is sold out of them, and he must travel all over town and compete with everybody else in order to find one.",
        "runtimeMinutes": "89"
    },
    "1996_250": {
        "plotSummary": "A cemetery man must kill the dead a second time when they become zombies.",
        "runtimeMinutes": "105"
    },
    "1996_251": {
        "plotSummary": "One morning Valerie has to tell her unemployed boyfriend Remi that she is pregnant. She has decided to keep the child, but they argue whether they should break up or not. That same day she starts working in room service at a smart hotel.",
        "runtimeMinutes": "90"
    },
    "1996_252": {
        "plotSummary": "David is an unemployed communist that comes to Spain in 1937 during the civil war to enroll the republicans and defend the democracy against the fascists. He makes friends between the soldiers.",
        "runtimeMinutes": "109"
    },
    "1996_253": {
        "plotSummary": "An evil millionaire believes he is Santa Claus after an accident renders him amnesiac.",
        "runtimeMinutes": "97"
    },
    "1996_254": {
        "plotSummary": "A young American woman becomes a nanny in the home of a recent British widower.",
        "runtimeMinutes": "110"
    },
    "1996_255": {
        "plotSummary": "Mockumentary look at Playgirl Magazine centerfold and 1992 Man of the Year, Dirk Shafer, who kept it a secret from the magazine that he is gay. Most of the film is a fictionalized retelling of Dirk's decision to send a photograph to ...See moreMockumentary look at Playgirl Magazine centerfold and 1992 Man of the Year, Dirk Shafer, who kept it a secret from the magazine that he is gay. Most of the film is a fictionalized retelling of Dirk's decision to send a photograph to Playgirl, his selection as a centerfold and then Man of the Year, his many TV interviews, his friend Vivian Paxton posing as his beard, and the pressures from his live-in lover to come out of the closet. Interspersed with this chronological narrative are a black and white look at an evening Dirk spends with Angela Lucassey, a woman from Reno who wins Playgirl's national contest to have a date with Dirk, and an interview with a stripper who tracks Dirk down.  Written by See less",
        "runtimeMinutes": "86"
    },
    "1996_256": {
        "plotSummary": "A moral college ethics professor plans to kill his neighbor, a Nazi death camp commander.",
        "runtimeMinutes": "91"
    },
    "1996_257": {
        "plotSummary": "Story of the early life of genius and Nobel Prize-winning physicist Richard Feynman.",
        "runtimeMinutes": "119"
    },
    "1996_258": {
        "plotSummary": "Sprawling epic covering the life of a Texas cattle rancher and his family and associates.",
        "runtimeMinutes": "201"
    },
    "1996_259": {
        "plotSummary": "Three teenage brothers, gang-member Bobby, troubled mama's boy Alan and self-assured prankster Lex, reside in a downtrodden section of Glasgow, Scotland, circa 1968. But while Bobby and Alan are beginning to experience the power of raging ...See moreThree teenage brothers, gang-member Bobby, troubled mama's boy Alan and self-assured prankster Lex, reside in a downtrodden section of Glasgow, Scotland, circa 1968. But while Bobby and Alan are beginning to experience the power of raging hormones, the story focuses on Lex, who begins a downward spiral after he accidentally shoots the leader of Bobby's gang. Lex's cockiness and immaturity unfortunately prevent him from understanding the effect his subsequent crimes will have on both himself, and on those around him.  Written by Ary Luiz Dalazen Jr. See less",
        "runtimeMinutes": "108"
    },
    "1996_26": {
        "plotSummary": "When terrorists seize control of an airliner, an intelligence analyst accompanies a commando unit for a midair boarding operation.",
        "runtimeMinutes": "133"
    },
    "1996_260": {
        "plotSummary": "A group of friends in New York, working away at their PCs and laptops, keep in touch exclusively by phone and fax. They are all too busy to meet face to face. Gale plays matchmaker, by phone, to Jerry and Barbara who, in turn, hit it off ...See moreA group of friends in New York, working away at their PCs and laptops, keep in touch exclusively by phone and fax. They are all too busy to meet face to face. Gale plays matchmaker, by phone, to Jerry and Barbara who, in turn, hit it off beautifully...via phone and fax. Martin gets a telephone call from someone he's never met. It's Denise, with some extraordinary news. Tapping away at his computer all the while, he develops a sort of friendship with Denise...via phone. And so it goes as the friends, tap, tap, tapping away, share news, hopes, and dreams...via phone and fax. Finally Gale has an unfortunate encounter with a phone, Denise has some more news for Martin, and Frank plans a gala New Year's Eve party, but will he answer the door?  Written by Helen Stavrou See less",
        "runtimeMinutes": "80"
    },
    "1996_261": {
        "plotSummary": "The filmmakers follow Oliver North's unsuccessful 1994 bid for a Virginia Senate seat, focusing on North's campaign strategist, Mark Goodin, and a Washington Post reporter. Mudslinging ensues.See moreThe filmmakers follow Oliver North's unsuccessful 1994 bid for a Virginia Senate seat, focusing on North's campaign strategist, Mark Goodin, and a Washington Post reporter. Mudslinging ensues.  Written by Mike D'Angelo See less",
        "runtimeMinutes": "105"
    },
    "1996_262": {
        "plotSummary": "The story of airmen training in rural Manitoba in the summer of 1942 to go overseas and become bomber pilots in World War II, as well as the romantic entanglements which overcome them while they contemplate life and love in a world at war.",
        "runtimeMinutes": "120"
    },
    "1996_263": {
        "plotSummary": "With his boss in the madhouse, a mobster is temporary boss of the criminal empire just as vicious rivals threaten the control of the empire.",
        "runtimeMinutes": "93"
    },
    "1996_264": {
        "plotSummary": "Ed lives in Wisconsin, but he's just been dumped by his girlfriend. So he moves to New York City for a big change...but will he ever find love again? He loves his new job studying the genetics of different strains of rice. He has a good ...See moreEd lives in Wisconsin, but he's just been dumped by his girlfriend. So he moves to New York City for a big change...but will he ever find love again? He loves his new job studying the genetics of different strains of rice. He has a good partnership with his promiscuous roommate Ray. And he's made some great friends, characters at the local diner. But then there's Natalie (Lee for short). She's just what Ed thinks he's looking for, and she's available...or is she?  Written by Martin Lewison See less",
        "runtimeMinutes": "88"
    },
    "1996_265": {
        "plotSummary": "London of the late 19th century is a haven for political exiles of all sorts - refugees, partisans, anarchists. Verloc has made his living spying for the Russian government, an agent provocateur of sorts, while simultaneously providing ...See moreLondon of the late 19th century is a haven for political exiles of all sorts - refugees, partisans, anarchists. Verloc has made his living spying for the Russian government, an agent provocateur of sorts, while simultaneously providing information to the London police, specifically Chief Inspector Heat. When the new Russian ambassador demands he prove his worth or lose his salary, Verloc sets off a tragic chain of events that involves his pretty young wife Winnie, her intellectually disabled brother Stevie, and a figure called the Professor, whose fascination with explosives and destruction makes him the person to call on when Verloc needs a bomb.  Written by Gary Dickerson See less",
        "runtimeMinutes": "95"
    },
    "1996_266": {
        "plotSummary": "Angel celebrates the birth of his daughter by taking his first hit of crack cocaine. With the hesitant support of his wife, Monika, he joins a friend of his to deal drugs for a short time--enough time to get out of debt and buy some nice ...See moreAngel celebrates the birth of his daughter by taking his first hit of crack cocaine. With the hesitant support of his wife, Monika, he joins a friend of his to deal drugs for a short time--enough time to get out of debt and buy some nice things for the family. Three years later, Angel is still dealing, and has not saved any money, instead spending it on crack. His addiction grows, straining his friendship and his family life, and he gradually loses control.  Written by James Meek See less",
        "runtimeMinutes": "89"
    },
    "1996_267": {
        "plotSummary": "In the beginning of the 19th century, Johannes Elias Alder is born in a small village in the Austrian mountains. While growing up he is considered strange by the other villagers and discovers his love of music, especially rebuilding and ...See moreIn the beginning of the 19th century, Johannes Elias Alder is born in a small village in the Austrian mountains. While growing up he is considered strange by the other villagers and discovers his love of music, especially rebuilding and playing the organ at the village church. After experiencing an \"acoustic wonder\", his eye color changes and he can hear even the most subtle sounds. Elias falls in platonic love with Elsbeth, the sister of Peter, a neighbor's son, who has longstanding homosexual feelings towards Elias. After Elsbeth, out of frustration from Elias' not returning her love and instead being obsessed with music, chooses to be impregnated and marries someone else who lose love she had spurned for Elias. The village burns and most villagers, including Elsbeth, evacuate to the closest town. Elias remains behind. A music master with the official task to register all the organs in the country arrives at the burnt village. There he discovers Elias' prodigy and invites him to an organ challenge in the town where the villagers relocated. Elias performs there and amazes the audience which includes Elsbeth. She is unable to meet with Elias before he is rushed to a waiting carriage. She calls to him and he hears her, but it is too late. Elias is taken on a brief tour by his mentors but soon returns to his spiritual site near the burnt village where he takes his own life (with Peter by his side), having decided to not sleep anymore. Elsbeth later returns there, a widow with a young daughter, hoping to find Elias but instead discovers his spiritual site has disappeared.  Written by Thomas Meyer See less",
        "runtimeMinutes": "127"
    },
    "1996_268": {
        "plotSummary": "Eunice is walking along the highways of northern England from one filling station to another. She is searching for Judith, the woman, she says to be in love with. It's bad luck for the women at the cash desk not to be Judith, because ...See moreEunice is walking along the highways of northern England from one filling station to another. She is searching for Judith, the woman, she says to be in love with. It's bad luck for the women at the cash desk not to be Judith, because Eunice is eccentric, angry and extreme dangerous. One day she meets Miriam, hard of hearing and a little ingenuous, who feels sympathy for Eunice and takes her home. Miriam is very impressed by Eunice's fierceness and willfulness and follows her on the search for Judith. Shocked by Eunice's cruelty she tries to make her a better person, but she looses ground herself.  Written by Robert Stroetgen See less",
        "runtimeMinutes": "88"
    },
    "1996_269": {
        "plotSummary": "A first person narrative of the exploits of a gay serial killer in deeply disturbing, controversial drama about violence, sexuality, and the imagination. Dennis, the main character, whose lead we follow on this path between what is real ...See moreA first person narrative of the exploits of a gay serial killer in deeply disturbing, controversial drama about violence, sexuality, and the imagination. Dennis, the main character, whose lead we follow on this path between what is real and what we can only hope is surreal. His friends attempt to determine if he's truly a psychopath. The story, is told in the form of a succession of ritual-like murders, comes to life through the letters he writes to his sometime lover and best friend Julian and the object of his desire, Julian's younger brother, Kevin. The film is set in an erotic world of sado-masochism and portrays the sexual appetites of a young man for whom killing and engorging the victim become the ultimate thrill.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "88"
    },
    "1996_27": {
        "plotSummary": "Two tabloid reporters checking out a report of the Archangel Michael living with an old woman find that it's true. But that's not the only surprise.",
        "runtimeMinutes": "105"
    },
    "1996_270": {
        "plotSummary": "Carl Panzram is sent to Leavenworth Prison for burglary. While there, he is brutally beaten by a guard. Neophyte guard Henry Lesser feels sympathy for Panzram, befriends him, and gets him to write his life story. Lesser learns that ...See moreCarl Panzram is sent to Leavenworth Prison for burglary. While there, he is brutally beaten by a guard. Neophyte guard Henry Lesser feels sympathy for Panzram, befriends him, and gets him to write his life story. Lesser learns that Panzram's past is much more violent than he thought, but also that he's capable of being a much better person than the rest of the prison staff believes - or so Lesser thinks.  Written by Jon Reeves See less",
        "runtimeMinutes": "91"
    },
    "1996_271": {
        "plotSummary": "While on a train, a teenage boy thinks about his life and the flamboyant aunt whose friendship acted as an emotional shield from his troubled family. This film evokes the haunting quality of memory while creating a heartfelt portrait of a ...See moreWhile on a train, a teenage boy thinks about his life and the flamboyant aunt whose friendship acted as an emotional shield from his troubled family. This film evokes the haunting quality of memory while creating a heartfelt portrait of a boy's life in a rural 1940s Southern town.  Written by Ivana Redwine See less",
        "runtimeMinutes": "91"
    },
    "1996_272": {
        "plotSummary": "While working on a documentary on his old neighborhood, a young film school graduate shifts the focus of his production onto the disappearance of a local resident and the strange characters who are conducting the search to find him.See moreWhile working on a documentary on his old neighborhood, a young film school graduate shifts the focus of his production onto the disappearance of a local resident and the strange characters who are conducting the search to find him.  Written by JD-2 See less",
        "runtimeMinutes": "84"
    },
    "1996_273": {
        "plotSummary": "Chekov's Uncle Vanya, transposed to turn-of-the-century North Wales, where the peace and tranquility of a country house is disturbed by the arrival of the estate's tyrannical owner and his American wife.See moreChekov's Uncle Vanya, transposed to turn-of-the-century North Wales, where the peace and tranquility of a country house is disturbed by the arrival of the estate's tyrannical owner and his American wife.  Written by Jonathan Broxton See less",
        "runtimeMinutes": "94"
    },
    "1996_274": {
        "plotSummary": "The story of a young geisha who falls madly in love with an american captain that travels all around the world collecting hearts.",
        "runtimeMinutes": "135"
    },
    "1996_275": {
        "plotSummary": "Chase Phillips (Dame Helen Mirren), a lifetime resident of Martha's Vineyard, married Richard (Beau Bridges), and like the area, grew into the upper middle class. Her distaste for artificiality leads her to a wild breakdown, and Richard ...See moreChase Phillips (Dame Helen Mirren), a lifetime resident of Martha's Vineyard, married Richard (Beau Bridges), and like the area, grew into the upper middle class. Her distaste for artificiality leads her to a wild breakdown, and Richard dutifully tries to restore their family unit as best he knows how by hiring a \"Mother's Helper\", Elizabeth (Kyra Sedgwick). Chase is broken, and wickedly caustic towards Elizabeth, until they discover each other's similarities. A strong relationship develops, affecting their personal and familial salvation, and destruction.  Written by Lew Jacobs See less",
        "runtimeMinutes": "93"
    },
    "1996_276": {
        "plotSummary": "Romeo & Juliet gets transplanted to the Bronx.",
        "runtimeMinutes": "105"
    },
    "1996_277": {
        "plotSummary": "Individual memories of a group of teenage Holocaust survivors in Israel creates sharp conflicts among them.",
        "runtimeMinutes": "102"
    },
    "1996_278": {
        "plotSummary": "The leader of an inner city girl gang is challenged when a new girl moves into the neighbourhood.",
        "runtimeMinutes": "91"
    },
    "1996_279": {
        "plotSummary": "The childhood, adolescence, and incredible adult years of Al Hirshfeld, celebrated creator of thousands of line drawings of famous people - many in the entertainment industry - over a span of more than sixty years. He is still drawing in ...See moreThe childhood, adolescence, and incredible adult years of Al Hirshfeld, celebrated creator of thousands of line drawings of famous people - many in the entertainment industry - over a span of more than sixty years. He is still drawing in his nineties. His interesting domestic life, political, and cultural views are highlights. In addition, he talks about himself a bit - seriously and lightly.(At one point he he claims that his only form of exercise has been to live in his Manhattan townhouse: stairs). He drives his car around Manhattan - an adventure in itself. Brief interviews with, and reminiscences of many friends and associates.  Written by Eileen Berdon See less",
        "runtimeMinutes": "86"
    },
    "1996_28": {
        "plotSummary": "The last dragon and a disillusioned dragonslaying Knight must cooperate to stop an evil King, who was given partial immortality.",
        "runtimeMinutes": "103"
    },
    "1996_280": {
        "plotSummary": "After getting interested in murder as a kid in Colombia, Gabriela now has a scrapbook on murders including clippings on \"The Blue Blood Killer\". While cleaning his latest murder scene in Miami, she comes across a clue missed by the cops.",
        "runtimeMinutes": "88"
    },
    "1996_281": {
        "plotSummary": "John came to Hollywood to get that one big break in life. Years have passed since and all he has to show for are a menial job, unpaid bills and airhead friends and he's getting sick of it all. Is there a way out of this downward spiral?",
        "runtimeMinutes": "96"
    },
    "1996_282": {
        "plotSummary": "Haunted by his experiences in the Vietnam War, a young man returns home and has trouble adjusting back to civilian life, his family and his stern father.",
        "runtimeMinutes": "123"
    },
    "1996_283": {
        "plotSummary": "Seven teenagers retreat to a country house for the weekend to make their epic, an impossibly ambitious Celtic fantasy. As the making of the video drifts from playful hilarity to argument, frustrated ambition and accusation, intimate ...See moreSeven teenagers retreat to a country house for the weekend to make their epic, an impossibly ambitious Celtic fantasy. As the making of the video drifts from playful hilarity to argument, frustrated ambition and accusation, intimate details seep into the script and the gap between fact and fiction closes, foreshadowing later events. When the group decides to lift the mood with an Acid-inspired initiation, secret dreams and fears are revealed, and pent-up emotions released, with all their youthful intensity and passion.  Written by L.H. Wong See less",
        "runtimeMinutes": "108"
    },
    "1996_284": {
        "plotSummary": "Interviews in the Michael Moore/\"Roger and Me\" tradition examine life in small-town America, class conflicts and the collapse of an upstate New York community, Dadetown, when the town's once-prosperous factory, reduced to the manufacture ...See moreInterviews in the Michael Moore/\"Roger and Me\" tradition examine life in small-town America, class conflicts and the collapse of an upstate New York community, Dadetown, when the town's once-prosperous factory, reduced to the manufacture of paper clips and staples, finally closes. Facing massive unemployment, the blue-collar Dadetown residents next find yuppies moving into town to staff the local division of a big computer outfit.  Written by Bhob Stewart See less",
        "runtimeMinutes": "93"
    },
    "1996_285": {
        "plotSummary": "A documentary crew from the BBC arrives in L.A. intent on interviewing Heidi Fleiss, a year after her arrest for running a brothel but before her trial. Several months elapse before the interview, so the crew searches for anyone who'll ...See moreA documentary crew from the BBC arrives in L.A. intent on interviewing Heidi Fleiss, a year after her arrest for running a brothel but before her trial. Several months elapse before the interview, so the crew searches for anyone who'll talk about the young woman. Two people have a lot to say to the camera: a retired madam named Alex for whom Fleiss once worked and Fleiss's one-time boyfriend, Ivan Nagy, who introduced her to Alex. Alex and Nagy don't like each other, so the crew shuttles between them with \"she said\" and \"he said.\" When they finally interview Fleiss, they spend their time reciting what Alex and Nagy have had to say and asking her reaction.  Written by See less",
        "runtimeMinutes": "106"
    },
    "1996_286": {
        "plotSummary": "Fred Tuttle, faced with his father's impending hip operation and his failing farm, needs to make a six-digit salary with a fourth-grade education. So he runs for U.S. Representative from Vermont with a markedly bizarre campaign. Will he ...See moreFred Tuttle, faced with his father's impending hip operation and his failing farm, needs to make a six-digit salary with a fourth-grade education. So he runs for U.S. Representative from Vermont with a markedly bizarre campaign. Will he triumph over incumbent Bill Blachly?  Written by Ben Guaraldi See less",
        "runtimeMinutes": "89"
    },
    "1996_287": {
        "plotSummary": "A camera follows model Christy Turlington through the spring fashion shows in Milan, Paris, and New York one year in the early 1990s, probably 1992. She and others dash from one designer's unveilings to another. Extended footage looks at ...See moreA camera follows model Christy Turlington through the spring fashion shows in Milan, Paris, and New York one year in the early 1990s, probably 1992. She and others dash from one designer's unveilings to another. Extended footage looks at Versace and Armani in Milan, Galliano, Gaultier, and Langerfeld in Paris, and Isaac Mizrahi in New York. With Kate Moss, Naomi Campbell, and Turlington, we see the nature of friendships among models. With the engaging Mizrahi in particular, there's some exploration of the relationship between designer and models.  Written by See less",
        "runtimeMinutes": "95"
    },
    "1996_288": {
        "plotSummary": "Two old men - a white former radical, and a black retired janitor - strike up an unusual and funny friendship on a park bench in New York, where they deal with family, drug dealers, and the pitfalls of age.",
        "runtimeMinutes": "135"
    },
    "1996_289": {
        "plotSummary": "Chris is young idealistic cop who falls in love and gets married to Pam, a beautiful but emotionally unstable woman who suffers from alcoholism and drug addiction. While Chris is trying hard to have a normal life and some money, Pam is big...See moreChris is young idealistic cop who falls in love and gets married to Pam, a beautiful but emotionally unstable woman who suffers from alcoholism and drug addiction. While Chris is trying hard to have a normal life and some money, Pam is big spender and their marriage is constantly troublesome with the financial situation getting worse and worse. The biggest blow comes after Chris loses his job. In the desperate situation Chris decides to use his police skills to rob banks.  Written by Dragan Antulov See less",
        "runtimeMinutes": "101"
    },
    "1996_29": {
        "plotSummary": "A stripper and single mother gets dragged into a dangerous situation after a congressman takes a fancy to her.",
        "runtimeMinutes": "115"
    },
    "1996_290": {
        "plotSummary": "Michael Reynolds is a rich oncologist who has a one hundred seventy-five thousand dollar sports car, a multi-million dollar house, and a new boost in his career. Brandon \"Blue\" Monroe is a dying patient who kidnaps Reynolds. They are going...See moreMichael Reynolds is a rich oncologist who has a one hundred seventy-five thousand dollar sports car, a multi-million dollar house, and a new boost in his career. Brandon \"Blue\" Monroe is a dying patient who kidnaps Reynolds. They are going to a legendary Navajo healing place while a manhunt closes in. Soon the men get closer in understanding, and to the place that may save them both.  Written by Robert Krzanowski See less",
        "runtimeMinutes": "122"
    },
    "1996_291": {
        "plotSummary": "A dedicated music teacher in East Harlem instructs a gaggle of underprivileged children in the art of the violin. In the climax, they play Carnegie Hall with some of the world's foremost fiddlers.See moreA dedicated music teacher in East Harlem instructs a gaggle of underprivileged children in the art of the violin. In the climax, they play Carnegie Hall with some of the world's foremost fiddlers.  Written by Mike D'Angelo See less",
        "runtimeMinutes": "77"
    },
    "1996_292": {
        "plotSummary": "Chile 1973 is ruled by the dictator Pinochet. The wealthy don't see the violence, terror, executions etc. including Irene. She's engaged to an officer in the fascist military. She meets Francisco who opens her eyes to truth and love.",
        "runtimeMinutes": "105"
    },
    "1996_293": {
        "plotSummary": "Mercedes is a taxi dancer who wants to be an actress. She's involved with the married Harry, who considers himself a respected actor. Ernesto is in love with Mercedes, but he doesn't dance or have money.",
        "runtimeMinutes": "102"
    },
    "1996_294": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "1996_295": {
        "plotSummary": "She's Kathy, a comix cartoonist; he's David, teaching English to new immigrants. It's New York City, with 29 shopping days left until Christmas, and they're in love. Or are they? Their romance has been on-again, off-again because David ...See moreShe's Kathy, a comix cartoonist; he's David, teaching English to new immigrants. It's New York City, with 29 shopping days left until Christmas, and they're in love. Or are they? Their romance has been on-again, off-again because David can't bring himself to say, \"I love you.\" He can say it in French, Russian, Japanese, Chinese, but not English. So, when she learns at an inopportune time that he's applied for a job in Ho Chi Minh City, she asks for breathing room until Christmas; the film chronicles the ensuing days of restless indecision.  Written by See less",
        "runtimeMinutes": "90"
    },
    "1996_296": {
        "plotSummary": "With college graduation pending, the old gang tries to avoid the inevitability of breaking up and going forward with their lives.",
        "runtimeMinutes": "100"
    },
    "1996_297": {
        "plotSummary": "\"A Modern Affair\" is a romantic comedy about the strain of contemporary relationships, one woman's urgent desire for parenthood, and a solution to it all. Grace Rhodes is the perfect corporate executive -- bright, successful, attractive ...See more\"A Modern Affair\" is a romantic comedy about the strain of contemporary relationships, one woman's urgent desire for parenthood, and a solution to it all. Grace Rhodes is the perfect corporate executive -- bright, successful, attractive and with just professional touch. With her career in place, Grace feels she has everything she needs -- until she bumps into an ex-boyfriend bearing photos of his young kids. Feeling the irresistible urge to have a child, but not sure about waiting around for Mr. Right,\" Grace knows what she wants, but not how best to get it. Elaine, her wryly pragmatic best friend, suggests that Grace do the unthinkable and enlist the services of a sperm bank. After choosing a donor from the \"DNA menu,\" Grace becomes pregnant and deeply curious about the identity of the donor #247. Enter Peter Kessler, a handsome photographer who divides his time between his craft, his casual affair with a married woman, and his \"other job:\" depositing specimens as a sperm donor to earn a little extra cash. When Grace and Peter finally meet, they begin the journey down the rocky road to parenthood and possibly from there to love.  Written by Rama See less",
        "runtimeMinutes": "90"
    },
    "1996_298": {
        "plotSummary": "Malmö, Sweden during the Second World War. Stig is a 15 year old pupil on the verge of adulthood. Viola is 37 years old and his teacher. He is attracted by her beauty and maturity. She is drawn to him by his youth and innocence. At the ...See moreMalmö, Sweden during the Second World War. Stig is a 15 year old pupil on the verge of adulthood. Viola is 37 years old and his teacher. He is attracted by her beauty and maturity. She is drawn to him by his youth and innocence. At the same time, Stig becomes friends with Viola's husband Kjell, who teaches him classical music, and the affair continues even after he understands that he has a relationship with his wife. but does nothing to prevent it. But Stig and Viola's passionate and forbidden relationship will have consequences they never could have expected.  Written by Mattias Pettersson See less",
        "runtimeMinutes": "130"
    },
    "1996_299": {
        "plotSummary": "A young writer whose proposal was recently rejected goes to Greenland to spend a year at an outpost for hunting and trapping animals for furs. At the outpost he meets two men who are none too keen to spend the winter with the newcomer.",
        "runtimeMinutes": "118"
    },
    "1996_3": {
        "plotSummary": "An American agent, under false suspicion of disloyalty, must discover and expose the real spy without the help of his organization.",
        "runtimeMinutes": "110"
    },
    "1996_30": {
        "plotSummary": "A lonely and mentally disturbed cable guy raised on television just wants a new friend, but his target, a designer, rejects him, with bad consequences.",
        "runtimeMinutes": "96"
    },
    "1996_300": {
        "plotSummary": "When the television ratings machines suddenly malfunction, public television suddenly, but mistakenly, soars to #1 in this humorous satire.",
        "runtimeMinutes": "97"
    },
    "1996_301": {
        "plotSummary": "Diana, a young Italian-American photographer, returns to the city in which she grew up in order to settle her mother's estate. She had not gotten along well with her mother in recent years. While packing up the house, she meets a close ...See moreDiana, a young Italian-American photographer, returns to the city in which she grew up in order to settle her mother's estate. She had not gotten along well with her mother in recent years. While packing up the house, she meets a close friend of her mother's and grandmother's, who gives her her mother's last gift. As she learns more about her mother's history, Diana comes to terms with their relationship and her own Italian heritage.  Written by James Meek See less",
        "runtimeMinutes": "100"
    },
    "1996_302": {
        "plotSummary": "'Not Bad for a Girl' is a documentary on women musicians of the 1990s from the indie rock music genre, grunge and riot grrrl.",
        "runtimeMinutes": "90"
    },
    "1996_303": {
        "plotSummary": "JC thinks surfing is everything. His girlfriend Chloe wants him to settle down. When he decides to go surfing one night with friends from London, she throws JC out. Surfing or Chloe?",
        "runtimeMinutes": "90"
    },
    "1996_304": {
        "plotSummary": "As a boy, Dominik watched an American crime boss murder his father, a police officer fighting corruption in Sofia, Bulgaria. Years later, he attempts to avenge his father's death but is imprisoned for 15 years for attempted murder. In ...See moreAs a boy, Dominik watched an American crime boss murder his father, a police officer fighting corruption in Sofia, Bulgaria. Years later, he attempts to avenge his father's death but is imprisoned for 15 years for attempted murder. In prison, he meets an American photo-journalist who shares his enemy and his thoughts of revenge. Released from prison, the two hatch a plot which involves the man's recently-arrived daughter.  Written by Murray Chapman See less",
        "runtimeMinutes": "105"
    },
    "1996_305": {
        "plotSummary": "The profile of controversial journalist George Seldes and a piercing examination of America's news media. Narrated by Susan Sarandon, with readings of writings by Ed Asner, this Academy Award-nominated film includes stunning archival ...See moreThe profile of controversial journalist George Seldes and a piercing examination of America's news media. Narrated by Susan Sarandon, with readings of writings by Ed Asner, this Academy Award-nominated film includes stunning archival materials.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "1996_306": {
        "plotSummary": "You've run out of options, no school, no job. Steal a car, smash a shop with a heavy car and reap the proceeds! This movie is about underground England. The causes, the benefits, and the result of a life of 'crash and carry.'",
        "runtimeMinutes": "105"
    },
    "1996_307": {
        "plotSummary": "Two desperate, jealous actors plan to break into a mega-successful Hollywood director's home and steal his latest film, then toss it onto a scrap heap where they can gleefully watch it being destroyed. Chaos ensues.",
        "runtimeMinutes": "83"
    },
    "1996_308": {
        "plotSummary": "A couple of people steal the daughter of a famous lawyer. Now they want money to give her back, but it's not just the money they want. They want revenge.See moreA couple of people steal the daughter of a famous lawyer. Now they want money to give her back, but it's not just the money they want. They want revenge.  Written by Harun Mehmedinovic See less",
        "runtimeMinutes": "85"
    },
    "1996_309": {
        "plotSummary": "Some friends meet each other at a bar in Vegas. After many drinks someone gets shot by his \"friend\". They decide to hide the body in the trunk of their car and drive to L.A. where they can get help disposing of the body. Each person in the...See moreSome friends meet each other at a bar in Vegas. After many drinks someone gets shot by his \"friend\". They decide to hide the body in the trunk of their car and drive to L.A. where they can get help disposing of the body. Each person in the car describes what happened when the guy got shot. Along the way they start to change their minds about this decision. Will they make it or do they get caught ?  Written by AnonymousSee less",
        "runtimeMinutes": "86"
    },
    "1996_31": {
        "plotSummary": "An altar boy is accused of murdering a priest, and the truth is buried several layers deep.",
        "runtimeMinutes": "129"
    },
    "1996_310": {
        "plotSummary": "Set in the harness racing fraternity, this feature drama explores the conflict between urban and rural values and the relationship between an estranged father and son.",
        "runtimeMinutes": "95"
    },
    "1996_311": {
        "plotSummary": "The desert can be a lonely place for the people who live there or for those who are traveling through. It is also the teller of different stories including the story of a traveling salesman whose only commodity is death and the story of a ...See moreThe desert can be a lonely place for the people who live there or for those who are traveling through. It is also the teller of different stories including the story of a traveling salesman whose only commodity is death and the story of a young man who finds that the death that he wishes for is difficult to find. Others are just traveling through, on their way to another place when they stop to eat at Red's Desert Oasis. The food may not be great, and the waitress may be surly, but those who stopped at Red's will find that they are involved in the showdown of their life.  Written by Tony Fontana See less",
        "runtimeMinutes": "97"
    },
    "1996_32": {
        "plotSummary": "Earth is invaded by Martians with unbeatable weapons and a cruel sense of humor.",
        "runtimeMinutes": "106"
    },
    "1996_33": {
        "plotSummary": "A U.S. Army officer, despondent about a deadly mistake he made, investigates a female chopper commander's worthiness for the Medal of Honor.",
        "runtimeMinutes": "116"
    },
    "1996_34": {
        "plotSummary": "An ambitious young woman, determined to build a career in television journalism, gets good advice from her first boss, and they fall in love.",
        "runtimeMinutes": "124"
    },
    "1996_35": {
        "plotSummary": "The lives of two strangers and their young children unexpectedly intersect on one hectic, stressful day in New York City.",
        "runtimeMinutes": "108"
    },
    "1996_36": {
        "plotSummary": "Samantha Caine lives in a small town with her daughter. Eight years ago she emerged, two months pregnant, from a nearby river with no memory of her past or who she is. However, she's getting closer to finding out about her past.",
        "runtimeMinutes": "121"
    },
    "1996_37": {
        "plotSummary": "Our intrepid adolescent heroes wake up to find their beloved television stolen, and embark on an epic journey across America to recover it, and, who knows, maybe even score.",
        "runtimeMinutes": "81"
    },
    "1996_38": {
        "plotSummary": "Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson.",
        "runtimeMinutes": "98"
    },
    "1996_39": {
        "plotSummary": "Two researchers in a green alternative energy project are put on the run when they are framed for murder and treason.",
        "runtimeMinutes": "107"
    },
    "1996_4": {
        "plotSummary": "A mild-mannered chemist and an ex-con must lead the counterstrike when a rogue group of military men, led by a renegade general, threaten a nerve gas attack from Alcatraz against San Francisco.",
        "runtimeMinutes": "136"
    },
    "1996_40": {
        "plotSummary": "Because of an unusual disorder that has aged him four times faster than a typical human being, a boy looks like a 40-year-old man as he starts fifth grade at public school after being homeschooled.",
        "runtimeMinutes": "113"
    },
    "1996_41": {
        "plotSummary": "A group of gentlemen of fortune visits a legendary \"Lost City\", located in Tibet. They plan to steal a priceless statue \"Golden Dragon\" during the martial arts tournament.",
        "runtimeMinutes": "95"
    },
    "1996_42": {
        "plotSummary": "A washed up golf pro working at a driving range tries to qualify for the US Open in order to win the heart of his successful rival's girlfriend.",
        "runtimeMinutes": "135"
    },
    "1996_43": {
        "plotSummary": "After being rescued and brought to an island, a man discovers that its inhabitants are experimental animals being turned into strange-looking humans, all of it the work of a visionary doctor.",
        "runtimeMinutes": "96"
    },
    "1996_44": {
        "plotSummary": "An angel comes to Earth to help a preacher save his church and his family.",
        "runtimeMinutes": "123"
    },
    "1996_45": {
        "plotSummary": "A drifting gunslinger-for-hire finds himself in the middle of an ongoing war between the Irish and Italian mafia in a Prohibition era ghost town.",
        "runtimeMinutes": "101"
    },
    "1996_46": {
        "plotSummary": "Desperation drives four inner-city women to bank robbery in Los Angeles, then they start mistrusting each other.",
        "runtimeMinutes": "123"
    },
    "1996_47": {
        "plotSummary": "A rejected hockey player puts his skills to the golf course to save his grandmother's house.",
        "runtimeMinutes": "92"
    },
    "1996_48": {
        "plotSummary": "A shy, middle-aged professor enters into a romantic but non-physical relationship with an unlucky-in-love colleague.",
        "runtimeMinutes": "126"
    },
    "1996_49": {
        "plotSummary": "A bridge engineer and an experienced old hunter begin a hunt for two lions after they start attacking local construction workers.",
        "runtimeMinutes": "110"
    },
    "1996_5": {
        "plotSummary": "A deformed bell-ringer must assert his independence from a vicious government minister in order to help his friend, a gypsy dancer.",
        "runtimeMinutes": "91"
    },
    "1996_50": {
        "plotSummary": "Sgt. Bilko is a well-liked conman in charge of the army base's motor pool, developing a hover tank and unofficially of gambling etc. One man hates Bilko and he's coming to inspect the base for possible closure.",
        "runtimeMinutes": "93"
    },
    "1996_51": {
        "plotSummary": "Lt. Cmdr. Tom Dodge is assigned as Captain to the USS Stingray, an old diesel driven submarine that has seen better days.",
        "runtimeMinutes": "92"
    },
    "1996_52": {
        "plotSummary": "Pianist David Helfgott, driven by his father and teachers, has a breakdown. Years later he returns to the piano, to popular if not critical acclaim.",
        "runtimeMinutes": "105"
    },
    "1996_53": {
        "plotSummary": "An observable, fast-talking party man Darnell Wright, gets his punishment when one of his conquests takes it personally and comes back for revenge in this 'Fatal Attraction'-esque comic thriller.See moreAn observable, fast-talking party man Darnell Wright, gets his punishment when one of his conquests takes it personally and comes back for revenge in this 'Fatal Attraction'-esque comic thriller.  Written by AnonymousSee less",
        "runtimeMinutes": "108"
    },
    "1996_54": {
        "plotSummary": "A successful veternarian & radio show host with low self-esteem asks her model friend to impersonate her when a handsome man wants to see her.",
        "runtimeMinutes": "97"
    },
    "1996_55": {
        "plotSummary": "A local Pennsylvania band scores a one hit wonder in 1964 and rides the star-making machinery as long as they can, with lots of help from its manager.",
        "runtimeMinutes": "108"
    },
    "1996_56": {
        "plotSummary": "The Muppets' twist on the classic tale.",
        "runtimeMinutes": "99"
    },
    "1996_57": {
        "plotSummary": "Story of a wonderful little girl, who happens to be a genius, and her wonderful teacher vs. the worst parents ever and the worst school principal imaginable.",
        "runtimeMinutes": "98"
    },
    "1996_58": {
        "plotSummary": "When adventurous pets Chance, Shadow and Sassy are accidentally separated from their vacationing owners, they're left to fend for themselves on the mean streets of San Francisco, in search for the \"golden bridge\" that will take them home.",
        "runtimeMinutes": "88"
    },
    "1996_59": {
        "plotSummary": "A gubernatorial candidate hires a wormy special assistant whose only job is to make sure the candidate's well-meaning but incompetent brother doesn't ruin the election.",
        "runtimeMinutes": "87"
    },
    "1996_6": {
        "plotSummary": "An evil high-fashion designer plots to steal Dalmatian puppies in order to make an extravagant fur coat, but instead creates an extravagant mess.",
        "runtimeMinutes": "103"
    },
    "1996_60": {
        "plotSummary": "A young man visiting and helping his uncle in New York City finds himself forced to fight a street gang and the mob with his martial art skills.",
        "runtimeMinutes": "104"
    },
    "1996_61": {
        "plotSummary": "Coincidences lead to the New York Knicks, getting its loudest fan, Edwina \"Eddie\" Franklin (Whoopi Goldberg), as coach. Season victory?",
        "runtimeMinutes": "100"
    },
    "1996_62": {
        "plotSummary": "After a tragic car accident that kills his wife, a man discovers he can communicate with the dead to con people. However, when a demonic spirit appears, he may be the only one who can stop it from killing the living and the dead.",
        "runtimeMinutes": "110"
    },
    "1996_63": {
        "plotSummary": "An orphan who lives with his two cruel aunts befriends anthropomorphic bugs who live inside a giant peach, and they embark on a journey to New York City.",
        "runtimeMinutes": "79"
    },
    "1996_64": {
        "plotSummary": "Romantic drama about a young career girl who is swept off her feet by a shy florist, who fell in love with her after one glimpse through a shadowy window.See moreRomantic drama about a young career girl who is swept off her feet by a shy florist, who fell in love with her after one glimpse through a shadowy window.  Written by Jonathan Broxton See less",
        "runtimeMinutes": "87"
    },
    "1996_65": {
        "plotSummary": "Dick Steele, Agent WD-40 is assigned by his Director, to stop the evil General Rancor from destroying the world. WD-40 believed Rancor was dead and he teams up with the hot K.G.B. Agent Veronique Ukrinsky to find Rancor and save the world.",
        "runtimeMinutes": "81"
    },
    "1996_66": {
        "plotSummary": "When the courts fail to keep behind bars the man who raped and murdered her daughter, a woman seeks her own form of justice.",
        "runtimeMinutes": "101"
    },
    "1996_67": {
        "plotSummary": "Harriet M. Welsch is a spy. But when her friends find her secret notebook the tables are turned on her. Can she win her friends back and still keep on going with the spy business?",
        "runtimeMinutes": "100"
    },
    "1996_68": {
        "plotSummary": "A former boxer turned Secret Service agent is assigned to protect the President's son, who seems determined to make life difficult for his new protector.",
        "runtimeMinutes": "101"
    },
    "1996_69": {
        "plotSummary": "Two criminals and their hostages unknowingly seek temporary refuge in a truck stop populated by vampires, with chaotic results.",
        "runtimeMinutes": "108"
    },
    "1996_7": {
        "plotSummary": "Multi-millionaire Tom Mullen's son is kidnapped, but after initially agreeing to pay the ransom Mullen then decides to use the ransom money as a bounty.",
        "runtimeMinutes": "121"
    },
    "1996_70": {
        "plotSummary": "Snake Plissken is once again called in by the United States government to recover a potential doomsday device from Los Angeles, now an autonomous island where undesirables are deported.",
        "runtimeMinutes": "101"
    },
    "1996_71": {
        "plotSummary": "A bitter love story between a talented writer and a gentle nurse.",
        "runtimeMinutes": "113"
    },
    "1996_72": {
        "plotSummary": "A father and daughter decide to attempt to lead a flock of orphaned Canada Geese south by air.",
        "runtimeMinutes": "107"
    },
    "1996_73": {
        "plotSummary": "A star bowler whose career was prematurely \"cut off\" hopes to ride a new prodigy to success and riches.",
        "runtimeMinutes": "114"
    },
    "1996_74": {
        "plotSummary": "A newcomer to a Catholic prep high school falls in with a trio of outcast teenage girls who practice witchcraft, and they all soon conjure up various spells and curses against those who anger them.",
        "runtimeMinutes": "101"
    },
    "1996_75": {
        "plotSummary": "Karl Childers, a simple man hospitalized since his childhood murder of his mother and her lover, is released to start a new life in a small town.",
        "runtimeMinutes": "135"
    },
    "1996_76": {
        "plotSummary": "The unruly team of hockey misfits grows up a bit and receives scholarships to a prestigious prep school, where they take on the snotty varsity team.",
        "runtimeMinutes": "104"
    },
    "1996_77": {
        "plotSummary": "A juror in a Mafia trial is forced to convince the other jurors to vote not guilty by an obsessive mob enforcer.",
        "runtimeMinutes": "118"
    },
    "1996_78": {
        "plotSummary": "Two criminals, Keats and Moses, end their friendship, when Keats turns out to be an undercover cop. Many years later, the two are forced to work together when Keats is assigned to protect Moses as a witness.",
        "runtimeMinutes": "84"
    },
    "1996_79": {
        "plotSummary": "A young man fresh out of law school tries to win a reprieve for his racist grandfather who is on death row.",
        "runtimeMinutes": "113"
    },
    "1996_8": {
        "plotSummary": "Grossly overweight yet good-hearted professor Sherman Klump takes a special chemical that turns him into the slim but obnoxious Buddy Love.",
        "runtimeMinutes": "95"
    },
    "1996_80": {
        "plotSummary": "Two former U. S. Presidents, hated rivals, join forces to expose the current, corrupt President at the risk of their lives.",
        "runtimeMinutes": "101"
    },
    "1996_81": {
        "plotSummary": "While matchmaking for friends and neighbours, a young 19th Century Englishwoman nearly misses her own chance at love.",
        "runtimeMinutes": "120"
    },
    "1996_82": {
        "plotSummary": "The Bradys are surprised when a man claiming to be Carol's long lost first husband shows up at their home. Before long, his strange actions cause them to question his motives.",
        "runtimeMinutes": "90"
    },
    "1996_83": {
        "plotSummary": "Richard Clark has just left the well-known Wellington Academy to teach at Marion Barry High School. Now, he will try to inspire the D-average students into making good grades and try to woo a fellow teacher.",
        "runtimeMinutes": "86"
    },
    "1996_84": {
        "plotSummary": "A man who never has enough time for the things he wants to do is offered the opportunity to have himself duplicated.",
        "runtimeMinutes": "117"
    },
    "1996_85": {
        "plotSummary": "A lost and alone kitten joins a gang of dogs engaged in petty larceny in New York City.",
        "runtimeMinutes": "74"
    },
    "1996_86": {
        "plotSummary": "When Nicole met David; handsome, charming, affectionate, he was everything. It seemed perfect, but soon she sees that David has a darker side. And his adoration turns to obsession, their dream into a nightmare, and her love into fear.",
        "runtimeMinutes": "97"
    },
    "1996_87": {
        "plotSummary": "Two cops are forced to work together to solve a chain of mysterious killings by a killer nicknamed \"The Family Man\".",
        "runtimeMinutes": "91"
    },
    "1996_88": {
        "plotSummary": "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.",
        "runtimeMinutes": "111"
    },
    "1996_89": {
        "plotSummary": "The story of controversial pornography publisher Larry Flynt, and how he became a defender of free speech.",
        "runtimeMinutes": "130"
    },
    "1996_9": {
        "plotSummary": "When a sports agent has a moral epiphany and is fired for expressing it, he decides to put his new philosophy to the test as an independent agent with the only athlete who stays with him and his former colleague.",
        "runtimeMinutes": "139"
    },
    "1996_90": {
        "plotSummary": "A parody of several U.S. films about being in the 'Hood', for instance Boyz n the Hood, South Central, Menace II Society, Higher Learning and Juice.",
        "runtimeMinutes": "89"
    },
    "1996_91": {
        "plotSummary": "A teenage boy sent to spend the summer with his eccentric uncle on the Florida coast befriends a remarkable dolphin and takes on local bad guys who are polluting the water.",
        "runtimeMinutes": "95"
    },
    "1996_92": {
        "plotSummary": "A neurotic, twice-divorced sci-fi writer moves back in with his mother to solve his personal problems.",
        "runtimeMinutes": "104"
    },
    "1996_93": {
        "plotSummary": "A troubled kid inadvertently releases a genie, who must grant him any three wishes he requests.",
        "runtimeMinutes": "93"
    },
    "1996_94": {
        "plotSummary": "An all star baseball player becomes the unhealthy focus of a down on his luck salesman.",
        "runtimeMinutes": "116"
    },
    "1996_95": {
        "plotSummary": "The spirit of the Crow resurrects another man seeking revenge for the murder of his son.",
        "runtimeMinutes": "84"
    },
    "1996_96": {
        "plotSummary": "A young doctor confronts a famous colleague; when he learns about the true methods of his work.",
        "runtimeMinutes": "118"
    },
    "1996_97": {
        "plotSummary": "The Phantom, descendent of a line of African superheroes, travels to New York City to thwart a wealthy criminal genius from obtaining three magic skulls which would give him the secret to ultimate power.",
        "runtimeMinutes": "100"
    },
    "1996_98": {
        "plotSummary": "Two prisoners chained together flee during an escape attempt gone bad.",
        "runtimeMinutes": "98"
    },
    "1996_99": {
        "plotSummary": "The wife and mistress of the sadistic dean of an exclusive prep school conspire to murder him.",
        "runtimeMinutes": "107"
    }
}