{
    "1997_1": {
        "plotSummary": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.",
        "runtimeMinutes": "194"
    },
    "1997_10": {
        "plotSummary": "Six unemployed steel workers form a male striptease act. The women cheer them on to go for \"the full monty\" - total nudity.",
        "runtimeMinutes": "91"
    },
    "1997_100": {
        "plotSummary": "Fred Z. Randall is a geeky spacecraft designer who gets the chance to make his dream come true and travel to Mars.",
        "runtimeMinutes": "95"
    },
    "1997_101": {
        "plotSummary": "What did little Eve see--and how will it haunt her? Husband, father and womanizer Louis Batiste is the head of an affluent family, but it's the women who rule this gothic world of secrets, lies and mystic forces.",
        "runtimeMinutes": "109"
    },
    "1997_102": {
        "plotSummary": "A college athlete returns from the dead to help his brother's basketball team win the NCAA title.",
        "runtimeMinutes": "107"
    },
    "1997_103": {
        "plotSummary": "An actor poses as a lawyer to help his sick friend, and problems develop.",
        "runtimeMinutes": "98"
    },
    "1997_104": {
        "plotSummary": "A bratty teenager fakes her own kidnapping, but gets mistakenly kidnapped for real instead.",
        "runtimeMinutes": "101"
    },
    "1997_105": {
        "plotSummary": "In 1917, two children take a photograph, which is soon believed by some to be the first scientific evidence of the existence of fairies.",
        "runtimeMinutes": "99"
    },
    "1997_106": {
        "plotSummary": "A playboy gets the tables turned on him when a party is arranged with all of the women he has been two-timing are in attendance.",
        "runtimeMinutes": "93"
    },
    "1997_107": {
        "plotSummary": "Wallace Ritchie is mistaken for a spy and must stop a plot to assassinate international leaders at a banquet.",
        "runtimeMinutes": "94"
    },
    "1997_108": {
        "plotSummary": "An impoverished woman who has been forced to choose between a privileged life with her wealthy aunt and her journalist lover, befriends an American heiress. When she discovers the heiress is attracted to her own lover and is dying, she ...See moreAn impoverished woman who has been forced to choose between a privileged life with her wealthy aunt and her journalist lover, befriends an American heiress. When she discovers the heiress is attracted to her own lover and is dying, she sees a chance to have both the privileged life she cannot give up and the lover she cannot live without.See less",
        "runtimeMinutes": "102"
    },
    "1997_109": {
        "plotSummary": "A dramatization of a 1923 horrific racist lynch mob attack on an African-American community.",
        "runtimeMinutes": "140"
    },
    "1997_11": {
        "plotSummary": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.",
        "runtimeMinutes": "121"
    },
    "1997_110": {
        "plotSummary": "Darius Lovehall is a young black poet in Chicago who starts dating Nina Mosley, a beautiful and talented photographer. While trying to figure out if they've got a \"love thing\" or are just \"kicking it,\" they hang out with their friend, ...See moreDarius Lovehall is a young black poet in Chicago who starts dating Nina Mosley, a beautiful and talented photographer. While trying to figure out if they've got a \"love thing\" or are just \"kicking it,\" they hang out with their friend, talking about love and sex. Then Nina tests the strength of Darius' feelings and sets a chain of romantic complications into motion.  Written by Jesse Garon See less",
        "runtimeMinutes": "104"
    },
    "1997_111": {
        "plotSummary": "A genetically inferior man assumes the identity of a superior one in order to pursue his lifelong dream of space travel.",
        "runtimeMinutes": "106"
    },
    "1997_112": {
        "plotSummary": "Holden and Banky are comic book artists. Everything's going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's a lesbian.",
        "runtimeMinutes": "113"
    },
    "1997_113": {
        "plotSummary": "A Marine on death row is recruited by a shadowy U.S. military officer as part of a top-secret ops team, then gets framed for murder when the team and its officer set him up as the fall guy for the assassination of the First Lady.",
        "runtimeMinutes": "99"
    },
    "1997_114": {
        "plotSummary": "After a shootout on a flight transporting prisoners, a flight attendant must outwit a smooth-talking serial killer and land the plane herself.",
        "runtimeMinutes": "100"
    },
    "1997_115": {
        "plotSummary": "A New York City cosmetologist, mistakenly thought to be a science teacher, is offered a job to teach the children of an Eastern European dictator.",
        "runtimeMinutes": "105"
    },
    "1997_116": {
        "plotSummary": "An international spy teams up with an arms dealer to escape from a penal colony and rescue his family from a terrorist.",
        "runtimeMinutes": "93"
    },
    "1997_117": {
        "plotSummary": "The several misadventures and life-lessons learned by 8-year-old Theodore \"Beaver\" Cleaver in an entertaining and hilarious tale of a small-town Ohio family and the daily trials and tribunes of life.",
        "runtimeMinutes": "84"
    },
    "1997_118": {
        "plotSummary": "Suffering from writer's block and eagerly awaiting his writing award, Harry Block remembers events from his past and scenes from his best-selling books as characters, real and fictional, come back to haunt him.",
        "runtimeMinutes": "96"
    },
    "1997_119": {
        "plotSummary": "A disgruntled security guard holds a school trip group hostage, while a news reporter forms a bond with him.",
        "runtimeMinutes": "114"
    },
    "1997_12": {
        "plotSummary": "The son of Zeus and Hera is stripped of his immortality as an infant and must become a true hero in order to reclaim it.",
        "runtimeMinutes": "93"
    },
    "1997_120": {
        "plotSummary": "Jackie is hired to help the UN find Nazi gold hidden in Sahara. He's accompanied from Spain by 2 (later 3) cute women. As there are others wanting the gold, lots of kung fu fighting and comedy follows.",
        "runtimeMinutes": "106"
    },
    "1997_121": {
        "plotSummary": "An eccentric socialite raises a gorilla as her son.",
        "runtimeMinutes": "84"
    },
    "1997_122": {
        "plotSummary": "A newly elected District Attorney finds himself in the middle of a police corruption investigation that may involve his father and his partner.",
        "runtimeMinutes": "113"
    },
    "1997_123": {
        "plotSummary": "A space alien is threatening to bring destruction on Earth, and the Power Rangers are enhanced with turbo powers in order to prevent his plan.",
        "runtimeMinutes": "99"
    },
    "1997_124": {
        "plotSummary": "A successful but unhappy Japanese accountant finds the missing passion in his life when he begins to secretly take ballroom dance lessons.",
        "runtimeMinutes": "136"
    },
    "1997_125": {
        "plotSummary": "Zookeepers struggle to deal with the policies of changing directors.",
        "runtimeMinutes": "93"
    },
    "1997_126": {
        "plotSummary": "When Queen Victoria's husband Prince Albert dies, she finds solace in her trusted servant, Mr. John Brown, but their relationship also brings scandal and turmoil.",
        "runtimeMinutes": "101"
    },
    "1997_127": {
        "plotSummary": "A reclusive beekeeper slowly pulls his dysfunctional family back together, but not without having to fight his son's previous dastardly cohorts.",
        "runtimeMinutes": "113"
    },
    "1997_128": {
        "plotSummary": "A bumbling fairy godfather tries to grant a girl's wish that her cabby father lands a Broadway role.",
        "runtimeMinutes": "89"
    },
    "1997_129": {
        "plotSummary": "In suburban New Canaan, Connecticut, 1973, middle class families experimenting with casual sex and substance abuse find their lives beyond their control.",
        "runtimeMinutes": "112"
    },
    "1997_13": {
        "plotSummary": "The bumbling Mr. Bean travels to America when he is given the responsibility of bringing a highly valuable painting to a Los Angeles museum.",
        "runtimeMinutes": "89"
    },
    "1997_130": {
        "plotSummary": "\"King Lear\" set on a farm in Iowa.",
        "runtimeMinutes": "105"
    },
    "1997_131": {
        "plotSummary": "Two pairs of best friends - Montel & Clyde and Brandy & Adina meet at the party, where Clyde makes Adina think he is very rich and gets her into bed the same evening. When Adina finds out that she's been fooled, she becomes Clyde's worst ...See moreTwo pairs of best friends - Montel & Clyde and Brandy & Adina meet at the party, where Clyde makes Adina think he is very rich and gets her into bed the same evening. When Adina finds out that she's been fooled, she becomes Clyde's worst enemy. Meanwhile Montel and Brandy fall in love and plan to marry, and Adina and Clyde try to do everything to stop them.  Written by AnonymousSee less",
        "runtimeMinutes": "105"
    },
    "1997_132": {
        "plotSummary": "Three brothers who are obsessed with animals are given permission from their parents to travel around America with a camera documenting wildlife.",
        "runtimeMinutes": "106"
    },
    "1997_133": {
        "plotSummary": "Two tacky homegirls move to L.A. to become dancers; instead they scam a dying millionaire but eventually become B*A*P*S (Black American Princesses).",
        "runtimeMinutes": "91"
    },
    "1997_134": {
        "plotSummary": "After being released from a psychiatric institution, a man tries to redeem himself in the eyes of his now-ex wife from the events that led up to his incarceration.",
        "runtimeMinutes": "100"
    },
    "1997_135": {
        "plotSummary": "A touching friendship story between a dog and a dolphin.",
        "runtimeMinutes": "98"
    },
    "1997_136": {
        "plotSummary": "A man heading to Vegas to pay off his gambling debt before the Russian mafia kills him is forced to stop in an Arizona town where everything that can go wrong does go wrong.",
        "runtimeMinutes": "125"
    },
    "1997_137": {
        "plotSummary": "A young boy is whisked away to the mythical land of Tao where he becomes the center of a conflict between an evil lord and a group of animal warriors.",
        "runtimeMinutes": "101"
    },
    "1997_138": {
        "plotSummary": "An FBI agent tries to catch a serial killer who kidnapped his son.",
        "runtimeMinutes": "118"
    },
    "1997_139": {
        "plotSummary": "A barbarian warrior becomes a king when he defeats a king in armed combat and the king's heir conspire to overthrow him and reclaim the throne by resurrecting an evil sorceress.",
        "runtimeMinutes": "95"
    },
    "1997_14": {
        "plotSummary": "In order to foil a terrorist plot, an FBI agent undergoes facial transplant surgery and assumes the identity of a criminal mastermind, who murdered his only son. The plan turns sour when the criminal wakes up prematurely and seeks revenge.",
        "runtimeMinutes": "138"
    },
    "1997_140": {
        "plotSummary": "Two working class brothers court three wealthy and beautiful sisters in a small Illinois town.",
        "runtimeMinutes": "110"
    },
    "1997_141": {
        "plotSummary": "After murdering an undercover DEA agent, two corrupt cops scramble to cover up what they've done.",
        "runtimeMinutes": "116"
    },
    "1997_142": {
        "plotSummary": "A confirmed bachelor is in for the surprise of his life when a get-rich-quick scheme backfires - setting off a wild set of circumstances - and leaving him with a pint-sized new roommate.",
        "runtimeMinutes": "105"
    },
    "1997_143": {
        "plotSummary": "15 months after being stabbed 9 times by a student at work as a high school teacher in NYC, Mr. Garfield is working in LA as a substitute teacher come full-time. He refuses to be a victim anymore.",
        "runtimeMinutes": "119"
    },
    "1997_144": {
        "plotSummary": "From childhood to adulthood, Tibet's fourteenth Dalai Lama deals with Chinese oppression and other problems.",
        "runtimeMinutes": "134"
    },
    "1997_145": {
        "plotSummary": "Two friends try to kick their drug addiction after a friend dies from an overdose, when they try to enroll in a detox program, things quickly go wrong.",
        "runtimeMinutes": "91"
    },
    "1997_146": {
        "plotSummary": "Vusi Madlazi returns to the South African village he left as a young boy (he was organizing against apartheid, and left in fear of his life) to bury his father. He meets up with his brother Ernest, who tells him their other brother Stephen...See moreVusi Madlazi returns to the South African village he left as a young boy (he was organizing against apartheid, and left in fear of his life) to bury his father. He meets up with his brother Ernest, who tells him their other brother Stephen couldn't be contacted. Vusi goes to Johannesburg to find him, but at first can only find his neighbor/girlfriend, Karin, a stripper. Vusi proceeds to learn how conditions have changed since the end of apartheid, not always for the better for black men.  Written by Jon Reeves See less",
        "runtimeMinutes": "95"
    },
    "1997_147": {
        "plotSummary": "Ever wanted to know what guys say when they get together? This light- hearted comedy explores the male world through an amateur hockey team. Every male stereotype is analyzed, comically of course.See moreEver wanted to know what guys say when they get together? This light- hearted comedy explores the male world through an amateur hockey team. Every male stereotype is analyzed, comically of course.  Written by Steve Richer See less",
        "runtimeMinutes": "107"
    },
    "1997_148": {
        "plotSummary": "The former World War II Naval captain of PT-73 - now a fun-loving black marketeer - reunites with his crew to battle a bumbling Russian terrorist. Based on the hit 1960s television show.",
        "runtimeMinutes": "108"
    },
    "1997_149": {
        "plotSummary": "Upon being fired, a desperate guy kidnaps a daughter of his former boss. Two angels are sent to Earth to check if love is possible in this case.",
        "runtimeMinutes": "103"
    },
    "1997_15": {
        "plotSummary": "Batman and Robin try to keep their relationship together even as they must stop Mr. Freeze and Poison Ivy from freezing Gotham City.",
        "runtimeMinutes": "125"
    },
    "1997_150": {
        "plotSummary": "A disgraced surgeon leaves his former life and reinvents himself as a gunshot doctor in the criminal underworld.",
        "runtimeMinutes": "94"
    },
    "1997_151": {
        "plotSummary": "Two female friends become sexual rivals at maturity.",
        "runtimeMinutes": "117"
    },
    "1997_152": {
        "plotSummary": "Wally Sparks is a tabloid television show reporter, who's trying to boost ratings on his show. He goes to the Governor's mansion to uncover a sex scandal.",
        "runtimeMinutes": "105"
    },
    "1997_153": {
        "plotSummary": "Anonymous videotapes presage a musician's murder conviction; a gangster's girlfriend leads a mechanic astray.",
        "runtimeMinutes": "134"
    },
    "1997_154": {
        "plotSummary": "A mob bagman finds that his luggage, containing the proof of his gang's latest hit, has been switched.",
        "runtimeMinutes": "95"
    },
    "1997_155": {
        "plotSummary": "A Miami con man agrees to be the human target for a Neo-Nazi manhunter, in order to collect $50,000 if he survives.",
        "runtimeMinutes": "84"
    },
    "1997_156": {
        "plotSummary": "Danny, an ambitious singing and dancing cat, goes to Hollywood and overcomes several obstacles to fulfill his dream of becoming a movie star.",
        "runtimeMinutes": "75"
    },
    "1997_157": {
        "plotSummary": "Two strangers, whose paths are always crossing, finally meet when fate steps in.",
        "runtimeMinutes": "113"
    },
    "1997_158": {
        "plotSummary": "16-year-old Jesse and old friend Randolph try to foil an illegal whaler threatening Willy and his pregnant mate.",
        "runtimeMinutes": "86"
    },
    "1997_159": {
        "plotSummary": "Marcy is an assistant to Senator John McGlory, who is having problems with a re-election campaign. Desperate for Irish votes, McGlory's chief of staff Nick sends Marcy to Ireland to trace McGlory's relatives or ancestors. Marcy arrives at ...See moreMarcy is an assistant to Senator John McGlory, who is having problems with a re-election campaign. Desperate for Irish votes, McGlory's chief of staff Nick sends Marcy to Ireland to trace McGlory's relatives or ancestors. Marcy arrives at the village of Ballinagra when it is preparing for an annual Matchmaking Festival. A well-dressed, handsome and single young lady, she becomes the center of attention for two professional matchmakers, Dermot and Millie, as well as for bartender Sean.  Written by AnonymousSee less",
        "runtimeMinutes": "97"
    },
    "1997_16": {
        "plotSummary": "Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.",
        "runtimeMinutes": "126"
    },
    "1997_160": {
        "plotSummary": "Greg Kinnear plays a carriage-shy husband in a romantic comedy about a couple trying to conceive a child.",
        "runtimeMinutes": "98"
    },
    "1997_161": {
        "plotSummary": "A bus crash in a small town brings a lawyer to the town to defend the families, but he discovers that everything is not what it seems.",
        "runtimeMinutes": "112"
    },
    "1997_162": {
        "plotSummary": "Gregory invites seven friends to spend the summer at his large, secluded 19th-century home in upstate New York. The seven are: Bobby, Gregory's \"significant other,\" who is blind but who loves to explore the home's garden using his sense of...See moreGregory invites seven friends to spend the summer at his large, secluded 19th-century home in upstate New York. The seven are: Bobby, Gregory's \"significant other,\" who is blind but who loves to explore the home's garden using his sense of touch; Art and Perry, two \"yuppies\" who drive a Volvo and who celebrate their 14th anniversary together that summer; John, a dour expatriate Briton who loathes his twin brother James; Ramon, John's \"companion,\" who is physically attracted to Bobby and immediately tries to seduce the blind man; James, a cheerful soul who is in the advanced stages of AIDS; and Buzz, a fan of traditional Broadway musicals who is dealing with his own HIV-positive status.  Written by Dennis Lewis See less",
        "runtimeMinutes": "108"
    },
    "1997_163": {
        "plotSummary": "An aspiring director and the marginally talented amateur cast of a hokey small-town Missouri musical production go overboard when they learn that someone from Broadway will be in attendance.",
        "runtimeMinutes": "84"
    },
    "1997_164": {
        "plotSummary": "Two business executives--one an avowed misogynist, the other recently emotionally wounded by his love interest--set out to exact revenge on the female gender by seeking out the most innocent, uncorrupted girl they can find and ruining her life.",
        "runtimeMinutes": "97"
    },
    "1997_165": {
        "plotSummary": "Max/W.Snipes has a one night stand with Karen/N.Kinski in NYC. He returns to his wife, 2 kids and career in LA but is affected. A year later, Max and Karen meet again by chance, but this time they're with their spouses.",
        "runtimeMinutes": "102"
    },
    "1997_166": {
        "plotSummary": "The coal mine in a northern English village may be closing, which would also mean the end of the miners' brass band.",
        "runtimeMinutes": "108"
    },
    "1997_167": {
        "plotSummary": "A handyman with marital problems meets a housewife with the same.",
        "runtimeMinutes": "119"
    },
    "1997_168": {
        "plotSummary": "2 young women reunite and rekindle their friendship after having said goodbye at their college graduation, six years earlier.",
        "runtimeMinutes": "83"
    },
    "1997_169": {
        "plotSummary": "A 6 y.o. Inuit boy runs off a snowy roof in Copenhagen and dies. Smilla, a half Inuit who lives in the building and knows the boy, looks into it. What makes an acrophobic boy run up on the roof? The clues take her to Greenland.",
        "runtimeMinutes": "121"
    },
    "1997_17": {
        "plotSummary": "Newly paroled ex-con and former U.S. Ranger Cameron Poe finds himself trapped in a prisoner transport plane when the passengers seize control.",
        "runtimeMinutes": "115"
    },
    "1997_170": {
        "plotSummary": "A woman with a body writing fetish seeks to find a combined lover and calligrapher.",
        "runtimeMinutes": "126"
    },
    "1997_171": {
        "plotSummary": "Bishop, trusted advisor to the president, has shots fired at him when Pachenko comes to him about a traitor in highest level of government. He gets away from the cold blooded assassin twice. Will he find the traitor before getting killed?",
        "runtimeMinutes": "103"
    },
    "1997_172": {
        "plotSummary": "So nice we had to do it twice, grab your skis and come along on a true ski adventure in Warren Miller's Snowriders 2. Join extreme skiers and riders like Caleb Martin, Chris Davenport, Amy Wheeler, Justin Patnode, and loads more ski and ...See moreSo nice we had to do it twice, grab your skis and come along on a true ski adventure in Warren Miller's Snowriders 2. Join extreme skiers and riders like Caleb Martin, Chris Davenport, Amy Wheeler, Justin Patnode, and loads more ski and attempt what we can all only dream of. Follow along as they travel from British Columbia way down under to New Zealand and even to Kazakhstan and find out just what is so addicting about riding on snow.See less",
        "runtimeMinutes": "95"
    },
    "1997_173": {
        "plotSummary": "Ludovic is an innocent seven-year-old child who provokes horror in his community when he dresses in girls clothes and insists he's a girl.",
        "runtimeMinutes": "88"
    },
    "1997_174": {
        "plotSummary": "When she discovers a love letter written to her husband by an unknown paramour, the distraught Eliza turns to her tight-knit Long Island family for advice.",
        "runtimeMinutes": "87"
    },
    "1997_175": {
        "plotSummary": "A group of women who are imprisoned on the island of Sumatra by the Japanese during World War II use music as relieve their misery.",
        "runtimeMinutes": "122"
    },
    "1997_176": {
        "plotSummary": "Trapped in a school in which a gang of criminals has siezed control, a young troublemaker fights a cat and mouse battle from inside.",
        "runtimeMinutes": "106"
    },
    "1997_177": {
        "plotSummary": "Warren has an extra room in his apartment (and is five months behind on the rent) after his lover moves out, so a friend places an ad on his behalf for a GWM roommate. Frankie, a pizza baker (and aspiring actor), decides to move out of his...See moreWarren has an extra room in his apartment (and is five months behind on the rent) after his lover moves out, so a friend places an ad on his behalf for a GWM roommate. Frankie, a pizza baker (and aspiring actor), decides to move out of his family's flat in The Bronx when he comes home one evening and walks in on his brother making love to Frankie's girlfriend. Frankie checks ads for roommates in \"the city\" (i.e., Manhattan), notices Warren's ad and decides to answer it, reasoning that GWM stands for \"Guy With Money.\"  Written by Dennis Lewis See less",
        "runtimeMinutes": "86"
    },
    "1997_178": {
        "plotSummary": "Catherine Sloper (Jennifer Jason Leigh) has found the man of her dreams in Morris Townsend (Ben Chaplin), but her plans to marry him are strongly opposed by her father, Dr. Austin Sloper (Albert Finney), who believes Townsend is only ...See moreCatherine Sloper (Jennifer Jason Leigh) has found the man of her dreams in Morris Townsend (Ben Chaplin), but her plans to marry him are strongly opposed by her father, Dr. Austin Sloper (Albert Finney), who believes Townsend is only interested in his daughter for her money. But Catherine is determined to follow her heart, even if she loses her inheritance in the process. But just what are Townsend's intentions?  Written by Mike Myers See less",
        "runtimeMinutes": "115"
    },
    "1997_179": {
        "plotSummary": "A scientist for the military turns himself into a cartoon-like superhero when a version of one of his own weapons is being used against enemies.",
        "runtimeMinutes": "97"
    },
    "1997_18": {
        "plotSummary": "A vulcanologist arrives at a countryside town recently named the second most desirable place to live in America, and discovers that the long dormant volcano, Dante's Peak, may wake up at any moment.",
        "runtimeMinutes": "108"
    },
    "1997_180": {
        "plotSummary": "A study in the world of hip-hop, done mostly with interviews, in order to see why it is as popular as it is today and what the future holds.",
        "runtimeMinutes": "90"
    },
    "1997_181": {
        "plotSummary": "A retired thief swears revenge on the lunatic who murdered his brother and partner, while going on the run with the loot they stole.",
        "runtimeMinutes": "97"
    },
    "1997_182": {
        "plotSummary": "Chloe, a young woman, is going on holidays. She entrusts her beloved cat to Madame Renee's care. But one day Madame Renee (an old lady of the neighborhood) can not find the cat. Chloe starts searching the neighborhood... This is the ...See moreChloe, a young woman, is going on holidays. She entrusts her beloved cat to Madame Renee's care. But one day Madame Renee (an old lady of the neighborhood) can not find the cat. Chloe starts searching the neighborhood... This is the pretext for the exploration of a quarter of Paris and his inhabitants.  Written by YepokSee less",
        "runtimeMinutes": "91"
    },
    "1997_183": {
        "plotSummary": "A four-year-old girl tries to come to terms with the sudden death of her mother.",
        "runtimeMinutes": "97"
    },
    "1997_184": {
        "plotSummary": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
        "runtimeMinutes": "175"
    },
    "1997_185": {
        "plotSummary": "Not far from Shanghai, in a country town stands the palatial home of the Pang family. Old Master Pang is an addict who brings up his beautiful daughter Ruyi on opium smoke. Her older brother, Zhengda, is addicted as well, and then ...See moreNot far from Shanghai, in a country town stands the palatial home of the Pang family. Old Master Pang is an addict who brings up his beautiful daughter Ruyi on opium smoke. Her older brother, Zhengda, is addicted as well, and then paralysed and effectively brain-dead. Zhongliang, Zhengda's brother-in-law, is a successful gigolo in Shanghai who seduces older married women and then blackmails them. When Older Master Pang dies, the clan elders make Ruyi take over the role as the head of the household. Zhongliang returns to the Pang family on the death of Old Master Pang, re-encounters Ruyi, and they are secretly attracted to each other. Wanting to seem sophisticated, she succumbs to Zhongliang's attempts to seduce her. But then an emotional maelstrom follows - for the angry, jealous and sexually frustrated sister (Zhengda's wife) is also part of the picture.  Written by L.H. Wong See less",
        "runtimeMinutes": "130"
    },
    "1997_186": {
        "plotSummary": "A man who has failed as a father and husband commits a heist to make money for his fledging business, but things become complicated when his wife interferes.",
        "runtimeMinutes": "101"
    },
    "1997_187": {
        "plotSummary": "A scriptwriter comes to Paris to work on her film. There she takes up tango lessons and forms a relationship with the dancer.",
        "runtimeMinutes": "100"
    },
    "1997_188": {
        "plotSummary": "Marty Preston, a small-town Southern boy, must rescue a young beagle from abusive owner and recluse Judd Travers.",
        "runtimeMinutes": "93"
    },
    "1997_189": {
        "plotSummary": "An ambitious female attorney wallows in excess and meaningless sex with both male and female partners, while dealing with her personal life problems including helping her kleptomaniac sister.",
        "runtimeMinutes": "120"
    },
    "1997_19": {
        "plotSummary": "An absent-minded professor discovers \"flubber,\" a rubber-like super-bouncy substance.",
        "runtimeMinutes": "93"
    },
    "1997_190": {
        "plotSummary": "An uptight and conservative woman, working on tenure as a literacy professor at a large urban university, finds herself strangely attracted to a free-spirited, liberal woman who works at a local carnival that comes to town.",
        "runtimeMinutes": "94"
    },
    "1997_191": {
        "plotSummary": "It is a satire about life in Cuba. The members of a funeral procession and some truckdrivers who have to take the same route begin to talk about god and the world ending up in discovering that life for both groups has many similarities as ...See moreIt is a satire about life in Cuba. The members of a funeral procession and some truckdrivers who have to take the same route begin to talk about god and the world ending up in discovering that life for both groups has many similarities as well as a lot of differences depending on the point of view.  Written by Volker BoehmSee less",
        "runtimeMinutes": "105"
    },
    "1997_192": {
        "plotSummary": "Two Russian soldiers, one battle-seasoned and the other barely into his boots and uniform, are taken prisoner by an anxious Islamic father from a remote village hoping to trade them for his captured son.",
        "runtimeMinutes": "99"
    },
    "1997_193": {
        "plotSummary": "An exploration of the careers of four unrelated professionals: a lion tamer, a robotics expert, a topiary gardener, and a naked mole rat specialist.",
        "runtimeMinutes": "80"
    },
    "1997_194": {
        "plotSummary": "A recent widow, who is determined to leave Scotland for Australia with her son, gets an unexpected visit from her aging mother.",
        "runtimeMinutes": "108"
    },
    "1997_195": {
        "plotSummary": "Anna (Marceau) is a wife and mother who has an affair with the handsome Count Vronsky (Bean). Based on the novel by Tolstoy.",
        "runtimeMinutes": "108"
    },
    "1997_196": {
        "plotSummary": "Few knew that Stalin spent his last night in the arms of a young Australian woman. Few still knew that their \"love-child\" brought Australia to the brink of civil war. Until now.",
        "runtimeMinutes": "101"
    },
    "1997_197": {
        "plotSummary": "Spending the summer at a Catskills resort with her family, Frances \"Baby\" Houseman falls in love with the camp's dance instructor, Johnny Castle.",
        "runtimeMinutes": "100"
    },
    "1997_198": {
        "plotSummary": "After a robbery scam that goes bad, lovers Nikki and Al take off into the Australian outback, pursued by the police and a malevolent footballer named Zipper Doyle, and meet a number of offbeat characters.",
        "runtimeMinutes": "96"
    },
    "1997_199": {
        "plotSummary": "An engineer finds his first gray hair, takes 6 days off from wife, son and work, rents a car and meets different people.",
        "runtimeMinutes": "112"
    },
    "1997_2": {
        "plotSummary": "A research team is sent to the Jurassic Park Site B island to study the dinosaurs there, while an InGen team approaches with another agenda.",
        "runtimeMinutes": "129"
    },
    "1997_20": {
        "plotSummary": "A man raised in the jungle by apes falls in love with a wealthy American heiress.",
        "runtimeMinutes": "92"
    },
    "1997_200": {
        "plotSummary": "Set in the fictional Dublin suburb of Barrytown, Bimbo is a baker who loses his job after being made redundant. Bimbo then acquires the help of his best friend, Larry, to set up a successful burger van.",
        "runtimeMinutes": "100"
    },
    "1997_201": {
        "plotSummary": "Screenwriter Paul Javal's marriage to his wife Camille disintegrates during movie production as she spends time with the producer. Layered conflicts between art and business ensue.",
        "runtimeMinutes": "103"
    },
    "1997_202": {
        "plotSummary": "The story of Pascal Ichak, a larger-than-life French traveller, bon vivant, and chef, who falls in love with Georgia and a Georgian princess in the early 1920s. All is well until the arrival of the Red Army of the Caucasus, as the Soviet ...See moreThe story of Pascal Ichak, a larger-than-life French traveller, bon vivant, and chef, who falls in love with Georgia and a Georgian princess in the early 1920s. All is well until the arrival of the Red Army of the Caucasus, as the Soviet revolution that has swept Russian comes to Georgia. Told as a flashback from the present, as a French-Georgian man whose mother was Pascal's lover translates his memoirs for Pascal's niece.  Written by Michael C. Berch See less",
        "runtimeMinutes": "100"
    },
    "1997_203": {
        "plotSummary": "After five years of living in Mexico, Carlos, an 18-year-old youth returns to Los Angeles. He wants to be an actor. But his father, Pepe, a pimp wants him to work in the family business, that is, male prostitution. Carlos decides that he ...See moreAfter five years of living in Mexico, Carlos, an 18-year-old youth returns to Los Angeles. He wants to be an actor. But his father, Pepe, a pimp wants him to work in the family business, that is, male prostitution. Carlos decides that he will be one of his father's boys until he can get his foot in the door in Hollywood. Finally one of his clients, Jennifer a rich soap star, offers him a bit part in her show. Pepe tells Carlos that she is just using him and demands that he most not see the woman any longer. Carlos defies his father and when his big day comes he finds out the harsh realities of life are even harsher than he imagined.  Written by WikiSee less",
        "runtimeMinutes": "86"
    },
    "1997_204": {
        "plotSummary": "A group of suburban teenagers try to support each other through the difficult task of becoming adults.",
        "runtimeMinutes": "121"
    },
    "1997_205": {
        "plotSummary": "A mentally unbalanced young woman - who is convinced she is Jackie Kennedy - flies into a murderous rage when her brother returns home to reveal he is engaged.",
        "runtimeMinutes": "85"
    },
    "1997_206": {
        "plotSummary": "In Sunray, a backwater town on Australia's Murray River, there's little to do but fish or listen to the local radio station. D.J. Ken Sherry arrives from the hustle of Brisbane to run the station; he's mid-40s, detached, thrice divorced, ...See moreIn Sunray, a backwater town on Australia's Murray River, there's little to do but fish or listen to the local radio station. D.J. Ken Sherry arrives from the hustle of Brisbane to run the station; he's mid-40s, detached, thrice divorced, hatchet faced. But both sisters next door find him attractive: awkward Dimity, only 20, who works in a Chinese restaurant with few patrons, and perky Vicki-Ann, a hairdresser with a hope chest who invents a happy future with Sherry based on little but his arrival. First Dimity then Vicki-Ann spend the night with Ken, one concluding he's her boy friend, the other her fiance. Then Dimity begins to smell something fishy.  Written by See less",
        "runtimeMinutes": "101"
    },
    "1997_207": {
        "plotSummary": "Roger uses his son Igor to ruthlessly traffic and exploit undocumented immigrants. When one of the immigrants is killed, Igor is guilt-ridden and wants to care for the dead man's family against his father's orders.",
        "runtimeMinutes": "90"
    },
    "1997_208": {
        "plotSummary": "Based on the life of Olympic hopeful Steve Prefontaine, a long distance runner who lived in Oregon and died young.",
        "runtimeMinutes": "106"
    },
    "1997_209": {
        "plotSummary": "The claustrophobic world of a WWII German U-boat; boredom, filth and sheer terror.",
        "runtimeMinutes": "149"
    },
    "1997_21": {
        "plotSummary": "Two years after the first series of murders, as Sidney acclimates to college life, someone donning the Ghostface costume begins a new string of killings.",
        "runtimeMinutes": "120"
    },
    "1997_210": {
        "plotSummary": "His wife dies, his house destroyed, gets fired and his dog struck by lightning, when he shouts \"Why?\" at God. He decides to break all ten commandments. He moves in with his sister-in-law and cheating reporter husband.",
        "runtimeMinutes": "88"
    },
    "1997_211": {
        "plotSummary": "Terry is a suicidal voyeur who treats a dying addict to a final binge, but Terry will only do this if he promises to kill him.",
        "runtimeMinutes": "97"
    },
    "1997_212": {
        "plotSummary": "Ivan is the fierce patriarch of a family of Croatian refugees in Auckland. Nina is his daughter, ready to live on her own, despite his angry objections. Eddie is the Maori she takes as her lover. Nina works at a restaurant where Eddie ...See moreIvan is the fierce patriarch of a family of Croatian refugees in Auckland. Nina is his daughter, ready to live on her own, despite his angry objections. Eddie is the Maori she takes as her lover. Nina works at a restaurant where Eddie cooks. For a price, she agrees to marry a Chinese, another restaurant employee, so that he (and his Chinese wife) can establish permanent residency. The money gives her the independence she needs to leave her parents' house and move in with Eddie. Complications arise when Eddie realizes the depth of her father's fury and the strength of Nina's family ties.  Written by See less",
        "runtimeMinutes": "92"
    },
    "1997_213": {
        "plotSummary": "A man joins a group of nomadic con artists in rural North Carolina.",
        "runtimeMinutes": "101"
    },
    "1997_214": {
        "plotSummary": "Compilation of four short films about homoerotic situations involving young men. Tom DeCerchio directed \"Nunzio's Second Cousin\", telling the story of a gay cop who forces a gay-basher to come to his house and have dinner with his family. ...See moreCompilation of four short films about homoerotic situations involving young men. Tom DeCerchio directed \"Nunzio's Second Cousin\", telling the story of a gay cop who forces a gay-basher to come to his house and have dinner with his family. In \"Alkali, Iowa\", by Mark Christopher, a young gay man finds out some of his father's past secrets. And \"Must Be the Music\", by Nickolas Perry, follows four teenagers looking for love in nightclubs.  Written by lukejoplin@infolink.com.brSee less",
        "runtimeMinutes": "74"
    },
    "1997_215": {
        "plotSummary": "When an old couple washes their gabbeh - a type of Persian rug - a young woman magically appears and tells them her life story.",
        "runtimeMinutes": "75"
    },
    "1997_216": {
        "plotSummary": "A few days spent in close proximity to each other soon leads to family secrets and old resentments being revealed, which threaten to splinter an already dysfunctional family.",
        "runtimeMinutes": "93"
    },
    "1997_217": {
        "plotSummary": "Pippi is a little girl who lives alone in her house, while her father is sailing the seas. With Pippi we meet her horse, her monkey and her two friends Tommy and Anika. Together they go on many journeys through the neighborhood. Read more: Synopsis",
        "runtimeMinutes": "76"
    },
    "1997_218": {
        "plotSummary": "In 1930s Berlin, a gay Jew is sent to a concentration camp under the Nazi regime.",
        "runtimeMinutes": "105"
    },
    "1997_219": {
        "plotSummary": "As a hall fills with performers, a narrator says that flamenco came from Andalucia, a mix of Greek psalms, Mozarabic dirges, Castillian ballads, Jewish laments, Gregorian chants, African rhythms, and Iranian and Romany melodies. The film ...See moreAs a hall fills with performers, a narrator says that flamenco came from Andalucia, a mix of Greek psalms, Mozarabic dirges, Castillian ballads, Jewish laments, Gregorian chants, African rhythms, and Iranian and Romany melodies. The film presents thirteen rhythms of flamenco, each with song, guitar, and dance: the up-tempo bularías, a brooding farruca, an anguished martinete, and a satiric fandango de huelva. There are tangos, a taranta, alegrías, siguiriyas, soleás, a guajira of patrician women, a petenera about a sentence to death, villancicos, and a final rumba. Families present numbers, both festive and fierce. The camera and the other performers are the only audience.  Written by See less",
        "runtimeMinutes": "100"
    },
    "1997_22": {
        "plotSummary": "Dr. Ellie Arroway, after years of searching, finds conclusive radio proof of extraterrestrial intelligence, sending plans for a mysterious machine.",
        "runtimeMinutes": "150"
    },
    "1997_220": {
        "plotSummary": "At the discovery of his ability to work miracles, Juvenal becomes a media sensation, but now he's prone to those who want to exploit him.",
        "runtimeMinutes": "96"
    },
    "1997_221": {
        "plotSummary": "Mike is a successful Hollywood producer of violent movies. Then he himself experiences extreme violence, goes missing, joins some Latino gardeners and reviews his life.",
        "runtimeMinutes": "122"
    },
    "1997_222": {
        "plotSummary": "The story of Mowgli, a young boy abandoned in the wilds of India. Raised by a panther, an elephant and a bear, Mowgli must learn civilization's ways when his long-lost uncle and a circus scout from Barnum and Bailey come looking for him.",
        "runtimeMinutes": "88"
    },
    "1997_223": {
        "plotSummary": "While escaping from a foiled robbery attempt, three thieves find themselves surrounded by police at a New Orleans bar--only they're not the people the police are searching for.",
        "runtimeMinutes": "94"
    },
    "1997_224": {
        "plotSummary": "Journalist Flynn from the U.S., Michael Henderson from the U.K., and their teams meet at the beginning of the Bosnian war in Sarajevo. During their reports, they find an orphanage run by the devoted Mrs. Savic near the frontline. Henderson...See moreJournalist Flynn from the U.S., Michael Henderson from the U.K., and their teams meet at the beginning of the Bosnian war in Sarajevo. During their reports, they find an orphanage run by the devoted Mrs. Savic near the frontline. Henderson gets so involved in the kids' problems, that he decides to take one of the children, Emira, illegally back to England. He is assisted by American aid worker Nina.See less",
        "runtimeMinutes": "103"
    },
    "1997_225": {
        "plotSummary": "An American naval officer is recruited for an operation to eliminate his lookalike, the infamous terrorist Carlos The Jackal.",
        "runtimeMinutes": "119"
    },
    "1997_226": {
        "plotSummary": "Over the years, a child's romantic ideals about death blossom into necrophilia, the study of embalming and the most profound relationship of her life.",
        "runtimeMinutes": "78"
    },
    "1997_227": {
        "plotSummary": "Little Tree is an 8-year-old Cherokee boy who loses his parents during The Great Depression and begins living with his Indian grandparents and learning the Cherokee way of life.",
        "runtimeMinutes": "116"
    },
    "1997_228": {
        "plotSummary": "A couple take a trip to Argentina but both men find their lives drifting apart in opposite directions.",
        "runtimeMinutes": "96"
    },
    "1997_229": {
        "plotSummary": "A loner befriends a local celebrity, Billy Magic, but he soon begins to tell lies in order to maintain the friendship and the newfound status.",
        "runtimeMinutes": "101"
    },
    "1997_23": {
        "plotSummary": "A computer hacker breaks into the computer system of the Seabourn Legend cruise liner and sets it speeding on a collision course into a gigantic oil tanker.",
        "runtimeMinutes": "121"
    },
    "1997_230": {
        "plotSummary": "When a bishop comes to a prison to hear the confession of an old friend he is forced to watch a play, performed by the inmates, about their youth together, love and betrayal.",
        "runtimeMinutes": "95"
    },
    "1997_231": {
        "plotSummary": "Karl Foyle and Paul Prentice were best mates at school in the Seventies. But when they meet again in present-day London things are definitely not the same. Karl is now Kim, a transsexual, and she has no desire to stir up the past while ...See moreKarl Foyle and Paul Prentice were best mates at school in the Seventies. But when they meet again in present-day London things are definitely not the same. Karl is now Kim, a transsexual, and she has no desire to stir up the past while she's busy forging a neat and orderly new life. Prentice, on the other hand, has charm but is a social disaster stuck in a dead-end job. His main talent is for getting them both into trouble. Amid the squabbles, they start to fall in love. One night, Kim invites Prentice to a romantic dinner at her flat. Prentice, finding the seduction unexpectedly effective, freaks out. He proceeds to make a public display of both of them and winds up in court. Humiliated and angry, Kim runs away. Only she can save Prentice now, but will true love triumph for a new made woman and an aging punk?  Written by See less",
        "runtimeMinutes": "97"
    },
    "1997_232": {
        "plotSummary": "A day in the life of two film-school students trying to find love and another house-mate.",
        "runtimeMinutes": "76"
    },
    "1997_233": {
        "plotSummary": "A newly married happy couple visits a sex therapist to determine why the wife can't achieve an orgasm with her husband. This causes a horrific suppressed memory to emerge and she becomes more and more distant.",
        "runtimeMinutes": "103"
    },
    "1997_234": {
        "plotSummary": "Claude and Ellen are best friends who live in a not-so-nice area of New York. They're involved in the subculture of 90s youth, complete with drugs, live music, and homophobia. All is changed one night when a violent and meaningless death ...See moreClaude and Ellen are best friends who live in a not-so-nice area of New York. They're involved in the subculture of 90s youth, complete with drugs, live music, and homophobia. All is changed one night when a violent and meaningless death rocks their lives.  Written by Josh Pasnak See less",
        "runtimeMinutes": "86"
    },
    "1997_235": {
        "plotSummary": "A Chinese movie actress, in France to star in a remake of \"Les Vampires\", finds petty intrigues and clashing egos on the set.",
        "runtimeMinutes": "99"
    },
    "1997_236": {
        "plotSummary": "The first wedding anniversary of Princess Odette and Prince Derek is distracted by field fires set by Knuckles. His master Clavius, wants to conquer the world, and he needs to capture a giant orb to do that. Clavius kidnaps Queen Uberta ...See moreThe first wedding anniversary of Princess Odette and Prince Derek is distracted by field fires set by Knuckles. His master Clavius, wants to conquer the world, and he needs to capture a giant orb to do that. Clavius kidnaps Queen Uberta and Odette with Derek have to save her.  Written by AnonymousSee less",
        "runtimeMinutes": "71"
    },
    "1997_237": {
        "plotSummary": "Following the break-up of his marriage after revealing his homosexuality, GP Martin Wyatt loses custody of his son Oliver to his now ex-wife Hannah and her new partner Frank. It is not long, however, until Oliver appears at the house of ...See moreFollowing the break-up of his marriage after revealing his homosexuality, GP Martin Wyatt loses custody of his son Oliver to his now ex-wife Hannah and her new partner Frank. It is not long, however, until Oliver appears at the house of Martin and his new lover Tom claiming to have been beaten up by boys in the park. After another incident, Martin puts two and two together and comes to the conclusion that Frank has been beating Oliver without Hannah's knowledge. Martin then begins a long courtroom custody battle to win back his son.  Written by Jonathan Broxton See less",
        "runtimeMinutes": "104"
    },
    "1997_238": {
        "plotSummary": "A disillusioned college graduate finds himself torn between his older lover and her daughter.",
        "runtimeMinutes": "106"
    },
    "1997_239": {
        "plotSummary": "Set in the 1950s, Rough Magic tells the story of what happens when a pretty apprentice magician goes to Mexico to escape her fiance, a wealthy politician, and to find a Mayan shaman who will teach her ancient principles of magic. She is ...See moreSet in the 1950s, Rough Magic tells the story of what happens when a pretty apprentice magician goes to Mexico to escape her fiance, a wealthy politician, and to find a Mayan shaman who will teach her ancient principles of magic. She is being trailed by a detective hired by her fiance. He's a former photojournalist traumatized by what he saw in Hiroshima. The photojournalist joins her in the search for the Mayan shaman, and falls in love with her; the feeling is not reciprocated. When she finds the shaman, she drinks a potion which empowers her to do magic. The potion has life-changing effects on her and her relationship with her companion. They have strange experiences which are brought about by magic.  Written by See less",
        "runtimeMinutes": "105"
    },
    "1997_24": {
        "plotSummary": "200 years after her death, Ellen Ripley is revived as a powerful human/alien hybrid clone. Along with a crew of space pirates, she must again battle the deadly aliens and stop them from reaching Earth.",
        "runtimeMinutes": "109"
    },
    "1997_240": {
        "plotSummary": "Professional gambler Sydney teaches John the tricks of the trade. John does well until he falls for cocktail waitress Clementine.",
        "runtimeMinutes": "102"
    },
    "1997_241": {
        "plotSummary": "A hospital resident is put in the middle of a legal battle between two half-sisters on whether to pull their comatose dad's life support. But more seems to be at stake than dad's life - his inheritance.",
        "runtimeMinutes": "107"
    },
    "1997_242": {
        "plotSummary": "Jack and Judy are husband and wife, and Howard is Judys father. They live in some fictional undemocratic and repressive country, and tell us a story about their lives, mostly from Jack's point of view.See moreJack and Judy are husband and wife, and Howard is Judys father. They live in some fictional undemocratic and repressive country, and tell us a story about their lives, mostly from Jack's point of view.  Written by AnonymousSee less",
        "runtimeMinutes": "94"
    },
    "1997_243": {
        "plotSummary": "A cute, openly gay latin boy's hormones go into overdrive when his hunky cousin (Angel) arrives for an extended stay. The two explore the young and sometimes dangerous gay scene in the city's Latin neighborhood, with surprising outcomes.See moreA cute, openly gay latin boy's hormones go into overdrive when his hunky cousin (Angel) arrives for an extended stay. The two explore the young and sometimes dangerous gay scene in the city's Latin neighborhood, with surprising outcomes.  Written by Guy33134See less",
        "runtimeMinutes": "71"
    },
    "1997_244": {
        "plotSummary": "Follows a day in the lives of a group of Los Angeles high school students and the strange lives they lead.",
        "runtimeMinutes": "82"
    },
    "1997_245": {
        "plotSummary": "A group of Serbian socialists prepares for the war in a surreal underground filled by parties, tragedies, love and hate.",
        "runtimeMinutes": "170"
    },
    "1997_246": {
        "plotSummary": "Twin brothers meet a childhood sweetheart at a tacky hotel and rediscover their love as they renew their competition for her affection.",
        "runtimeMinutes": "95"
    },
    "1997_247": {
        "plotSummary": "Sophie, a writer of racy romance novels, is working on one of her stories in the library, when Eddie overhears her. Sophie, embarrassed by her paralyzed leg from childhood polio, spurns his advances, but when Sophie breaks her leg, she has...See moreSophie, a writer of racy romance novels, is working on one of her stories in the library, when Eddie overhears her. Sophie, embarrassed by her paralyzed leg from childhood polio, spurns his advances, but when Sophie breaks her leg, she has the perfect way of hiding her disability from Eddie. As Sophie struggles to win over Eddie and hide her disability, Eddie's jealous fiance and a police officer investigating a jewel heist threaten their relationship.  Written by Mike Myers See less",
        "runtimeMinutes": "94"
    },
    "1997_248": {
        "plotSummary": "A reassessment of the tragedy at Waco that left 76 members of the Branch Davidian religious sect dead.",
        "runtimeMinutes": "136"
    },
    "1997_249": {
        "plotSummary": "A group of teenagers get into a car crash in the Texas woods on prom night, and then wander into an old farmhouse that is home to Leatherface (Robert Jacks) and his insane family of cannibalistic psychopaths.",
        "runtimeMinutes": "87"
    },
    "1997_25": {
        "plotSummary": "An imprisoned I.R.A. fighter is freed to help stop a brutal, seemingly \"faceless\" assassin from completing his next job.",
        "runtimeMinutes": "124"
    },
    "1997_250": {
        "plotSummary": "Troublesome Creek is the acclaimed story of the Jordan family's gamble to save their Iowa farm. From fighting the Crooked Creek Gang in 1867 to fighting off the bank today. An Oscar-nominated cliffhanger about history, humor and the ...See moreTroublesome Creek is the acclaimed story of the Jordan family's gamble to save their Iowa farm. From fighting the Crooked Creek Gang in 1867 to fighting off the bank today. An Oscar-nominated cliffhanger about history, humor and the unsettling of America.  Written by AnonymousSee less",
        "runtimeMinutes": "88"
    },
    "1997_251": {
        "plotSummary": "A documentary of the notorious racial terrorist bombing of an African American church during the Civil Rights Movement.",
        "runtimeMinutes": "102"
    },
    "1997_252": {
        "plotSummary": "Julian and Jeremy, two brothers prefer to spend their time on drugs and joyriding. When their father, Fatty Lewis, they show up demanding compensation.",
        "runtimeMinutes": "99"
    },
    "1997_253": {
        "plotSummary": "Roseanna is dying of a heart condition, and all she wants is to be buried next to her daughter, in a cemetery that is getting full fast. The cemetery can't expand because Capestro, the man who owns the land next to the cemetery, won't sell...See moreRoseanna is dying of a heart condition, and all she wants is to be buried next to her daughter, in a cemetery that is getting full fast. The cemetery can't expand because Capestro, the man who owns the land next to the cemetery, won't sell. While Marcello is doing good deeds to make sure no one dies, Roseanna thinks of Marcello's future.  Written by Robert Krzanowski See less",
        "runtimeMinutes": "98"
    },
    "1997_254": {
        "plotSummary": "A group of crooks, an ex con, his friend and a gun crazy gangster plan a drug heist, but not everything goes as planned.",
        "runtimeMinutes": "106"
    },
    "1997_255": {
        "plotSummary": "Lonely residents of a tornado-stricken Ohio town wander the deserted landscape trying to fulfill their boring, nihilistic lives.",
        "runtimeMinutes": "89"
    },
    "1997_256": {
        "plotSummary": "After returning home from the Korean War, two young men search for love and fulfillment in middle America.",
        "runtimeMinutes": "103"
    },
    "1997_257": {
        "plotSummary": "A has-been cowboy is given a second chance at the hands of an unexpected teacher.",
        "runtimeMinutes": "101"
    },
    "1997_258": {
        "plotSummary": "When their abusive parents are killed in a car crash, twin sisters Rosie and Violet vow to run away to Kentucky in search of a better life. While on the road, the girls meet up with Pete, a drifter working as a grounds keeper on a derelict...See moreWhen their abusive parents are killed in a car crash, twin sisters Rosie and Violet vow to run away to Kentucky in search of a better life. While on the road, the girls meet up with Pete, a drifter working as a grounds keeper on a derelict army base, who takes them in. While Violet falls for him, Rosie becomes increasingly angry and hostile, and the sisters' childhood bond is eventually destroyed forever.  Written by Babydoll xxxSee less",
        "runtimeMinutes": "92"
    },
    "1997_259": {
        "plotSummary": "A mousy office worker accidentally kills one of her coworkers, then proceeds to bump off a few others.",
        "runtimeMinutes": "82"
    },
    "1997_26": {
        "plotSummary": "An exceptionally adept Florida lawyer is offered a job at a high-end New York City law firm with a high-end boss - the biggest opportunity of his career to date.",
        "runtimeMinutes": "144"
    },
    "1997_260": {
        "plotSummary": "The story of the post World War II Jewish refugee situation from liberation to the establishment of the modern state of Israel.",
        "runtimeMinutes": "120"
    },
    "1997_261": {
        "plotSummary": "Richter is a lazy son of a wealthy woman, who's put up with too much so no more money. He's about to lose his local newspaper job arranged by his mom. Richter owes money to a violent drug dealer/blackmailer but sees his wife. Death wish?",
        "runtimeMinutes": "113"
    },
    "1997_262": {
        "plotSummary": "Harold Guppy (Rupert Graves) moves into the Beasley household as a lodger. Before long Mrs. Marjorie Beasley (Dame Julie Walters) falls for him and eventually ends up in his bed. Her thirteen-year old daughter Joyce (Laura Sadler) is aware...See moreHarold Guppy (Rupert Graves) moves into the Beasley household as a lodger. Before long Mrs. Marjorie Beasley (Dame Julie Walters) falls for him and eventually ends up in his bed. Her thirteen-year old daughter Joyce (Laura Sadler) is aware of what is happening and threatens to tell Mr. Stanley Beasley (Matthew Walker) unless she is also allowed share the bed with Harold and \"Mum\". \"Mum\" seems to think there is no harm in this, as long as Joyce doesn't take part in the physical activities. Harold gets caught up in a web of deceit and blackmail, and each time he tries to break free of the grasp of \"Mum\", she threatens to tell the Police that he has been abusing Joyce. This movie continues much in this line, and it examines the effect of the relationship on both Harold and Joyce and how they are both driven to extreme action because of the influence of Mrs. Beasley.  Written by SNC See less",
        "runtimeMinutes": "105"
    },
    "1997_263": {
        "plotSummary": "White stars as Reggie Knox, a pro football player who retires, frustrated because he hasn't won a championship. Knox begins coaching a Portland, Ore., high school football program, where he befriends a troubled student.See moreWhite stars as Reggie Knox, a pro football player who retires, frustrated because he hasn't won a championship. Knox begins coaching a Portland, Ore., high school football program, where he befriends a troubled student.  Written by AnonymousSee less",
        "runtimeMinutes": "94"
    },
    "1997_264": {
        "plotSummary": "Two brothers, Lex and younger Mick, are living in Harlem. Mick is a policeman, and Lex, who spent youth years in reformatory because of injustice after he confronted the cop who tried to sodomize Mick on the street, is living with his wife...See moreTwo brothers, Lex and younger Mick, are living in Harlem. Mick is a policeman, and Lex, who spent youth years in reformatory because of injustice after he confronted the cop who tried to sodomize Mick on the street, is living with his wife Debbie trying to make ends meet and failing. One day Lex calls Mick - he has a problem...  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "1997_265": {
        "plotSummary": "Three muralists (one Chicano, one Black, one American Indian) and the socially-maladjusted cousin of the Chicano muralist set off on a road trip with the intent of painting their images on the White House. Along the way they meet a ...See moreThree muralists (one Chicano, one Black, one American Indian) and the socially-maladjusted cousin of the Chicano muralist set off on a road trip with the intent of painting their images on the White House. Along the way they meet a mysterious Black woman. Together, these four men and one woman encounter racism, sexism, internal conflicts, and finally redemption as they discover their common humanity and their internal ability to conquer the societal ills that effect them all.  Written by L. J. Allen-2See less",
        "runtimeMinutes": "100"
    },
    "1997_266": {
        "plotSummary": "A woman and her seven children live on a farm in Southern France. In spite of the hard work and the mediocre accommodation, their life would be a happy one, but for one person: the owner of the farm an egotistic and authoritarian ...See moreA woman and her seven children live on a farm in Southern France. In spite of the hard work and the mediocre accommodation, their life would be a happy one, but for one person: the owner of the farm an egotistic and authoritarian individual, who is also the lover of the woman and the father of all her children. The farmer handles them as his property, uses them as cheap labour to work in the fields, and denies them the right to leave the farm. It is only the love of the woman for her children that allows them to endure their situation; but even for her, disenchantment has set in.  Written by Eduardo Casais See less",
        "runtimeMinutes": "90"
    },
    "1997_267": {
        "plotSummary": "Christian Slater is a stranger who comes to a small town. The local citizens think he's up to no good. After bothering him for a while, he blurts out his reason for moving in frustration.See moreChristian Slater is a stranger who comes to a small town. The local citizens think he's up to no good. After bothering him for a while, he blurts out his reason for moving in frustration.  Written by RachelWSee less",
        "runtimeMinutes": "84"
    },
    "1997_268": {
        "plotSummary": "In 1950s, two incestuous lovers, a depraved suave journalist and his equally depraved prostitute sister, plan to get rich through seduction and murder. Things complicate when their feeble-minded mother begins to suspect something.",
        "runtimeMinutes": "100"
    },
    "1997_269": {
        "plotSummary": "Cab driver Michael and supermodel Sarah fall in love while her gorgeous husband Phillippe is in Madrid for two months.",
        "runtimeMinutes": "93"
    },
    "1997_27": {
        "plotSummary": "A police officer uncovers the real identity of his house-guest, an I.R.A. terrorist in hiding.",
        "runtimeMinutes": "111"
    },
    "1997_270": {
        "plotSummary": "It's the day before Christmas, the day before John's 21st birthday. He's a prostitute on Santa Monica Blvd in L.A., and he wants to spend that night and the next day at the posh Park Plaza Hotel. He's ripped off a local drug dealer to pay ...See moreIt's the day before Christmas, the day before John's 21st birthday. He's a prostitute on Santa Monica Blvd in L.A., and he wants to spend that night and the next day at the posh Park Plaza Hotel. He's ripped off a local drug dealer to pay the bill, but as he's sleeping that morning, someone steals his shoes right off his feet, with the money in them. Meanwhile, Donner, a lad new to the streets, wants John to leave the city with him for Camelot, a theme park in Branson, MO, where they'll work as lifeguards. John spends the day trying to hustle the money for the hotel, avoid Jimmy the Warlock, keep his girl friend placated, and figure out how to deal with Donner's friendship.  Written by See less",
        "runtimeMinutes": "96"
    },
    "1997_271": {
        "plotSummary": "Norwegian Nobel Laureate Knut Hamsun's controversial support for the Nazi regime during WW2 and its consequences for the Hamsun family after the war.",
        "runtimeMinutes": "159"
    },
    "1997_272": {
        "plotSummary": "In 1946 Denver, an aspiring writer who enjoys irresponsible adventures with his friend, writes a letter about his life before and after the suicide attempt by his sad girlfriend who wants a commitment.",
        "runtimeMinutes": "92"
    },
    "1997_273": {
        "plotSummary": "It is 1940. Chuchu and Luo Xiaoman are Chinese students who have been sent to study in Moscow, at the International School. She is 13; he is 12. Xiaoman is from Yanan, Mao's base after the Long March; Chuchu had seen her father executed by...See moreIt is 1940. Chuchu and Luo Xiaoman are Chinese students who have been sent to study in Moscow, at the International School. She is 13; he is 12. Xiaoman is from Yanan, Mao's base after the Long March; Chuchu had seen her father executed by Chiang Kai-shek's Kuomintang. The youngsters fit in well and learn to speak Russian... A large group of students, including Chuchu, leave for summer camp in Byelorussia accompanied by their teacher, Miss Vera. Xiaoman remains behind... The Nazis invade the Soviet Union. Moscow remains unoccupied. Xiaoman takes a job delivering condolence letters to soldiers' families. At one apartment, he finds a mother has died. Her very young daughter, Nadia, has not realized it... The summer camp is occupied by Germans. Miss Vera is murdered. One of the Russian boys, Carl, is half-German, and helps the others to escape. They are quickly recaptured. Chuchu and several other students are sent by Gen. von Dietrich to work as servants at Nazi headquarters in the Yakovliv Monastery. The general is also a medical doctor with a peculiar hobby, tattooing...  Written by David CarlessSee less",
        "runtimeMinutes": "120"
    },
    "1997_274": {
        "plotSummary": "Tony gets fired from his job. He's not really sad about this because he prefers writing songs and playing the guitar. He meets the drummer Charlie and they decide to start a band, although Tony is afraid of playing in front of other people...See moreTony gets fired from his job. He's not really sad about this because he prefers writing songs and playing the guitar. He meets the drummer Charlie and they decide to start a band, although Tony is afraid of playing in front of other people. He can't even play in front of Charlie. They find another guitarist, Wynn, who enjoys fishing if he's not playing the guitar. The final member of the band is Eric, the bass-player who is often unpredictable in his actions. They name the band Circus Monkey and want to get famous and rich. However, after some successful gigs, they begin to realize what all the big music and show business is about.  Written by Gerhard Windecker See less",
        "runtimeMinutes": "103"
    },
    "1997_275": {
        "plotSummary": "Three women are apartment mates: one is about to be married, another discovers she is pregnant by her long-standing boyfriend and a third has a endless queue of men in and out of her bedroom. Sudden jilting leads them to Vegas.",
        "runtimeMinutes": "102"
    },
    "1997_276": {
        "plotSummary": "Follows Nelson Mandela, from his early protests against racial discrimination, to his election as South Africa's first Democratically elected leader.",
        "runtimeMinutes": "118"
    },
    "1997_277": {
        "plotSummary": "A raw depiction of the Belfast, Northern Ireland \"troubles\" as savage tribal warfare. Set shortly after the 1975 cease fire, this movie focuses on the tribulations of Kenny (James Frain), Protestant leader of a group of Shankill Road ...See moreA raw depiction of the Belfast, Northern Ireland \"troubles\" as savage tribal warfare. Set shortly after the 1975 cease fire, this movie focuses on the tribulations of Kenny (James Frain), Protestant leader of a group of Shankill Road Loyalists, and his one-time friend Liam (John Lynch), a Catholic.  Written by Dawn M. BarcliftSee less",
        "runtimeMinutes": "85"
    },
    "1997_278": {
        "plotSummary": "A drifter enters a small town looking for employment. While working at the local cattle ranch, he meets and falls in love with the beautiful Kitty and becomes involved in a deadly yet erotic love triangle.",
        "runtimeMinutes": "124"
    },
    "1997_279": {
        "plotSummary": "Hines plays a former dental student, Bern Lemley, who had to quit school just before finals because of a car accident that left him in a wheelchair. D'Onofrio plays a former pro football player, Ole Olezniak, who was blinded in a freak ...See moreHines plays a former dental student, Bern Lemley, who had to quit school just before finals because of a car accident that left him in a wheelchair. D'Onofrio plays a former pro football player, Ole Olezniak, who was blinded in a freak accident on the field. Before their accidents, Bern had been a tutor for Ole, and, after quitting his post-accident job as a denture technician, he approaches Ole about teaming up to enter a white-water rafting race on Oregon's Rogue River.  Written by Katherine SmithSee less",
        "runtimeMinutes": "92"
    },
    "1997_28": {
        "plotSummary": "The last surviving child of the Russian Royal Family joins two con men to reunite with her grandmother, the Dowager Empress, while the undead Rasputin seeks her death.",
        "runtimeMinutes": "94"
    },
    "1997_280": {
        "plotSummary": "The lives of Jim and other alcoholics in and outside an AA meeting.",
        "runtimeMinutes": "90"
    },
    "1997_281": {
        "plotSummary": "A village girl agrees to a marriage to a king she has never met after he sends her a photograph of himself. But the man in the photograph is not the king but his most loyal slave, the handsome but mute Shankar.",
        "runtimeMinutes": "166"
    },
    "1997_282": {
        "plotSummary": "Sir Hugo (Sir Alan Bates) is more interested in reconstructing dinosaur bones than in paying attention to his wife, Lady Harriet (Theresa Russell). He's not thrilled when daughter Cleo (Lena Headey) brings home her betrothed, Sidney (...See moreSir Hugo (Sir Alan Bates) is more interested in reconstructing dinosaur bones than in paying attention to his wife, Lady Harriet (Theresa Russell). He's not thrilled when daughter Cleo (Lena Headey) brings home her betrothed, Sidney (Steven Mackintosh), who aspires to be a poet. The new butler, Fledge (Sting), provides Lady Harriet with the attention she's been missing, and then seduces Sidney. Did he have a role in Sidney's disappearance as well?  Written by Dennis Lewis See less",
        "runtimeMinutes": "99"
    },
    "1997_283": {
        "plotSummary": "Lewis is a young Sydney amateur theater director at his first experience: he is offered a job with a Governmental program for the rehabilitation of mentally ill patients in a Sydney institution for mentally ill. His project is overrun by ...See moreLewis is a young Sydney amateur theater director at his first experience: he is offered a job with a Governmental program for the rehabilitation of mentally ill patients in a Sydney institution for mentally ill. His project is overrun by one of the patients Roy who wants to put on stage Cosi Fan Tutte (Mozart). None of the patients in the cast is able to sing and none of them knows Italian which is the language of the libretto. Through a lot of difficulties Lewis and his cast develop a deep understanding. The play smartly adapted for the unusual cast is finally produced: lots of unforeseen situations solved 'a la crazy way'but indeed brilliantly. Great success and sad farewell of the director from his cast.  Written by Lorenzo Matteoli See less",
        "runtimeMinutes": "100"
    },
    "1997_284": {
        "plotSummary": "A prominent judge, his wife, her ex-lover, and their neighbor encounter a dead body that complicates their lives.",
        "runtimeMinutes": "92"
    },
    "1997_285": {
        "plotSummary": "Publishing magnate refuses to publish a book by his son's male lover so the kids buy out their father and run it themselves!",
        "runtimeMinutes": "97"
    },
    "1997_286": {
        "plotSummary": "The life trials and tribulations of a group of young athletic men that struggle through everyday life supporting one another on the rough streets of a Brooklyn neighborhood, using basketball as their way out of a possible life of poverty.",
        "runtimeMinutes": "98"
    },
    "1997_287": {
        "plotSummary": "After doctors inform him that an eye affliction will require risky surgery, monologist Spalding Gray recounts his various pursuits for alternative medicine to avoid the doctor's scalpel.",
        "runtimeMinutes": "80"
    },
    "1997_288": {
        "plotSummary": "The film deals with the career of a supposedly forgotten pioneer of international cinema, Colin McKenzie, who was allegedly born in rural New Zealand in 1888.",
        "runtimeMinutes": "53"
    },
    "1997_289": {
        "plotSummary": "When it is discovered that a man is having luck in the casinos in Las Vegas, people start attempting to take his money.",
        "runtimeMinutes": "92"
    },
    "1997_29": {
        "plotSummary": "A taxi driver with a penchant for conspiracy theories becomes a target after one of these theories turns out to be true. Unfortunately, to save himself, he has to figure out which theory it is.",
        "runtimeMinutes": "135"
    },
    "1997_290": {
        "plotSummary": "Jean-Luc Godard's densely packed rumination on the need to create order and beauty in a world ruled by chaos is divided into four distinct but tangentially related stories, including the attempts by a young group of idealists to stage a ...See moreJean-Luc Godard's densely packed rumination on the need to create order and beauty in a world ruled by chaos is divided into four distinct but tangentially related stories, including the attempts by a young group of idealists to stage a play in war-torn Sarajevo and an elderly director's efforts to complete his film.  Written by AnonymousSee less",
        "runtimeMinutes": "84"
    },
    "1997_291": {
        "plotSummary": "Eddie, a small town ex-con, discovers he has talent for selling anything and everything. Eddie sees a way to rise above the low life by setting up on his own. What he didn't bargain for, was the murder and mayhem along the way.",
        "runtimeMinutes": "105"
    },
    "1997_292": {
        "plotSummary": "Prep school student Daisy and her European-born grandmother Nana share the sad stories of their lives: Daisy tells Nana of her romance with young Ethan and problems in school because she's Jewish; and Nana tells of her young years under ...See morePrep school student Daisy and her European-born grandmother Nana share the sad stories of their lives: Daisy tells Nana of her romance with young Ethan and problems in school because she's Jewish; and Nana tells of her young years under Nazis when she was sent to ghetto and then to concentration camp.  Written by AnonymousSee less",
        "runtimeMinutes": "88"
    },
    "1997_293": {
        "plotSummary": "Hugo Pool is a quirky tale of a Los Angeles pool cleaner who falls in love with a young man dying of Lou Gerhig's Disease. Written by Anonymous",
        "runtimeMinutes": "92"
    },
    "1997_294": {
        "plotSummary": "A couple circa 30 breaks up after 2 1/2 years - or do they?",
        "runtimeMinutes": "90"
    },
    "1997_295": {
        "plotSummary": "Fletcher Munson, the lethargic employee of a pseudo-religious self help company, and his doppelganger, the friendly but dull dentist Dr. Jeffrey Korchek.",
        "runtimeMinutes": "96"
    },
    "1997_296": {
        "plotSummary": "",
        "runtimeMinutes": "72"
    },
    "1997_297": {
        "plotSummary": "The young, bright, and decent London tramp Alan Terry (Rupert Graves) accidentally witnesses a mob execution. He gets away, but leaves enough evidence for them to come looking for him amongst the homeless, and most violently: his older ...See moreThe young, bright, and decent London tramp Alan Terry (Rupert Graves) accidentally witnesses a mob execution. He gets away, but leaves enough evidence for them to come looking for him amongst the homeless, and most violently: his older best friend is killed by arson. It turns out that Matheson (Sir Michael Gambon), the police Detective Inspector in charge of the murder investigation, is in cahoots with mob boss Adolfo Cavani (Franco Nero), and actually on Alan's trace, with the firm intent to eliminate him. The only one who may actually help Alan is a female reporter.  Written by KGF VissersSee less",
        "runtimeMinutes": "110"
    },
    "1997_298": {
        "plotSummary": "Amir is an illegal Pakistani immigrant smuggled into England in the 1960's to work, to send money to his family and perhaps even bring them over with him. A skilled laborer, he is forced to do unskilled work like shoveling sheep dung and ...See moreAmir is an illegal Pakistani immigrant smuggled into England in the 1960's to work, to send money to his family and perhaps even bring them over with him. A skilled laborer, he is forced to do unskilled work like shoveling sheep dung and processing wool. He lives in a boarding house with nearly a dozen other men, under the supervision of Hussein Shah. He befriends a young student, Sakib, who dreams of being a writer. Their existence is punctuated by secret movies, a visiting prostitute, fear of detection and deportation, and the gangster-like smuggler who comes by for his take every week. The household is shaken up by the arrival of a white girl, Shah's girlfriend, and the sense of femininity and family she brings.  Written by Gary Dickerson See less",
        "runtimeMinutes": "102"
    },
    "1997_299": {
        "plotSummary": "Lovers Ned and Jude snatch a lot of diamonds in a jewelry store holdup, leaving three dead bodies. Ned is captured, but soon escapes and vows revenge on Jude, who pushed him out of their escaping car. Ned is joined in his search for Jude ...See moreLovers Ned and Jude snatch a lot of diamonds in a jewelry store holdup, leaving three dead bodies. Ned is captured, but soon escapes and vows revenge on Jude, who pushed him out of their escaping car. Ned is joined in his search for Jude by female hitchhiker Bec.  Written by Gustaf Molin See less",
        "runtimeMinutes": "96"
    },
    "1997_3": {
        "plotSummary": "A police officer joins a secret organization that polices and monitors extraterrestrial interactions on Earth.",
        "runtimeMinutes": "98"
    },
    "1997_30": {
        "plotSummary": "A \"National Geographic\" film crew is taken hostage by an insane hunter, who forces them along on his quest to capture the world's largest - and deadliest - snake.",
        "runtimeMinutes": "89"
    },
    "1997_300": {
        "plotSummary": "A young woman with a camera follows a man around to make a documentary about him, something he is not very happy with.",
        "runtimeMinutes": "94"
    },
    "1997_301": {
        "plotSummary": "A story of two teens discovering their budding sexuality. Greg is having his first sexual experience and first relationship with his friend's mother, a woman twice his age....while Denise is angry with Greg, and sleeps with another girl. ...See moreA story of two teens discovering their budding sexuality. Greg is having his first sexual experience and first relationship with his friend's mother, a woman twice his age....while Denise is angry with Greg, and sleeps with another girl. Both are in a hurry to mature, but both must deal with the repercussions of growing up, moving out, and leaving the security of childhood behind. Edie Falco, Sam Trammell, and Colleen Werthmann star in this engaging, intelligent, and semi-realistic independent seriocomedy.  Written by TrivWhizSee less",
        "runtimeMinutes": "115"
    },
    "1997_302": {
        "plotSummary": "",
        "runtimeMinutes": "88"
    },
    "1997_303": {
        "plotSummary": "Brad is about to hook up with the girl of his dreams, but runs into a problem, no condom. So Brad sets out into the night to find one, running into many obstacles along the way, while not knowing his best friend, Leah is in love with him.",
        "runtimeMinutes": "84"
    },
    "1997_31": {
        "plotSummary": "True story of Heinrich Harrer, an Austrian mountain climber who became friends with the Dalai Lama at the time of China's takeover of Tibet.",
        "runtimeMinutes": "136"
    },
    "1997_32": {
        "plotSummary": "As corruption grows in 1950s Los Angeles, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their own brand of justice.",
        "runtimeMinutes": "138"
    },
    "1997_33": {
        "plotSummary": "Four young friends bound by a tragic accident are reunited when they find themselves being stalked by a hook-wielding maniac in their small seaside town.",
        "runtimeMinutes": "101"
    },
    "1997_34": {
        "plotSummary": "An FBI undercover agent infiltrates the mob and finds himself identifying more with the mafia life, at the expense of his regular one.",
        "runtimeMinutes": "127"
    },
    "1997_35": {
        "plotSummary": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader and a bounty hunter named Boba Fett all over the galaxy.",
        "runtimeMinutes": "124"
    },
    "1997_36": {
        "plotSummary": "A volcano erupts in downtown Los Angeles, threatening to destroy the city.",
        "runtimeMinutes": "104"
    },
    "1997_37": {
        "plotSummary": "Two stumblebum inheritors are determined to rid their antique house of a mouse who is equally determined to stay where he is.",
        "runtimeMinutes": "98"
    },
    "1997_38": {
        "plotSummary": "Humans in a fascist, militaristic future wage war with giant alien bugs.",
        "runtimeMinutes": "129"
    },
    "1997_39": {
        "plotSummary": "Simon Templar (The Saint), is a thief for hire, whose latest job to steal the secret process for cold fusion puts him at odds with a traitor bent on toppling the Russian government, as well as the woman who holds its secret.",
        "runtimeMinutes": "116"
    },
    "1997_4": {
        "plotSummary": "James Bond sets out to stop a media mogul's plan to induce war between China and the UK in order to obtain exclusive global media coverage.",
        "runtimeMinutes": "119"
    },
    "1997_40": {
        "plotSummary": "A US Army colonel and a civilian woman supervising him must track down stolen Russian nuclear weapons before they're used by terrorists.",
        "runtimeMinutes": "124"
    },
    "1997_41": {
        "plotSummary": "After a wealthy banker is given an opportunity to participate in a mysterious game, his life is turned upside down when he becomes unable to distinguish between the game and reality.",
        "runtimeMinutes": "129"
    },
    "1997_42": {
        "plotSummary": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap.",
        "runtimeMinutes": "131"
    },
    "1997_43": {
        "plotSummary": "An elite mercenary is killed, but comes back from Hell as a reluctant soldier of the Devil.",
        "runtimeMinutes": "96"
    },
    "1997_44": {
        "plotSummary": "Alex Pruitt, an 8-year-old boy living in Chicago, must fend off international spies who seek a top-secret computer chip in his toy car.",
        "runtimeMinutes": "102"
    },
    "1997_45": {
        "plotSummary": "A world-class playboy and part-time secret agent from the 1960s emerges after thirty years in a cryogenic state to battle with his nemesis Dr. Evil.",
        "runtimeMinutes": "94"
    },
    "1997_46": {
        "plotSummary": "Shortly before an election, a spin-doctor and a Hollywood producer join efforts to fabricate a war in order to cover up a Presidential sex scandal.",
        "runtimeMinutes": "97"
    },
    "1997_47": {
        "plotSummary": "A midwestern teacher questions his sexuality after a former student makes a comment about him at the Academy Awards.",
        "runtimeMinutes": "90"
    },
    "1997_48": {
        "plotSummary": "Police hunting for a serial kidnapper are helped when a victim manages to escape for the first time.",
        "runtimeMinutes": "115"
    },
    "1997_49": {
        "plotSummary": "A man learns he has a thirteen-year-old son who was raised in the jungle and brings the boy to New York City, turning his life upside down in the process.",
        "runtimeMinutes": "105"
    },
    "1997_5": {
        "plotSummary": "Communist Radicals hijack Air Force One with The U.S. President and his family on board. The Vice President negotiates from Washington D.C., while the President, a Veteran, fights to rescue the hostages on board.",
        "runtimeMinutes": "124"
    },
    "1997_50": {
        "plotSummary": "A group of martial arts warriors have only six days to save the Earth from an extra-dimensional invasion.",
        "runtimeMinutes": "95"
    },
    "1997_51": {
        "plotSummary": "A man searches for his missing wife after his car breaks down in the middle of the desert.",
        "runtimeMinutes": "93"
    },
    "1997_52": {
        "plotSummary": "Career thief Luther Whitney (Clint Eastwood) witnesses a horrific crime involving U.S. President Alan Richmond (Gene Hackman).",
        "runtimeMinutes": "121"
    },
    "1997_53": {
        "plotSummary": "Sought by police and criminals, a small-time huckster makes a deal with a TV newsman for protection.",
        "runtimeMinutes": "97"
    },
    "1997_54": {
        "plotSummary": "A female Senator succeeds in enrolling a woman into Combined Reconnaissance Team training where everyone expects her to fail.",
        "runtimeMinutes": "125"
    },
    "1997_55": {
        "plotSummary": "An underdog lawyer takes on a fraudulent insurance company.",
        "runtimeMinutes": "135"
    },
    "1997_56": {
        "plotSummary": "The Sheriff of a suburban New Jersey community, populated by New York City police officers, slowly discovers the town is a front for mob connections and corruption.",
        "runtimeMinutes": "105"
    },
    "1997_57": {
        "plotSummary": "Nick's wife's in bed with his boss. He later gets a gun to his head by a carjacker but steps on the gas pedal. They end up friends after adventures together - holdups, burglary, reckless driving, revenge etc. Twists follow.",
        "runtimeMinutes": "98"
    },
    "1997_58": {
        "plotSummary": "A young advertising executive's life becomes increasingly complicated when, in order to impress her boss, she pretends to be engaged to a man she has just met.",
        "runtimeMinutes": "101"
    },
    "1997_59": {
        "plotSummary": "In 1839, the revolt of Mende captives aboard a Spanish owned ship causes a major controversy in the United States when the ship is captured off the coast of Long Island. The courts must decide whether the Mende are slaves or legally free.",
        "runtimeMinutes": "155"
    },
    "1997_6": {
        "plotSummary": "A single mother and waitress, a misanthropic author, and a gay artist form an unlikely friendship after the artist is assaulted in a robbery.",
        "runtimeMinutes": "139"
    },
    "1997_60": {
        "plotSummary": "One person can keep a family together and, when that one person is gone, a family can be torn apart.",
        "runtimeMinutes": "115"
    },
    "1997_61": {
        "plotSummary": "An intellectual billionaire and two other men struggle to band together and survive after getting stranded in the Alaskan wilderness with a blood-thirsty Kodiak Bear hunting them down.",
        "runtimeMinutes": "117"
    },
    "1997_62": {
        "plotSummary": "Back when sex was safe, pleasure was a business and business was booming, an idealistic porn producer aspires to elevate his craft to an art when he discovers a hot young talent.",
        "runtimeMinutes": "155"
    },
    "1997_63": {
        "plotSummary": "The autobiographical story of Howard Stern, the radio rebel who is now also a TV personality, an author and a movie star.",
        "runtimeMinutes": "109"
    },
    "1997_64": {
        "plotSummary": "A middle-aged woman finds herself in the middle of a huge conflict that will either make her a profit or cost her life.",
        "runtimeMinutes": "154"
    },
    "1997_65": {
        "plotSummary": "In the fourth outing for the vacation franchise, the Griswolds have to survive Vegas fever when they go to Las Vegas for a fun family vacation.",
        "runtimeMinutes": "93"
    },
    "1997_66": {
        "plotSummary": "The true story of Selena, a Texas-born Tejano singer who rose from cult status to performing at the Astrodome, as well as having chart topping albums on the Latin music charts.",
        "runtimeMinutes": "127"
    },
    "1997_67": {
        "plotSummary": "Maggie's and Sam's former partners are in love; she wants revenge and he wants his lost love back, so they work together to break up the happy couple.",
        "runtimeMinutes": "100"
    },
    "1997_68": {
        "plotSummary": "A homicide detective and an anthropologist try to destroy a South American lizard-like god, who's on a people eating rampage in a Chicago museum.",
        "runtimeMinutes": "110"
    },
    "1997_69": {
        "plotSummary": "An unusual and wonderful friendship develops between a busy but unhappy salesman and a resident of a mental asylum.",
        "runtimeMinutes": "118"
    },
    "1997_7": {
        "plotSummary": "A fast-track lawyer can't lie for 24 hours due to his son's birthday wish after he disappoints his son for the last time.",
        "runtimeMinutes": "86"
    },
    "1997_70": {
        "plotSummary": "A real estate hustler and his wife hide from the IRS among the Amish.",
        "runtimeMinutes": "115"
    },
    "1997_71": {
        "plotSummary": "A Hostage Negotiator teams up with a Sharpshooter to bring down a dangerous jewel thief.",
        "runtimeMinutes": "117"
    },
    "1997_72": {
        "plotSummary": "A man tries to rescue a woman with a little help from his half brother.",
        "runtimeMinutes": "88"
    },
    "1997_73": {
        "plotSummary": "A failed gambler, intent on meeting a rich widow, tricks his widowed brother-in-law into boarding a cruise ship as dance hosts.",
        "runtimeMinutes": "106"
    },
    "1997_74": {
        "plotSummary": "After a one night stand with Alex, Isabel realizes that she is pregnant and they decide to get married. However, along with the marriage comes compromise of one's own cultural traditions.",
        "runtimeMinutes": "109"
    },
    "1997_75": {
        "plotSummary": "Two dim-witted, inseparable friends hit the road for their ten-year high school reunion and concoct an elaborate lie about their lives in order to impress their classmates.",
        "runtimeMinutes": "92"
    },
    "1997_76": {
        "plotSummary": "A woman cons two old boyfriends into searching for her runaway son by convincing both that they are the boy's father.",
        "runtimeMinutes": "98"
    },
    "1997_77": {
        "plotSummary": "Martin Blank is a professional assassin. He is sent on a mission to a small Detroit suburb, Grosse Pointe, and, by coincidence, his ten-year high school reunion party is taking place there at the same time.",
        "runtimeMinutes": "107"
    },
    "1997_78": {
        "plotSummary": "A mermaid princess makes a Faustian bargain in an attempt to become human and win a prince's love.",
        "runtimeMinutes": "83"
    },
    "1997_79": {
        "plotSummary": "A rescue crew investigates a spaceship that disappeared into a black hole and has now returned...with someone or something new on-board.",
        "runtimeMinutes": "96"
    },
    "1997_8": {
        "plotSummary": "When a woman's long-time friend reveals he's engaged, she realizes she loves him herself and sets out to get him, with only days before the wedding.",
        "runtimeMinutes": "105"
    },
    "1997_80": {
        "plotSummary": "An American man unwittingly gets involved with French werewolves who have developed a serum allowing them to transform at will.",
        "runtimeMinutes": "105"
    },
    "1997_81": {
        "plotSummary": "A young woman is murdered in the White House. Homicide detective Regis (Wesley Snipes) investigates while Secret Service works against him. He's assigned agent Chance (Diane Lane). She eventually cooperates after a man's framed.",
        "runtimeMinutes": "107"
    },
    "1997_82": {
        "plotSummary": "Three years ago, entomologist Dr. Susan Tyler genetically created an insect to kill cockroaches carrying a virulent disease. Now, the insects are out to destroy their only predator, mankind.",
        "runtimeMinutes": "105"
    },
    "1997_83": {
        "plotSummary": "A visiting city reporter's assignment suddenly revolves around the murder trial of a local millionaire, whom he befriends.",
        "runtimeMinutes": "155"
    },
    "1997_84": {
        "plotSummary": "Two dim-witted teenagers are forced to save the fast food restaurant they work at from going out of business, despite a new-and-improved burger joint opening across the street that want to be the \"Top Dog\" in the fast food industry.",
        "runtimeMinutes": "95"
    },
    "1997_85": {
        "plotSummary": "Black gangsters in 1930 Harlem fights Dutch Schultz who is trying to horn in on their numbers racket.",
        "runtimeMinutes": "130"
    },
    "1997_86": {
        "plotSummary": "An unexpected player joins the school basketball team - a circus dog who escaped from a cruel master.",
        "runtimeMinutes": "98"
    },
    "1997_87": {
        "plotSummary": "An American attorney on business in China is wrongfully arrested and put on trial for murder, with a female defense lawyer from the country the only key to proving his innocence.",
        "runtimeMinutes": "122"
    },
    "1997_88": {
        "plotSummary": "This fourth installment of Chan's Police Story film franchise has our hero trying to locate a missing nuclear warhead.",
        "runtimeMinutes": "107"
    },
    "1997_89": {
        "plotSummary": "The myopic millionaire defeats jewel smugglers in his usual bumbling manner.",
        "runtimeMinutes": "87"
    },
    "1997_9": {
        "plotSummary": "In the colorful future, a cab driver unwittingly becomes the central figure in the search for a legendary cosmic weapon to keep Evil and Mr. Zorg at bay.",
        "runtimeMinutes": "126"
    },
    "1997_90": {
        "plotSummary": "Two friends who have gone too long without sex set out to get some.",
        "runtimeMinutes": "79"
    },
    "1997_91": {
        "plotSummary": "After his happy life spins out of control, a preacher from Texas changes his name, goes to Louisiana and starts preaching on the radio.",
        "runtimeMinutes": "134"
    },
    "1997_92": {
        "plotSummary": "Two fishing fanatics get in trouble when their car is stolen during a fishing trip.",
        "runtimeMinutes": "94"
    },
    "1997_93": {
        "plotSummary": "How to create the imagination of movement for fun parks is the theme of this documentary. Although engineers try and try to create machines that shake, tilt, turn, lift and drop people in a way that fools their senses, the real McCoy ...See moreHow to create the imagination of movement for fun parks is the theme of this documentary. Although engineers try and try to create machines that shake, tilt, turn, lift and drop people in a way that fools their senses, the real McCoy cannot be imitated: Roller Coasters just let you experience movement much, much more intense than everything else - even on the screen.  Written by Julian Reischl See less",
        "runtimeMinutes": "38"
    },
    "1997_94": {
        "plotSummary": "A maid is kidnapped and scratches a message onto D.C. the cat's collar and when his owner Patti discovers this, she plays amateur detective with the help of D.C. to try to find the culprits.",
        "runtimeMinutes": "89"
    },
    "1997_95": {
        "plotSummary": "A nameless drifter dons a postman's uniform and bag of mail as he begins a quest to inspire hope to the survivors living in post-apocalyptic America.",
        "runtimeMinutes": "177"
    },
    "1997_96": {
        "plotSummary": "A bride's divorced parents find their old feelings for each other during the wedding reception and over the course of the next few days upsetting the newlywed's honeymoon.",
        "runtimeMinutes": "105"
    },
    "1997_97": {
        "plotSummary": "Young Danny Flynn is released from prison 14 years after \"taking the rap\" for the IRA and tries to rebuild his life in his old Belfast neighborhood.",
        "runtimeMinutes": "113"
    },
    "1997_98": {
        "plotSummary": "Going undercover in rural Kentucky, an environmental agent tries to prove the dumping of toxic waste in the local coal mines by ruthless industrialists.",
        "runtimeMinutes": "105"
    },
    "1997_99": {
        "plotSummary": "A demonic djinn attempts to grant its owner three wishes, which will allow him to summon his brethren to Earth.",
        "runtimeMinutes": "90"
    }
}