{
    "1998_1": "After discovering that an asteroid the size of Texas is going to impact Earth in less than a month, NASA recruits a misfit team of deep-core drillers to save the planet.",
    "1998_10": "With personal crises and age weighing in on them, LAPD officers Riggs and Murtaugh must contend with deadly Chinese triads that are trying to free their former leaders out of prison and onto American soil.",
    "1998_100": "The extracurricular king of Rushmore Preparatory School is put on academic probation.",
    "1998_101": "The famous 1970s New York City nightclub seen and told through the eyes of a young employee.",
    "1998_102": "Three blue-collar acquaintances come across millions of dollars in lost cash and make a plan to keep their find from the authorities, but it isn't long before complications and mistrust weave their way into the plan.",
    "1998_103": "Rafael Infante (Chayanne) comes to Houston from Cuba to work at John Burnett's (Kris Kristofferson's) dance studio. He meets Ruby Sinclair (Vanessa Williams), a cute dance instructor there. Chemistry? Will John know he's Rafael's dad?",
    "1998_104": "Judith Nelson quit her medical studies to marry. Years later, her husband, a physician, divorces her to be with another doctor. Deeply frustrated, she now lives alone in her luxury apartment in New York, looking for a new meaning for her ...See moreJudith Nelson quit her medical studies to marry. Years later, her husband, a physician, divorces her to be with another doctor. Deeply frustrated, she now lives alone in her luxury apartment in New York, looking for a new meaning for her life. Pat Francato, the janitor and lift-boy, has a troubled life himself: Gambling debts and the tragic death of his daughter took away all his spirit. One day, he and Judith meet in the right mood and a fragile friendship starts to grow. They can help each other to get on their feet again. But one false move could destroy everything they built so carefully.  Written by Julian Reischl See less",
    "1998_105": "Two college roommates go out and party, resulting in bad grades. They learn of the clause that says, \"If your roommate dies, you get an A,\" and decide to find someone who is on the verge, so to speak, to move in with them.",
    "1998_106": "A retired detective accepts a simple task, unaware that it will tear open old, forgotten, but deadly wounds.",
    "1998_107": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
    "1998_108": "A soldier trained from birth is deemed obsolete and dumped on a waste planet where he is reluctantly taken in by a community of defenseless, stranded wayfarers.",
    "1998_109": "Valjean, a former criminal, has atoned for his past and now finds himself in the midst of the French Revolution, avoiding a law-obsessed policeman hell-bent on capturing him.",
    "1998_11": "An insurance salesman discovers his whole life is actually a reality TV show.",
    "1998_110": "Elwood must reunite the old band, with a few new members, and go on another \"Mission from God.\"",
    "1998_111": "Frank Conner is an honest police officer who desperately needs to save his son's life. However, after losing all hope, he finds out that a criminal Peter McCabe in jail is his only savior.",
    "1998_112": "A couple with jobs and apartment in NYC, decide to move to his mom's farm, get married and have the baby there. They can also make the changes to get a better price for the farm. However, there's something seriously wrong with his mom.",
    "1998_113": "This film explores an elephant clan's search for food and water as seen through the eyes of one old bull.",
    "1998_114": "A weapons loaded truck is shadowed by FBI and ATF. It explodes and kills the driver. Jack, just out of prison, is pressured into driving another truck from Atlanta to NJ. Things get rough when hijacking attempts are made.",
    "1998_115": "A student gets his senses enhanced by an experimental drug. But abuse is not an option.",
    "1998_116": "Three women each claim to be the widow of 1950s doo-wop singer Frankie Lymon, claiming legal rights to his estate.",
    "1998_117": "Mom and dad dump son Cody, daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma. Purple dinosaur Barney soon appears to entertain kids, and when a large colorful egg deposited on a farm by a shooting star...See moreMom and dad dump son Cody, daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma. Purple dinosaur Barney soon appears to entertain kids, and when a large colorful egg deposited on a farm by a shooting star is accidentally carted off, Barney and kids start their chase for it.  Written by AnonymousSee less",
    "1998_118": "A college student faces an impossible journey when he is left stranded in the desert, thousands of miles from home, with no money and only a few days left until Christmas.",
    "1998_119": "Eddie Murphy stars as an over-the-top television evangelist who finds a way to turn television home shopping into a religious experience, and takes America by storm.",
    "1998_12": "A lawyer becomes targeted by a corrupt politician and his N.S.A. goons when he accidentally receives key evidence to a politically motivated crime.",
    "1998_120": "A London woman's love life and career both hinge, unknown to her, on whether or not she catches a train. We see it both ways, in parallel.",
    "1998_121": "A group of heavily armed hijackers board a luxury ocean liner in the South Pacific Ocean to loot it, only to do battle with a series of large-sized, tentacled, man-eating sea creatures who had already invaded the ship.",
    "1998_122": "An oddball journalist and his psychopathic lawyer travel to Las Vegas for a series of psychedelic escapades.",
    "1998_123": "Pregnant Sally unknowingly falls for the stepson of the deceased father of her baby and has to deal with his homicidal family.",
    "1998_124": "The story of the Newton gang, the most successful bank robbers in history, owing to their good planning and minimal violence.",
    "1998_125": "A fashion designer must join forces with a C.I.A. agent to combat terrorism.",
    "1998_126": "Two small time scam artists, Black and Blue, sell boom boxes and broken TVs from their van at the parking lot. When, by mistake, a shipment of cellular phones gets to them, it doesn't take long before FBI and gangsters are after them.",
    "1998_127": "Story of a golden retriever who can play football.",
    "1998_128": "A loser finds success in the revenge-for-hire business.",
    "1998_129": "A red-colored violin inspires passion, making its way through three centuries over several owners and countries, eventually ending up at an auction where it may find a new owner.",
    "1998_13": "Two business rivals who despise each other in real life unwittingly fall in love over the Internet.",
    "1998_130": "A prostitute is killed during a bachelor party and the attendees turn on each other as the wedding approaches.",
    "1998_131": "Two young friends involved in organized crime and drug dealing find that their priorities differ.",
    "1998_132": "Ryan Harrison is framed for murder and must prove himself innocent by finding a mysterious one-eyed, one-armed, one-legged man after escaping from a bus accident on the way to jail.",
    "1998_133": "An employee of a corporation with a lucrative secret process is tempted to betray it. But there's more to it than that.",
    "1998_134": "Talk show special guests air their grievances backstage and in front of the cameras as the host struggles to manage the mayhem that ensues.",
    "1998_135": "A boy blackmails his neighbor after suspecting him to be a Nazi war criminal.",
    "1998_136": "Two friends must choose whether to help a third friend who was arrested in Malaysia for drug possession.",
    "1998_137": "Gorgeous and extravert Woo meets insecure and straight-laced law clerk Tim at a blind date.",
    "1998_138": "Firefighter Jesse Graves has to save ornithologist Jennifer and other people caught in a forest fire, which was set up by the lawyer of convicted killer Earl Shaye, who escaped from the prison with several of his inmates posing as ...See moreFirefighter Jesse Graves has to save ornithologist Jennifer and other people caught in a forest fire, which was set up by the lawyer of convicted killer Earl Shaye, who escaped from the prison with several of his inmates posing as firefighters to recover thirty-seven million dollars in stashed loot.See less",
    "1998_139": "Billy Crystal plays a Hollywood agent who stumbles upon Max, a giant living in Romania, and tries to get him into the movies.",
    "1998_14": "A young thief, seeking revenge for the death of his brother, is trained by the once great, but aged Zorro, who also pursues vengeance of his own.",
    "1998_140": "An anthropologist creates a fictitious lost New Guinea tribe using his family members to cover-up for his mis-use of grant moneys.",
    "1998_141": "Spencer Griffith's life changes when a meteor falls into a local junkyard, and he finds a Cybersuit, an exoskeleton with AI from another galaxy. When Spencer puts on the Cybersuit he becomes a different kind of person.",
    "1998_142": "Two childhood friends are pro athletes of a national sport called BASEketball, a hybrid of baseball and basketball, and must deal with a greedy businessman scheming against their team.",
    "1998_143": "She caught his eye. He was caught off guard. Now Daryl Allen is caught in the line of fire. After six years behind bars, a reformed street hood(Bokeem Woodbine) puts down his gun and struggles to go legit. But when a beautiful, mysterious ...See moreShe caught his eye. He was caught off guard. Now Daryl Allen is caught in the line of fire. After six years behind bars, a reformed street hood(Bokeem Woodbine) puts down his gun and struggles to go legit. But when a beautiful, mysterious young woman gets him involved with a bag of stolen diamonds, corrupt cops and a Jamaican mobster, his dreams for an honest future are shattered by a hail of gunfire. Snoop Doggy Dogg and LL Cool J cameo in this gritty action-thriller, from the producers of \"Menace II Society\" and \"Tales from the Hood\".  Written by Artisan EntertainmentSee less",
    "1998_144": "A manipulative woman and a roguish man conduct a turbulent romance during the American Civil War and Reconstruction periods.",
    "1998_145": "Arnold rescued Thomas from a fire when he was a child. Thomas thinks of Arnold as a hero, while Arnold's son Victor resents his father's alcoholism, violence and abandonment of his family.",
    "1998_146": "The last days of Frankenstein Director James Whale are explored.",
    "1998_147": "A deeply troubled small-town cop investigates a suspicious hunting death while other events jeopardize his sanity.",
    "1998_148": "A road comedy about 2 guys whose mission is to beat Lewis and Clark.",
    "1998_149": "Stan and his team are back. This time, they will meet in Chamonix to compete in an international hockey championship.",
    "1998_15": "A loyal and dedicated Hong Kong Inspector teams up with a reckless and loudmouthed L.A.P.D. detective to rescue the Chinese Consul's kidnapped daughter, while trying to arrest a dangerous crime lord along the way.",
    "1998_150": "An emotive journey of a former school teacher, who writes letters for illiterate people, and a young boy, whose mother has just died, as they search for the father he never knew.",
    "1998_151": "A 16-year-old girl visits her gay half-brother and ends up seducing his boyfriend, thus wreaking havoc on all of their lives.",
    "1998_152": "A recently released ex-con gets involved in a fake kidnapping scheme that turns very real.",
    "1998_153": "Rosa Lynn sends her druggie daughter Loretta and her children Thomas and Tracy away from the big city to live with their uncle Earl in the ancestral home in rural Mississippi. Earl puts Loretta to work in his restaurant, Just Chicken, ...See moreRosa Lynn sends her druggie daughter Loretta and her children Thomas and Tracy away from the big city to live with their uncle Earl in the ancestral home in rural Mississippi. Earl puts Loretta to work in his restaurant, Just Chicken, while also telling them about the generations of their family, the Sinclairs, dating back to their time in slavery before the the Civil War.  Written by Jon Reeves See less",
    "1998_154": "One hundred fifty dead, and three hundred fifty missing in the tiny mountain town of Snowfield, Colorado, and that's only the beginning.",
    "1998_155": "In 1976, a lower-middle-class teenager struggles to cope living with her neurotic family of nomads on the outskirts of Beverly Hills.",
    "1998_156": "A group of young people take an old bus from Harlem to Miami to make a rap music video there.",
    "1998_157": "The fortunes of a husband and wife differ drastically after they divorce.",
    "1998_158": "The tragic story of world renowned classic cellist Jacqueline du Pre, as told from the point of view of her sister, flautist Hilary du Pre-Finzi.",
    "1998_159": "Unhappy couples fall apart and hop into other beds with other people.",
    "1998_16": "When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp.",
    "1998_160": "A shy reclusive lady is convinced by an invisible entity to sing. Subsequently, she finds herself noticed by a sleazy talent agent and her talent being showcased on-stage. She also meets a kind but nervous man who becomes her best friend.",
    "1998_161": "A Venetian courtesan becomes a hero to her city, but later becomes the target of an inquisition by the Church for witchcraft.",
    "1998_162": "Two surfers end up as Yellowstone park rangers and have to stop a former ranger who is out for revenge.",
    "1998_163": "Max is a popular local sports broadcaster and his marriage with attractive Sam is already set up. Max is not sure he wants Sam to be his wife and offers his best friend Jay a test: Jay will try to seduce Sam and if he fails Max will have ...See moreMax is a popular local sports broadcaster and his marriage with attractive Sam is already set up. Max is not sure he wants Sam to be his wife and offers his best friend Jay a test: Jay will try to seduce Sam and if he fails Max will have enough trust in Sam to go on with a marriage. Jay refuses, but soon they become professionally connected with Sam.  Written by AnonymousSee less",
    "1998_164": "When the father of privileged Rosina da Silva violently dies, she decides to pass herself off as a gentile and finds employment with a family in faraway Scotland. Soon she and the family father, Charles, start a passionate secret affair.See moreWhen the father of privileged Rosina da Silva violently dies, she decides to pass herself off as a gentile and finds employment with a family in faraway Scotland. Soon she and the family father, Charles, start a passionate secret affair.  Written by AnonymousSee less",
    "1998_165": "Gus Cantrell is a major league pitcher in the twilight of his career. He contacted by Roger Dorn, General Manager of the Minnesota Twins, and offered the role of managing the Buzz, the Twins' AAA team. Cantrell accepts but regrets it ...See moreGus Cantrell is a major league pitcher in the twilight of his career. He contacted by Roger Dorn, General Manager of the Minnesota Twins, and offered the role of managing the Buzz, the Twins' AAA team. Cantrell accepts but regrets it almost immediately. The Buzz is a dysfunctional no-hoper team, with an odd assortment of characters. However, Cantrell quickly sets about forging them into a winning team.  Written by grantssSee less",
    "1998_166": "An unlucky in love nurse finds her life taking a detour when her mother places a personals ad in the paper, while on the other side of Boston, a plumber is trying to change careers.",
    "1998_167": "In 1923 London, socialite Clarissa Dalloway's (Vanessa Redgrave's) well-planned party is overshadowed by the return of an old suitor she had known thirty-three years earlier.",
    "1998_168": "A paranoid mathematician searches for a key number that will unlock the universal patterns found in nature.",
    "1998_169": "Story of two female Manhattan book editors fresh out of college, both finding love and themselves while frequenting the local disco.",
    "1998_17": "Egyptian Prince Moses learns of his identity as a Hebrew and his destiny to become the chosen deliverer of his people.",
    "1998_170": "The lives of several individuals intertwine as they go about their lives in their own unique ways, engaging in acts society as a whole might find disturbing in a desperate search for human connection.",
    "1998_171": "Are you feeling cooped up working inside at a desk all day? Well break free and become a true Freerider. Come learn how from some of the best freeriders on the planet like Candide Thovex, JP Auclair, Suzanne Sawyer, Jonny Moseley, and tons...See moreAre you feeling cooped up working inside at a desk all day? Well break free and become a true Freerider. Come learn how from some of the best freeriders on the planet like Candide Thovex, JP Auclair, Suzanne Sawyer, Jonny Moseley, and tons more. Ski down the side of a volcano, take a trip across the pond to London, journey through the deserts of Mexico, and take a cruise along the shores of Greece and discover what it's like to be a true Freerider.See less",
    "1998_172": "Two young boys, both social outcasts in their small town, form an unlikely friendship.",
    "1998_173": "Giles De'Ath (Sir John Hurt) is a widower who doesn't like anything modern. He goes to movies and falls in love with movie star Ronnie Bostock (Jason Priestly). He then investigates everything about the movie and Ronnie. After that, he ...See moreGiles De'Ath (Sir John Hurt) is a widower who doesn't like anything modern. He goes to movies and falls in love with movie star Ronnie Bostock (Jason Priestly). He then investigates everything about the movie and Ronnie. After that, he travels to Long Island City, where Ronnie lives, and meets him, pretending that Ronnie is a great actor, and that's why Giles admires him.See less",
    "1998_174": "After being released from prison, Billy is set to visit his parents with his wife, whom he does not actually have. This provokes Billy to act out, as he kidnaps a girl and forces her to act as his wife for the visit.",
    "1998_175": "Interweaves Twain's life and times with the lives of current day enthusiasts of the 19th century way of life. Utilizing archival stereo-optic photos, powerful images from the past seemingly come alive in a larger-than-life presentation.",
    "1998_176": "Five unmarried sisters make the most of their simple existence in rural Ireland in the 1930s.",
    "1998_177": "Lee Plenty is a flailing, wannabe writer, homeless and apartment-sitting for his friend, the wealthy Havilland Savage, while she is off visiting family. So Lee jumps at the chance to see Havilland, whom he has secretly loved for years.",
    "1998_178": "A talented young photographer, who enjoys snapping photos of his satirical, perverted Baltimore neighborhood and his wacky family, gets dragged into a world of pretentious artists from New York City and finds newfound fame.",
    "1998_179": "A stark, perverse story of murder, kidnapping, and police corruption in a Mexican border town.",
    "1998_18": "The true story of a heroic man, Hunter \"Patch\" Adams, determined to become a medical doctor because he enjoys helping people. He ventured where no doctor had ventured before, using humour and pathos.",
    "1998_180": "In an attempt to resurrect the slapstick comedy of Laurel and Hardy or The Marx Brothers, Arthur (Stanley Tucci) and Maurice (Oliver Platt) team-up as two out-of-work actors who accidentally stowaway on a ship to hide from a drunken, ...See moreIn an attempt to resurrect the slapstick comedy of Laurel and Hardy or The Marx Brothers, Arthur (Stanley Tucci) and Maurice (Oliver Platt) team-up as two out-of-work actors who accidentally stowaway on a ship to hide from a drunken, belligerent lead actor who has sworn to kill them for belittling his talents. Of course, the lead actor end up on the ship as well. Also, madman Voltri, First Mate (Tony Shalhoub) plots the destruction of the ship, and Happy Franks (Steve Buscemi) is a depressed, suicidal lounge singer.  Written by John Sacksteder See less",
    "1998_181": "The story of Hong Kong, from New Year's Day to June 30th, 1997, when the British left their colony and turned it over to the People's Republic of China.",
    "1998_182": "Tarzan returns to his homeland of Africa to save his home from destruction.",
    "1998_183": "The turmoil in poet/playwright Oscar Wilde's life after he discovers his homosexuality.",
    "1998_184": "The world's greatest detective Daryl Zero aided by his associate Steve Arlo investigates a complex and mysterious case of blackmail and missing keys for shady tycoon Gregory Stark who is less than forthcoming about what is really happening!",
    "1998_185": "Billy is a gay fine-arts photographer who falls in love with straight coffee-shop waiter Gabriel.",
    "1998_186": "2 girls wait outside a young actor's door and find out he's had them both as \"only\" girlfriend the last 10 months. They wait inside after breaking in. When Blake comes home he just can't stop lying but they stay.",
    "1998_187": "The antisocial son of an alcoholic father and a bipolar mother grows up in 1960s Ireland.",
    "1998_188": "A young female intern at a small magazine company and a drug-addicted lesbian photographer slowly fall in love while exploiting each other to advance their respective careers.",
    "1998_189": "In mid-1800s England, Oscar is a young Anglican priest, a misfit and an outcast, but with the soul of an angel. As a boy, even though from a strict Pentecostal family, he felt God told him through a sign to leave his father and his faith ...See moreIn mid-1800s England, Oscar is a young Anglican priest, a misfit and an outcast, but with the soul of an angel. As a boy, even though from a strict Pentecostal family, he felt God told him through a sign to leave his father and his faith and join the Church of England. Lucinda is a teen-aged Australian heiress who has an almost desperate desire to liberate her sex from the confines of the male-dominated culture of the Australia of that time. She buys a glass factory and has a dream of building a church made almost entirely of glass, and then transporting it to Bellingen, a remote settlement on the north coast. Oscar and Lucinda meet on a ship going to Australia; once there, they are for different reasons ostracized from society, and as a result \"join forces\" together. Oscar and Lucinda are both passionate gamblers, and Lucinda bets Oscar her entire inheritance that he cannot transport the glass church to the Outback safely. Oscar accepts her wager, and this leads to the events that will change both their lives forever.  Written by M.E. NelsonSee less",
    "1998_19": "An angel on Earth, a doctor unable to believe, a patient with a secret, a love story made in Heaven.",
    "1998_190": "Hollywood movers and shakers dissect their own personal lives when everything seems to clash together.",
    "1998_191": "After hearing that his wife sleeps with Clay, Earl kills himself, making it look like Clay shot him. The widow doesn't like it when Clay starts sees another woman instead. Bodies start piling up.",
    "1998_192": "This fictionalized story, based on the family life of writer James Jones, is an emotionless slice-of-life story. Jones here is portrayed as Bill Willis, a former war hero and now successful author who obviously drinks too much and is ...See moreThis fictionalized story, based on the family life of writer James Jones, is an emotionless slice-of-life story. Jones here is portrayed as Bill Willis, a former war hero and now successful author who obviously drinks too much and is starting to experience health problems. Living in France with his wife, daughter, and an adopted son, the family travels an unconventional road that leaves all of them as outsiders to others. Preaching a sexual freedom, his daughter's sexual acceptance begins at an early age and betrays her when the family moves to Hanover in America. Her sexuality is definitely not the normal for American teens and gives her a bad reputation and outcasts her. Meanwhile her brooding brother struggles with his own inner turmoils about his early desertion in life. Only within the tight knit confines of his family is he comfortable to even speak.  Written by John Sacksteder See less",
    "1998_193": "A group of youngsters kidnap a respected Mafia figure.",
    "1998_194": "After leaving jail, Víctor is still in love with Elena, but she's married to the former cop -now basketball player- who became paralysed by a shot from Víctor's gun...",
    "1998_195": "A lawyer uses his power to help his lover put her father behind bars, but when he escapes, they are all in danger.",
    "1998_196": "At Helge's 60th birthday party, some unpleasant family truths are revealed.",
    "1998_197": "Three pro surfers - gifted Shane, once-great Mickey and rising young star Keoni travel to Madagascar, Bali and Hawaii in search for the ultimate wave.",
    "1998_198": "An introverted garbageman writes his thoughts in a notebook after Henry Fool, writer and ex-con, rents the basement and gives him a notebook and the idea. He writes poetry and Henry helps him along.",
    "1998_199": "Cousin Bette is a poor and lonely seamstress, who, after the death of her prominent and wealthy sister, tries to ingratiate herself into lives of her brother-in-law, Baron Hulot, and her niece, Hortense Hulot. Failing to do so, she instead...See moreCousin Bette is a poor and lonely seamstress, who, after the death of her prominent and wealthy sister, tries to ingratiate herself into lives of her brother-in-law, Baron Hulot, and her niece, Hortense Hulot. Failing to do so, she instead finds solace and company in a handsome young sculptor she saves from starvation. But the aspiring artist soon finds love in the arms of another woman, Hortense, leaving Bette a bitter spinster. Bette plots to take revenge on the family who turned her away and stole her only love. With the help of famed courtesan Jenny Cadine she slowly destroys the lives of those who have scorned her.  Written by See less",
    "1998_2": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
    "1998_20": "Mulder and Scully must fight the government in a conspiracy and find the truth about an alien colonization of Earth.",
    "1998_200": "A detective tries to remain loyal to his partner, and his best friend - a mobster. Read more: Synopsis",
    "1998_201": "The real-life story of Dublin folk hero and criminal Martin Cahill, who pulled off two daring robberies in Ireland with his team, but attracted unwanted attention from the police, the I.R.A., the U.V.F., and members of his own team.",
    "1998_202": "A law student, who takes a job as a night watchman at a morgue, begins to discover clues that implicate him as the suspect of a series of murders.",
    "1998_203": "A comedy writer struggles to overcome his addiction to heroin.",
    "1998_204": "This movie is about a young woman who is married to a devout Jew and the problems that trouble their marriage because of her wanting something more out of her life. Written by Doug",
    "1998_205": "A woman meets a man who isn't the right man for her - but she hasn't realised it yet...",
    "1998_206": "L.A. shop owner Dana and Englishman Sean meet and fall in love at first sight, but Sean is married and Dana is to marry her business partner Alex.",
    "1998_207": "An English professor falls for a minor , and has to face the consequences of his actions.",
    "1998_208": "In 1984, British journalist Arthur Stuart investigates the career of 1970s glam superstar Brian Slade, who was heavily influenced in his early years by hard-living and rebellious American singer Curt Wild.",
    "1998_209": "In the hope of a big score, two junkie couples team up to commit various drug robberies which go disastrously wrong leading to dissent, violence and murder.",
    "1998_21": "The mother of a severely traumatized daughter enlists the aid of a unique horse trainer to help the girl's equally injured horse.",
    "1998_210": "Slam tells the story of Ray Joshua, an original, gifted young MC trapped in a war-zone housing project known as Dodge City. Unable to find a job, Ray copes with the despair and poverty of his neighborhood by using his wits and verbal ...See moreSlam tells the story of Ray Joshua, an original, gifted young MC trapped in a war-zone housing project known as Dodge City. Unable to find a job, Ray copes with the despair and poverty of his neighborhood by using his wits and verbal talent.  Written by Offline PublicistSee less",
    "1998_211": "Humberto Fuentes is a wealthy doctor whose wife has recently died. In spite of the advice of his children, he takes a trip to visit his former students who now work in impoverished villages. His trip soon becomes a quest, politically ...See moreHumberto Fuentes is a wealthy doctor whose wife has recently died. In spite of the advice of his children, he takes a trip to visit his former students who now work in impoverished villages. His trip soon becomes a quest, politically awakening him when he finds out that one of his students was killed by the army.  Written by AnonymousSee less",
    "1998_212": "In the 1960s, a group of friends at an all girls school learn that their school is going to be combined with a nearby all boys school. They concoct a plan to save their school while dealing with everyday problems along the way.",
    "1998_213": "In 1838, lovely governess Elisabeth agrees to bear a child of anonymous English landowner, and he will in return pay her father's debt. At birth she, as agreed, gives up the child. Seven years later she is hired as governess to a girl on a...See moreIn 1838, lovely governess Elisabeth agrees to bear a child of anonymous English landowner, and he will in return pay her father's debt. At birth she, as agreed, gives up the child. Seven years later she is hired as governess to a girl on a remote Sussex estate. The father of the girl, Charles Godwin, turns out to be that anonymous landowner. So Elisabeth has to be her own daughter's governess, and she can't reveal the secret of her tie with little Louisa.  Written by AnonymousSee less",
    "1998_214": "The life of renowned runner Steve Prefontaine and his relationship with legendary coach Bill Bowerman.",
    "1998_215": "A waifish prostitute wanders the streets of Rome looking for true love but finds only heartbreak.",
    "1998_216": "On his book tour, Michael Moore exposes more wrongdoing by greedy big businesses and callous politicians around America.",
    "1998_217": "A detective pursues a sadist specializing in body modification rituals who lures teenagers through the internet.",
    "1998_218": "The film centers on a big Polish family. Jadzia is the mother and the ruler of the Pzoniak family (she has five children). Though she's happily married to Bolek, she is also having a long-time affair with Roman. Her young daughter Hala is ...See moreThe film centers on a big Polish family. Jadzia is the mother and the ruler of the Pzoniak family (she has five children). Though she's happily married to Bolek, she is also having a long-time affair with Roman. Her young daughter Hala is having an affair with neighbour cop Russell and becomes pregnant by him. Russell is pressed hard to marry Hala.  Written by AnonymousSee less",
    "1998_219": "Four friends from the small Texas town of Dancer are graduating from high school and are planning to move to L.A. after graduation, taking the population of Dancer down to 77 from 81. All other 77 residents feel threatened by their ...See moreFour friends from the small Texas town of Dancer are graduating from high school and are planning to move to L.A. after graduation, taking the population of Dancer down to 77 from 81. All other 77 residents feel threatened by their decision and decide to spoil their plans by all means possible.  Written by AnonymousSee less",
    "1998_22": "A waterboy for a college football team discovers he has a unique tackling ability and becomes a member of the team.",
    "1998_220": "A documentary on the life of Kurt Cobain and his relationship with Courtney Love.",
    "1998_221": "Jacob Katadreuffe lives mute with his mother, has no contact with his father who only works against him and wants to become a lawyer, at all costs.",
    "1998_222": "Naive young Mormon Joe Young is recruited to act in porn movies.",
    "1998_223": "A hooker is found cut in two. Two cops give polygraph tests to the only suspect, James Wayland (Tim Roth), an unstable genius. After some time, the roles change.",
    "1998_224": "Twenty-four contestants compete in an endurance/sleep deprivation contest in order to win a brand new Nissan Hardbody truck. The last person to remain standing with his or her hand on the truck wins. An absurd marketing gimmick at first ...See moreTwenty-four contestants compete in an endurance/sleep deprivation contest in order to win a brand new Nissan Hardbody truck. The last person to remain standing with his or her hand on the truck wins. An absurd marketing gimmick at first glance, the contest proves to be much more...  Written by AnonymousSee less",
    "1998_226": "The relationship between four female temps all working for the same credit company is threatened with the arrival of a new hire, who lands a permanent position one of the women was vying for.",
    "1998_227": "Academy Award-winner Barbara Kopple directs this documentary portrait of Academy Award and Golden Globe-winner Woody Allen, seen traveling with friends and fellow musicians during their New Orleans jazz band's 1996 European tour. Allen's ...See moreAcademy Award-winner Barbara Kopple directs this documentary portrait of Academy Award and Golden Globe-winner Woody Allen, seen traveling with friends and fellow musicians during their New Orleans jazz band's 1996 European tour. Allen's relationship with his wife Soon-Yi Previn is captured on film here for the first time, and others on the European jaunt include Allen's sister Letty Aronson. Followed by press, paparazzi, and gushing admirers, Allen returns home to face a more realistic critical assessment during \"the lunch from hell\" with his aged parents.  Written by AnonymousSee less",
    "1998_228": "Six complete strangers with widely varying personalities are involuntarily placed in an endless maze containing deadly traps.",
    "1998_229": "Nishi leaves the police in the face of harrowing personal and professional difficulties. Spiraling into depression, he makes questionable decisions.",
    "1998_23": "The cruel King Louis XIV of France has a secret twin brother whom he keeps imprisoned. Can the twin be substituted for the real king?",
    "1998_230": "A businessman kills his adulterous wife and is sent to prison. After the release, he opens a barbershop and meets new people, talking almost to no one except an eel he befriended while in prison.",
    "1998_231": "Michigan J. Frog is shown to have caused problems throughout history to those greedy souls who try to exploit him.",
    "1998_232": "Brazillian urban guerrilla fighters kidnap the American Ambassador. Now, the diplomat's life hangs in the balance - helplessly caught between a government unwilling to cooperate - and his fear of the captors themselves.",
    "1998_233": "The of story of Russian emigrant Yanko Goorall and servant Amy Foster in the end of nineteenth century. When Yanko enters a farm, sick and hungry after a shipwreck, everyone is afraid of him, except for Amy.",
    "1998_234": "Francesco inherits an old palace from a Turkish aunt and moves to Istanbul to renovate it.",
    "1998_235": "Three young boys, Rocky, Colt and Tum Tum together with their neighbor girl, computer whiz Amanda are visiting Mega Mountain amusement park when it is invaded by an army of ninjas led by evil Medusa, who wants to take over the park and ...See moreThree young boys, Rocky, Colt and Tum Tum together with their neighbor girl, computer whiz Amanda are visiting Mega Mountain amusement park when it is invaded by an army of ninjas led by evil Medusa, who wants to take over the park and hold the owners for ransom. Kids and retired TV star Dave Dragon, who made his farewell appearance at the park at the time the ninjas appeared, have to break Medusa's vicious plans.  Written by AnonymousSee less",
    "1998_236": "A teenage petty criminal dreams of escaping his increasingly unlawful lifestyle when he meets a sweet girl who hopes to one day travel to Alaska.",
    "1998_237": "Two con artists' plan to steal enough for a house are twisted when a pretty girl enters the picture.",
    "1998_238": "Artemisia Gentileschi (1593-1653) was one of the first well-known female painters. The movie tells the story of her youth, when she was guided and protected by her father, the painter Orazio Gentileschi. Her professional curiosity about ...See moreArtemisia Gentileschi (1593-1653) was one of the first well-known female painters. The movie tells the story of her youth, when she was guided and protected by her father, the painter Orazio Gentileschi. Her professional curiosity about the male anatomy, forbidden for her eyes, led her to the knowledge of sexual pleasure. But she was also well known because in 1612 she had to appear in a courtroom because her teacher, Agostino Tassi, was suspected of raping her. She tried to protect him, but was put in the thumb screws...  Written by kipjohn See less",
    "1998_239": "Biography of British painter Francis Bacon focuses on his relationship with his lover, George Dyer, a former small time crook.",
    "1998_24": "A rather neurotic ant tries to break from his totalitarian society while trying to win the affection of the princess he loves.",
    "1998_240": "A screwball comedy about a gay couple at a straight couple's wedding.",
    "1998_241": "In post-war Italy, a working-class man's bicycle is stolen. He and his son set out to find it.",
    "1998_242": "A small-time hoodlum is divided between his conscience and loyalty to his boss when his cousin is murdered.",
    "1998_243": "A teen faces her impending adulthood in the carefree sex and drug revolution years of the early 80's prior to fears of AIDS. She lives with her bitter, divorced mother and her sadistic kid brother. Looking forward to a life based on her ...See moreA teen faces her impending adulthood in the carefree sex and drug revolution years of the early 80's prior to fears of AIDS. She lives with her bitter, divorced mother and her sadistic kid brother. Looking forward to a life based on her passion for art, she nevertheless gets in with the partying crowd which causes her to miss deadlines and poor grades which jeapordizes her future. Ultimately she ends up losing her virginity to an older artist wanna-be who she has had a long standing crush on.  Written by John Sacksteder See less",
    "1998_244": "Lester is an occasional substitute teacher and he's very jealous. He is jealous about the last boyfriend of Lester's slightly wacky current partner Ramona - arrogant best-selling author Dashiell. Lester joins Dashiell's therapy group under...See moreLester is an occasional substitute teacher and he's very jealous. He is jealous about the last boyfriend of Lester's slightly wacky current partner Ramona - arrogant best-selling author Dashiell. Lester joins Dashiell's therapy group under an alias to find out if Dashiell still has any feelings for her.  Written by AnonymousSee less",
    "1998_245": "Marius is the keeper of an abandoned cement works staying high above the quarter of l'Estaque in Marseilles. Jeannette is bringing up her two children alone with her poor checkout operator salary. Their meeting won't be without trouble, ...See moreMarius is the keeper of an abandoned cement works staying high above the quarter of l'Estaque in Marseilles. Jeannette is bringing up her two children alone with her poor checkout operator salary. Their meeting won't be without trouble, since besides material difficulties, both of them are wounded by life. They have to learn how to be happy again.  Written by Gregoire Dubost See less",
    "1998_246": "A 10-year-old boy goes on a search for God after his grandfather dies.",
    "1998_247": "A mouthy and feisty taxicab driver has hot tips for a green and inept cop set on solving a string of New York City bank robberies committed by a quartet of female Brazilian bank robbers.",
    "1998_248": "A rough, short-tempered patriarch of a working class family has his life and the relationships around him slowly unravel.",
    "1998_249": "When the Zapatista National Liberation Army took over five towns and 500 ranches in southern Mexico, the government deployed its troops and at least 145 people died in the ensuing battle. Filmmaker Nettie Wild traveled to the jungle ...See moreWhen the Zapatista National Liberation Army took over five towns and 500 ranches in southern Mexico, the government deployed its troops and at least 145 people died in the ensuing battle. Filmmaker Nettie Wild traveled to the jungle canyons of southern Mexico to film the elusive and fragile life of the rebellion.See less",
    "1998_25": "Robin Monroe, a New York magazine editor, and the gruff pilot Quinn Harris must put aside their mutual dislike if they are to survive after crash landing on a deserted South Seas island.",
    "1998_250": "Betty and Victor are a pair of scam artists. One day Betty brings in Maurice, a treasurer of a multinational company. Maurice is due to transfer 5 millions francs out of Switzerland, and Betty is convinced he plans to steal that money.",
    "1998_251": "Young French officer Augustin Robert escorts artist Jean-Michel Venture de Paradis to Egypt during Napoleon's Egyptian campaign. Napoleon sent de Paradis to record Egypt's great monuments and temples that are destroyed by French soldiers ...See moreYoung French officer Augustin Robert escorts artist Jean-Michel Venture de Paradis to Egypt during Napoleon's Egyptian campaign. Napoleon sent de Paradis to record Egypt's great monuments and temples that are destroyed by French soldiers in acts of barbarism. During combat, Augustin and Jean-Michel are separated from their regiment, and they start wandering through the desert fighting for their life. In one of the canyons Augustin meets a leopard he names Simoom and a strange bond between them appears.  Written by AnonymousSee less",
    "1998_252": "Three young women from very different walks of life join the women's land army during World War II and are sent to work together on a farm in Dorset and the experience changes their lives forever.",
    "1998_253": "When artist and street performer Fletcher (Brendan Fraser) thinks con-artist Roz (Joanna Going) is the woman he has seen in a vision, he has no idea she sees him as her next victim.",
    "1998_254": "In a Norwegian city with a 24-hour daylight cycle a Swedish murder investigator has been brought in on a special case. Sleep deprived, he makes a horrible mistake which is discovered by the killer he has been hunting.",
    "1998_255": "Claudia has lived all her life in a small, seaside, blue-collar town, hanging out with the same group of friends since grade school. Now she's waiting tables in a greasy spoon to help support her mother. After three years together, her ...See moreClaudia has lived all her life in a small, seaside, blue-collar town, hanging out with the same group of friends since grade school. Now she's waiting tables in a greasy spoon to help support her mother. After three years together, her live-in boyfriend, Michael, is eager to tie the knot. Their life together is comfortable and Michael loves her. But Claudia has dreams of life beyond her home town and is afraid that if she marries now, she'll never realize them. Claudia's sister Kelly lives with her mother and struggles with good humor to care for her fatherless baby. Their mother hasn't left the house since Claudia's dad walked out on the family six months ago. No one understands why Claudia sympathizes with her renegade father. Like him, she has a wild, restless streak and longs for more. But she can't quite put her finger on what it is she wants. So when her old flame, Charlie, returns from out west, she begins to wonder... maybe he's the answer.  Written by Eva Tauzer See less",
    "1998_256": "An outsider and a young woman plagued by Tourette's syndrome meet and together journey to Canada.",
    "1998_257": "A newlywed develops a strange lump on his neck that gives him the ability to transform people or objects at will. His wife is very upset. Meanwhile, the CEO of Smilecorp learns of this man and his ability and sees a way to achieve world ...See moreA newlywed develops a strange lump on his neck that gives him the ability to transform people or objects at will. His wife is very upset. Meanwhile, the CEO of Smilecorp learns of this man and his ability and sees a way to achieve world domination if only the man can be taken alive.  Written by Jon Reeves See less",
    "1998_258": "A documentary focusing on the life of novelist and philosopher Ayn Rand, the author of the bestselling novels The Fountainhead and Atlas Shrugged and originator of the Objectivist philosophy.",
    "1998_259": "Since the earliest days in her childhood Lara has had a difficult but important task. Both her parents are deaf-mute and Lara has to translate from sign-language to the spoken word and vice versa when her parents want to communicate with ...See moreSince the earliest days in her childhood Lara has had a difficult but important task. Both her parents are deaf-mute and Lara has to translate from sign-language to the spoken word and vice versa when her parents want to communicate with other people. Getting older and more mature she becomes interested in music and starts to play clarinet very successfully. However her parents are deaf, they cannot share Lara's musical career. The day comes when Lara has to decide between her parents and her own ambitions.  Written by Oliver HeidelbachSee less",
    "1998_26": "A terminally-ill woman must deal with her ex-husband's new lover, who will be their children's stepmother.",
    "1998_260": "A surfer becomes the head of a major company.",
    "1998_261": "Two cowboys have their friendship tested when they fall for the same girl.",
    "1998_262": "This Hong Kong-set crime drama follows the lives of a hitman, hoping to get out of the business, and his elusive female partner.",
    "1998_263": "Longing to have a baby, a sterile 1930s Bostonian hires a man to impregnate his wife.",
    "1998_264": "In the post-apocalyptic world of 1960s Nevada, a rock 'n' roll samurai on his way to Lost Vegas takes a young orphan boy under his protection as Death and his metalhead Horsemen chase after them.",
    "1998_265": "Knight Godefroy has to return to our time from 1023 to get back the sacred jewels that Jacquouille has taken to the 20th century.",
    "1998_266": "A woman explores her sexuality to cope with the passing of her mother, leading her to profound revelations about herself and the people closest to her.",
    "1998_267": "A reporter is on the trail of a vampiric murderer who travels by plane.",
    "1998_268": "A young woman inherits an old hotel in Louisiana where, following a series of supernatural \"accidents\", she learns that the building was built over one of the entrances to Hell.",
    "1998_269": "Two cousins and friends, Richie and Evan, go to Atlantic City to gamble. Richie loses all he has at slot machines and asks Evan for two more coins for a last attempt. That last attempt brings a $400,000 jackpot for Richie. No wonder Evan ...See moreTwo cousins and friends, Richie and Evan, go to Atlantic City to gamble. Richie loses all he has at slot machines and asks Evan for two more coins for a last attempt. That last attempt brings a $400,000 jackpot for Richie. No wonder Evan turns greedy and jealous.  Written by AnonymousSee less",
    "1998_27": "Death, who takes the form of a young man, asks a media mogul to act as a guide to teach him about life on Earth, and in the process, he falls in love with his guide's daughter.",
    "1998_270": "Music From Another Room is a romantic comedy that follows the exploits of Danny, a young man who grew up believing he was destined to marry the girl he helped deliver as a five year old boy when his mother's best friend went into emergency...See moreMusic From Another Room is a romantic comedy that follows the exploits of Danny, a young man who grew up believing he was destined to marry the girl he helped deliver as a five year old boy when his mother's best friend went into emergency labor. Twenty-five years later, Danny returns to his hometown and finds the irresistible Anna Swan but she finds it easy to resist him since she is already engaged to dreamboat Eric, a very practical match. In pursuit of Anna, Danny finds himself entangled with each of the eccentric Swans including blind, sheltered Nina, cynical sister Karen, big brother Bill and dramatic mother Grace as he fights to prove that fate should never be messed with and passion should never be practical.  Written by AnonymousSee less",
    "1998_271": "When Devon, a 10-year-old girl, forges a friendship with Trent, a 21-year-old outsider who mows the neighborhood lawns, things suddenly get very complicated and private.",
    "1998_272": "Traumatised rape victim Jessie (Anne Parillaud) is living a double life as a cool assassin on a mission and as a paranoid bride on her honeymoon.",
    "1998_273": "1871 New England. Two-week orphaned preteen Nat Blake, in his new circumstance, has been living on the streets of Boston with his more streetwise friend, fourteen year old Dan, who looks after Nat and who survives by his cunning and by ...See more1871 New England. Two-week orphaned preteen Nat Blake, in his new circumstance, has been living on the streets of Boston with his more streetwise friend, fourteen year old Dan, who looks after Nat and who survives by his cunning and by stealing. Due to an event of living on the streets, Nat gets a benefactor in the form of John Brooke who pays for his schooling at Plumfield, a boys' boarding school in the country owned and operated by John's sister-in-law and her husband, Jo and Fritz Bhaer. Although each being different in the way they exact their discipline, both the Bhaers believe that treating the boys with compassion and treating them as boys will result in them being better people than if they were strict disciplinarians. Nat goes through some adjustment of needing to lie to survive on the street to life at Plumfield, but ultimately finds that that different life is one to which he truly wants and that the changes he has to make do make him a better person. Nat's stay at Plumfield is further affected by two subsequent arrivals, one being Dan who has no benefactor to pay his way at the school (which is facing financial problems), but it where he says he wants to be despite he treating his stay there the exact same as he is when he is on the street: by his own rules, and not the Bhaers or anyone else's.  Written by HuggoSee less",
    "1998_274": "The story of a 25 year old virgin girl, looking for the right boyfriend, not realizing that \"the one\" has been next to her for many years.",
    "1998_275": "An upper middle-class French family celebrates a birthday in a restaurant. In one evening and during one meal, family history, tensions, collective and separate grudges, delights, and memories both clash and coalesce.See moreAn upper middle-class French family celebrates a birthday in a restaurant. In one evening and during one meal, family history, tensions, collective and separate grudges, delights, and memories both clash and coalesce.  Written by Eileen Berdon See less",
    "1998_276": "Documentary about a multiple murder in rural Nebraska in 1993.",
    "1998_277": "Two sisters leave their small seaside town of Rochefort in search of romance. Hired as carnival singers, one falls for an American musician, while the other must search for her ideal partner.",
    "1998_278": "In a typical English working-class town, the juveniles have nothing more to do than hang around in gangs. One day, Alan Darcy, a highly motivated man with the same kind of youth experience, starts trying to get the young people off the ...See moreIn a typical English working-class town, the juveniles have nothing more to do than hang around in gangs. One day, Alan Darcy, a highly motivated man with the same kind of youth experience, starts trying to get the young people off the street and into doing something they can believe in: Boxing. Soon he opens a training facility which is accepted gratefully by them and the gangs start to grow together into friends. Darcy manages to organize a public fight for them to prove what they have learned. A training camp with hiking tours into the mountains of Wales forge the group into a tight-knit club society. With the day of the fight drawing closer, the young boxers get more and more excited.  Written by Julian Reischl See less",
    "1998_279": "Joe and Mary live in Manhattan. She's the breadwinner, working as makeup artist. He's a wannabe actor working as waiter. When a friend gets a soap part ($3600/wk), Joe lowers his standard.",
    "1998_28": "The babies gets lost in the forest after Tommy Pickles (Elizabeth Daily) gets a new baby brother.",
    "1998_280": "a group of young troublemakers try to help a sea lion escape to ocean.",
    "1998_281": "The slightly kleptomanic 29-year-old Mathilde is experiencing strange swoonings since a few days. There she encounters a mysterious doctor who treats her with hypnosis therapy. As she gets better her husband Nico does not. He even has ...See moreThe slightly kleptomanic 29-year-old Mathilde is experiencing strange swoonings since a few days. There she encounters a mysterious doctor who treats her with hypnosis therapy. As she gets better her husband Nico does not. He even has problems recognizing his wife, especially when she has an orgasm while in bed with him. So he also goes to a psychiatrist, but the therapy does not seem to work...  Written by Marco Radke See less",
    "1998_282": "At her son's funeral, Solange, a lawyer famous for losing hopeless cases, agrees to defend Rene, her son's age, accused of murdering his wealthy aunt, Jeanne, who's part of the Franco-Belgian Psychoanalytic Society, known for odd views and...See moreAt her son's funeral, Solange, a lawyer famous for losing hopeless cases, agrees to defend Rene, her son's age, accused of murdering his wealthy aunt, Jeanne, who's part of the Franco-Belgian Psychoanalytic Society, known for odd views and methods. She reads Jeanne's journal, documenting Rene's criminal tendencies. Solange believes him innocent, manipulated into the murder or framed. Odd psychiatrists turn up, including Georges Didier, who runs FBPS, and his rival, Christian, who believes crime originates in a story's taking hold of a person. After the verdict, Rene and Solange's relationship changes, Georges and his society commit a bizarre act, and the police record Solange's story.  Written by See less",
    "1998_283": "3 marijuana farmhands see their boss killed, ending their peaceful existence in NW California. They decide to harvest, process and sell the crop themselves. Crime bosses, corrupt cops, killer pilot, greed etc. ensue.",
    "1998_284": "Two miserable people find happiness together: a man dreaming of flying, and a woman dreaming of living.",
    "1998_285": "Follows the plot of Pulp Fiction. Scenes from other movies are also parodied.",
    "1998_286": "When a young girl becomes lost in the hustle and bustle of Tehran, her journey turns into a dazzling exercise on the nature of film itself. In this ingenious and daringly original feature, world renowned director Jafar Panahi (The White ...See moreWhen a young girl becomes lost in the hustle and bustle of Tehran, her journey turns into a dazzling exercise on the nature of film itself. In this ingenious and daringly original feature, world renowned director Jafar Panahi (The White Balloon, Crimson gold) has wrapped a blunt political critique inside the layers of a deceptively simple film.  Written by [from video jacket]See less",
    "1998_287": "Young Tommy Hudler decides to become a security systems salesman, and is an instant success. Everything seems to be going great until he discovers there's more to this business and his boss Heinrich than he previously suspected.See moreYoung Tommy Hudler decides to become a security systems salesman, and is an instant success. Everything seems to be going great until he discovers there's more to this business and his boss Heinrich than he previously suspected.  Written by Rob M. See less",
    "1998_288": "Several yakuza from Tokyo are sent to Okinawa to help end a gang war. The war then escalates and the Tokyo drifters decide to lay low at the beach.",
    "1998_289": "A group of seven former college friends gather for a week-end reunion at a South Carolina vacation home after the funeral of another of their college friends.",
    "1998_29": "The Robinson family was going into space to fight for a chance for humanity. Now they are fighting to live long enough to find a way home.",
    "1998_290": "When a rookie filmmaker with the unfortunate name Alan Smithee realizes he's an unwitting studio puppet, being forced to make a big-budget action movie he knows is horrible, he steals the master reels and tries to make a deal.",
    "1998_291": "Reece McHenry is a used-clothing store owner and Carol Fitzsimmons is a seamstress working in that store. The film follows the story of their relationships from 1960s till present time (as well as the story of relationships between Reece's...See moreReece McHenry is a used-clothing store owner and Carol Fitzsimmons is a seamstress working in that store. The film follows the story of their relationships from 1960s till present time (as well as the story of relationships between Reece's son Tom and Carol's daughter Katherine).  Written by AnonymousSee less",
    "1998_292": "Frenchman Abel Tiffauges likes children, and wants to protect them against the grown-ups. Falsely suspected as child molester, he's recruited as a soldier in the 2nd World War, but very soon he is taken prisoner of war. After shortly ...See moreFrenchman Abel Tiffauges likes children, and wants to protect them against the grown-ups. Falsely suspected as child molester, he's recruited as a soldier in the 2nd World War, but very soon he is taken prisoner of war. After shortly serving in Goerings hunting lodge, he becomes the dogsbody in Kaltenborn Castle, an elite training camp for German boys. Completely happy to take care of these children, he becomes a servant of Nazism, catching boys from the area as supplies for the camp.  Written by Frank Wallner See less",
    "1998_293": "During a rural summer picnic, a few students and a teacher from an Australian girls' school vanish without a trace. Their absence frustrates and haunts the people left behind.",
    "1998_294": "2 bad singers are mistaken for top safe-crackers at a bar. A gangster boss orders them to break into 3 safes or else..",
    "1998_295": "A cop (Liotta) with a gambling addiction plots a theft from the bookies who are putting pressure on him to pay off or else.",
    "1998_296": "10-year-old Harriet dreams of leaving her home, where she doesn't feel she's needed by her mother and sister Gwen. When her mother dies in a car accident, she really starts to make plans for leaving and she finally does so together with ...See more10-year-old Harriet dreams of leaving her home, where she doesn't feel she's needed by her mother and sister Gwen. When her mother dies in a car accident, she really starts to make plans for leaving and she finally does so together with her childlike (mentally ill) friend Ricky.  Written by AnonymousSee less",
    "1998_297": "Joey and Sissel are two misfits spending most of their time together talking or having sex. Gradually and slowly their relationships are becoming boring for them.",
    "1998_298": "Martin Scorsese describes his initial and growing obsession with films from the 1940s and 50s as the art form developed and grew with clips from classics and cult classics.",
    "1998_299": "A con artist escapes a deal gone wrong in New York and winds up in the Aussie outback in a strange town whose inhabitants are an oddball collection of misfits. Written by Anonymous",
    "1998_3": "A giant, reptilian monster surfaces, leaving destruction in its wake as it strides into New York City. To stop it, an earthworm scientist, his reporter ex-girlfriend, and other unlikely heroes team up to save their city.",
    "1998_30": "A half-vampire, half-mortal man becomes a protector of the mortal race, while slaying evil vampires.",
    "1998_300": "Based on Pat Barker's novel of the same name, 'Regeneration' tells the story of soldiers of World War One sent to an asylum for emotional troubles. Two of the soldiers meeting there are Wilfred Owen and Siegfried Sassoon, two of England's ...See moreBased on Pat Barker's novel of the same name, 'Regeneration' tells the story of soldiers of World War One sent to an asylum for emotional troubles. Two of the soldiers meeting there are Wilfred Owen and Siegfried Sassoon, two of England's most important WW1 poets.  Written by Daniel Roy See less",
    "1998_301": "A small-time hood tries to keep the peace between his friend Johnny and Johnny's creditors.",
    "1998_302": "Wes and Nancy are a married academics couple. One day they host Nancy's long-ago lover Matt and his current sexy girlfriend Kim. Matt is a musician and Kim is a computer specialist who helped Matt to make some discovery in his science. Wes...See moreWes and Nancy are a married academics couple. One day they host Nancy's long-ago lover Matt and his current sexy girlfriend Kim. Matt is a musician and Kim is a computer specialist who helped Matt to make some discovery in his science. Wes suspects Kim of stealing 50 dollars from him and that starts tension, intrigues, mistrust.  Written by AnonymousSee less",
    "1998_303": "1987, love in time of war. A bus driver George Lennox meets Carla, a Nicaraguan exile living a precarious, profoundly sad life in Glasgow. Her back is scarred, her boyfriend missing, her family dispersed; she's suicidal. George takes her ...See more1987, love in time of war. A bus driver George Lennox meets Carla, a Nicaraguan exile living a precarious, profoundly sad life in Glasgow. Her back is scarred, her boyfriend missing, her family dispersed; she's suicidal. George takes her to Nicaragua to find out what has happened to them and to help her face her past. Once home, Carla's nightmarish memories take over, and Carla and George are thrown into the thick of the US war against the Sandinistas. A mystery develops over where Carla's boyfriend is, and the key to his whereabouts may be Carla's friend Bradley, a bitter American aid worker. She finds her family, the Contras attack, and she and the Scot face their choices.  Written by See less",
    "1998_304": "Nick, is a young Scottish soccer player living in the big city. He meets Karen, and the two fall in love and move in together. Soon after, Nick exhibits signs of serious illness. As his body slowly succumbs to multiple sclerosis, he ...See moreNick, is a young Scottish soccer player living in the big city. He meets Karen, and the two fall in love and move in together. Soon after, Nick exhibits signs of serious illness. As his body slowly succumbs to multiple sclerosis, he experiences a wide sweep of jagged emotions, and in the process gives himself and those who love him the strength to carry on.  Written by AnonymousSee less",
    "1998_305": "Girl leads a lonely life until she meets the boy of her dreams. The boy, however, has a live-in girlfriend.",
    "1998_306": "There is more to this story than this review lets on. It reflects all different facets of society over one drivers shift. He starts out it seems as a cold, ignorant man. But his character develops as the different people of Chicago come & ...See moreThere is more to this story than this review lets on. It reflects all different facets of society over one drivers shift. He starts out it seems as a cold, ignorant man. But his character develops as the different people of Chicago come & go. His character shows through when he tells a woman the truth about one of the huys he has in his cab. One highlight of this is the amount of cameos by well known faces who seem to be doing this film for the craic. The cab driver reacts well to the madness surrounding him & you can almost share his tiredness at the end of the shift. Crackheads, stoners, posh randy lawyers, irate Pakistanis and the high & lows of the working day are dealt with in this low budget film.  Written by Michael A Hunter See less",
    "1998_307": "From a bland tract house on the outskirts of Los Angeles, Simon Geist (with occasional help from his platonic girlfriend Darla) wages war against all of modern American popular culture. Geist starts up a magazine called \"The Next Big Thing...See moreFrom a bland tract house on the outskirts of Los Angeles, Simon Geist (with occasional help from his platonic girlfriend Darla) wages war against all of modern American popular culture. Geist starts up a magazine called \"The Next Big Thing\", which he uses to confront and insult upcoming actors, comics, models and rock bands. As Geist's mysterious Underground Agenda escalates, will he become the \"last big thing\", or be co-opted by the very forces he is railing against?  Written by Van Film FestSee less",
    "1998_308": "In 1995, Chasen's closed its doors after 60 years of serving chili to movie stars and visiting dignitaries, Presidents and the Pope. During its two final weeks, Chasen regulars (actors and producers), staff, and management sat for ...See moreIn 1995, Chasen's closed its doors after 60 years of serving chili to movie stars and visiting dignitaries, Presidents and the Pope. During its two final weeks, Chasen regulars (actors and producers), staff, and management sat for interviews. There's an Oscar party for 1500, footage and photos of famous diners, and time with Tommy Gallagher, the ebullient head waiter until retirement in 1994, his son Patrick, catering head Raymond Bilbool, general manager Ronnie Clint, hat check girl Val Schwab, ladies' room attendant Onetta Johnson, and foreign- born waiters, including Jaime. When he started in 1970, like other Latins, he wasn't allowed out of the kitchen. It's a family farewell.  Written by See less",
    "1998_309": "This is the story of a young Irish woman who comes to Spain to escape from the pressures she feels about her impending marriage to a political activist in Ireland. But in Spain in the 1930's, taking a job of governess in a wealthy family, ...See moreThis is the story of a young Irish woman who comes to Spain to escape from the pressures she feels about her impending marriage to a political activist in Ireland. But in Spain in the 1930's, taking a job of governess in a wealthy family, she finds the same kinds of political unrest. In fact, it isn't long before she finds herself attracted to a married man who is similarly involved in the struggle against fascism and Franco. This awakens her to her nature that brings her to such men and resolves for her what she must do about the life she left in Ireland.  Written by BOB STEBBINS See less",
    "1998_31": "A wealthy Wall Street speculator discovers that his wife has a lover. He investigates him and uses the carrot and stick to make him murder his wife. Planned to detail, it seems like a perfect murder.",
    "1998_310": "Successful playwright Felix Webb has a new play, 'The Hit Man', in rehearsal. Directed by his old friend Humphrey, it is already being hailed as a masterpiece; but Felix can't enjoy his success. He has fallen passionately in love with ...See moreSuccessful playwright Felix Webb has a new play, 'The Hit Man', in rehearsal. Directed by his old friend Humphrey, it is already being hailed as a masterpiece; but Felix can't enjoy his success. He has fallen passionately in love with Hilary, a beautiful, fiesty young actress, and is preparing to desert his perfect family, his wife Elena and three lively children. His intolerable situation is further complicated when Humphrey casts Hilary as one of the leads in 'The Hit Man'. Enter Robin Grange, a charismatic young Hollywood actor making his London theatre debut. Robin is attractive, charming and dangerous, and soon inveigles his way into everyone's life. He ingratiates himself with the cast and, quickly grasping Felix's dilemma, sets about weaving his web of mischief. He suggests that if he were to seduce Elena, she would be distracted from Felix's affair, regain her self respect, and perhaps even willingly part from the unfaithful husband to whom she clings. Initially Felix is outraged but as the tension mounts with Hilary, reluctant to continue as the second woman in his life, he succumbs. Watching in horror as Elena responds to Robin's perfectly plotted seduction, and tormented with suspicions that Hilary has also fallen under Robin's spell, Felix spirals towards a kind of madness. Desperate to regain control of his life, he indulges in a grand theatrical gesture, but fate intervenes, and both Felix and Robin learn that real life doesn't always follow the script.  Written by Eva Tauzer See less",
    "1998_311": "Can you go home again? What if you're a gay man and home is a state where voters keep electing a homophobe to the US Senate? In 1996, at age 30, native son Tim Kirkman returns to North Carolina to explore the parallels and differences ...See moreCan you go home again? What if you're a gay man and home is a state where voters keep electing a homophobe to the US Senate? In 1996, at age 30, native son Tim Kirkman returns to North Carolina to explore the parallels and differences between himself and Jesse Helms: they're from the same town and college, with media interests, from families blessed by adoptions, Baptists by upbringing. Tim puts his camera in front of his family, a boyhood pal, college friends, his pastor, Helms fans, community activists, novelists Lee Smith and Allan Gurganus, a mayor who's gay, and people in the street, including a brief interview with Matthew Shepard. What is it to judge, and what is it to love?  Written by See less",
    "1998_312": "Two Chinese-mainlanders living in Hong Kong form a close friendship. Over the years this grows into love, but there are obstacles.",
    "1998_313": " Read more: Synopsis",
    "1998_314": "Esmeralda is married with 5 husbands at the same time, so she has to explain to the judge why she has done this.",
    "1998_315": "A documentary about the production of From Dusk Till Dawn and the people who made it.",
    "1998_316": "Dowd, who's IRA, escapes an Irish prison in a bloody jailbreak, making his way to New York City where he lives alone, avoids Irish hangouts, and works as a dishwasher. When a good deed gets him stabbed, one of the restaurant employees ...See moreDowd, who's IRA, escapes an Irish prison in a bloody jailbreak, making his way to New York City where he lives alone, avoids Irish hangouts, and works as a dishwasher. When a good deed gets him stabbed, one of the restaurant employees takes him in and finds him medical care. As Dowd recovers in the flat of Tulio and Tulio's sister Monica, he realizes that these Guatemalan exiles share his rebellious principles. When he learns they are planning a political assassination, he offers to help. His attraction to Monica contributes to his willingness to volunteer. However, the cops are closing in on him: can he make the hit, protect his new friends, and escape with Monica?  Written by See less",
    "1998_317": "A group of washed-up Canadian punk rockers get back together for a road trip in memory of a dear friend who was supposedly shot, or so rumors imply. As they travel, they ignore the underlying psychological darkness within each other.",
    "1998_318": "A hardened mercenary in the Foreign Legion begins to find his own humanity when confronted with atrocities during the fighting in Bosnia.",
    "1998_319": "19 y.o. Jimmy' s dad is a vicious, impotent Vietnam vet, who forces his wife and son to have incest. He has a secret he'll kill to keep. Jimmy won't abandon his two kid brothers by leaving.",
    "1998_32": "An international team of climbers ascends Mt. Everest in the spring of 1996. The film depicts their lengthy preparations for the climb, their trek to the summit, and their successful return to Base Camp. It also shows many of the ...See moreAn international team of climbers ascends Mt. Everest in the spring of 1996. The film depicts their lengthy preparations for the climb, their trek to the summit, and their successful return to Base Camp. It also shows many of the challenges the group faced, including avalanches, lack of oxygen, treacherous ice walls, and a deadly blizzard.  Written by Eric SorensenSee less",
    "1998_320": "Sonny lives with his intellectually disabled older brother, and works as a bellhop at a second-rate hotel. This changes when Monique a beautiful, suicidal nut-case checks in. Sonny is offered a part in a heist that goes wrong.",
    "1998_321": "In this film, director Jonathan Demme documents a live performance by Robyn Hitchcock, an English singer-songwriter.",
    "1998_322": "The films tells the story of three friends living in the Bronx in New York - Juan Jose a.k.a. J.J., Joey and Louie. The first half of the film tells of them when they were children, and second is set 15 years later, when they have much ...See moreThe films tells the story of three friends living in the Bronx in New York - Juan Jose a.k.a. J.J., Joey and Louie. The first half of the film tells of them when they were children, and second is set 15 years later, when they have much more serious problems.  Written by AnonymousSee less",
    "1998_323": "A film crew ventures into the forest in search of the mythical 'Jersey Devil'.",
    "1998_324": "1947, in Patagonia, in a little village on the seaside. An abandoned house on the beach shelters Letty's dreams, her loneliness that only Miguel, a very young pianist, may share with her. Tomas, her husband, loves Letty and eagerly defends...See more1947, in Patagonia, in a little village on the seaside. An abandoned house on the beach shelters Letty's dreams, her loneliness that only Miguel, a very young pianist, may share with her. Tomas, her husband, loves Letty and eagerly defends her against all the village, while she keeps playing her part of a 'femme fatale' with a romantic past and a very adventurous file. But on a windy day, a handsome and strange foreigner appears, coming from the sea, a man just as those Bette Davis used to fall in love with. For Letty, reality begins to look like the most incredible dreams of her. But this will call the police inspector's attention. With that mysterious spy, Letty will be involved in a story that will end as those stories she was so fond of when she was going to the movie theater of her little willage.  Written by NaleatovSee less",
    "1998_325": "In 1995, Kelli Peterson started a gay and straight club at her Salt Lake City high school. The story of her ensuing battle with school authorities in interspersed with looks back at the diary of Michael Wigglesworth, a 17th-century Puritan...See moreIn 1995, Kelli Peterson started a gay and straight club at her Salt Lake City high school. The story of her ensuing battle with school authorities in interspersed with looks back at the diary of Michael Wigglesworth, a 17th-century Puritan cleric, at the 30-year love affair of Sarah Orne Jewett and Annie Adams Fields, at Henry Gerber's attempt after World War I to establish a gay-rights organization, at Bayard Rustin's role in the civil rights movement, and at Barbara Gittings' taking on of the American Psychiatric Association's position that homosexuality is illness. One person comments, \"To create a place for ourselves in the present, we have to find ourselves in the past.\"  Written by See less",
    "1998_326": "Jimmy needs $900 to clear a gambling debt but a series of lies leads to Ray trying to raise the cash from friends who owe him money.",
    "1998_327": "WEST AFRICA 1869 - Slave trade is illegal. There is a revolt on a slave ship - twenty four men fight for their lives. Out-gunned, the revolt fails but a second uprising is planned.See moreWEST AFRICA 1869 - Slave trade is illegal. There is a revolt on a slave ship - twenty four men fight for their lives. Out-gunned, the revolt fails but a second uprising is planned.  Written by Man Wei Tam See less",
    "1998_328": "It is 1977, Dublin rocks to the music of Thin Lizzy and the world is stunned by the death of Elvis Presley. Frankie, caught between acne and adulthood, has just completed his final exams in school. Convinced he will fail, he survives the ...See moreIt is 1977, Dublin rocks to the music of Thin Lizzy and the world is stunned by the death of Elvis Presley. Frankie, caught between acne and adulthood, has just completed his final exams in school. Convinced he will fail, he survives the summer organising a beach party, having lustful thoughts about two girls he believes are unobtainable and fending off the advances from a visiting American family friend, all whilst coping with his oddball family.  Written by AnonymousSee less",
    "1998_329": "Tells how Roger Kamenetz, author of the best-selling 1994 book by the same title, found his way back to Judaism - the tradition of his birth.",
    "1998_33": "Robbie, a singer, and Julia, a waitress, are both engaged, but to the wrong people. Fortune intervenes to help them discover each other.",
    "1998_330": "Pino Buchero has to find his brother, who has disappeared. Forced to use an alias, Pino heads to the United States, encounters an assortment of strangers, falls in love and decides to kill his brother, when he finally finds him.",
    "1998_331": "Two school kids, who are best friends, are drinking on the side of a river. One friend bets the other that he can't swim across the river and \"Reach The Rock\". The friend takes the bet and drowns halfway towards the rock. The entire town ...See moreTwo school kids, who are best friends, are drinking on the side of a river. One friend bets the other that he can't swim across the river and \"Reach The Rock\". The friend takes the bet and drowns halfway towards the rock. The entire town blames the the kid for his friends death, he runs away, never to be seen again. He eventually comes back to his home town of Shermerville and goes crazy, and starts to trash the town (for example, breaking store-front windows, stealing a police car). He also meets up with his old high school girlfriend. The majority of the movie takes place in one night.  Written by Darryl WisnerSee less",
    "1998_332": "The Other Side of Sunday criticizes the small, and often tight church community. We follow the Preachers Daughter; Maria, in her journey to liberate herself from the stiff church community and her strict religious father.",
    "1998_333": "Story of a New England boys' school and of one of the students who is infatuated with an instructor's wife who has Multiple Sclerosis. The woman struggles to show her strict husband how love rather than demands helps the student to blossom...See moreStory of a New England boys' school and of one of the students who is infatuated with an instructor's wife who has Multiple Sclerosis. The woman struggles to show her strict husband how love rather than demands helps the student to blossom, but finally she falls into a coma. While she is able to have some 'looking down' awareness of what is happening, her coma is what brings her husband to an understanding of the needs of others.  Written by BOB STEBBINS See less",
    "1998_334": "After a fundraiser for a black politician is robbed, Detroit police put two detectives, one white and one black, on the case, who try to work together under boiling political pressure.",
    "1998_335": "A former L.A. drug dealer has moved to Houston to make a new life for himself as a married architect. Everything falls apart when he is suddenly visited by one of his former cohorts who comes carrying heroin.",
    "1998_336": "During the war in Bosnia, two childhood friends eventually become enemies, as the tragic and devastating circumstances of the war put them on the opposite sides and expose the most gruesome and cruel aspects of the human nature.",
    "1998_34": "The secret U.S. abduction of a suspected terrorist leads to a wave of terrorist attacks in New York City, which leads to the declaration of martial-law.",
    "1998_35": "When the crew of the Enterprise learn of a Federation conspiracy against the inhabitants of a unique planet, Captain Picard begins an open rebellion.",
    "1998_36": "A youth who finds a dinosaur egg accidentally breaks it. Soon after, she begins to have surreal visions of dinosaurs, including the Tyrannosaurus Rex.",
    "1998_37": "A shady police detective finds himself in the middle of a murder conspiracy at an important boxing match in an Atlantic City casino.",
    "1998_38": "U.S. Marshal Samuel Gerard and his team of Marshals are assigned to track down Sheridan, who has been accused of a double-murder.",
    "1998_39": "Adaptation of James Jones' autobiographical 1962 novel, focusing on the conflict at Guadalcanal during the second World War.",
    "1998_4": "A man gets a chance to meet up with his dream girl from high school, even though his date with her back then was a complete disaster.",
    "1998_40": "The Brothers Grimm arrive at the home of a wealthy Grande Dame who speaks of the many legends surrounding the fable of the cinder girl before telling the \"true\" story of her ancestor.",
    "1998_41": "Shadowy elements in the NSA target a nine-year old autistic savant for death when he is able to decipher a top secret code.",
    "1998_42": "Identical twins Annie and Hallie, separated at birth and each raised by one of their biological parents, later discover each other for the first time at summer camp and make a plan to bring their wayward parents back together.",
    "1998_43": "The early years of the reign of Elizabeth I of England and her difficult task of learning what is necessary to be a monarch.",
    "1998_44": "Birdee Calvert must choose between her morals and her heart after her husband divorces her and a charming young man, who her daughter disapproves of, comes back into her life.",
    "1998_45": "A career bank robber breaks out of jail, and shares a moment of mutual attraction with a U.S. Marshal he has kidnapped.",
    "1998_46": "A college student suspects a series of bizarre deaths are connected to certain urban legends.",
    "1998_47": "Babe, fresh from his victory in the sheepherding contest, returns to Farmer Hoggett's farm, but after Farmer Hoggett is injured and unable to work, Babe has to go to the big city to save the farm.",
    "1998_48": "A tenacious lawyer takes on a case involving a major company responsible for causing several people to be diagnosed with leukemia due to the town's water supply being contaminated, at the risk of bankrupting his firm and career.",
    "1998_49": "Modernization of Charles Dickens classic story finds the hapless Finn as a painter in New York City pursuing his unrequited and haughty childhood love.",
    "1998_5": "A misfit ant, looking for \"warriors\" to save his colony from greedy grasshoppers, recruits a group of bugs that turn out to be an inept circus troupe.",
    "1998_50": "Chris Nielsen dies in an accident, and enters Heaven. But when he discovers that his beloved wife Annie has killed herself out of grief over the loss, he embarks on an afterlife adventure to reunite with her.",
    "1998_51": "When a lottery winner dies of shock, his fellow townsfolk attempt to claim the money.",
    "1998_52": "Laurie Strode, now the dean of a Northern California private school with an assumed name, must battle the Shape one last time, as the life of her own son hangs in the balance.",
    "1998_53": "When missile technology is used to enhance toy action figures, the toys soon begin to take their battle programming too seriously.",
    "1998_54": "A man joins the political campaign of a smooth-operator candidate for President of the U.S.",
    "1998_55": "Chucky, the doll possessed by a serial killer, discovers the perfect mate to kill and revive into the body of another doll.",
    "1998_56": "A legendary fifteen-foot tall mountain gorilla named Joe is taken to an animal sanctuary in California by zoologist Gregg O'Hara (Bill Paxton) and Jill Young (Charlize Theron), with whom he grew up. Poacher Strasser (Rade Serbedzija) ...See moreA legendary fifteen-foot tall mountain gorilla named Joe is taken to an animal sanctuary in California by zoologist Gregg O'Hara (Bill Paxton) and Jill Young (Charlize Theron), with whom he grew up. Poacher Strasser (Rade Serbedzija) returns from the past to seek vengeance on Joe.See less",
    "1998_57": "Two 1990s teenage siblings find themselves in a 1950s sitcom, where their influence begins to profoundly change that complacent world.",
    "1998_58": "A pregnant New York City social worker begins to develop romantic feelings for her gay best friend, and decides she'd rather raise her child with him, much to the dismay of her overbearing boyfriend.",
    "1998_59": "Two witch sisters, raised by their eccentric aunts in a small town, face closed-minded prejudice and a curse which threatens to prevent them ever finding lasting love.",
    "1998_6": "A comet is discovered to be on a collision course with Earth. As doomsday nears, the human race prepares for the worst.",
    "1998_60": "Jeff \"The Dude\" Lebowski, mistaken for a millionaire of the same name, seeks restitution for his ruined rug and enlists his bowling buddies to help get it.",
    "1998_61": "Egypt is and ever was a place of mystery. Many rumors spread around the great Pyramids of Gizeh. Here, an old Egyptian is asked by his granddaughter about those mysteries of which we all heard in one way or the other.",
    "1998_62": "In a desperate attempt to prove his innocence, a skilled police negotiator accused of corruption and murder takes hostages in a government office to gain the time he needs to find the truth.",
    "1998_63": "A freelancing former U.S. Intelligence Agent tries to track down a mysterious package that is wanted by the Irish and the Russians.",
    "1998_64": "Students suspect that their teachers are aliens after bizarre occurrences.",
    "1998_65": "The murderous fisherman with a hook is back to once again stalk the two surviving teens, Julie and Ray, who had left him for dead, as well as cause even more murder and mayhem, this time at a posh island resort.",
    "1998_66": "Stella is a highly successful, forty-something San Francisco stock broker who is persuaded by her colorful New York girlfriend Delilah to take a well deserved, first-class vacation to Jamaica.",
    "1998_67": "A young female embezzler arrives at the Bates Motel, which has terrible secrets of its own.",
    "1998_68": "A spaceship is discovered under three hundred years' worth of coral growth at the bottom of the ocean.",
    "1998_69": "A father who can't keep his promises, dies in a car accident. One year later, he returns as a snowman, who has the final chance to put things right with his son, before he is gone forever.",
    "1998_7": "To save her father from death in the army, a young maiden secretly goes in his place and becomes one of China's greatest heroines in the process.",
    "1998_70": "Two dim-witted brothers dream of owning their own dance club or at least getting into the coolest and most exclusive club in town, The Roxbury.",
    "1998_71": "A police detective uncovers a conspiracy behind a case involving a high-school guidance counselor when accusations of rape are made against him by two female students.",
    "1998_72": "Horrified at the prospect of her beloved school being sold, a young French girl uses her wit and craftiness to attempt to save it, making an unlikely new friend in the process.",
    "1998_73": "World famous pop group the Spice Girls zip around London in their luxurious double decker tour bus having various adventures and performing for their fans.",
    "1998_74": "A suicidally disillusioned liberal politician puts a contract out on himself and takes the opportunity to be bluntly honest with his voters by affecting the rhythms and speech of hip-hop music and culture.",
    "1998_75": "Good girl Sandy Olsson and greaser Danny Zuko fell in love over the summer. When they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance?",
    "1998_76": "A man struggles with memories of his past, which includes a wife he cannot remember, and a nightmarish world, no one else seems to be waking up from.",
    "1998_77": "Socially anxious hitman Melvin Smiley, an expert in his lucrative field, goes on a job and falls in love with his kidnapping victim, turning his world upside down.",
    "1998_78": "Paulie, a talking parrot, recounts his travels looking for his original owner to a Russian janitor who helps him to the end of his journey.",
    "1998_79": "A career woman reassesses her parents' lives after she is forced to care for her cancer-stricken mother.",
    "1998_8": "A doctor discovers that he can communicate with animals.",
    "1998_80": "Multicharacter teenage comedy about high school graduates with different agenda of life on graduation night.",
    "1998_81": "Homicide detective John Hobbes witnesses the execution of serial killer Edgar Reese. Soon after the execution the killings start again, and they are very similar to Reese's style.",
    "1998_82": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.",
    "1998_83": "Two British Agents team up to stop Sir August de Wynter from destroying the world with a weather-changing machine.",
    "1998_84": "A woman must contend with rival strippers and her boss in an attempt to make a legitimate living.",
    "1998_85": "A young, reformed gambler must return to playing big stakes poker to help a friend pay off loan sharks, while balancing his relationship with his girlfriend and his commitments to law school.",
    "1998_86": "Based on the book by Toni Morrison, in which a slave is visited by the spirit of a mysterious young woman",
    "1998_87": "A secret family of four-inch people living inside the walls of a house must save their home from an evil real estate developer.",
    "1998_88": "An adventurous girl, a young blind hermit, and a goofy two-headed dragon race to find the lost sword Excalibur to save King Arthur and Camelot from disaster.",
    "1998_89": "A basketball player's father must try to convince him to go to a college so he can get a shorter sentence.",
    "1998_9": "The world's greatest ever playwright, William Shakespeare, is young, out of ideas and short of cash, but meets his ideal woman and is inspired to write one of his most famous plays.",
    "1998_90": "Recovering from an ambush that killed his entire team, a vengeful vampire slayer must retrieve an ancient Catholic relic that, should it be acquired by vampires, will allow them to walk in sunlight.",
    "1998_91": "Takeoff on the Godfather with the son of a mafia king taking over for his dying father",
    "1998_92": "The nephew of an armored-truck driver tries to prevent three million dollars from being taken by a local rival gang during a catastrophic flooding caused by a severe storm.",
    "1998_93": "An astronaut gets infected with alien DNA during the first mission on Mars and runs amok on earth. Preston and Laura team up with a peaceful, genetically re-engineered Sil to track the monster down.",
    "1998_94": "A troubled hitman seeks aid from a forger to help him get papers to China. However, the drug lord has hired replacements to finish the job, and kill the hitman.",
    "1998_95": "Oscar and Felix take a road trip to their son and daughter's wedding.",
    "1998_96": "A Chinese chef accidentally gets involved with a news reporter who filmed a drug bust that went awry, and is now being chased by gangs who are trying to get the video tape.",
    "1998_97": "A young boy with stunted growth is convinced that God has a great purpose for him.",
    "1998_98": "The new kid in Cradle Bay, Washington stumbles across something sinister about the town's method of transforming its unruly teens into upstanding citizens.",
    "1998_99": "The story of three not so bright men who come up with a series of crazy schemes to get a friend out of jail."
}