{
    "1999_1": "Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory.",
    "1999_10": "Dr. Evil is back and has invented a new time machine that allows him to go back to the 1960s and steal Austin Powers' mojo, inadvertently leaving him \"shagless\".",
    "1999_100": "A baby boy, discovered in 1900 on an ocean liner, grows into a musical prodigy, never setting foot on land.",
    "1999_101": "After an explosion in space and subsequent two-minute radio-out period, two astronauts return home to their wives. Slightly it's revealed that they're not the same as they were.",
    "1999_102": "Doug and his pal Skeeter set out to find the monster of Lucky Duck Lake.",
    "1999_103": "Spike Lee's take on the \"Son of Sam\" murders in New York City during the summer of 1977 centering on the residents of an Italian-American Northeast Bronx neighborhood who live in fear and distrust of one another. Read more: Synopsis",
    "1999_104": "A computer scientist running a virtual reality simulation of 1937 becomes the primary suspect when his colleague and mentor is murdered.",
    "1999_105": "London 1895: Cabinet minister, Sir Chiltern, and bachelor, Lord Goring, are victims of scheming women.",
    "1999_106": "A horrible massacre strikes up after an outcast teenage girl is taunted by a group of high school jocks, all of them unaware of her cutthroat telekinetic powers.",
    "1999_107": "A private eye shadows a female serial killer of men all over the U.S. without her knowing as he, strangely enough, occasionally acts as her guardian angel.",
    "1999_108": "Haunted by the patients he failed to save, an extremely burned-out Manhattan ambulance paramedic fights to maintain his sanity over three fraught and turbulent nights.",
    "1999_109": "Extreme combines incredible extreme sport action with narration by the athletes and an eclectic, contemporary soundtrack. Extreme features 6 nature based sports; Big Wave Surfing, Ice Climbing, Skiing, Snowboarding, Windsurfing and Rock ...See moreExtreme combines incredible extreme sport action with narration by the athletes and an eclectic, contemporary soundtrack. Extreme features 6 nature based sports; Big Wave Surfing, Ice Climbing, Skiing, Snowboarding, Windsurfing and Rock Climbing.  Written by AnonymousSee less",
    "1999_11": "A reporter is assigned to write a story about a woman who has left a string of fiances at the altar.",
    "1999_110": "Can an over-the-hill journalist uncover the evidence that can prove a death row inmate's innocence just hours before his execution?",
    "1999_111": "Lovers' lives are complicated by city law, feuding faerie royalty, and... love.",
    "1999_112": "A high school teacher meets his match in an over-achieving student politician.",
    "1999_113": "Story of a schoolteacher's struggle to teach violin to inner-city Harlem kids.",
    "1999_114": "An orphaned Italian boy is raised amongst a circle of British and American women living in Mussolini's Italy before and during World War II.",
    "1999_115": "Jeff Cole is a recent graduate of the Cincinnati police academy who dreams of working undercover. His wish is granted and through success is given the task of taking down state-wide crack dealer Dwayne Gittens aka \"God\". Gittens is known ...See moreJeff Cole is a recent graduate of the Cincinnati police academy who dreams of working undercover. His wish is granted and through success is given the task of taking down state-wide crack dealer Dwayne Gittens aka \"God\". Gittens is known as a family man and a man of the people, contributing to his community and helping those in need. However, there is another side to him, a ruthless leader of a criminal empire who will torture or kill anyone without question. Over time, Cole develops a close friendship with Gittens. Cole's superiors worry that the line between cop and bad guy is getting blurred and that both identities are becoming one. Cole's loyalties are put to the ultimate test just as there is enough evidence to take Gittens down for good.  Written by Dalton MSee less",
    "1999_116": "Three problem teens sent to jail are offered a deal to work with an undercover cop, uncover an intricate drug ring and are caught in a deadly set-up. With cops on their trail, they have little time to solve the case and clear their names.",
    "1999_117": "Based on the best-selling autobiography by Irish expatriate Frank McCourt, Angela's Ashes follows the experiences of young Frankie and his family as they try against all odds to escape the poverty endemic in the slums of pre-war Limerick. ...See moreBased on the best-selling autobiography by Irish expatriate Frank McCourt, Angela's Ashes follows the experiences of young Frankie and his family as they try against all odds to escape the poverty endemic in the slums of pre-war Limerick. The film opens with the family in Brooklyn, but following the death of one of Frankie's siblings, they return home, only to find the situation there even worse. Prejudice against Frankie's Northern Irish father makes his search for employment in the Republic difficult despite his having fought for the I.R.A., and when he does find money, he spends it on drink.  Written by KB-26See less",
    "1999_118": "A rabbi in Jerusalem develops software that can unlock prophecies in the Torah. He's murdered and the software stolen. A powerful man uses it to gain world domination.",
    "1999_119": "A survivor of a supersoldier project must fight his former comrades as a masked hero.",
    "1999_12": "The Little family adopt a charming young mouse named Stuart, but the family cat wants rid of him.",
    "1999_120": "A suburban housewife learns that she has a dreamworld connection to a serial murderer, and must stop him from killing again.",
    "1999_121": "Traveling to the exotic kingdom of Siam, English schoolteacher Anna Leonowens soon discovers that her most difficult challenge is the stubborn, imperious King himself.",
    "1999_122": "A new biological chemical weapon that explodes up to temperatures over fifty degrees Fahrenheit, falls into the hands of two men who try to make sure that it doesn't get stolen by a terrorist.",
    "1999_123": "A tug-of-war between Elmo and his friend sends his blanket to faraway Grouchland, a place full of grouchy creatures and the villainous Huxley. Elmo embarks on a rescue mission, learning important lessons about sharing and responsibility.",
    "1999_124": "With his career on the skids, a Hollywood screenwriter enlists the aid of a modern-day muse, who proves to test his patience.",
    "1999_125": "Blair, a fighter pilot, joins an interstellar war to fight the evil Kilrathi who are trying to destroy the universe.",
    "1999_126": "A young man named Brandon Teena navigates love, life, and being transgender in rural Nebraska.",
    "1999_127": "Conflict arises in the small town of Holly Springs when an old woman's death causes a variety of reactions among family and friends.",
    "1999_128": "A desperate man tries to find out why his beloved left him years ago.",
    "1999_129": "Three company workers who hate their jobs decide to rebel against their greedy boss.",
    "1999_13": "The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.",
    "1999_130": "The \"universal soldiers\" must fight the whole army, when the military's supercomputer S.E.T.H gets out of control.",
    "1999_131": "Otherwise known as Cocos Island, this underwater mountain--an Island of the Sharks--is a migratory gathering place for a dazzling array of sea creatures including sharks, manta rays, sea turtles, and dolphins.",
    "1999_132": "A small-town beauty pageant turns deadly as it becomes clear that someone will go to any lengths to win.",
    "1999_133": "A rich businessman's assumption that his new colleague is gay leads him to ask the man to keep an eye on his mistress. However, the man is not gay, and begins to fall for the woman himself.",
    "1999_134": "Genetically mutated bats escape and it's up to a bat expert and the local sheriff to stop them.",
    "1999_135": "Two women are arrested for smuggling while vacationing in Thailand.",
    "1999_136": "Inept Canadian mountie Dudley Do-Right chases after villian Snidely Whiplash and woos girlfriend Nell Fenwick.",
    "1999_137": "The life of a provincial town becomes stormy after the appearance of an anonymous love letter.",
    "1999_138": "The only effort high school student Greg Reed exerts is pursuing the beautiful and unattainable Cinny Hawkins. But when he realizes that that way to win Cinny's heart is through academics, Greg starts hitting the books.",
    "1999_139": "The story of a girl who is willing to do anything to become Valedictorian, even if it means murdering the teacher that stands in her way.",
    "1999_14": "Three film students vanish after traveling into a Maryland forest to film a documentary on the local Blair Witch legend, leaving only their footage behind.",
    "1999_140": "This comedy is about the residents of a small town who get over-excited when their hockey team gets chosen to host a televised event",
    "1999_141": "Two best friends and former middleweight contenders travel to Las Vegas to fight each other for the first time.",
    "1999_142": "A feud develops between two air traffic controllers: one cocky and determined while the other is restrained and laidback, which inevitably affects their lives.",
    "1999_143": "Identical twins are separated at birth, one becoming a streetwise mechanic, and the other an acclaimed classical concert conductor. Finally meeting in adulthood, they each become mistaken for the other and entangled in each other's world.",
    "1999_144": "The fate of a Hungarian Jewish family throughout the 20th century.",
    "1999_145": "After one too many run ins with the law, a punk teenager from a working class background is sent to prep school by his frustrated dad, and learns a thing or two.",
    "1999_146": "After a botched money delivery, Lola has 20 minutes to come up with 100,000 Deutschmarks.",
    "1999_147": "A collection of twentysomethings try to cope with relationships, loneliness, desire and their individual neuroses.",
    "1999_148": "In order to impress his beautiful French neighbor, Dylan Ramsey dognaps her pet pooch so he can return him and become a hero. Unfortunately, things do not work out as planned.",
    "1999_149": "An old man makes a long journey by lawnmower to mend his relationship with an ill brother.",
    "1999_15": "Four teenage boys enter a pact to lose their virginity by prom night.",
    "1999_150": "Two girls wander away from a White House tour and meet President Nixon.",
    "1999_151": "Set in the 1880s, the story of how, during a creative dry spell, the partnership of the legendary musical/theatrical writers Gilbert and Sullivan almost dissolves, before they turn it all around and write the Mikado.",
    "1999_152": "2 brothers try to make it in the comedy business. The kid brother \"Foolish\"/Eddie Griffin does a lot of stand-up comedy.",
    "1999_153": "A group of teens are bent on improving the run-down conditions of their high-school.",
    "1999_154": "",
    "1999_155": "During World War II, an ordinary inhabitant of a ghetto fakes news about Allied offensives to inspire hope for other victims of the Nazi regime.",
    "1999_156": "Wolves tells the remarkable story of one of the world's most tenacious species and our closest fellow predator. The film follows these elusive subjects across remote landscapes in an effort to catch glimpses of a way of life known only to ...See moreWolves tells the remarkable story of one of the world's most tenacious species and our closest fellow predator. The film follows these elusive subjects across remote landscapes in an effort to catch glimpses of a way of life known only to a handful of scientists.  Written by AnonymousSee less",
    "1999_157": "Fanny, born into a poor family, is sent away to live with wealthy uncle Sir Thomas, his wife and their four children, where she'll be brought up for a proper introduction to society.",
    "1999_158": "The world of a young housewife is turned upside down when she has an affair with a free-spirited blouse salesman.",
    "1999_159": "In the small town of Mumford, a psychologist of the same name moves in and quickly becomes very popular, despite a questionable past.",
    "1999_16": "A lazy law school grad adopts a kid to impress his girlfriend, but everything doesn't go as planned and he becomes the unlikely foster father.",
    "1999_160": "In the 1930s, jazz guitarist Emmet Ray idolizes Django Reinhardt, faces gangsters and falls in love with a mute woman.",
    "1999_161": "An ultraconservative security guard suffers a debilitating stroke and is assigned to a rehabilitative program that includes singing lessons, with the drag queen next door.",
    "1999_162": "A magical crab works wonders for a terrible chef's culinary skills, leading her towards the man of her dreams.",
    "1999_163": "In 1978, four rebellious teenagers try to scam their way into a KISS concert.",
    "1999_164": "After serving three years in prison covering for her gangster boyfriend, Kevin, Gloria returns to New York City for the money she was promised. Inside Kevin's base of operations, she finds 7 year old Nicky, whose family has been killed.",
    "1999_165": "A teenage slacker's right hand becomes possessed with murderous intent.",
    "1999_166": "A few friends have a weekly fools' dinner, where each brings a fool along. Pierre finds a champion fool for next dinner. Surprise.",
    "1999_167": "Eleven articulate people work through affairs of the heart in Los Angeles.",
    "1999_168": "Following the theft of a postal-order, a fourteen-year old cadet is expelled from Naval College. To save the honour of the boy and his family, the pre-eminent barrister of the day is engaged to take on the might the Admiralty.",
    "1999_169": "A botched card game in London triggers four friends, thugs, weed-growers, hard gangsters, loan sharks and debt collectors to collide with each other in a series of unexpected events, all for the sake of weed, cash and two antique shotguns.",
    "1999_17": "The two best special agents in the Wild West must save President Grant from the clutches of a diabolical, wheelchair-bound, steampunk-savvy, Confederate scientist bent on revenge for losing the Civil War.",
    "1999_170": "Baltimore, Fall 1954: Schools implement the new integration law. Ben finds the \"colored\" girl in his class cute - upsetting his Jewish mom and granny. Ben talks to her while his brother looks for his WASP dream girl.",
    "1999_171": "A showcase of skiing exploits.",
    "1999_172": "Elvis Gratton, dead for three days, came back to life. First man to revive 2,000 years, it is slowly recuperating from her experience in the hospital. Accompanied by his friend and brother-Meo, he left then relax in the countryside. There ...See moreElvis Gratton, dead for three days, came back to life. First man to revive 2,000 years, it is slowly recuperating from her experience in the hospital. Accompanied by his friend and brother-Meo, he left then relax in the countryside. There he was joined by the American producer Donald Bill Clinton asked him to make an international rock star known around the world. Elvis accept. Quickly became a star adored millionaire, it creates a chain of fast food restaurants, bought the island of St. Helena, and is somehow promote Canadian unity.  Written by Translated from WikipediaSee less",
    "1999_173": "In 1941, the inhabitants of a small Jewish village in Central Europe organize a fake deportation train so that they can escape the Nazis and flee to Palestine.",
    "1999_174": "An extremely volatile and dangerous Englishman goes to Los Angeles to find the man he considers responsible for his daughter's death.",
    "1999_175": "Three of the most popular girls at Reagan High accidentally kill the prom queen with a jawbreaker when a kidnapping goes horribly wrong.",
    "1999_176": "Seth Winnick has it all: a successful career in television, good friends, and a passionate relationship with beautiful Chelsea. However, when he fails to make a timely marriage proposal, Chelsea tries to make his life hell.",
    "1999_177": "A true story of politics and art in the 1930s U.S., focusing on a leftist musical drama and attempts to stop its production.",
    "1999_178": "A game designer on the run from assassins must play her latest virtual reality creation with a marketing trainee to determine if the game has been damaged.",
    "1999_179": "A widow's best friend tries to find her a new husband, but the ad posted in the newspaper attracts more than one possibility.",
    "1999_18": "An insurance agent is sent by her employer to track down and help capture an art thief.",
    "1999_180": "Poor, but happy, young Nello and his grandfather live alone, delivering milk as a livelihood, in the outskirts of Antwerp, a city in Flanders (the Flemish or Dutch-speaking part of modern-day Belgium). They discover a beaten dog (a Bouvier...See morePoor, but happy, young Nello and his grandfather live alone, delivering milk as a livelihood, in the outskirts of Antwerp, a city in Flanders (the Flemish or Dutch-speaking part of modern-day Belgium). They discover a beaten dog (a Bouvier, a large sturdy dog native to Flanders) and adopt it and nurse it back to health, naming it Patrasche, the middle name of Nello's mother Mary, who died when Nello was very young. Nello's mother was a talented artist, and like his mother, he delights in drawing, and his friend Aloise is his model and greatest fan and supporter.  Written by Martin Lewison See less",
    "1999_181": "In an economically devastated Alaskan town, a fisherman with a troublesome past dates a woman whose young daughter does not approve of him. When he witnesses the murder of his shady brother, he, the woman and the kid run to the wilderness.",
    "1999_182": "The misadventures of two young gay men, trying to find a place to be alone, one night in Manhattan.",
    "1999_183": "In a remote military outpost in the 19th century, Captain John Boyd and his regiment embark on a rescue mission which takes a dark turn when they are ambushed by a sadistic cannibal.",
    "1999_184": "A heartfelt documentary focusing on the day-to-day lives of professional wrestlers, some on the rise, some on the wane, and others fighting for their lives.",
    "1999_185": "While in exile in Italy, an African woman finds herself trying to get back home and free her imprisoned husband. But the only man that can help her do so is in love with her.",
    "1999_187": "An American in Ho Chi Minh City looks for a daughter he fathered during the war. He meets Woody, a child who's a street vendor, and when Woody's case of wares disappears, he thinks the soldier took it. Woody hunts for him. A cyclo driver, ...See moreAn American in Ho Chi Minh City looks for a daughter he fathered during the war. He meets Woody, a child who's a street vendor, and when Woody's case of wares disappears, he thinks the soldier took it. Woody hunts for him. A cyclo driver, Hai, gives a ride to Lan, a hotel call girl, and starts waiting for her daily; he falls in love with her and tries to break through her tough veneer. Kien An, a young woman, takes a job harvesting lotuses in the ponds of Teacher Dao, a reclusive man who has leprosy. Her singing awakens him from depression, and he asks her to write down poetry he has composed. The characters' paths cross in small ways, around flowers and kindnesses.  Written by See less",
    "1999_188": "Businessman Manav falls for aspiring singer Mansi, but their romance faces an uphill climb when Manav must depart and Mansi's suave manager moves in.",
    "1999_189": "Maggie, 19, works at a lesbian/LGBT bookstore. Her mom's getting divorced and has invited herself to stay with Maggie. Maggie hasn't told her, she's lesbian. Her new girlfriend moves in as well.",
    "1999_19": "At the end of the century, Satan visits New York in search of a bride. It's up to an ex-cop who now runs an elite security outfit to stop him.",
    "1999_190": "Titus returns victorious from war, only to plant the seeds of future turmoil for himself and his family.",
    "1999_191": "An abused wife heads to California to become a movie star while her nephew back in Alabama has to deal with a racially-motivated murder involving a corrupt sheriff.",
    "1999_192": "Ramkishen and Mamta have three sons Vivek , Prem and Vinod and a daughter Sangeeta. This family is part of a joint family whose close knit bond is challenged by a misunderstanding.",
    "1999_193": "3 prisoners escape. 2 end up in Happy, Texas, where they're mistaken for a gay couple expected there to help with the small girls beauty pageant. As the 2 are paid $1000, they decide to stay until the heat is gone.",
    "1999_194": "Ben and Sandra are hot and provocative lovers, but Sandra is unfortunately married to Ben's younger brother Jake, and soon Jake will find out about Ben. Written by Anonymous",
    "1999_195": "Mario Suarez is a forty-something tango artist, whose wife Laura has left him. He leaves his apartment and starts preparing a film about tango.",
    "1999_196": "Ruth's been brainwashed by a guru in Delhi, India. Her parents in Sydney hire a specialist in reversing this. Ruth is tricked to return to Australia and is isolated in an outback cabin with the specialist. It gets messy.",
    "1999_197": "The lives of two dissimilar girls turned out in different ways.",
    "1999_198": "Frustrated by the lack of intimacy in her relationship, a young schoolteacher goes through a series of intimidating and often violent sexual partners.",
    "1999_199": "Inhabitants of the last unconquered village in Gaul (ancient France) use a magical potion to hold their independence from Roman invaders.",
    "1999_2": "A boy who communicates with spirits seeks the help of a disheartened child psychologist.",
    "1999_20": "Ichabod Crane is sent to Sleepy Hollow to investigate the decapitations of three people, with the culprit being the legendary apparition, The Headless Horseman.",
    "1999_200": "A woman and her daughter have been constantly moving from town to town for years, but their newest home might be different from all the others.",
    "1999_201": "In pre-unified China, the King of Qin sends his concubine to a rival kingdom to produce an assassin for a political plot, but as the king's cruelty mounts she finds her loyalty faltering.",
    "1999_202": "Unsatisfied with her life in England, young mother Julia relocates to Morocco with her small daughters, Lucy and Bea. Although the family enjoys various adventures, they struggle to make ends meet.",
    "1999_203": "Documentary about an aspiring filmmaker's attempts to finance his dream project by finally completing the low-budget horror film he abandoned years before.",
    "1999_204": "A tenderly romantic coming-of-age story as two boys in a British school fall in love.",
    "1999_205": "Wang Bianlian is an aging street performer known as the King of Mask for his mastery of Sichuan Change Art in a true story. His wife left him with and infant son over 30 years ago. The son died from illness at age 10. This left Wang a ...See moreWang Bianlian is an aging street performer known as the King of Mask for his mastery of Sichuan Change Art in a true story. His wife left him with and infant son over 30 years ago. The son died from illness at age 10. This left Wang a melancholy loner aching for a male descendent to learn his rare and dying art. A famous master performer of the Sichuan Opera offers to bring him into his act, thus giving Wang fame and possible fortune, but Wang opts for staying the simple street performer. Then, one night after a performance he is sold a young boy by a slave trader posing as the boy's parent. \"Grandpa\" finds new joy in life as he plans to teach \"Doggie\" (an affectionate term often used for young children in China) his art. All is well until Doggie is found out to really be a girl.  Written by Steve Uptegraft See less",
    "1999_206": "Widowed Kieran Johnson is a lonely, middle-aged, Chicago-based high school history teacher who feels disconnected to his life. He decides to take a trip to his mother's small old hometown of Kilronan, County Galway, Ireland after he ...See moreWidowed Kieran Johnson is a lonely, middle-aged, Chicago-based high school history teacher who feels disconnected to his life. He decides to take a trip to his mother's small old hometown of Kilronan, County Galway, Ireland after he discovers an old photograph of her, she who now cannot speak due to a stroke, with a man he has never seen. He suspects this man may be his biological father. On the urging of his sister, Kieran takes his teen-aged nephew Jack on the trip. In Kilronan, Mrs. Kearney, the innkeeper's mother and a bit of a gypsy woman who has lived in the area for the better part of her life, tells Kieran and Jack about life in the town in 1939 when a high-spirited Fiona Flynn, Kieran's mother, started seeing a peat farmer named Kieran O'Day. Kieran O'Day grew up a \"poorhouse bastard\", and as such he was always shy and considered an outsider amongst the townsfolk. Because of his standing in the community and the differences in their ages (she being only seventeen, he in his thirties), Fiona and Kieran's relationship was looked down upon by those considered the upstanding in town, including Fiona's widowed mother, Mary Flynn, and those associated with the church. Mrs. Kearney slowly tells the entire story of Kieran and Fiona's relationship, the tragedy that prevented their love for not being enough to endure the scrutiny, the stories of the \"curses\" that befell the Flynn family, and the truth behind the person Kieran Johnson knew as his father.  Written by HuggoSee less",
    "1999_207": "Young teen girl Xiu Xiu is sent away to a remote corner of the Sichuan steppes for manual labor in 1975 (sending young people to there was a part of Cultural Revolution in China). A year later, she agrees to go to even more remote spot ...See moreYoung teen girl Xiu Xiu is sent away to a remote corner of the Sichuan steppes for manual labor in 1975 (sending young people to there was a part of Cultural Revolution in China). A year later, she agrees to go to even more remote spot with a Tibetan saddle tramp Lao Jin to learn horse herding.  Written by AnonymousSee less",
    "1999_208": "",
    "1999_209": "Nandini has to choose between Sameer, the man who taught her to fall in love; and Vanraj, the man from whom she learnt how to abide and fulfill promises of love.",
    "1999_21": "A woman framed for her husband's murder suspects he is still alive; as she has already been tried for the crime, she can't be re-prosecuted if she finds and kills him.",
    "1999_210": "Conjoined twins have their relationship tested when a woman takes interest in one of them.",
    "1999_211": "After a boy loses his sister's pair of shoes, he goes on a series of adventures in order to find them. When he can't, he tries a new way to \"win\" a new pair.",
    "1999_212": "A working-class family from Melbourne, Australia fights city hall after being told they must vacate their beloved family home to allow for infrastructural expansion.",
    "1999_213": "A teenager copes with his sexuality on the last day of school in 1984. It shows him coping with being gay and being with friends.",
    "1999_214": "There are over 20,000 wildfires in a typical year; we follow crews to a few of them. First, we see the preseason physical training and a prescribed burn, which burns the flammable underbrush before the trees themselves are flammable. But ...See moreThere are over 20,000 wildfires in a typical year; we follow crews to a few of them. First, we see the preseason physical training and a prescribed burn, which burns the flammable underbrush before the trees themselves are flammable. But since these burns can't do the whole job, we see how firespotters pinpoint lighting-caused fires that smokejumpers then have to parachute into. In the open wilderness of Idaho, the job is relatively simple. In California, where forests are closer to civilization and the chaparral forests are much more flammable, access to the fire is easier, but fighting it is harder. And in Australia, where the forests are full of eucalyptus and tea, the flammability is compounded by the acrid smoke.  Written by Jon Reeves See less",
    "1999_215": "A turn-of-the-20th-century theatre repertory company rejects the latest project of their beloved playwright Tuccio, kicking off a saga of intrigue surrounding the influential critic Bevalaqua and star Celimene.",
    "1999_216": "A young woman leaves Ireland to find her boyfriend in England, and while there is helped by a man hiding unsettling secrets.",
    "1999_217": "After death, people have a week to choose only one memory to keep for eternity.",
    "1999_218": "",
    "1999_219": "A tale of the mysterious, but necessary, mating ritual between men and women of today and everything they think about sex but are afraid to say.",
    "1999_22": "A study in fear escalates into a heart-stopping nightmare for a professor and three subjects trapped in a mysterious mansion.",
    "1999_220": "A 19 year old Greek Australian youth struggles with his sexual identity and has one clumsy heterosexual and several homosexual encounters.",
    "1999_221": "A small time detective is mistaken as a CBI agent and gets embroiled in a deadly mission to save the Chief Minister from an assassination attempt.",
    "1999_222": "Memoir of the lives of a family growing up on a post World War I British estate headed up by a strong disciplinarian, her daughter, her inventor husband, their ten year old son and his older sister. Through the household comes a number of ...See moreMemoir of the lives of a family growing up on a post World War I British estate headed up by a strong disciplinarian, her daughter, her inventor husband, their ten year old son and his older sister. Through the household comes a number of suitors hoping to impress the young woman, including an aviator. When the elder woman's son shows up at the estate with his French fiance, everything gets thrown into turmoil. The young boy takes a sudden interest in her sexual allure and his father is disturbed by his own non-Victorian feelings.  Written by John Sacksteder See less",
    "1999_223": "During the American Civil War, two friends join the Bushwhackers, a militant group loyal to the Confederacy.",
    "1999_224": "The story of the life and work of the Canadian fur trapper-turned-conservationist who claimed to be an aboriginal North American.",
    "1999_225": "A young girl from an affluent family rebels and becomes involved with a much older photographer.",
    "1999_226": "Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime.",
    "1999_227": "A group of very different individuals with different ideas of how to face the end come together as the world is expected to end in six hours at the turn of the century.",
    "1999_228": "The Vatican sends a priest to verify some miracles, performed by a woman who has been nominated for sainthood. During his investigation, the priest, who is experiencing a crisis of faith, re-discovers his own purpose in life.",
    "1999_229": "A woman's life falls apart after she's blamed for an accident on her property.",
    "1999_23": "A comedy about a psychiatrist whose number one patient is an insecure mob boss.",
    "1999_230": "A documentary type film about the dates Myles has gone on as he tries to find out how to find love in the future.",
    "1999_231": "\"Strange Fruit\" had everything that makes a legendary rockband: money, fame, success, groupies, a singer who died of drugs, and even a divine ending, when lightning struck the stage during an open-air concert. Twenty years later, all of ...See more\"Strange Fruit\" had everything that makes a legendary rockband: money, fame, success, groupies, a singer who died of drugs, and even a divine ending, when lightning struck the stage during an open-air concert. Twenty years later, all of the band members are minding their own businesses, the idea of a band reunion is brought up by, well, public request. Tony Costello (Stephen Rea), the former keyboard player, sets out only to find his former friends working as a roofer, a gardener and a hotel clerk. They all became rather everyday people, married or still single, they definitely are not wild and crazy anymore. But with the help of former manager Karen Knowles (Juliet Aubrey), who is still dreaming of Brian Lovell (Bruce Robinson), the apparently deceased lead guitarist, they all, old, fat and wrinkled as they are, try to catch that spirit again.  Written by chijim222@yahoo.comSee less",
    "1999_232": "A cinematic portrait of the life and career of the infamous American execution device designer and holocaust denier.",
    "1999_233": "Two robbers are persecuted by the law, whose servants are not much better and even worse.",
    "1999_234": "A ticket scalper wants to make one last big deal on the pope's visit to finally do something worthwhile about his relationship.",
    "1999_235": "It's 1947 and the borderlines between India and Pakistan are being drawn. A young girl witnesses tragedy as her ayah (nanny) is caught between the love of two men and the rising tide of political and religious violence.",
    "1999_236": "In late 1944, even as they faced imminent defeat, the Nazis expended enormous resources to kill or deport over 425,000 Jews during the \"cleansing\" of Hungary. This Oscar-winning documentary, executive produced by Steven Spielberg, focuses ...See moreIn late 1944, even as they faced imminent defeat, the Nazis expended enormous resources to kill or deport over 425,000 Jews during the \"cleansing\" of Hungary. This Oscar-winning documentary, executive produced by Steven Spielberg, focuses on the plight of five Hungarian Jews who survived imprisonment in Auschwitz. Though these survivors recount the horrors they witnessed and endured as a result of the Nazis' \"Final Solution,\" their individual triumphs are a testament to hope and humanity.  Written by Jwelch5742See less",
    "1999_237": "Pakistani taxi-driver Parvez and prostitute Bettina find themselves trapped in the middle when Islamic fundamentalists decide to clean up their local town.",
    "1999_238": "Fashion executive Dominique's obsession for Quentin, a young bisexual hustler, fills her desire for physical love but leaves her taxed emotionally. Twists and turns in the relationship, along with the man's violent and abusive nature, ...See moreFashion executive Dominique's obsession for Quentin, a young bisexual hustler, fills her desire for physical love but leaves her taxed emotionally. Twists and turns in the relationship, along with the man's violent and abusive nature, force Dominique to reconcile the conflicts created by her passion. In this quest, Dominique is aided [and sometimes hindered] by friends, clients, and Quentin's former and current acquaintances.  Written by kevin kraynak See less",
    "1999_239": "Two brothers -- Ranvir and Rajvir along with their parents move to Mumbai. They endure numerous hardships, but their will to survive prevails and they succeed. Soon, their parents pass away, leaving young Rajvir in the care of Ranvir. Now ...See moreTwo brothers -- Ranvir and Rajvir along with their parents move to Mumbai. They endure numerous hardships, but their will to survive prevails and they succeed. Soon, their parents pass away, leaving young Rajvir in the care of Ranvir. Now wealthy beyond any means, Ranvir runs the business and Rajvir lives recklessly. When Rajvir falls in love, Ranvir arranges his marriage, but to his dismay finds out that he has arranged his brother to marry the girl he loves.  Written by gavin@sunny_deol2009@yahoo.comSee less",
    "1999_24": "Searching for a cure to Alzheimer's disease, a group of scientists on an isolated research facility become the prey, as a trio of intelligent sharks fight back.",
    "1999_240": "A love story or a tale of the resistance, this poignant movie tells both the haunting story of a French resistance cell in Lyon but also the love of Lucie Aubrac for her husband, and the lengths she goes to to rescue her husband from ...See moreA love story or a tale of the resistance, this poignant movie tells both the haunting story of a French resistance cell in Lyon but also the love of Lucie Aubrac for her husband, and the lengths she goes to to rescue her husband from prison on more than one occasion. Based on a true story Lucie Aubrac works as both history lesson and love story.  Written by See less",
    "1999_241": "San Francisco bluesman and composer, Paul Peña makes a musical pilgrimage to the land of Tuva.",
    "1999_242": "A very handsome man finds the love of his life, but he suffers an accident and needs to have his face rebuilt by surgery after it is severely disfigured.",
    "1999_243": "Aimless Vann Siegert takes a bizarre turn in life and becomes a serial killer, tracking down the miserable, the self-destructive and those who otherwise seem willing to die.",
    "1999_244": "A picturesque Pacific Northwest community raising its wheat and children in the midst of a nation reeling from World War I sets the stage for The Basket. In a time of pain and prejudice woven against a background of beauty, The Basket ...See moreA picturesque Pacific Northwest community raising its wheat and children in the midst of a nation reeling from World War I sets the stage for The Basket. In a time of pain and prejudice woven against a background of beauty, The Basket ultimately points to triumph and hope in a changing America.  Written by AnonymousSee less",
    "1999_245": "Traces the Beats from Allen Ginsberg and Jack Kerouac's meeting in 1944 at Columbia University to the deaths of Ginsberg and William S. Burroughs in 1997. Three actors provide dramatic interpretations of the work of these three writers, ...See moreTraces the Beats from Allen Ginsberg and Jack Kerouac's meeting in 1944 at Columbia University to the deaths of Ginsberg and William S. Burroughs in 1997. Three actors provide dramatic interpretations of the work of these three writers, and the film chronicles their friendships, their arrival into American consciousness, their travels, frequent parodies, Kerouac's death, and Ginsberg's politicization. Their movement connects with bebop, John Cage's music, abstract expressionism, and living theater. In recent interviews, Ginsberg, Burroughs, Kesey, Ferlinghetti, Mailer, Jerry Garcia, Tom Hayden, Gary Snyder, Ed Sanders, and others measure the Beats' meaning and impact.  Written by See less",
    "1999_246": "Two thirtysomethings, unemployed former alcoholic Joe and community health worker Sarah, start a romantic relationship in the one of the toughest Glasgow neighbourhoods.See moreTwo thirtysomethings, unemployed former alcoholic Joe and community health worker Sarah, start a romantic relationship in the one of the toughest Glasgow neighbourhoods.  Written by AnonymousSee less",
    "1999_247": "Matko and his son Zare live on the banks of the Danube river and get by through hustling and basically doing anything to make a living. In order to pay off a business debt Matko agrees to marry off Zare to the sister of a local gangster.",
    "1999_248": "A chronicle of a group of friends in rural France in 1918. Garris and Riton live in the marshlands along the banks of the Loire river. Riton is afflicted with a bad-tempered wife and three unruly children. Garris lives alone with his ...See moreA chronicle of a group of friends in rural France in 1918. Garris and Riton live in the marshlands along the banks of the Loire river. Riton is afflicted with a bad-tempered wife and three unruly children. Garris lives alone with his recollections of World War I trenches. Their daily life consists of seasonal work and visits from their two pals: Tane, the local train conductor and Amedee, a dreamer and voracious reader of classics. Meanwhile, Garris is overwhelmed by an unspoken love for a housemaid in the town, Marie...  Written by L.H. Wong See less",
    "1999_249": "Denise Crosby takes a first look at the huge fans of \"Star Trek\" and how the series from around America has affected and shaped their lives.",
    "1999_25": "Scientists genetically create a new Pokemon, Mewtwo, but the results are horrific and disastrous.",
    "1999_250": "In cold Lapland Finland, under the eternal midnight sun, two ardent lovers reunite once again after a long period apart, governed by a powerful and eloquent circular motif woven by destiny, faith, and love. Can they deny their destiny?",
    "1999_251": "A Montreal police officer goes to Arkansas to solve the murder of his brother.",
    "1999_252": "A pair of twins separated at birth. One grows up as a Hindu in India, while the other is raised a Muslim in Pakistan. They are forced to battle each other during an Indo-Pak war.",
    "1999_253": "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.",
    "1999_254": "In the early 1980s Stevo and Heroin Bob are the only two dedicated punks in conservative Salt Lake City.",
    "1999_255": "Basketball superstar Dennis Rodman stars as a hip Interpol agent attempting to defeat the deadly plans of a crazed arms dealer. Read more: Synopsis",
    "1999_256": "After his brother is killed and father severely injured by terrorists, a young med student quits his studies to join the Indian Police Service to wipe out the terrorists.",
    "1999_257": "An emotional saga of a mother who has lost her child and her love.",
    "1999_258": "A shambling, out-of-work actor, desperate to win back the affections of his ex-girlfriend, unexpectedly stumbles upon a way to turn back the clock.",
    "1999_259": "This film looks at the 1950's muscle men's magazines and the representative industry that were popular supposedly as health and fitness magazines, but were in reality primarily being purchased by the still underground homosexual community....See moreThis film looks at the 1950's muscle men's magazines and the representative industry that were popular supposedly as health and fitness magazines, but were in reality primarily being purchased by the still underground homosexual community. Chief among the purveyors of this literature was Bob Mizer, who maintained a magazine and developed sexually inexplicit men's films for over 40 years. Aided by his mother, the two maintained a stable of not so innocent studs. At the end, the film moves into a court room drama as Mizer is tried for running a male-prostitute ring in the early 60's. Clips of Mizer's actual films starring individuals, such as Jack LaLanne and Joe Dallesandro, are included.  Written by John Sacksteder See less",
    "1999_26": "A New York City doctor embarks on a harrowing, night-long odyssey of sexual and moral discovery after his wife reveals a painful secret to him.",
    "1999_260": "Young and impulsive Rosetta lives with her alcoholic mother and, moved by despair, she will do anything to maintain a job.",
    "1999_261": "A look at Paul Taylor (1930-2018) and his dance company over several months in 1997. Preparation of Taylor's piece, \"Piazzolla Caldera,\" from conception and rehearsals to opening night at City Center, frames the film. The troupe's trip to ...See moreA look at Paul Taylor (1930-2018) and his dance company over several months in 1997. Preparation of Taylor's piece, \"Piazzolla Caldera,\" from conception and rehearsals to opening night at City Center, frames the film. The troupe's trip to India falls in the middle. Included are black and white footage of rehearsals, and, in color, interviews with Taylor, his dancers, dance critics and scholars, and those who manage the business side. There is also footage of a younger Taylor dancing and film of the troupe performing a dozen Taylor pieces. His genius, his roots, his method of working with dancers, and his sometimes difficult nature draw the attention of those who comment.  Written by See less",
    "1999_262": "An alienated teenager, saddened that he has moved away from London, must find a way to deal with a dark family secret.",
    "1999_263": "Sex comedy takes a look at contemporary dating mores and hypothesizes that the new dating location may be the dog walk in the park. A mild-mannered man loses his present girlfriend to another man. His attraction to a kid's television show ...See moreSex comedy takes a look at contemporary dating mores and hypothesizes that the new dating location may be the dog walk in the park. A mild-mannered man loses his present girlfriend to another man. His attraction to a kid's television show hostess goes nowhere because of her obsession with her dog, Peanut. He then gets hooked up with an overly exuberant blonde who overwhelms him. He even lost his Collie, Mogley, when his girlfriend moved out. In a funny subplot, the Collie is going to a doggie psychiatrist, who determines the dog is being traumatized by his mistress' sexual antics. Jeri and Jeff are best friends whose constant smooching simply makes the leads life less comfortable.  Written by John Sacksteder See less",
    "1999_264": "A police officer receives a heart transplant from a murdered man and in turn, the dead man's ghost follows him around and insists he solve and avenge his murder.",
    "1999_265": "The film chronicles the rise and fall of Germany's most famous a capella group, the Comedian Harmonists, in 1930s Germany.",
    "1999_266": "John Riley, an Irish immigrant soldier recruited in the American army during the Mexican-American War faces anti-immigrant and anti-Catholic bigotry from his fellow servicemen and defects to the Mexican army.",
    "1999_267": "Babar is a young elephant in the great forest. Whilst out with his mother a hunter kills his mother and he flees to escape the same fate. He eventually finds himself in a human city and experiences the many differences between city and ...See moreBabar is a young elephant in the great forest. Whilst out with his mother a hunter kills his mother and he flees to escape the same fate. He eventually finds himself in a human city and experiences the many differences between city and forest life. Generally treated as an outsider he is taken in by an elderly woman, dressed in fancy suits, taught to write and count and is brought up in human culture. Later in life his friends Celeste and Arthur stumble into the city and find him - previously assuming he was also killed by the hunter. Babar dresses them and treats them to the comforts of his world until more elephants arrive to bring them back. The three elephants return by car to the great forest. Soon after Arthur sparks a war with the neighbouring Rhino tribe but peace is formed due to quick thinking by Babar. After this Babar is crowned king with Celeste his Queen. Due to his human upbringing Babar decides to alter the elephant society and builds a city and kits every elephant out in human clothing, every elephant is assigned tasks and everyone has his place. But with human culture comes problems associated with modern living. How will Babar cope with the onset of misfortune?  Written by Paul Hunter aka Bob the MooSee less",
    "1999_268": "Two teenage girls in small-town Sweden. Elin is beautiful, popular, and bored with life. Agnes is friendless, sad, and secretly in love with Elin.",
    "1999_269": "Pinky and Atul alias Bunty are in love with each other, and plan to marry. They, however, run into opposition with their respective families, as their life-partners have already been picked for them. Pinky's dad, a retired Colonel has ...See morePinky and Atul alias Bunty are in love with each other, and plan to marry. They, however, run into opposition with their respective families, as their life-partners have already been picked for them. Pinky's dad, a retired Colonel has picked Police Inspector Arjun to be Pinky's groom; while Ajit and Asha, Bunty's dad and mom, have picked Shobha to be Bunty's bride. Both Bunty and Pinky plan to go through with their respective marriages to the partners of their parents' choices, and then eventually divorce them, and then get married to each other. They give in to their parents' choices, and their parents are delighted and both the weddings take place with great pomp and ceremony. Pinky then starts picking fights with Arjun and his mom, and openly insults them; while Bunty also does the same with Shobha. Their plans seem to be going on track, until they come to know that Shobha and Arjun are meeting on the sly. What impact will this have on their plans and their marriage?  Written by rAjOo (gunwanti@hotmail.com)See less",
    "1999_27": "After a successful heist, Porter is left for dead. Once he recovers, he seeks vengeance and wants his share of the money.",
    "1999_270": "In this sequel to Apocalypse: Caught in the Eye of the Storm, police officer in search for answers, Thorold Stone, joins a rebel group of Christians to thwart the Antichrist's plan to use virtual reality to solidify its power.",
    "1999_271": "Russia, 1820s: Onegin inherits his uncle's country estate and moves there from St. Petersburg. He befriends his neighbor, Lensky, and meets Tatyana through him. She falls in love with Onegin but he just wants friendship.",
    "1999_272": "A rich car dealer is losing his mind. His son lives in the bomb shelter. His suicidal wife has an affair with his transvestite sales manager.",
    "1999_273": "Unimpassioned look at the lives of struggling L.A. scene rock stars follows main character, Gwen, on her quest for the top. Working as an assistant to a film production designer, she tries to steal her boy friend who is a music producer by...See moreUnimpassioned look at the lives of struggling L.A. scene rock stars follows main character, Gwen, on her quest for the top. Working as an assistant to a film production designer, she tries to steal her boy friend who is a music producer by offering sexual favors. The producer meanwhile is trying to orchestrate a comeback for a former glam band played by Michael Des Barres (of Power Station fame), John Taylor (from Duran Duran), and Martin Kemp (from Spandau Ballet). Rosanna Arquette plays the former movie star wife of the lead singer, who is fretting because she has just been offered the role as the mother of one of the new ingenious. Beverly D'Angelo also shows up as a millionairess who agrees to bankroll the group, but only if she gets a roll in the hay with the lead singer. All of the career problems, including drug proclivity, are represented in this film.  Written by John Sacksteder See less",
    "1999_274": "Non-linear film tells the sexual story of a film director from his life at age 5, 12 and 16, a man embarking on his first film in 1950s Tunisia, and finally to his current life. Along the way, as a teen, he has sexual exploits with an ...See moreNon-linear film tells the sexual story of a film director from his life at age 5, 12 and 16, a man embarking on his first film in 1950s Tunisia, and finally to his current life. Along the way, as a teen, he has sexual exploits with an older woman, gets involved with an Italian couple in Tunisia that culminates in the killing of a local boy and the brutal revenge murder of the woman and, ultimately, is married to a cold woman.  Written by John Sacksteder See less",
    "1999_275": "Krishnakant Mathur (Aftab Shivdasani) alias \"kittu\", works in a restaurant, which is located right opposite the bunglow of famous movie actress, Mallika (Urmilla Matondkar). Kittu, simply put, is only a fan, but is smitten by Mallika, ...See moreKrishnakant Mathur (Aftab Shivdasani) alias \"kittu\", works in a restaurant, which is located right opposite the bunglow of famous movie actress, Mallika (Urmilla Matondkar). Kittu, simply put, is only a fan, but is smitten by Mallika, almost to the point of obsession. He does get to meet her at Mehboob Studios, and speak with Mallika herself. Before he could finish speaking with her, he is rudely interrupted by Tolluram, Manisha's uncle (Govind Namdeo), who insults and humiliates him and tells him to leave. Kittu is confused at this, and gets appalled and concerned about Mallika, when he learns that her life is being controlled by her uncle, aunt and cousin sister. One day he witnesses her uncle beating her up, he breaks into her house, assaults the uncle, and abducts Mallika. The next day, there is furore in the media when everyone learns that an actress has been abducted. The police get involved. Kittu decides to take Mallika to his home to his parents, and does so. He hides her in his house, but decides not to tell anyone in his family about Mallika. How long will Kittu succeed in doing this? Is this what Mallika wants, or is she being taken advantage of again? How long will a famous actress hide out without anyone else coming to know her?  Written by rAjOo (gunwanti@hotmail.com)See less",
    "1999_276": "Lal Singh (Amitabh Bachchan) lives with his mother (Nirupa Roy) in a small basti in Bombay, grows up with the poor and needy. He is called Lal Badshah by the people he lives among. Lal is a very helping person and dead set against crime. ...See moreLal Singh (Amitabh Bachchan) lives with his mother (Nirupa Roy) in a small basti in Bombay, grows up with the poor and needy. He is called Lal Badshah by the people he lives among. Lal is a very helping person and dead set against crime. In the same city lives Vikram Singh alias Vicky Baadshah (Raghuvaran) who is the Don of the city always clashing with Lal Baadshah. Vicky is the son of Dayal Singh (Amrish Puri) who lives far away from Mumbai in a castle. Vicky & his brother Ajit Singh (Mukesh Rishi), a corrupt police officer want to rule the city. Meanwhile, Lal meets Kiran (Manisha Koirala), an L.I.C. agent who falls in love with him & is determined to become his wife. At the castle, Dayal Singh is still hunting for the treasures of the Maharaja, whom he murdered years ago along with his brother Sultan Singh (Prem Chopra). When the Maharaja was murdered, his son, Dewan Ranbir Singh (also Amitabh Bachchan) hid the treasure, for which Dayal Singh tried to murder him. What is the link between Ranbir Singh and his look-alike Lal Singh and will Dayal Singh be able to ever find the treasure?  Written by gavin@sunny_deol2009@yahoo.comSee less",
    "1999_277": "The unexpected death of her husband sends a woman and her seven children, ages 2-14, into emotional turmoil and financial crisis in 1967 Dublin. She is forced to borrow money from a ruthless loan shark to make ends meet. She faces her ...See moreThe unexpected death of her husband sends a woman and her seven children, ages 2-14, into emotional turmoil and financial crisis in 1967 Dublin. She is forced to borrow money from a ruthless loan shark to make ends meet. She faces her dismal existence by selling fruits and vegetables at an open air market where she spends time with a best friend who gives her encouragement. Wishing to escape her existence, if only for a short time, she dreams of finding enough money to attend an upcoming Tom Jones concert. She realizes her dream by accepting her first date with a French baker. Her kids pool their money so she can buy a new dress. Of course, eventually the family has to face the loan shark, but this is a movie where obstacles are maybe too easily overcome.  Written by John Sacksteder See less",
    "1999_278": "An innovative concert movie for the rock group The Talking Heads.",
    "1999_279": "Vanshika Mathur (Karishma Kapoor), an orphan who lives with her aunt (Aroona Irani), is a simple middle class girl desperately in search of a job. Eventually she gets a job with Mr. Sinha (Alok Nath), a very successful businessman. Mr. ...See moreVanshika Mathur (Karishma Kapoor), an orphan who lives with her aunt (Aroona Irani), is a simple middle class girl desperately in search of a job. Eventually she gets a job with Mr. Sinha (Alok Nath), a very successful businessman. Mr. Sinha is a widower who has a son Abhay (Chandrachur Singh). Abhay has grown up with his maternal uncle, Rakesh (Shakti Kapoor), a four-time divorce, whose motto is 'Stay unmarried and lead a Bohemian lifestyle'. Abhay is strongly influenced by his uncle and has grown into a flamboyant, arrogant, spoilt brat who has never put in a day's work at the family business.Mr. Sinha is obviously perturbed to the point of distress by the lifestyle his son leads - party all night and sleep through the day. He is determined to get his son back on the right track. In order to get Abhay into the office he entices him with the idea of young female secretary. He succeeds. Abhay meets Vanshika at the office. He is disgusted. She is flustered, but hopelessly in love. The rest of the film is a roller-coaster ride - a clash of the value system of the idealistic Vanshika and the non-existent morals of the wayward Abhay. But there are some unexpected twists, strange encounters (with Jabbar Khashogi-Danny Denzongpa) and unusual events courtesy (Jhonny Lever} on this exciting ride. Will Vanshika win Abhay over Yet again, will love triumph against all odds.  Written by gavin@sunny_deol2009@yahoo.comSee less",
    "1999_28": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
    "1999_280": "An adult Martin Roy reminisces about his life in the 1966/67 school year. At fifteen years old and in his last year of junior high school, he breathed, ate and slept hockey. He collected hockey cards, played street hockey with his friends,...See moreAn adult Martin Roy reminisces about his life in the 1966/67 school year. At fifteen years old and in his last year of junior high school, he breathed, ate and slept hockey. He collected hockey cards, played street hockey with his friends, tried skating and ice hockey for the first time in his life, but was most fascinated with his local national league team, the Montreal Canadiens, and its star player, Henri Richard. He dreamed of growing up and working for the Canadiens franchise. But a more immediate goal was to get tickets to one of their games, using M. Richard and his banker father, Herve, as possible conduits to that goal. He also remembers his school life from that year, with the arrival of pot smoking free thinking hippie Ron Richardson as the new English teacher, and dreading home room with strict Mlle. Chouinard, who he eventually learned too had a human side. But he learned that there may be a couple of things more important than hockey: family, and the opposite sex.  Written by HuggoSee less",
    "1999_281": "The gold medal for the men's 10,000-metre race in the 1996 Atlanta Olympics is won by Ethiopian Haile Gebrselassie.",
    "1999_282": "At the suggestion of a straight friend, gay man Leo joins a men's group, where he causes some upsets by declaring his attraction to one of its members.",
    "1999_283": "Gilles meets Guylaine on a beach. He's a bookish scholar with glasses; she's a waitress in a blue-collar bar in a rough part of Montreal. Gilles comes for a visit... Guylaine's brother Bob works for the brutal gangster Matroni. Two toughs ...See moreGilles meets Guylaine on a beach. He's a bookish scholar with glasses; she's a waitress in a blue-collar bar in a rough part of Montreal. Gilles comes for a visit... Guylaine's brother Bob works for the brutal gangster Matroni. Two toughs have hijacked a tractor-trailer full of stolen car parts that Matroni was about to deliver to an even worse gangster, Boyd. Boyd is very dangerous and he wants those parts. Guylaine's friend Linda knows the hijackers and has left their names with her mum in a letter. The thugs have gotten to Bob and beaten him up, so that means only one person can take the letter to Matroni at his autowrecking yard, polite and courteous Gilles...  Written by David BadgerSee less",
    "1999_284": "Separated from their wealthy father and each other, two brothers (Sanjay Dutt, Govinda) try to win the hearts of their dream girls.",
    "1999_285": "A crusading reporter (John Kennedy Horne) for the weekly L.A. New Times spends his time writing exposes on the conditions permitted by slumlords. However, when his best friend (Sheryl Lee Ralph) is killed by a corrupt business executive (...See moreA crusading reporter (John Kennedy Horne) for the weekly L.A. New Times spends his time writing exposes on the conditions permitted by slumlords. However, when his best friend (Sheryl Lee Ralph) is killed by a corrupt business executive (Henry Silva), he is forced to start trying to find the evidence. This leads him into conflict with many surly longshoremen and hit men. Meanwhile, he makes a new acquaintance in a bookstore clerk (Tracey Ross), who also happens to be a computer whiz and aids him in finding the information he needs.  Written by John Sacksteder See less",
    "1999_286": "In Los Angeles, two rival gang leaders are also trying to be music producers. When DJ's equipment shorts out and Lonzo is cut out of the action by a record producer, the two join forces, which also requires a tentative peace between gangs....See moreIn Los Angeles, two rival gang leaders are also trying to be music producers. When DJ's equipment shorts out and Lonzo is cut out of the action by a record producer, the two join forces, which also requires a tentative peace between gangs. With backing from Gator, a smooth New Orleans drug king, DJ and Lonzo start dealing, organizing their gangs into pushers. Just as their finances are looking up, one of Gator's team pulls a double cross and two of DJ and Lonzo's gang bangers start a shooting war. Can the erstwhile music producers salvage anything of their bond or their plans?  Written by See less",
    "1999_287": "A pop singer gives up her career to become an actress, but she slowly goes insane when she starts being stalked by an obsessed fan and what seems to be a ghost of her past.",
    "1999_288": "Grace tries to be the perfect mother and TV producer but finds trouble in juggling both.",
    "1999_289": "Famous writer Alexander is very ill and has little time left to live. He meets a little boy on the street, who is an illegal immigrant from Albania, and goes on a journey with him to take the boy home.",
    "1999_29": "A quadriplegic ex-homicide detective and his partner try to track down a serial killer who is terrorizing New York City.",
    "1999_290": "In June, 1983, in Dutchess County, New York, Sebastian Cole joins his mother, step-father, and sister for dinner. Hank, Sebastian's step-father, drops a bomb: he announces he's changing sexes. Sebastian's sister splits immediately for ...See moreIn June, 1983, in Dutchess County, New York, Sebastian Cole joins his mother, step-father, and sister for dinner. Hank, Sebastian's step-father, drops a bomb: he announces he's changing sexes. Sebastian's sister splits immediately for California, and his mother takes him back to England. Jump ahead eight months, Sebastian is back in New York, knocking on Hank's door. Hank (now Henrietta, although all the surgeries aren't complete) takes Sebastian in and is his rock over the next few months of high school. Sebastian's \"adventures\" are mostly self-destructive.  Written by See less",
    "1999_291": "An academic obsessed with \"roadside attractions\" and his tv-star daughter finally discover the world's largest ice cream cone, the centerpiece for an old gold-rush town struggling to stay on the map. They end up staying longer than ...See moreAn academic obsessed with \"roadside attractions\" and his tv-star daughter finally discover the world's largest ice cream cone, the centerpiece for an old gold-rush town struggling to stay on the map. They end up staying longer than expected because of an accident that spilled an unknown cola ingredient all over the highway. They spend the next few days with the various residents of the town which include a teenage girl who loves to blow things up and a boy trying to keep alive his fathers dream of building a beachside resort in the middle of the desert.  Written by Gregory Paris See less",
    "1999_292": "A harried movie director retreats into his memories and fantasies.",
    "1999_293": "3 childhood friends all separately fall for cute American Martha and within 3 days of her arrival at a London airport, their friendship is at risk.",
    "1999_294": "Mystery about an ex-prizefighter who embarks on a journey to find 13 missing diamonds.",
    "1999_295": "A portrait of the effects of schizophrenia on family life is the central focus.",
    "1999_296": "Consequences force an innocent man to get involved in crime after making an error.",
    "1999_297": "A frustrated teenage girl creates her perfect man in a virtual reality machine and in a freak accident, gives him life.",
    "1999_298": "Aunt Agnes (Prunella Scales) vainly tries to force Emily (Georgina Cates) to marry boring Cedric Trilling (Robert Portal) by taking them to Italy and India hoping that Emily will forget about the handsome George (Sean Pertwee).",
    "1999_299": "Major Ajit is sent to nab the ex army officer Colonel Sodhi, who is hiding in the guise of Devraj Hathoda.",
    "1999_3": "When Woody is stolen by a toy collector, Buzz and his friends set out on a rescue mission to save Woody before he becomes a museum toy property with his roundup gang Jessie, Prospector, and Bullseye.",
    "1999_30": "When the daughter of a well-known and well-respected base commander is murdered, an undercover detective is summoned to look into the matter and finds a slew of cover-ups at West Point.",
    "1999_300": "A story about the transition from late youth to early maturity, the film follows several friends and lovers as they come to make decisions on how to live their lives--getting a job more in harmony with ones ideals, committing to a lover, ...See moreA story about the transition from late youth to early maturity, the film follows several friends and lovers as they come to make decisions on how to live their lives--getting a job more in harmony with ones ideals, committing to a lover, giving up a lover that no longer loves you: a film about grown-ups growing up.  Written by Josh Baudhuin See less",
    "1999_301": "A strictly monogamous man stops to help a stranded female with a broken down car. In gratitude she offers oral sex, when he reluctantly accepts. However, just as they get involved, the cops arrive and it turns out that the woman is a known...See moreA strictly monogamous man stops to help a stranded female with a broken down car. In gratitude she offers oral sex, when he reluctantly accepts. However, just as they get involved, the cops arrive and it turns out that the woman is a known prostitute. The man is arrested and is forced to call his wife at 3 AM to bail him out. A few days later he is evicted from his home by his wife. His best friends question how he could have been so naive. Meanwhile his wife and her friends plan their own night out with full sexual plans. Meanwhile the men decide that an apology is at hand. Arriving home, instead of his wife, he finds his mother-in-law. Eventually the guys, girls, and mom all end up together in a night club that brings all the events to a head.  Written by John Sacksteder See less",
    "1999_302": "A manager hires Ray, off the books, to paint all the power towers in a 15-mile stretch of high-tension wires outside Sheffield. Ray's crew of men are friends, especially Ray with Steve, a young Romeo. Into the mix comes Gerry, an ...See moreA manager hires Ray, off the books, to paint all the power towers in a 15-mile stretch of high-tension wires outside Sheffield. Ray's crew of men are friends, especially Ray with Steve, a young Romeo. Into the mix comes Gerry, an Australian with a spirit of adventure and mountain climbing skills. She wants a job, and against the others' advice, who don't want a woman on the job, Ray hires her. Then she and Ray fall in love. He asks her to marry him, gives her a ring. Steve's jealous; Ray's ex-wife complains that he spends on Gerry, not his own kids, and she predicts that Gerry won't stay around. Plus, there's pressure to finish the job fast. Economics, romance, and wanderlust spark the end.  Written by See less",
    "1999_303": "A disadvantaged, abused, neglected, exploited but basically decent kid slips into criminality while trying to cope with his harsh, inescapable reality.",
    "1999_304": "When Shiloh's abusive previous owner, Judd Travers, tries to retake Shiloh again, Ray tries to find a way to end the rivalry and open up the hidden kindness within the town drunk.",
    "1999_305": "Julia Sweeney tells the viewers the monologue about the hard time in her life when her brother fought with cancer and she was also diagnosed with a rare form of cancer.See moreJulia Sweeney tells the viewers the monologue about the hard time in her life when her brother fought with cancer and she was also diagnosed with a rare form of cancer.  Written by AnonymousSee less",
    "1999_306": "Eighteen-year-old mothers' son Harry (he lives with his overprotective mother Kate) shows his cruel side at one occasion and is hired as hitman/enforcer by the Jewish mob.See moreEighteen-year-old mothers' son Harry (he lives with his overprotective mother Kate) shows his cruel side at one occasion and is hired as hitman/enforcer by the Jewish mob.  Written by AnonymousSee less",
    "1999_307": "After his son dies, an elderly man comes back to Spain from the US and hopes to find out which of his granddaughters is true, and which one is bastard.",
    "1999_308": "South Boston Irish bad boy Danny Quinn returns back home from New York and gets stuck between his pals, who are supported by one Irish mafia clan, and his family, which are members of another.See moreSouth Boston Irish bad boy Danny Quinn returns back home from New York and gets stuck between his pals, who are supported by one Irish mafia clan, and his family, which are members of another.  Written by AnonymousSee less",
    "1999_309": "Deepak returns Aarti's lost-in-transit luggage. The two start communicating via letter. They fall in love and rural/suburban Aarti comes to the city to look for Deepak, whom she had sent a handwoven pullover.",
    "1999_31": "A security guard's dreams come true when he is selected to be transformed into a cybernetic police officer.",
    "1999_310": "A young writer who follows strangers for material meets a thief who takes him under his wing.",
    "1999_311": "Devraj, a gangster and Payal, a reporter fell in love. Amit, loves Payal and a lot of trouble follows in their lives.",
    "1999_312": "The story of three young boxers and their coach who is determined to guide them in a positive direction in and out of the ring.",
    "1999_313": "A richly funny behind-the-scenes look at the art of creating comedy. When celebrities need a hilarious punch line, they get Bruce Vilanch, the comic writer behind Hollywood's biggest events.",
    "1999_314": "In this film made over ten years, filmmaker Barbara Sonneborn goes on a pilgrimage to the Vietnamese countryside where her husband was killed. She and translator (and fellow war widow) Xuan Ngoc Nguyen explore the meaning of war and loss ...See moreIn this film made over ten years, filmmaker Barbara Sonneborn goes on a pilgrimage to the Vietnamese countryside where her husband was killed. She and translator (and fellow war widow) Xuan Ngoc Nguyen explore the meaning of war and loss on a human level. The film weaves interviews with Vietnamese and American widows into a vivid testament to the legacy of war.  Written by Fiona Kelleghan See less",
    "1999_315": "A footman seduces a count's daughter.",
    "1999_316": "Neelima Bakshi is a girl who belongs to a conservative Muslim family from Bombay. At the post office, she meets a boy named Sameer 'Prince' Roshan and it is love at first sight. The bond that draws them close is their dream of becoming ...See moreNeelima Bakshi is a girl who belongs to a conservative Muslim family from Bombay. At the post office, she meets a boy named Sameer 'Prince' Roshan and it is love at first sight. The bond that draws them close is their dream of becoming doctors. However, when her uncle, a stunch and autocratic Muslim, is released from jail after 12 years, he forbids her to see Prince when he learns that Prince is Hindu. Amidst thse restrictions the love between Prince and Neelima blossoms, but is again threatened when Prince gets admission into a medical college and Neelima is rejected.  Written by gavin (gunmasterM@hotmail.com)See less",
    "1999_317": "A young woman attempts to end her criminal career. But she needs love to make it.",
    "1999_318": "In Flip's path towards \"keeping it real\" by becoming hip-hop star, harsh realities surface to shake up his world.",
    "1999_319": "Fantasy-comedy about a young man who lives as if it is 1928 or so, and his encounters with modern-day women and modern-day criminals.",
    "1999_32": "In late 1950s New York, Tom Ripley, a young underachiever, is sent to Italy to retrieve Dickie Greenleaf, a rich and spoiled millionaire playboy. But when the errand fails, Ripley takes extreme measures.",
    "1999_320": "Friends for ten years, a group of twenty-somethings head for the ski slopes as guests of Ian's father. (Ian and dad are estranged because dad worked too many hours when Ian was a lad.) Dad has something to say, but Ian won't listen. ...See moreFriends for ten years, a group of twenty-somethings head for the ski slopes as guests of Ian's father. (Ian and dad are estranged because dad worked too many hours when Ian was a lad.) Dad has something to say, but Ian won't listen. Meanwhile, David is gay and virginal; Ian's business partner, Keaton, is unhappy that his sister Jane is pregnant with no plans to tell the father; Lisa is everybody's pal and no one's lover; John, stuck in adolescence, is always on the make. He brings German-born stunner, Carla, and promptly loses her affection to Hans, a fast-talking ski instructor. David meets Manny: they have chess in common. Soon, surprises abound as relationships take new turns.  Written by See less",
    "1999_321": "Made of four short tales, linked by a story filmed by Wim Wenders. Taking place in Ferrara, Portofino, Aix en Provence and Paris, each story, which always a woman as the crux of the story, invites to an inner travel, as Antonioni says \"...See moreMade of four short tales, linked by a story filmed by Wim Wenders. Taking place in Ferrara, Portofino, Aix en Provence and Paris, each story, which always a woman as the crux of the story, invites to an inner travel, as Antonioni says \"towards the true image of that absolute and mysterious reality that nobody will ever see\".  Written by Oscar Esteban See less",
    "1999_322": "Two less than successful film producers, approaching mid-life crisis and clinging to their nerdy sci-fi obsessions, suddenly meet their idol: William Shatner.",
    "1999_323": "Alex, who's homeless and addicted to alcohol, and Michèle, who's losing her sight, form a relationship while sleeping rough on Paris's Pont-Neuf bridge.",
    "1999_324": "",
    "1999_325": "A botched robbery leads two crooks and an unwitting buddy into a web of passion, crime and murder in this twist-laden film noir.",
    "1999_326": "Screwball romance involving a woman (Makkena) who gets fired from her job as a bank teller when her friends arrange for a stripper to appear at the bank for her birthday. She then meets a man (Hickey) whom she had earlier seen jump off a ...See moreScrewball romance involving a woman (Makkena) who gets fired from her job as a bank teller when her friends arrange for a stripper to appear at the bank for her birthday. She then meets a man (Hickey) whom she had earlier seen jump off a bridge and had assumed had committed suicide. With nothing else to do, she follows him to Texas. Along the way she slowly comes to realize he is gay and is despondent over the AIDS-related death of his former lover.  Written by John Sacksteder See less",
    "1999_327": "A suicidal older man, Gordon Trout, is kidnapped for his car and money by three runaway teenagers who live on the streets. Their experiences together make them a close-knit family, but the nature of the crime committed could tear them ...See moreA suicidal older man, Gordon Trout, is kidnapped for his car and money by three runaway teenagers who live on the streets. Their experiences together make them a close-knit family, but the nature of the crime committed could tear them apart. The intricacies of these complex relationships are explored through an emotional story with twists and turns.  Written by AnonymousSee less",
    "1999_328": "The sudden reappearance of his best friend Toni, after a ten year absence, causes Chris to remember his past, to question some of his lifestyle decisions and to re-evaluate his life and marriage to Marion.",
    "1999_329": "Bobby Platt (Christian Bale) is a mentally slow young man who escapes an abusive, hateful stepfather who has killed his pets one by one. To save himself, Bobby runs away and meets a strange old man (Sir John Hurt) who wanders the highways ...See moreBobby Platt (Christian Bale) is a mentally slow young man who escapes an abusive, hateful stepfather who has killed his pets one by one. To save himself, Bobby runs away and meets a strange old man (Sir John Hurt) who wanders the highways to bury roadkill animals. Bobby becomes the old man's apprentice and learns to see the world of nature in a strange idyllic way. But soon the shadow of his stepfather catches up to him and Bobby's world explodes into a grotesque nightmare.  Written by Harrison See less",
    "1999_33": "A very rich and successful playboy amuses himself by stealing artwork, but may have met his match in a seductive detective.",
    "1999_330": "After a series of bizarre actions, Loris is mistaken for a serial killer. Jessica, a policewoman in undercover, will try to induce him to commit a murder.",
    "1999_331": "Eva is a legit actress, who also does debt collecting jobs on the side for her ex-husband, loan shark Al. She doesn't want to go on with collecting, but Al asks her to do one last job, finding a missing $600,000 stolen from him by Flav.",
    "1999_332": "Two businessmen are hired to steal secrets from a rival, and decide to use a beautiful call girl to do so.",
    "1999_333": "A former tennis player tries to arrange his wife's murder after learning of her affair.",
    "1999_334": "Kennedy is a rebellious, young musician who believes that talent and determination are all it takes to be a success. But as he and his loyal bandmates learn, success carries a heavy price tag that includes betrayal, crime and possibly even...See moreKennedy is a rebellious, young musician who believes that talent and determination are all it takes to be a success. But as he and his loyal bandmates learn, success carries a heavy price tag that includes betrayal, crime and possibly even murder.  Written by rooprectSee less",
    "1999_335": "A bachelor becomes the unwilling guardian of his autistic, intellectually disabled sister; then an experimental treatment works a dramatic change in her brain and his attitude.",
    "1999_336": "King Kong goes Hong Kong as a giant Himalayan beast tries to save a sexy Russia Tarzanette from a sleazy show-biz promoter. The action, locations set in India, and interracial romance made Variety reach this verdict: \"High camp, Chinese ...See moreKing Kong goes Hong Kong as a giant Himalayan beast tries to save a sexy Russia Tarzanette from a sleazy show-biz promoter. The action, locations set in India, and interracial romance made Variety reach this verdict: \"High camp, Chinese style.\"  Written by Celestial PicturesSee less",
    "1999_337": "Johnnie feels a lot of pressure lately. He's the foreman on his uncle's construction crew, and money seems to be going astray. His girlfriend begins pressuring him for more of a commitment and so does his new boyfriend. To top it off, he's...See moreJohnnie feels a lot of pressure lately. He's the foreman on his uncle's construction crew, and money seems to be going astray. His girlfriend begins pressuring him for more of a commitment and so does his new boyfriend. To top it off, he's started sleepwalking, and he doesn't know why.  Written by bjk1961See less",
    "1999_338": "A woman reporter in over her head in trying to write a book on the male machismo in Spain finds the men don't match her story's expectations. She also finds herself involved in relationships with the wrong men.",
    "1999_339": "After twelve years of imprisonment by their own parents, two sisters are finally released by social workers to face the outside world for the first time.",
    "1999_34": "A woman discovers a tragic love letter in a bottle on a beach, and is determined to track down its author.",
    "1999_340": "A Cherry Pontiac Lemans Convertible...Two Days...Two-Hundred & Fifty Grand. When your lemon lot hits the skids you glom the gig no matter what the smell. For Bob and Sid, two slicked-back burnouts, bum luck runs in spades. With a goose-egg...See moreA Cherry Pontiac Lemans Convertible...Two Days...Two-Hundred & Fifty Grand. When your lemon lot hits the skids you glom the gig no matter what the smell. For Bob and Sid, two slicked-back burnouts, bum luck runs in spades. With a goose-egg for cash flow and a fore-closure falling fast, they take the gig. The Upside: Fat Cash...The Flipside...Every Thug, Crook, Punk and Mercenary on the planet looking to get rich.  Written by See less",
    "1999_341": "A bored couple takes in a young man who turns their lives inside out",
    "1999_342": "A desperate writer fights for survival when the Mexican mob involves him in murder.",
    "1999_343": "Nearing his 60th birthday, a movie producer discovers that he may have less than a year to live as a result of inoperable cancer. The effects of his disease take the toll on him and his distressed wife. However, his dysfunctional family ...See moreNearing his 60th birthday, a movie producer discovers that he may have less than a year to live as a result of inoperable cancer. The effects of his disease take the toll on him and his distressed wife. However, his dysfunctional family are not told and their soap opera-ish life goes on. His son, a has-been actor, has to deal with a precocious daughter and a drug-addled ex-wife and sells AIDS patients insurance policies until he becomes attracted to one. His step-sister learns that her real father murdered her mother & then committed suicide.  Written by John Sacksteder See less",
    "1999_344": "",
    "1999_345": "A young woman in rural 1950s England becomes involved in a scandalous love triangle that will inevitably leave someone behind to suffer the consequences.",
    "1999_346": "3 men rob a place. Hayden's killed, Johnny's wounded and does 5 years prison and Patty leaves with the money. He sees Hayden's sister/A.Jolie. When released, Johnny goes straight and wants a boxing career.",
    "1999_347": "A young boy, left without attention, delves into a life of petty crime.",
    "1999_349": "A 1980s one-hit wonder band named \"The Suburbans\" reform for a special performance at one of the ex-member's wedding. At the wedding, a young record company talent scout happens to be in the audience and decides to give the now forty-ish ...See moreA 1980s one-hit wonder band named \"The Suburbans\" reform for a special performance at one of the ex-member's wedding. At the wedding, a young record company talent scout happens to be in the audience and decides to give the now forty-ish performers a comeback push. The film attempts to take a satirical look at the music business of the 1990s, and compare it to the simpler 1980s scene.  Written by John Sacksteder See less",
    "1999_35": "A former convict poses as a cop to retrieve a diamond he stole years ago.",
    "1999_350": "A tax investigator chasing a tax evader stumbles over a series of bloody murders and gets involved in an investigation with a rookie cop despite his boss' orders to stay out of the way.",
    "1999_351": "The end of the millenium has taken on a certain significance in modern day prophecies. What happens if Jesus Christ has second thoughts about the Apocalypse? It is December 31, 1999 and New Year's Eve takes on new meaning when the Devil, ...See moreThe end of the millenium has taken on a certain significance in modern day prophecies. What happens if Jesus Christ has second thoughts about the Apocalypse? It is December 31, 1999 and New Year's Eve takes on new meaning when the Devil, Jesus Christ, and Christ's assistant Magdelina discuss and debate the end of the world, the opening of the seven seals, and the essence of being human.  Written by Tracy See less",
    "1999_352": "Peter loves his next door neighbour Erica and, on the advice of his grandfather, decides to camp out on her front lawn for the entire summer, or until she agrees to go out with him. His father is none too happy about the idea and refuses ...See morePeter loves his next door neighbour Erica and, on the advice of his grandfather, decides to camp out on her front lawn for the entire summer, or until she agrees to go out with him. His father is none too happy about the idea and refuses to let his son back in the house, even to get a change of clothes. Peter's friend, Matt, thinks Peter should give up on women (like he has) and just have sex with fruit, and have a total devotion to masterbation.  Written by Jimbo , BobbyJ See less",
    "1999_353": "Three buddies discover a road trip for a party in Mexico can take more out of you than expected. Things begin to take a strange turn when Johnny gets mind reading powers from a medicine man's magical tequila. Johnny's friends want him to ...See moreThree buddies discover a road trip for a party in Mexico can take more out of you than expected. Things begin to take a strange turn when Johnny gets mind reading powers from a medicine man's magical tequila. Johnny's friends want him to use these powers to get women but Johnny's mind is only on the beautiful Tamlyn. Reaching Tamlyn proves more challenging when Johnny realizes that not only is her punk ex-boyfriend stalking her but also that Tamlyn's past life's husband, Hector, wants her back! Johnny and his friends are in for the adventure of their lives as they race to save Tamlyn - and themselves - from the clutches of Hector at a deadly party in hell. Luckily, our heros have time to squeeze in an enlightening round of truth or dare, drink themselves silly, and, oh yeah, get laid. The comical escapades are tied together by tequila body shots which are not only fun to drink but also conjure the souls of the dead back to life!  Written by Showtown Films, Inc.See less",
    "1999_354": "Melba is a Californian trailer-park girl who is said to look for three kings by a phone psychic, and when she meets three guys - Trent, Brad and Joel traveling to Las Vegas, she decides they are those kings and joins them on a trip. In ...See moreMelba is a Californian trailer-park girl who is said to look for three kings by a phone psychic, and when she meets three guys - Trent, Brad and Joel traveling to Las Vegas, she decides they are those kings and joins them on a trip. In Vegas she meets her old high school pal Dottie.  Written by AnonymousSee less",
    "1999_355": "A horse meat butcher's life and mind begins to breakdown as he lashes out against various factions of society while attempting to reconnect with his estranged daughter.",
    "1999_356": "This real-life documentary explores the passionate & energetic presence of renowned Italian violinist Nadja Salerno-Sonnenberg (she moved to the Unites States at the age of eight to study at The Curtis Institute of Music and later studied ...See moreThis real-life documentary explores the passionate & energetic presence of renowned Italian violinist Nadja Salerno-Sonnenberg (she moved to the Unites States at the age of eight to study at The Curtis Institute of Music and later studied with Dorothy DeLay at The Julliard School.) The film focuses on her professional life, starting in 1981, when she burst onto the classical music scene as the youngest (at 17) recipient ever of the Walter W. Naumburg International Violin Competition.  Written by Len MassaarSee less",
    "1999_357": "",
    "1999_358": "The story of families living in barracks, left by the US Army in Reykjavik at the conclusion of World War II.",
    "1999_359": "Two terminally ill patients escape from a hospital, steal a car and rush towards the sea.",
    "1999_36": "The story of the romance between the King of Siam and widowed British schoolteacher, Anna Leonowens, during the 1860s.",
    "1999_360": "Leila and Reza meet in a kind of celebration and fall for each other. Having discovered their love, they get married soon only to find out the infertility of Leila. That's when Reza's authoritative mother starts wheedling Leila to persuade...See moreLeila and Reza meet in a kind of celebration and fall for each other. Having discovered their love, they get married soon only to find out the infertility of Leila. That's when Reza's authoritative mother starts wheedling Leila to persuade Reza into second marriage for the sake of having a grandchild. Leila accepts at first but is unaware of her own strain threshold.  Written by Hossein srSee less",
    "1999_361": "Two old friends meet for dinner; as one tells anecdotes detailing his experiences, the other notices their differing worldviews.",
    "1999_362": "This Canadian comedy, filmed in black and white and color and adapted from Lepage's play The Seven Branches of the River Ota. In October 1970, Montreal actress Sophie (Anne-Marie Cadieux) appears in a Feydeau farce at the Osaka World's ...See moreThis Canadian comedy, filmed in black and white and color and adapted from Lepage's play The Seven Branches of the River Ota. In October 1970, Montreal actress Sophie (Anne-Marie Cadieux) appears in a Feydeau farce at the Osaka World's Fair. Back in Montreal, her boyfriend Michel (Alexis Martin) watches the October Crisis on TV and sees Canadian Prime Minister Trudeau declare the War Measures Act. The Canadian Army patrols Montreal streets. Sophie learns she's pregnant and phones Michel. However, Michel is immersed in politics, while Sophie rejects the amorous advances of her co-star (Eric Bernier), becomes friendly with a blind translator, and passes an evening with frivolous Canadian embassy official Walter (Richard Frechette) and his wife Patricia (Marie Gignac). Meanwhile, in Montreal, Michael plots terrorist activities.See less",
    "1999_363": "Adolf Hitler faces himself and must come to terms with his infamous career in an imaginary post-war subterranean bunker where he reviews historical films, dictates his memoirs and encounters Eva Braun, Josef Goebbels, Hermann Göring and ...See moreAdolf Hitler faces himself and must come to terms with his infamous career in an imaginary post-war subterranean bunker where he reviews historical films, dictates his memoirs and encounters Eva Braun, Josef Goebbels, Hermann Göring and Sigmund Freud.  Written by MGSee less",
    "1999_364": "Jeanne has an appetite for love that can never be satisfied. Lovers at every corner of her life she is still in search of that \"one\". When a impromptu tryst on the subway with Olivier gives her butterflies like never before she finally ...See moreJeanne has an appetite for love that can never be satisfied. Lovers at every corner of her life she is still in search of that \"one\". When a impromptu tryst on the subway with Olivier gives her butterflies like never before she finally finds herself in love, truly in love. Yet she continues her affairs but now with a realization that they are not what she wants, she wants Olivier. Olivier reluctant to continue the romance with Jeanne for fear of hurting her or worse yet her seeing him at his worse. Olivier reveals to Jeanne he has AIDS from a bad needle during his heroine use. This however does not scare Jeanne off and her love for him turns her into a new person who wants to care for him, but that is not what he wants. The two share a common friend that is an AIDS Activist but they don't know it. Then Olivier because severely ill and Jeanne professes her love and her infidelity. That is the last she ever sees of Olivier. She returns to the hospital to find he has left with his parents, and left no forwarding address. Much time passes, and still the pain of her lost love resides. She knows of nothing of his whereabouts and no way to find him, until she bumps in to a friend that accompanied Olivier on the subway when she met him. Then she finally learns her love has passed on. A musical about the french governments lack of concern and role in the dire conditions of their citizens and about the different classes in society from the immigrant workers, soldiers, upper class and economic dependency on credit cards. A story that covers all walks of life and the pains of love.  Written by Leslie Erentreich, Woodland Hills, CA USASee less",
    "1999_365": "Russell, single father balances his work as a lawyer with the care of his five-year-old son, after his wife abandoned them. When she reappears creating turmoil, he must deal with his new love interest and a job opportunity of a lifetime.",
    "1999_366": "",
    "1999_367": "Historical drama set in the 1950s. Story is based on real-life events. Rosemarie Nitribitt comes out of a remand center, runs away from her foster parents and ends up working as a barmaid in a Frankfurt nightclub. A wealthy French ...See moreHistorical drama set in the 1950s. Story is based on real-life events. Rosemarie Nitribitt comes out of a remand center, runs away from her foster parents and ends up working as a barmaid in a Frankfurt nightclub. A wealthy French businessman offers to set her up in return for tape-recordings of her sex sessions with German VIPs.See less",
    "1999_368": "A sports fan's romantic courtship clashes with his obsession with his favorite football team.",
    "1999_369": "A deodorant company with a product called \"Smell No Mo\" pits two rival ad agencies in a race to come up with a campaign for a new-fangled sanitary napkin called Vorcan. The advertising satire follows the New York firm of Cranston & Co. as ...See moreA deodorant company with a product called \"Smell No Mo\" pits two rival ad agencies in a race to come up with a campaign for a new-fangled sanitary napkin called Vorcan. The advertising satire follows the New York firm of Cranston & Co. as they fight rival Hoffman & Partners. Cranston fires his creative director which puts a young copywriter with a literature degree on the front line, even though he doesn't want to be. The contest comes down to a schmaltzy campaign by Hoffman with music by Air Supply that uses the tagline \"Vorcan: your own personal air supply.\" or a more down to earth campaign from Cranston of \"The pad ain't bad!\"  Written by John Sacksteder See less",
    "1999_37": "In the aftermath of the Persian Gulf War, four soldiers set out to steal gold that was stolen from Kuwait, but they discover people who desperately need their help.",
    "1999_370": "A young Japanese-American girl is affected on all fronts. She suffers from the volition of her ancestry, the discipline of her mother and the world she feels betrays her. She is a pyromaniac and has mental issues. What to do? Escape and ...See moreA young Japanese-American girl is affected on all fronts. She suffers from the volition of her ancestry, the discipline of her mother and the world she feels betrays her. She is a pyromaniac and has mental issues. What to do? Escape and hit the road with your boyfriend except there is no destination and even were there one she abandons it in favour of a detour through history.  Written by aghaemiSee less",
    "1999_371": "Romeo, a lovelorn Roman musician in his 40s with 20 years since his only hit, consults a fortuneteller who predicts he'll find love and money with a foreign singer named for a flower. In Brussels he meets Marguerite, an older chanteuse who...See moreRomeo, a lovelorn Roman musician in his 40s with 20 years since his only hit, consults a fortuneteller who predicts he'll find love and money with a foreign singer named for a flower. In Brussels he meets Marguerite, an older chanteuse who interprets Jacques Brel and loves her yappy dog. Then, late one night, while binging on burgers, he meets Iris, 25, a waitress, free spirit, poet and singer who sleeps with a new man nearly every night. Romeo falls for her, and, better, he puts her poems to music. They form an act. He moves in with her and pays all the bills. She insists it's business, with no romance. What will happen when an important producer hears them perform?  Written by See less",
    "1999_372": "Billy Duncan, a dance instructor, has fallen on hard times and is sentenced to community service time. His assignment? To give dance lessons to elderly parishioners at a local Greek church. Reluctant at first, Billy soon finds himself ...See moreBilly Duncan, a dance instructor, has fallen on hard times and is sentenced to community service time. His assignment? To give dance lessons to elderly parishioners at a local Greek church. Reluctant at first, Billy soon finds himself falling in love with a wealthy parishioner's daughter. With the help of an off-beat Priest, Billy is inspired into teaching dance again and taking a chance on love.See less",
    "1999_373": "Brett Sprague is a violent and psychopathic man, who is released on parole after serving a sentence for assault. As he returns to his family house and we watch him and his brothers, Stevie and Glenn, for the next 24 hours, it becomes clear...See moreBrett Sprague is a violent and psychopathic man, who is released on parole after serving a sentence for assault. As he returns to his family house and we watch him and his brothers, Stevie and Glenn, for the next 24 hours, it becomes clear this day will not end well.  Written by AnonymousSee less",
    "1999_374": "A masochistic cop, who hides her predilection from her cop husband, gets involved in pursuing a kidnapper nicknamed Harry for Harry Houdini, who has kidnapped a rich woman and has buried her somewhere in Manhattan while demanding a ransom ...See moreA masochistic cop, who hides her predilection from her cop husband, gets involved in pursuing a kidnapper nicknamed Harry for Harry Houdini, who has kidnapped a rich woman and has buried her somewhere in Manhattan while demanding a ransom from her tycoon husband. Failure to pay the ransom within 24 hours will lead the kidnapper to abandoning the woman. Dylan Baker also appears as the fed that is assigned to the case.  Written by John Sacksteder See less",
    "1999_375": "A documentary that follows four upcoming models, while showing what the whole world of modeling is all about.",
    "1999_376": "Robert's wife is divorcing him for gambling etc. A strip club owner offers him work redesigning his club. Robert befriends a dancer there, who has premonitions.",
    "1999_377": "Two college graduates who find themselves stuck behind the counter of a pizza parlor while their friends move on struggle to find a new direction for their lives.",
    "1999_378": "",
    "1999_379": "Ex porn star Valentino and Gary are in love with each other. But Valentino also has a girlfriend. Tragedy hits them, when Valentino collapses and is hospitalized with AIDS.",
    "1999_38": "A high school jock makes a bet that he can turn an unattractive girl into the school's prom queen.",
    "1999_380": "A young boy and his sister are drawn into one man's obsessive pursuit of his former lover.",
    "1999_381": "A detective investigating the murder of a heroin addict discovers that there is a connection between the junkie and his fiance, who is his boss' daughter.",
    "1999_382": "A writer, Tucker Harding, is hired to cover an article on the hydrogen-bomb test, Nevada, 1952. While there, radiation mutates her code/soul, spawning in her the ability to travel through time by force of will. Not long after she is ...See moreA writer, Tucker Harding, is hired to cover an article on the hydrogen-bomb test, Nevada, 1952. While there, radiation mutates her code/soul, spawning in her the ability to travel through time by force of will. Not long after she is murdered by a woman from the future, Ofelia, intent on securing her own ability to time travel. However, before her death Tucker travels to the year 1997 where she meets Drew, a failed writer who has been infected with Tuckers original mutation since birth.  Written by kwedgwood@hotmail.comSee less",
    "1999_383": "Family celebrations and tensions, Independence Day, Texas 1948",
    "1999_384": "A series of comedic short films guaranteed to offend.",
    "1999_385": "Because he wants to keep a promise made to his friend, the physician Antoine Barasse, murdered in Port Djema, former territory of the French Empire in East Africa, Pierre Feldman, surgeon, shares in the footsteps of the disappeared. ...See moreBecause he wants to keep a promise made to his friend, the physician Antoine Barasse, murdered in Port Djema, former territory of the French Empire in East Africa, Pierre Feldman, surgeon, shares in the footsteps of the disappeared. Antoine had chosen the camp of rebellion, supporting Assad nomads fighting against the power in place. Despite the warnings, Peter goes to Antoine's dispensary. He discovers a bruised and violent Africa and especially the reverse of a humanitarian commitment.  Written by Eric HeumanSee less",
    "1999_386": "Three friends find themselves in a bar fight with a shady trio of strangers. When the strangers come looking for revenge, the three friends find themselves in something deadly.",
    "1999_39": "An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into something much, much more.",
    "1999_4": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
    "1999_40": "A behind-the-scenes look at the life-and-death struggles of modern-day gladiators and those who lead them.",
    "1999_41": "When a desperate movie producer fails to get a major star for his bargain basement film, he decides to shoot the film secretly around him.",
    "1999_42": "A private investigator is hired to discover if a \"snuff film\" is authentic or not.",
    "1999_43": "A soon-to-be-married man encounters an exciting stranger after his plane suffers an accident on takeoff.",
    "1999_44": "An average aquarium cleaner house-sits for a gigolo, only to be forced to become one himself.",
    "1999_45": "The alumni cast of a space opera television series have to play their roles as the real thing when an alien race needs their help. However, they also have to defend both Earth and the alien race from a reptilian warlord.",
    "1999_46": "When a young woman becomes afflicted by stigmata, a priest is sent to investigate her case, which may have severe ramifications for his faith and for the Catholic Church itself.",
    "1999_47": "A compassionate young man, raised in an orphanage and trained to be a doctor there, decides to leave to see the world.",
    "1999_48": "An android endeavors to become human as he gradually acquires emotions.",
    "1999_49": "A newspaper reporter enrolls in high school as part of research for a story.",
    "1999_5": "A man raised by gorillas must decide where he really belongs when he discovers he is a human.",
    "1999_50": "When Stan Marsh and his friends go see an R-rated movie, they start cursing and their parents think that Canada is to blame.",
    "1999_51": "Two vicious step-siblings of an elite Manhattan prep school make a wager: to deflower the new headmaster's daughter before the start of term.",
    "1999_52": "Police Sergeant Dutch Van Den Broek (Harrison Ford) and U.S. Representative Kay Chandler (Dame Kristin Scott Thomas) lose their spouses in a plane crash, and they soon discover that their spouses were having an affair with each other.",
    "1999_53": "The story of Rubin \"Hurricane\" Carter, a boxer wrongly imprisoned for murder, and the people who aided in his fight to prove his innocence.",
    "1999_54": "In 1932, two strangers are wrongfully convicted and develop a strong friendship in prison that lasts them through the 20th century.",
    "1999_55": "Young Esteban wants to become a writer and also to discover the identity of his second mother, a trans woman, carefully concealed by his mother Manuela.",
    "1999_56": "A young girl receives a vision that drives her to rid France of its oppressors.",
    "1999_57": "A man, having fallen in love with the wrong woman, is sent by the sultan himself on a diplomatic mission to a distant land as an ambassador. Stopping at a Viking village port to restock on supplies, he finds himself unwittingly embroiled ...See moreA man, having fallen in love with the wrong woman, is sent by the sultan himself on a diplomatic mission to a distant land as an ambassador. Stopping at a Viking village port to restock on supplies, he finds himself unwittingly embroiled in a quest to banish a mysterious threat in a distant Viking land.See less",
    "1999_58": "A research chemist comes under personal and professional attack when he decides to appear in a 60 Minutes expose on Big Tobacco.",
    "1999_59": "Ben and Katie Jordan are a married couple who go through hard times in fifteen years of marriage.",
    "1999_6": "At an archaeological dig in the ancient city of Hamunaptra, an American serving in the French Foreign Legion accidentally awakens a mummy who begins to wreck havoc as he searches for the reincarnation of his long-lost love.",
    "1999_60": "Three people attempt to stop a gigantic crocodile, who is terrorizing residents in Black Lake, Maine.",
    "1999_61": "A back-up quarterback is chosen to lead a Texas football team to victory after the star quarterback is injured.",
    "1999_62": "An English auctioneer proposes to the daughter of a Mafia kingpin, only to realize that certain \"favors\" would be asked of him.",
    "1999_63": "A pretty, popular teenager can't go out on a date until her ill-tempered older sister does.",
    "1999_64": "An epic mosaic of interrelated characters in search of love, forgiveness, and meaning in the San Fernando Valley.",
    "1999_65": "Based on writer Susanna Kaysen's account of her 18-month stay at a mental hospital in the late 1960s.",
    "1999_66": "The life and career of legendary comedian Andy Kaufman.",
    "1999_67": "After 19 years of playing the game he's loved his whole life, Detroit Tigers pitcher Billy Chapel has to decide if he's going to risk everything and put everything out there.",
    "1999_68": "An amusement park mogul offers a group of diverse people $1,000,000 to spend the night in a haunted house with a horrifying past.",
    "1999_69": "A man begins to suspect his neighbors are not what they appear to be and their secrets could be deadly.",
    "1999_7": "The life of a simple bookshop owner changes when he meets the most famous film star in the world.",
    "1999_70": "A naive man comes out into the world after spending 35 years in a nuclear fallout shelter.",
    "1999_71": "A lab accident sends a scientist and his robot assistant on a trip through the history of 3D film. Special appearance by horror host Elvira, Mistress of the Dark.",
    "1999_72": "A commitment-phobic man goes in search of a bride, including his fed-up girlfriend, to inherit his grandfather's one hundred million dollar inheritance.",
    "1999_73": "A Martian lands on Earth and makes friends with a reporter.",
    "1999_74": "Scientists hold super intelligent talking babies captive, but things take a turn for the worse when a mix-up occurs between a baby genius and its twin.",
    "1999_75": "A video store clerk agrees to have his life filmed by a camera crew for a television show.",
    "1999_76": "The true story of Homer Hickam, a coal miner's son who was inspired by the first Sputnik launch to take up rocketry against his father's wishes.",
    "1999_77": "Just before best friend's wedding, the life of Chicago writer becomes crazy when the friend guesses that new book's story based on his bride's fervent past.",
    "1999_78": "When noted anthropologist Dr. Ethan Powell, who left society to live in the jungle is imprisoned for murder, it's up to young psychiatrist Theo Caulder to get through to him.",
    "1999_79": "A group of inept amateur superheroes must try to save the day when a supervillain threatens to destroy a major superhero and the city.",
    "1999_8": "James Bond uncovers a nuclear plot while protecting an oil heiress from her former kidnapper, an international terrorist who can't feel pain.",
    "1999_80": "An abortion clinic worker with a special heritage is called upon to save the existence of humanity from being negated by two renegade angels trying to exploit a loop-hole and reenter Heaven.",
    "1999_81": "When the crew of an American tugboat boards an abandoned Russian research vessel, the alien life form aboard regards them as a virus which must be destroyed.",
    "1999_82": "A nerdy Catholic schoolgirl, Mary Katherine Gallagher, dreams of superstardom.",
    "1999_83": "Marine biologist Dr. Carole Baldwin, from the Smithsonian Institutions's Museum of Natural History, and her first trips to the famed Galapagos Islands.",
    "1999_84": "The remake of the 1970 Neil Simon comedy follows the adventures of married couple Henry and Nancy Clark as they are vexed by misfortune while in New York City for a job interview.",
    "1999_85": "The aftermath of a drug deal as told from three different points of view.",
    "1999_86": "The Deep End of The Ocean is a film about a family's reaction when Ben, the youngest son is kidnapped and then found nine years later, living in the same town, where his family had just moved.",
    "1999_87": "A mentally challenged young woman seeks independence by obtaining her own apartment and attending college while her family plans her sister's wedding.",
    "1999_88": "While dealing with a friend's cold feet on his wedding day, a writer reminisces about his youth with his best friends.",
    "1999_89": "With the aid from a New York City policeman, a top immigrant cop tries to stop drug-trafficking and corruption by immigrant Chinese Triads, but things get complicated when the Triads try to bribe the policeman.",
    "1999_9": "A sexually frustrated suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend.",
    "1999_90": "Aliens arrive on Earth and explore an amusement park thinking it it is a modern city.",
    "1999_91": "A mother and daughter search for success in Beverly Hills.",
    "1999_92": "A young boy befriends a giant robot from outer space that a paranoid government agent wants to destroy.",
    "1999_93": "A puppeteer discovers a portal that leads literally into the head of movie star John Malkovich.",
    "1999_94": "A Japanese-American fisherman is accused of killing his neighbor at sea. In the 1950s, race figures into the trial. So does reporter Ishmael.",
    "1999_95": "Aging Cuban musicians whose talents had been virtually forgotten following Castro's takeover of Cuba, are brought out of retirement by Ry Cooder, who travelled to Havana in order to bring the musicians together, resulting in triumphant ...See moreAging Cuban musicians whose talents had been virtually forgotten following Castro's takeover of Cuba, are brought out of retirement by Ry Cooder, who travelled to Havana in order to bring the musicians together, resulting in triumphant performances of extraordinary music, and resurrecting the musicians' careers.See less",
    "1999_96": "Nicole and Chase used to be BFFs, then junior high happened. The high school centennial dance is coming but Nicole gets dumped. So does Chase. They stage a relationship to get at their exes. They visit each other's worlds. Love in the air?",
    "1999_97": "A blind man has an operation to regain his sight at the urging of his girlfriend and must deal with the changes to his life.",
    "1999_98": "Gonzo is contacted by his alien family through his breakfast cereal. But when the men in black kidnap him, it's up to Kermit and the gang to rescue Gonzo and help him reunite with his long-lost family.",
    "1999_99": "After being hypnotized by his sister-in-law, a man begins seeing haunting visions of a girl's ghost and a mystery begins to unfold around him."
}