{
    "2000_1": {
        "plotSummary": "IMF agent Ethan Hunt is sent to Sydney to find and destroy a genetically modified disease called \"Chimera\".",
        "runtimeMinutes": "123"
    },
    "2000_10": {
        "plotSummary": "The wife of a university research scientist believes that her lakeside Vermont home is haunted by a ghost - or that she is losing her mind.",
        "runtimeMinutes": "130"
    },
    "2000_100": {
        "plotSummary": "After assuming his dead cell-mate's identity to get with the other man's girlfriend, an ex-convict finds himself a reluctant participant in a casino heist.",
        "runtimeMinutes": "104"
    },
    "2000_101": {
        "plotSummary": "A Catholic teacher meets an atheist journalist, whom a group of Catholics and Priests believes has been chosen by the devil to be the Antichrist.",
        "runtimeMinutes": "97"
    },
    "2000_102": {
        "plotSummary": "A loser of a crook and his wife strike it rich when a botched bank job's cover business becomes a spectacular success.",
        "runtimeMinutes": "94"
    },
    "2000_103": {
        "plotSummary": "It's the year 3000 A.D., and the Earth is lost to the alien race of Psychlos. Humanity is enslaved by these gold-thirsty tyrants, who are unaware that their 'man-animals' are about to ignite the rebellion of a lifetime.",
        "runtimeMinutes": "118"
    },
    "2000_104": {
        "plotSummary": "Comedy about a widow's post-traumatic obsession with a soap star.",
        "runtimeMinutes": "110"
    },
    "2000_105": {
        "plotSummary": "A college dropout, attempting to live up to his father's high standards, gets a job as a broker for a suburban investment firm which puts him on the fast track to success. But the job might not be as legitimate as it first appeared to be.",
        "runtimeMinutes": "120"
    },
    "2000_106": {
        "plotSummary": "A lonely American boy living in Scotland makes a new best friend, a fellow nine year-old who happens to be a vampire.",
        "runtimeMinutes": "95"
    },
    "2000_107": {
        "plotSummary": "Monica and Quincy love and play basketball together through many life challenges from childhood to adulthood.",
        "runtimeMinutes": "124"
    },
    "2000_108": {
        "plotSummary": "A child is born. We see underwater swimmers representing this. He is young, in a jungle setting, with two fanciful \"instincts\" guiding him as swooping bird-like acrobats initially menace, then delight. As an adolescent, he enters a desert,...See moreA child is born. We see underwater swimmers representing this. He is young, in a jungle setting, with two fanciful \"instincts\" guiding him as swooping bird-like acrobats initially menace, then delight. As an adolescent, he enters a desert, where a man spins a large cube of metal tubing. He leaves his instinct-guides behind, and enters a garden where two statues dance in a pond. As he watches their sensual acrobatics of love, he becomes a man. He is offered wealth (represented by a golden hat) by a devil figure. In a richly decorated room, a scruffy troupe of a dozen acrobats and a little girl reawaken the old man's youthful nature and love.  Written by Jon Reeves See less",
        "runtimeMinutes": "39"
    },
    "2000_109": {
        "plotSummary": "A group of 12 teenagers from various backgrounds enroll at the American Ballet Academy in New York to make it as ballet dancers and each one deals with the problems and stress of training and getting ahead in the world of dance.",
        "runtimeMinutes": "115"
    },
    "2000_11": {
        "plotSummary": "A year after disposing of the body of a man they accidentally killed, a group of dumb teenagers are stalked by a bumbling serial killer.",
        "runtimeMinutes": "88"
    },
    "2000_110": {
        "plotSummary": "A small-town English widow, facing financial troubles after her husband's suicide, turns to agriculture of an illegal kind.",
        "runtimeMinutes": "93"
    },
    "2000_111": {
        "plotSummary": "A friendship is put to the ultimate test when two best friends wind up in bed together.",
        "runtimeMinutes": "94"
    },
    "2000_112": {
        "plotSummary": "A young man wins and loses the first serious love of his life. Al Connelly falls in love with the girl of his dreams. After the summer she breaks up with him. As he tries to recover Al goes to desperate measures.",
        "runtimeMinutes": "91"
    },
    "2000_113": {
        "plotSummary": "Abbie, tired of failed relationships, has a one-night-stand with her gay friend; they agree to raise the resulting baby together.",
        "runtimeMinutes": "108"
    },
    "2000_114": {
        "plotSummary": "A wealthy gynecologist's ideal life is thrown into turmoil when the women closest to him begin to affect his life in unexpecting ways.",
        "runtimeMinutes": "122"
    },
    "2000_115": {
        "plotSummary": "Senator Laine Hanson is a contender for U.S. Vice President, but information and disinformation about her past surfaces that threatens to derail her confirmation.",
        "runtimeMinutes": "126"
    },
    "2000_116": {
        "plotSummary": "A documentary that follows Michael Jordan's basketball career, stint in baseball, and his last championship season with the Chicago Bulls in 1998.",
        "runtimeMinutes": "46"
    },
    "2000_117": {
        "plotSummary": "A \"behind the scenes\" look into the highly competitive and cut-throat world of dog-shows through the eyes of a group of ruthless dog owners.",
        "runtimeMinutes": "90"
    },
    "2000_118": {
        "plotSummary": "Thomas the Tank Engine's feature film debut follows Thomas and Mr. Conductor (Alec Baldwin) as they cross between the real world and the fictional Island of Sodor, in an attempt to recover lost gold dust.",
        "runtimeMinutes": "85"
    },
    "2000_119": {
        "plotSummary": "A Las Vegas mob enforcer travels back to his hometown to investigate his brother's mysterious death.",
        "runtimeMinutes": "102"
    },
    "2000_12": {
        "plotSummary": "Three women, detectives with a mysterious boss, retrieve stolen voice-ID software, using martial arts, tech skills, and sex appeal.",
        "runtimeMinutes": "98"
    },
    "2000_120": {
        "plotSummary": "A college student, branded a loser by his roommates and booted from the dorm, falls in love with a coed who has eyes for their condescending professor.",
        "runtimeMinutes": "98"
    },
    "2000_121": {
        "plotSummary": "Two Texas cowboys head to Mexico in search of work, but soon find themselves in trouble with the law after one of them falls in love with a wealthy rancher's daughter.",
        "runtimeMinutes": "116"
    },
    "2000_122": {
        "plotSummary": "In a Napoleonic era insane asylum, an inmate, the irrepressible Marquis De Sade, fights a battle of wills against a tyrannically prudish doctor.",
        "runtimeMinutes": "124"
    },
    "2000_123": {
        "plotSummary": "While our host hunts for destructive computer bugs, various shorts and clips of computer animation are featured.",
        "runtimeMinutes": "44"
    },
    "2000_124": {
        "plotSummary": "Throughout three different stories, Kari Kamiya and her friends take on explosive adventures involving digital creatures.",
        "runtimeMinutes": "82"
    },
    "2000_125": {
        "plotSummary": "A remote Australian community, populated by quirky characters, plays a key role in the first Apollo moon landing.",
        "runtimeMinutes": "101"
    },
    "2000_126": {
        "plotSummary": "Several lonely hearts in a semi-provincial suburb of a town in Denmark use a beginner's course in Italian as the platform to meet the romance of their lives.",
        "runtimeMinutes": "112"
    },
    "2000_127": {
        "plotSummary": "When a woman drives a car into the river to her death, everyone in town becomes a suspect.",
        "runtimeMinutes": "96"
    },
    "2000_128": {
        "plotSummary": "Immortals Connor and Duncan MacLeod must join forces against Kell, an evil immortal who has become too strong for anyone to face alone.",
        "runtimeMinutes": "87"
    },
    "2000_129": {
        "plotSummary": "An ex-con is used by police to lure a criminal out of hiding.",
        "runtimeMinutes": "119"
    },
    "2000_13": {
        "plotSummary": "An unemployed single mother becomes a legal assistant and almost single-handedly brings down a California power company accused of polluting a city's water supply.",
        "runtimeMinutes": "131"
    },
    "2000_130": {
        "plotSummary": "A deep space rescue and recovery spaceship with a crew of 6 receives a distress call from a mining operation 3432 light years away. A rescue operation via dimension jump is made. Bad idea.",
        "runtimeMinutes": "90"
    },
    "2000_131": {
        "plotSummary": "Amidst the war climate, a teenage boy discovering himself becomes love-stricken by Malèna, a sensual woman living in a small, narrow-minded Italian town.",
        "runtimeMinutes": "108"
    },
    "2000_132": {
        "plotSummary": "Kuki, a divorced Italian socialite, changes her life after a serious car crash. She accepts a marriage proposal from Paolo Gallmann, a man she doesn't know well, and she moves to Kenya with him and her young son to start a cattle ranch. ...See moreKuki, a divorced Italian socialite, changes her life after a serious car crash. She accepts a marriage proposal from Paolo Gallmann, a man she doesn't know well, and she moves to Kenya with him and her young son to start a cattle ranch. Challenges beset her, not the least of which is Paulo's love of danger and his leaving for days on end to hunt and fish with pals. She must face fierce storms, roving lions, venomous snakes, and murderous poachers, and she must find accommodation with a neighboring tribe. Her mother entreats her to return home. Can Kuki live her dream, tame Paolo, guide her son safely past the perils and errors of youth, and serve Africa?  Written by See less",
        "runtimeMinutes": "114"
    },
    "2000_133": {
        "plotSummary": "A human-looking alien from a highly advanced but emotionless all-male society is sent to Earth to impregnate a woman and bring the child back to their planet. The alien ends up falling in love there. A suspicious F.A.A. Agent targets him.",
        "runtimeMinutes": "105"
    },
    "2000_134": {
        "plotSummary": "The Saturday Night Live character gets a big screen treatment.",
        "runtimeMinutes": "84"
    },
    "2000_135": {
        "plotSummary": "Solarmax is a 40-minute giant-screen documentary that tells the story of humankind's struggle to understand the sun. The film will take audiences on an incredible voyage from pre-history to the leading edge of today's contemporary solar ...See moreSolarmax is a 40-minute giant-screen documentary that tells the story of humankind's struggle to understand the sun. The film will take audiences on an incredible voyage from pre-history to the leading edge of today's contemporary solar science.  Written by AnonymousSee less",
        "runtimeMinutes": "40"
    },
    "2000_136": {
        "plotSummary": "Four retired mobsters plan one last crime to save their retirement home.",
        "runtimeMinutes": "88"
    },
    "2000_137": {
        "plotSummary": "Two criminal drifters without sympathy get more than they bargained for after kidnapping and holding for ransom the surrogate mother of a powerful and shady man.",
        "runtimeMinutes": "119"
    },
    "2000_138": {
        "plotSummary": "Godzilla saves Tokyo from a flying saucer that transforms into the beast Orga.",
        "runtimeMinutes": "99"
    },
    "2000_139": {
        "plotSummary": "Two neighbors, a woman and a man, form a strong bond after both suspect extramarital activities of their spouses. However, they agree to keep their bond platonic so as not to commit similar wrongs.",
        "runtimeMinutes": "98"
    },
    "2000_14": {
        "plotSummary": "A man learns something extraordinary about himself after a devastating accident.",
        "runtimeMinutes": "106"
    },
    "2000_140": {
        "plotSummary": "Three college students base their class project around gossip and how fast it spreads, which soon spirals out of control.",
        "runtimeMinutes": "90"
    },
    "2000_141": {
        "plotSummary": "Two slacker wrestling fans are devastated by the ousting of their favorite character by an unscrupulous promoter.",
        "runtimeMinutes": "107"
    },
    "2000_142": {
        "plotSummary": "A young martial artist is caught between respecting his pacifist father's wishes or stopping a group of disrespectful foreigners from stealing precious artifacts.",
        "runtimeMinutes": "102"
    },
    "2000_143": {
        "plotSummary": "A single mother's life is thrown into turmoil after her struggling, rarely seen younger brother returns to town.",
        "runtimeMinutes": "111"
    },
    "2000_144": {
        "plotSummary": "The filming of Nosferatu is hampered by the fact that its star Max Schreck is taking the role of a vampire far more seriously than seems humanly possible.",
        "runtimeMinutes": "92"
    },
    "2000_145": {
        "plotSummary": "A television weatherman scams a local lottery.",
        "runtimeMinutes": "105"
    },
    "2000_146": {
        "plotSummary": "A rich college kid is taught a lesson after a joy ride ends up destroying a country restaurant.",
        "runtimeMinutes": "96"
    },
    "2000_147": {
        "plotSummary": "A film about the life and career of the American painter, Jackson Pollock.",
        "runtimeMinutes": "122"
    },
    "2000_148": {
        "plotSummary": "A cute med student starts a summer course at Heidelberg University. David's on her dissection table. She met him the day before on the train. Something's wrong.",
        "runtimeMinutes": "103"
    },
    "2000_149": {
        "plotSummary": "A group of male friends become obsessed with five mysterious sisters who are sheltered by their strict, religious parents in suburban Detroit in the mid 1970s.",
        "runtimeMinutes": "97"
    },
    "2000_15": {
        "plotSummary": "A retired master car thief must come back to the industry and steal fifty cars with his crew in one night to save his brother's life.",
        "runtimeMinutes": "118"
    },
    "2000_150": {
        "plotSummary": "Brazilian chef Isabella Oliveira moves to San Francisco when her husband, frustrated by her motion sickness, cheats on her.",
        "runtimeMinutes": "92"
    },
    "2000_151": {
        "plotSummary": "A modern-day remake of the Cyrano DeBergerac tale.",
        "runtimeMinutes": "94"
    },
    "2000_152": {
        "plotSummary": "Rob has 2 strikes and 3 strikes now means 25 to life. Leaving prison, he's picked up in a stolen car later stopped by the police. Can he prove his innocence before he's caught?",
        "runtimeMinutes": "82"
    },
    "2000_153": {
        "plotSummary": "After being forgotten in a highway cafe during a bus trip, a housewife decides to start a new life by herself in Venice.",
        "runtimeMinutes": "114"
    },
    "2000_154": {
        "plotSummary": "An African-American Mafia hit man who models himself after the samurai of old finds himself targeted for death by the mob.",
        "runtimeMinutes": "116"
    },
    "2000_155": {
        "plotSummary": "A movie crew invades a small town whose residents are all too ready to give up their values for showbiz glitz.",
        "runtimeMinutes": "105"
    },
    "2000_156": {
        "plotSummary": "The life of Cuban poet and novelist, Reinaldo Arenas.",
        "runtimeMinutes": "133"
    },
    "2000_157": {
        "plotSummary": "For Moncho, it's an idyllic year: he starts school, he has a wonderful teacher, he makes a friend in Roque, he begins to figure out some of the mysteries of Eros, and, with his older brother, a budding saxophone player, he makes a trip ...See moreFor Moncho, it's an idyllic year: he starts school, he has a wonderful teacher, he makes a friend in Roque, he begins to figure out some of the mysteries of Eros, and, with his older brother, a budding saxophone player, he makes a trip with the band from their town in Galicia. But it's also the year that the Spanish Republic comes under fire from Fascist rebels. Moncho's father is a Republican as is the aging teacher, Don Gregorio. As sides are drawn and power falls clearly to one side, the forces of fear, violence, and betrayal alter profoundly what should be the pleasure of coming of age.  Written by See less",
        "runtimeMinutes": "96"
    },
    "2000_158": {
        "plotSummary": "The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.",
        "runtimeMinutes": "102"
    },
    "2000_159": {
        "plotSummary": "Old bank robber Henry, paralyzed from a stroke, is moved from a prison hospital to a retirement home, where Carol is a nurse. She doesn't believe he's paralyzed and sees him as a way out of her boring life.",
        "runtimeMinutes": "89"
    },
    "2000_16": {
        "plotSummary": "When a cockerel apparently flies into a chicken farm, the chickens see him as an opportunity to escape their evil owners.",
        "runtimeMinutes": "84"
    },
    "2000_160": {
        "plotSummary": "A chauffeur kidnaps his rich boss's dog to hold it for ransom, but when she accidentally gets the dog back, she thinks that it's the chauffeur who's been kidnapped.",
        "runtimeMinutes": "81"
    },
    "2000_161": {
        "plotSummary": "In a small French colony, a drunken man kills someone. While a guillotine is being shipped in, he changes, becoming a good and popular man.",
        "runtimeMinutes": "112"
    },
    "2000_162": {
        "plotSummary": "An aspiring writer is hired as a croupier at a casino, where he realizes that his life as a croupier would make a great novel.",
        "runtimeMinutes": "94"
    },
    "2000_163": {
        "plotSummary": "A professional karaoke hustler reconnects with his daughter and a bored suburban businessman turns outlaw karaoke singer, among other plotlines.",
        "runtimeMinutes": "112"
    },
    "2000_164": {
        "plotSummary": "In June 1946, Stalin invites the Russian exiled from the 1917 Revolution to return home. When the ships comes ashore in Odessa, the passengers are divided in two groups and one of them is executed. Among the survivors are Dr. Aleksei ...See moreIn June 1946, Stalin invites the Russian exiled from the 1917 Revolution to return home. When the ships comes ashore in Odessa, the passengers are divided in two groups and one of them is executed. Among the survivors are Dr. Aleksei Golovin, his French wife Marie and their young son. Marie is accused to be a spy, her French passport is torn up and Aleksei accepts to move to Kyiv with his family to save her. They are sent to a room in a communal house and soon Marie befriends the super, an old woman who speaks French. But she is denounced and killed by the government agents. Marie feels guilty and brings her grandson Sasha Vasilyev, who will be evicted, to live in her room with her family. Marie wants to return to her family in France, but Aleksei explains that they are imprisoned in Russia. Marie tries a contact with the leftist French actress Gabrielle Develay to ask for help to leave the USSR. While Marie gets distant from her husband, she gets closer to Sacha, who is a great swimmer and the only chance to Marie contact her family.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "121"
    },
    "2000_165": {
        "plotSummary": "A group of white high school teens become involved with Harlem's black hip-hop crowd.",
        "runtimeMinutes": "98"
    },
    "2000_166": {
        "plotSummary": "A mentally disturbed young woman takes a job at a posh country club and falls in with a clique of wealthy college kids where she's taken under the wing of the clique's twisted leader, who harbors some dark secrets too terrifying to tell.",
        "runtimeMinutes": "105"
    },
    "2000_167": {
        "plotSummary": "A woman risks losing her chance of happiness with the only man she has ever loved.",
        "runtimeMinutes": "135"
    },
    "2000_168": {
        "plotSummary": "Three egotistical swingers, who think they're God's gift to women, end up having their friendships tested when all three of them pick up and start dating the same woman.",
        "runtimeMinutes": "82"
    },
    "2000_169": {
        "plotSummary": "While they're on vacation in the Southwest, Rae finds out her man Michael spent their house money on a classic car, so she dumps him, hitching a ride to Vegas for a flight home. A kid promptly steals Michael's car, leaving him at the Zip &...See moreWhile they're on vacation in the Southwest, Rae finds out her man Michael spent their house money on a classic car, so she dumps him, hitching a ride to Vegas for a flight home. A kid promptly steals Michael's car, leaving him at the Zip & Sip, a convenience store. Three bumbling robbers promptly stage a hold up. Two take off with the cash stranding the third, with a mysterious crate, just as the cops arrive. The robber takes the store hostage. As incompetent cops bring in a SWAT team and try a by-the-book rescue, Michael has to keep the robber calm, find out what's in the crate, aid the negotiations, and get back to Rae. The Stockholm Syndrome asserts its effect.  Written by See less",
        "runtimeMinutes": "89"
    },
    "2000_17": {
        "plotSummary": "A climber must rescue his sister on top of K2, one of the world's biggest mountains.",
        "runtimeMinutes": "124"
    },
    "2000_170": {
        "plotSummary": "Underachieving, overweight kindergarten teacher Dex finds a woman who forces him to reexamine his Zen-like system of seduction.",
        "runtimeMinutes": "87"
    },
    "2000_171": {
        "plotSummary": "A film about the battle between love and fear, between two stubborn men and their opposing beliefs and the outcome of the love stories of 3 couples.",
        "runtimeMinutes": "216"
    },
    "2000_172": {
        "plotSummary": "In early 1970s England, a Pakistani father finds the authority he has previously maintained challenged by his increasingly Anglicized children.",
        "runtimeMinutes": "96"
    },
    "2000_173": {
        "plotSummary": "Rio lawyer Pedro Paulo is recently separated from his travel agent wife Tania. His office has taken on an energetic new intern, Sharon. Pedro Paulo is working on a divorce case - his own father's... Mary Ann is an English language teacher ...See moreRio lawyer Pedro Paulo is recently separated from his travel agent wife Tania. His office has taken on an energetic new intern, Sharon. Pedro Paulo is working on a divorce case - his own father's... Mary Ann is an English language teacher living in Rio. Her friend Nadine has been having an Internet romance with Gary, a SoHo artist. Nadine decides to visit Gary in New York; she books her flight through Tania... Soccer star Acacio is going to play for a team in England. He has been taking private lessons with Mary Ann. Is he reading too much into the word \"private\"? Pedro Paulo catches a glimpse of Mary Ann and decides he should study English again... Acacio needs some legal help with his new contract. He goes to Pedro Paulo's office, but the only one in is Sharon...  Written by David CarlessSee less",
        "runtimeMinutes": "95"
    },
    "2000_174": {
        "plotSummary": "A widow finds choosing a new husband might not be her choice at all, as the actions of her various prospects confine her freedom.",
        "runtimeMinutes": "115"
    },
    "2000_175": {
        "plotSummary": "Two veteran salesmen dissect a sales pitch to a particular client, through their young protege.",
        "runtimeMinutes": "90"
    },
    "2000_176": {
        "plotSummary": "An ex-boxer, living with the knowledge that his fight career was cut short by a crooked manager, channels his bitter disappointment in a single-minded quest for boxing championships for his three sons. We see them in pee-wee Silver Glove ...See moreAn ex-boxer, living with the knowledge that his fight career was cut short by a crooked manager, channels his bitter disappointment in a single-minded quest for boxing championships for his three sons. We see them in pee-wee Silver Glove matches with dad constantly pushing them. Ten years later, they're young men, with dad as both father and manager. A professional promoter, Nick Everson, wants to sign the boys, but dad rejects those offers. Then, in expressions of their varied relationships with their father, each son makes his own decisions. Can dad ever step aside, and can the family hold together?  Written by See less",
        "runtimeMinutes": "118"
    },
    "2000_177": {
        "plotSummary": "An undercover DEA agent brings down the Mafia.",
        "runtimeMinutes": "101"
    },
    "2000_178": {
        "plotSummary": "Mona sacrifices everything, including family, in pursuit of a beauty pageant victory. Her friend Ruby helps her to an amazing degree.",
        "runtimeMinutes": "112"
    },
    "2000_179": {
        "plotSummary": "An unsuccessful over-the-top actress becomes a successful over-the-top author in this biography of Jacqueline Susann, the famed writer of \"Valley of the Dolls\" and other trashy novels. Facing a failing career, Susann (Bette Midler) meets a...See moreAn unsuccessful over-the-top actress becomes a successful over-the-top author in this biography of Jacqueline Susann, the famed writer of \"Valley of the Dolls\" and other trashy novels. Facing a failing career, Susann (Bette Midler) meets a successful promoter who becomes her husband. After several failures to place her in commercials and a television quiz show, he hits upon the idea for her to become a writer. In the early 1960s, her books were looked upon as trash and non-printable. But then the sexual revolution hit and an audience was born for her books. The story shows the hidden behind the scenes story of Susann's life, including her autistic son and her continuing bout with cancer that she hid up to her death.  Written by John Sacksteder See less",
        "runtimeMinutes": "95"
    },
    "2000_18": {
        "plotSummary": "Peaceful farmer Benjamin Martin is driven to lead the Colonial Militia during the American Revolution when a sadistic British officer murders his son.",
        "runtimeMinutes": "165"
    },
    "2000_180": {
        "plotSummary": "The story of Mohammed, a blind Iranian boy and his father, Hashem, who is always oscillating between accepting his son as he is and abandoning him, as he represents a burden for him, after the loss of his wife.",
        "runtimeMinutes": "90"
    },
    "2000_181": {
        "plotSummary": "Life as a Mormon missionary isn't what 19-year-old Brandon Allen expected: so many rules and so few successes. Los Angeles is as unrepentant as Sodom and Gomorrah. He's forced to share a small apartment with five young prank-loving ...See moreLife as a Mormon missionary isn't what 19-year-old Brandon Allen expected: so many rules and so few successes. Los Angeles is as unrepentant as Sodom and Gomorrah. He's forced to share a small apartment with five young prank-loving missionaries and, to top it off, his first companion, 29-year-old Marcus Dalton, proves to be a harsh mentor. After only one day as a missionary, Allen is ready to hang up his necktie and go home. His point-of-view changes, however, as he begins to see the struggles and sacrifices that the other missionaries endure: Dalton, he soon learns, is fighting a losing battle with cancer. Banks, an African-American missionary, was disowned by his family when he joined the Mormon church. Kinegar, a fifth-generation Latter-Day Saint, finds himself doubting under the intellectual attacks of anti-Mormons. Working and living with these young men, Allen becomes a part of the drama occurring under the everyday surface of missionary life. After only a few intense days, Allen finds faith he didn't know he had, and courage he didn't know he lacked. He learns that the time has come to put away childish things, and to become more than just a man--to become a man of God.  Written by AnonymousSee less",
        "runtimeMinutes": "108"
    },
    "2000_182": {
        "plotSummary": "A naive teenager is sent to rehab camp when her straitlaced parents and friends suspect her of being a lesbian.",
        "runtimeMinutes": "85"
    },
    "2000_183": {
        "plotSummary": "A frustrated African-American TV writer proposes a blackface minstrel show in protest, but to his chagrin it becomes a hit.",
        "runtimeMinutes": "135"
    },
    "2000_184": {
        "plotSummary": "A young wealthy businessman's icy attitude toward his working-class background is about to thaw as he is forced to reconnect with his elderly father and mentally challenged younger brother, who together run a public bathhouse.",
        "runtimeMinutes": "92"
    },
    "2000_185": {
        "plotSummary": "Against a background of holocaust memories, a liberal Jewish girl becomes a nanny to a young Jewish boy with a disability and grows fond of him.",
        "runtimeMinutes": "100"
    },
    "2000_186": {
        "plotSummary": "The owner of a seedy small-town Texas bar discovers that one of his employees is having an affair with his wife. A chaotic chain of misunderstandings, lies and mischief ensues after he devises a plot to have them murdered.",
        "runtimeMinutes": "99"
    },
    "2000_187": {
        "plotSummary": "Modern-day New York City adaptation of Shakespeare's immortal story about Hamlet's plight to avenge his father's murder.",
        "runtimeMinutes": "112"
    },
    "2000_188": {
        "plotSummary": "An insight into the turbulent lives and loves of a gay clique based in Los Angeles.",
        "runtimeMinutes": "94"
    },
    "2000_189": {
        "plotSummary": "An insane independent film director and his renegade group of teenage filmmakers kidnap an A-list Hollywood actress and force her to star in their underground film.",
        "runtimeMinutes": "87"
    },
    "2000_19": {
        "plotSummary": "A young Chinese warrior steals a sword from a famed swordsman and then escapes into a world of romantic adventure with a mysterious man in the frontier of the nation.",
        "runtimeMinutes": "120"
    },
    "2000_190": {
        "plotSummary": "The life and career of Hank Greenberg, the first major Jewish baseball star in the Major Leagues.",
        "runtimeMinutes": "90"
    },
    "2000_191": {
        "plotSummary": "An elderly watchmaker stops a beautiful young blonde from committing suicide by throwing herself off a bridge. They eventually marry, and things go well until a man from the woman's somewhat unsavory past shows up and attempts to blackmail...See moreAn elderly watchmaker stops a beautiful young blonde from committing suicide by throwing herself off a bridge. They eventually marry, and things go well until a man from the woman's somewhat unsavory past shows up and attempts to blackmail her.  Written by frankfob2@yahoo.comSee less",
        "runtimeMinutes": "76"
    },
    "2000_192": {
        "plotSummary": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
        "runtimeMinutes": "112"
    },
    "2000_193": {
        "plotSummary": "Diana, without her father knowing it, trains as a boxer and achieves impressive success, blazing new trails for female boxers.",
        "runtimeMinutes": "110"
    },
    "2000_194": {
        "plotSummary": "Over two \"typical\" days in the life of The Beatles, the boys struggle to keep themselves and Sir Paul McCartney's mischievous grandfather in check while preparing for a live television performance.",
        "runtimeMinutes": "87"
    },
    "2000_195": {
        "plotSummary": "Four families in LA of different ethnicity (Latino, Asian/Vietnamese, African and Jewish) gather together for Thanksgiving dinner.",
        "runtimeMinutes": "109"
    },
    "2000_196": {
        "plotSummary": "Four frames of simultaneous action that alternately follow a smitten lesbian lover as she obsesses over her partner's dalliances and the tense goings-on of a Hollywood film production company.",
        "runtimeMinutes": "97"
    },
    "2000_197": {
        "plotSummary": "Dwayne and his older sister Mai are adults: Mai is married to Vinh, Dwayne is about to propose to Nina. Twenty-two years ago, when Mai was 10, she and Dwayne were refugees in Vietnam, adopted by Harold and Dee Williams, African-Americans ...See moreDwayne and his older sister Mai are adults: Mai is married to Vinh, Dwayne is about to propose to Nina. Twenty-two years ago, when Mai was 10, she and Dwayne were refugees in Vietnam, adopted by Harold and Dee Williams, African-Americans from Los Angeles. Now, they remain close, especially Dwayne and his parents. Mai drops a bomb: she's located their birth mother, Thahn, and she's flying her to LA. Dee takes the news hard: she sees herself being replaced. Harold is more sanguine, and Dwayne pretends to be indifferent. When Thahn arrives, tensions reach the breaking point between Mai and Dee, between Nina and Dwayne, and even between Dee and Harold. Can we all get along?  Written by See less",
        "runtimeMinutes": "119"
    },
    "2000_198": {
        "plotSummary": "A young man turns from drug addiction and petty crime to a life redeemed by a discovery of compassion.",
        "runtimeMinutes": "107"
    },
    "2000_199": {
        "plotSummary": "A wealthy attorney in San Juan comes to the police station for \"10 min.\" of follow up questions to finding a 12-year old girl's body in a park. Another young girl was also raped and murdered weeks earlier and the evidence points to him.",
        "runtimeMinutes": "110"
    },
    "2000_2": {
        "plotSummary": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
        "runtimeMinutes": "155"
    },
    "2000_20": {
        "plotSummary": "An F.B.I. Agent must go undercover in the Miss United States beauty pageant to prevent a group from bombing the event.",
        "runtimeMinutes": "109"
    },
    "2000_200": {
        "plotSummary": "When Jack, a sign-language-speaking chimp, makes a break for freedom, his talent for ice skating soon turns him into the local hockey team's secret weapon. But the lab officials are closing in.",
        "runtimeMinutes": "93"
    },
    "2000_201": {
        "plotSummary": "Trying to bootstrap his way out of Brooklyn's mean streets is Diamond, a rap musician. With his long-time pal Gage acting as his manager, he's trying to lay down a demo tape with cut-rate studio time. To pay the bills, he and Gage run ...See moreTrying to bootstrap his way out of Brooklyn's mean streets is Diamond, a rap musician. With his long-time pal Gage acting as his manager, he's trying to lay down a demo tape with cut-rate studio time. To pay the bills, he and Gage run drugs for \"Mr. B.\" Inside a week, Diamond's beloved mother dies suddenly, his father appears after an absence of 12 years and wants a relationship, and his girlfriend Kia tells him she's pregnant, asking him if he's ready to be a father. Gage steals $100,000 in a multiple-felony robbery so that Diamond can record a full album, not knowing it's Mr. B's money he's taken. B wants his money, Diamond wants his music, Kia wants an answer.  Written by See less",
        "runtimeMinutes": "86"
    },
    "2000_202": {
        "plotSummary": "November, 1999, Margaret Cho is home in San Francisco at the Warfield Theater. Cho structures her monologue loosely on her professional life's trajectory: doing stand-up, cast in an ABC-TV sitcom, losing 30 pounds in two weeks for the part...See moreNovember, 1999, Margaret Cho is home in San Francisco at the Warfield Theater. Cho structures her monologue loosely on her professional life's trajectory: doing stand-up, cast in an ABC-TV sitcom, losing 30 pounds in two weeks for the part, the show's cancellation, a descent into booze, pills, and self-loathing, and a resurrection into her own voice, her own shape, and being the one she wants. Along the way we visit Karl Langerfeld in jail, a lesbian cruise ship, a TV Guide photo shoot, a hospital, bars, and her family's Polk Street bookshop. Takes on being a fag hag, speeding up felatio, casual daily racism, and her mother's phone messages highlight a scabrous, brilliant performance.  Written by See less",
        "runtimeMinutes": "96"
    },
    "2000_203": {
        "plotSummary": "If you ever wanted to know what really goes on backstage, this is the definitive inside look - uncut and uncensored. Complete with on-stage performances you'll see an intimate view of what life is like at one of the biggest Rap Concert ...See moreIf you ever wanted to know what really goes on backstage, this is the definitive inside look - uncut and uncensored. Complete with on-stage performances you'll see an intimate view of what life is like at one of the biggest Rap Concert tours of all time. It shows life on the road, in hotels and off stage in a way you've never seen before.  Written by Dimension FilmsSee less",
        "runtimeMinutes": "86"
    },
    "2000_204": {
        "plotSummary": "An oddly naive man-child stalks his childhood best friend and tries to reconnect with their past.",
        "runtimeMinutes": "96"
    },
    "2000_205": {
        "plotSummary": "An inside look into one night in the San Francisco underground rave scene.",
        "runtimeMinutes": "86"
    },
    "2000_206": {
        "plotSummary": "Jermaine, a young struggling Atlanta lawyer, decides to spruce up his marriage with Jasmine, who's mentally recovering from an abusive previous relationship, by hiring Jade, a bisexual stripper/prostitute fighting a custody battle with her...See moreJermaine, a young struggling Atlanta lawyer, decides to spruce up his marriage with Jasmine, who's mentally recovering from an abusive previous relationship, by hiring Jade, a bisexual stripper/prostitute fighting a custody battle with her ex-husband for their four-year-old son, for a threesome menage-a-trois get together only to have all three of them suffer the after-affects when Jermaine begins acting possessive towards Jasmine and Jade which leads to Jade (or someone) stalking him and disrupting his private and professional life.  Written by matt-282See less",
        "runtimeMinutes": "93"
    },
    "2000_207": {
        "plotSummary": "Each member of a middle-class Taipei family seeks to reconcile past and present relationships within their daily lives.",
        "runtimeMinutes": "173"
    },
    "2000_208": {
        "plotSummary": "While the soccer World Cup is being played in France, two young Tibetan refugees arrive at a monastery/boarding school in exile in India. Its atmosphere of serene contemplation is somewhat disrupted by soccer fever, the chief instigator ...See moreWhile the soccer World Cup is being played in France, two young Tibetan refugees arrive at a monastery/boarding school in exile in India. Its atmosphere of serene contemplation is somewhat disrupted by soccer fever, the chief instigator being a young student, the soccer enthusiast Orgyen. Prevented by various circumstances from seeing the Cup finals on television in a nearby village, Orgyen sets out to organize the rental of a TV set for the monastery. The enterprise becomes a test of solidarity, resourcefulness and friendship for the students, while the Lama, head of the monastery, contemplates the challenges of teaching the word of Buddha in a rapidly changing world.  Written by See less",
        "runtimeMinutes": "93"
    },
    "2000_209": {
        "plotSummary": "A series of urban legends take place around the life of a troubled man who is searching New York City for a mysterious stranger.",
        "runtimeMinutes": "103"
    },
    "2000_21": {
        "plotSummary": "A conservative judge is appointed by the President to spearhead America's escalating war against drugs, only to discover that his teenage daughter is a crack addict. Two DEA agents protect an informant. A jailed drug baron's wife attempts ...See moreA conservative judge is appointed by the President to spearhead America's escalating war against drugs, only to discover that his teenage daughter is a crack addict. Two DEA agents protect an informant. A jailed drug baron's wife attempts to carry on the family business.See less",
        "runtimeMinutes": "147"
    },
    "2000_210": {
        "plotSummary": "A documentary look, mostly through the eyes of Tammy Faye Bakker Messner, at her rise and fall as a popular televangelist with husband Jim Bakker. Traces their rise: her teen marriage to Jim; their children's TV show (she was a puppeteer ...See moreA documentary look, mostly through the eyes of Tammy Faye Bakker Messner, at her rise and fall as a popular televangelist with husband Jim Bakker. Traces their rise: her teen marriage to Jim; their children's TV show (she was a puppeteer and singer), success founding the 700 Club, co-founding the Trinity Broadcast Network, and starting PTL Network; her nondenominational version of Christianity reaching out to all; and, their building of Heritage USA, a theme park. Things fall apart as money woes mount for Heritage and for Jim, as Tammy takes pills, and as Jerry Falwell takes PTL. Jim goes to prison; she remarries, finds herself alone again, yet remains unsinkable.  Written by See less",
        "runtimeMinutes": "79"
    },
    "2000_211": {
        "plotSummary": "The lives of 6 people over 35 in Rouen, France, and their relationship to each other.",
        "runtimeMinutes": "112"
    },
    "2000_212": {
        "plotSummary": "A dreamer finds that his wife and friends are binding him to his mediocre existence.",
        "runtimeMinutes": "108"
    },
    "2000_213": {
        "plotSummary": "After scams at horse races and making lots of money, 3 young people split. 20 years later, one of them, a drunk, creates chaos with photos from back then.",
        "runtimeMinutes": "106"
    },
    "2000_214": {
        "plotSummary": "In 1943 Berlin, a Nazi officer's wife meets and starts a passionate affair with a Jewish woman.",
        "runtimeMinutes": "125"
    },
    "2000_215": {
        "plotSummary": "Leo is released from prison after serving time for car theft. His plan to go straight falls apart when he meets his corrupt uncle for a job and later an old friend working there. It culminates at the (railroad) yards.",
        "runtimeMinutes": "115"
    },
    "2000_216": {
        "plotSummary": "Realising a dishonest deal has been found out a diamond merchant commits suicide, leaving the gems in question for his wife. Knowing the business from the time before drink largely took over her life, she decides to sober up and sell them ...See moreRealising a dishonest deal has been found out a diamond merchant commits suicide, leaving the gems in question for his wife. Knowing the business from the time before drink largely took over her life, she decides to sober up and sell them herself. Though they attract much interest, no-one legitimate will touch them. As she tries to get her present life straight the lure of the stones means she may have to confront the past as well.  Written by Jeremy Perkins {J-26}See less",
        "runtimeMinutes": "117"
    },
    "2000_217": {
        "plotSummary": "It is May 1520 in the vast Aztec Empire one year after the Spanish Conqueror Hernán Cortes' arrival in Mexico. \"The Other Conquest\" opens with the infamous massacre of the Aztecs at the Great Temple of Tenochtitlan [what is now called ...See moreIt is May 1520 in the vast Aztec Empire one year after the Spanish Conqueror Hernán Cortes' arrival in Mexico. \"The Other Conquest\" opens with the infamous massacre of the Aztecs at the Great Temple of Tenochtitlan [what is now called Mexico City]. The sacred grounds are covered with the countless bodies of priests and nobility slaughtered by the Spanish Armies under Cortes' command. The lone Aztec survivor of the massacre is a young Indian scribe named Topiltzin [Damián Delgado]. Topiltzin, who is the illegitimate son of the Aztec Emperor Moctezuma, survives the onslaught by burying himself under a stack of bodies. As if awakening from a dream, the young man rises from among the dead to find his mother murdered, the Spanish in power and the dawn of a new era in his native land. A New World with new leaders, language, customs... and God. Representing the New Order is the Spanish Friar Diego [Jose Carlos Rodríguez]. His mission is to convert the \"savage\" natives into civilised Christians; to replace their human sacrifices and feathered deities with public Christenings and fealty to the Blessed Virgin Mary. With Topiltzin, Friar Diego faces his most difficult spiritual and personal challenge, for when Topiltzin is captured by Spanish troops and presented to Cortes [Iñaki Aierra], the Spanish Conqueror places Topiltzin's conversion under Friar Diego's care. Old world confronts the New as Topiltzin struggles to preserve his own beliefs, whilst Friar Diego attempts to impose his own. Moreover, all the while, the question remains: Who is converting whom?  Written by Dennis Davidson Associates (DDA)See less",
        "runtimeMinutes": "105"
    },
    "2000_218": {
        "plotSummary": "A prospector who sold his wife and infant daughter in exchange for a mining claim, tries desperately to win them back as he helps to build the Pacific Railroad with a group of pioneer friends.",
        "runtimeMinutes": "120"
    },
    "2000_219": {
        "plotSummary": "An aging chief's last stand, lessons for the new, and the education of a young chief-to-be played against harsh Nature in Nepal's Dolpo. When his son dies returning from Tibet's salt lakes, Tinle blames Karma, his son's friend, refuses to ...See moreAn aging chief's last stand, lessons for the new, and the education of a young chief-to-be played against harsh Nature in Nepal's Dolpo. When his son dies returning from Tibet's salt lakes, Tinle blames Karma, his son's friend, refuses to give Karma his blessing as the new chief, and organizes a rival caravan to take the salt to lower Nepal to trade for grain. He, a few old men, his son's widow, his grandson, and his second son, a monk, set out on the arduous journey. Fearing storms, Karma has led his caravan out of the village before the auspicious day ordained by the lamas. Tinle's group catches Karma's before the final pass; the two stubborn men lock wills with Tinle's grandson watching.  Written by See less",
        "runtimeMinutes": "108"
    },
    "2000_22": {
        "plotSummary": "When the leader of a team of scientists volunteers to be the test subject for their experiment in human invisibility, he slowly unravels and turns against them, with horrific consequences.",
        "runtimeMinutes": "112"
    },
    "2000_220": {
        "plotSummary": "The daughter of a kisaeng in Namwon falls in love with Lee, a noble's son. Her lover leaves to complete his studies in Seoul and Chunhyang awaits his return. Soon, a new magistrate, Byeon, appears in the region. Byeon is dertermined to ...See moreThe daughter of a kisaeng in Namwon falls in love with Lee, a noble's son. Her lover leaves to complete his studies in Seoul and Chunhyang awaits his return. Soon, a new magistrate, Byeon, appears in the region. Byeon is dertermined to have the beautiful Chunhyang for himself, but when she refuses him, Byeon has her locked in a cell and tortured  Written by AnonymousSee less",
        "runtimeMinutes": "120"
    },
    "2000_221": {
        "plotSummary": "Alex, a hit man, tries to get out of the family business, but his father won't let him do so. While seeking the help of a therapist, he meets a sexually charged 23-year-old woman with whom he falls in love.",
        "runtimeMinutes": "88"
    },
    "2000_222": {
        "plotSummary": "A gifted teenager dreaming of life beyond her small town becomes inspired when a 15-year-old girl from New York moves in next door.",
        "runtimeMinutes": "97"
    },
    "2000_223": {
        "plotSummary": "A documentary about the rise to fame of adult movie star Stacy Valentine. Starting out as an under-confident woman pushed into entering a Hustler Magazine contest by her domineering husband, Stacy quickly became more sure of herself after ...See moreA documentary about the rise to fame of adult movie star Stacy Valentine. Starting out as an under-confident woman pushed into entering a Hustler Magazine contest by her domineering husband, Stacy quickly became more sure of herself after winning the contest, dumping the husband, and embarking upon a remarkably successful career in the unconventional field of hardcore porn movies. Although having attained a fair measure of success, her life is still not without disappointements, as her past has made it difficult for her to drop her emotional barriers and share a completely trusting relationship with others.  Written by Jean-Marc Rocher See less",
        "runtimeMinutes": "82"
    },
    "2000_224": {
        "plotSummary": "A psychological romantic thriller where fantasy and reality become indistinguishable for a woman leading a double life in her dreams.",
        "runtimeMinutes": "105"
    },
    "2000_225": {
        "plotSummary": "Two sisters become victims of the patriarchal, ultra-orthodox society.",
        "runtimeMinutes": "110"
    },
    "2000_226": {
        "plotSummary": "Ten television drama films, each one based on one of the Ten Commandments.",
        "runtimeMinutes": "572"
    },
    "2000_227": {
        "plotSummary": "Francisco Goya (1746-1828), deaf and ill, lives the last years of his life in voluntary exile in Bordeaux, a Liberal protesting the oppressive rule of Ferdinand VII. He's living with his much younger wife Leocadia and their daughter ...See moreFrancisco Goya (1746-1828), deaf and ill, lives the last years of his life in voluntary exile in Bordeaux, a Liberal protesting the oppressive rule of Ferdinand VII. He's living with his much younger wife Leocadia and their daughter Rosario. He continues to paint at night, and in flashbacks stirred by conversations with his daughter, by awful headaches, and by the befuddlement of age, he relives key times in his life, particularly his relationship with the Duchess of Alba, his discovery of how he wanted to paint (insight provided by Velázquez's work), and his lifelong celebration of the imagination. Throughout, his reveries become tableaux of his paintings.  Written by See less",
        "runtimeMinutes": "100"
    },
    "2000_228": {
        "plotSummary": "After a one-night stand a couple is faced with the terrifying possibility of what they really want.",
        "runtimeMinutes": "95"
    },
    "2000_229": {
        "plotSummary": "A film about the career of the notorious punk rock band, the Sex Pistols.",
        "runtimeMinutes": "108"
    },
    "2000_23": {
        "plotSummary": "Cruella DeVil gets out of prison and goes after the puppies once more.",
        "runtimeMinutes": "100"
    },
    "2000_230": {
        "plotSummary": "In 1993 Fiza's brother Aman disappears during the riots in Mumbai. In 1999 Fiza is tired of waiting and goes looking for him.",
        "runtimeMinutes": "170"
    },
    "2000_231": {
        "plotSummary": "In a remote mountain village, the teacher must leave for a month, and the mayor can find only a 13-year old girl, Wei Minzhi, to substitute. The teacher leaves one stick of chalk for each day and promises her an extra 10 yuan if there's ...See moreIn a remote mountain village, the teacher must leave for a month, and the mayor can find only a 13-year old girl, Wei Minzhi, to substitute. The teacher leaves one stick of chalk for each day and promises her an extra 10 yuan if there's not one less student when he returns. Within days, poverty forces the class troublemaker, Zhang Huike, to leave for the city to work. Minzhi, possessed of a stubborn streak, determines to bring him back. She enlists the 26 remaining pupils in earning money for her trip. She hitches to Jiangjiakou City and begins her search. The boy, meanwhile, is there, lost and begging for food. Minzhi's stubbornness may be Huike and the village school's salvation.  Written by See less",
        "runtimeMinutes": "106"
    },
    "2000_232": {
        "plotSummary": "A young man who smuggles illegal weapons and people back and forth over the borders between India and Pakistan falls in love with a young woman whose family he helped.",
        "runtimeMinutes": "207"
    },
    "2000_233": {
        "plotSummary": "In order to seek justice for a man who exacts vengeance on a politician, who was responsible for his daughter's death, two rival reporters teams up to help him to prove his innocence.",
        "runtimeMinutes": "160"
    },
    "2000_234": {
        "plotSummary": "Young Iranian Kurdish siblings try to save the youngest of them, who is seriously ill.",
        "runtimeMinutes": "80"
    },
    "2000_235": {
        "plotSummary": "A struggling auto mechanic with a criminal past agrees to one last heist to pay off his debts.",
        "runtimeMinutes": "90"
    },
    "2000_236": {
        "plotSummary": "Kate's fired from a women's magazine for writing about BJs, based on own experience as requested. She gets a last chance - 2500 happy, perky words on finding/keeping that perfect man. She tells about her relationships.",
        "runtimeMinutes": "82"
    },
    "2000_237": {
        "plotSummary": "Kresten's dad dies and he returns to the farm on Lolland to take care of things incl. his retarded brother. He employs a hooker as maid. He loses wife and job due to lies. The maid's kid brother moves in and they're a family of 4.",
        "runtimeMinutes": "98"
    },
    "2000_238": {
        "plotSummary": "A young man starts an affair with a woman - his brother's friend. Their relations are being tested because of obscure secrets hidden in the past.",
        "runtimeMinutes": "124"
    },
    "2000_239": {
        "plotSummary": "Interconnected stories examine situations involving the five senses. Touch is represented by a massage therapist who is treating a woman, while her daughter accidentally loses the woman's pre-school daughter in the park. The older daughter...See moreInterconnected stories examine situations involving the five senses. Touch is represented by a massage therapist who is treating a woman, while her daughter accidentally loses the woman's pre-school daughter in the park. The older daughter meets a voyeur (vision), a professional house-cleaner has an acute sense of smell, a cake maker has lost her sense of taste, and an older man is losing his hearing.  Written by John Sacksteder See less",
        "runtimeMinutes": "106"
    },
    "2000_24": {
        "plotSummary": "In order to protect a beautiful woman and her son from a robber, a male FBI agent disguises himself as a large grandmother.",
        "runtimeMinutes": "99"
    },
    "2000_240": {
        "plotSummary": "In 1920s Ireland, an elderly couple reside over a tired country estate. Living with them are their high-spirited niece, their Oxford student nephew, and married house guests, who are trying to cover up that they are presently homeless. The...See moreIn 1920s Ireland, an elderly couple reside over a tired country estate. Living with them are their high-spirited niece, their Oxford student nephew, and married house guests, who are trying to cover up that they are presently homeless. The niece enjoys romantic frolics with a soldier and a hidden guerrilla fighter. All of the principals are thrown into turmoil when one more guest arrives with considerable wit and unwanted advice.  Written by John Sacksteder See less",
        "runtimeMinutes": "103"
    },
    "2000_241": {
        "plotSummary": "Around 1940, The New Yorker staff writer Joe Mitchell meets Joe Gould, a Greenwich Village character, who is writing a voluminous Oral History of the World, a record of twenty thousand conversations he's overheard.",
        "runtimeMinutes": "104"
    },
    "2000_242": {
        "plotSummary": "Employees of a beauty parlor in search of love and happiness.",
        "runtimeMinutes": "105"
    },
    "2000_243": {
        "plotSummary": "Four men plan a technically perfect crime, but the human element intervenes...",
        "runtimeMinutes": "118"
    },
    "2000_244": {
        "plotSummary": "Two young women, marginalised by society, go on a destructive tour of sex and violence. Breaking norms and killing men - and shattering the complacency of polite cinema audiences.",
        "runtimeMinutes": "77"
    },
    "2000_245": {
        "plotSummary": "Shah Rukh Khan and Sharad Kapoor are the leaders of the two rival gangs. Aishwarya Rai is Shah Rukh Khan's twin sister. Shah Rukh is in love with Priya Gill. Chandrachur Singh is Sharad Kapoor's younger brother who studies in a catering ...See moreShah Rukh Khan and Sharad Kapoor are the leaders of the two rival gangs. Aishwarya Rai is Shah Rukh Khan's twin sister. Shah Rukh is in love with Priya Gill. Chandrachur Singh is Sharad Kapoor's younger brother who studies in a catering college in Bombay. He comes to Goa to visit his brother and plans to go back and start a restaurant there. He sees Aishwarya and falls in love with her. Chandrachur gives up the idea of going back to Bombay and opens a bakery in Goa. When Shah Rukh comes to know about the romance between Aishwarya and Chandrachur, the fight between the gang turns more violent. How the conflict is resolved is the rest of the story.  Written by gavin@sunny_deol2009@yahoo.comSee less",
        "runtimeMinutes": "162"
    },
    "2000_246": {
        "plotSummary": "Following the death of a mother, a father and son open up a brothel in their Genevan estate after watching 8½.",
        "runtimeMinutes": "118"
    },
    "2000_247": {
        "plotSummary": "There's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; Debbie, a single mom, entertains men at the hair ...See moreThere's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; Debbie, a single mom, entertains men at the hair salon after hours; her son spends part of the weekend with her ex, a man with a hair-trigger temper. Molly is expecting her first baby and the child's father acts as if the responsibility is too much for him. Eileen is bitter, complaining about her husband and the dog next door; Bill's a doormat. His West Indian neighbor offers him a drink; her own grown son locks himself in his room most of the time. Will anyone connect during this Guy Fawkes weekend?  Written by See less",
        "runtimeMinutes": "108"
    },
    "2000_248": {
        "plotSummary": "Raj is a struggling singer with big dreams who is still waiting for his big break. One night he witnesses an accident where a car spins out of control and lands on the tracks of an on-coming train. Raj runs over to the wreckage and rescues...See moreRaj is a struggling singer with big dreams who is still waiting for his big break. One night he witnesses an accident where a car spins out of control and lands on the tracks of an on-coming train. Raj runs over to the wreckage and rescues the occupant just in time. He takes her to the hospital and the girl's family are informed. The girl, Pooja Oberoi, survives but is in a vigil coma, a condition whereby she can hear and see everything but cannot speak nor move any part of her body. The Oberoi family is grateful to Raj and are led to believe that he is Pooja's groom, Romi. Raj is reluctant to accept this but then he changes his mind and accepts being the groom, as he has an agenda of his own and takes advantage of this accident to further his goals. But then he meets Pooja's best friend Jahnvi and falls in love with her. The situation is complicated even more when Pooja wakes up from the coma and begins to show feelings for Raj.  Written by SoumitraSee less",
        "runtimeMinutes": "173"
    },
    "2000_249": {
        "plotSummary": "The story of the film is of Siddhant Rai, who is a wealthy businessman looking for teacher for his three young children. They enjoys a lavish and a luxurious life. He hires Anna as governess for his children. Shekhar is a conman who is ...See moreThe story of the film is of Siddhant Rai, who is a wealthy businessman looking for teacher for his three young children. They enjoys a lavish and a luxurious life. He hires Anna as governess for his children. Shekhar is a conman who is trying to impress Anna with fake stories. Anna falls in love with Shekhar. When she finds out the truth of Shekhar, she becomes angry and leaves him. The life turns upside down when Siddhant Rai dies in an accident and his children are left alone. His relatives try to capture Siddhant Rai's property, then suddenly Shekhar appears again posing as their parental uncle, to save Siddhant's children from going to orphanage. Anna returns home to find Shekhar posing as Raju. Shekhar convinces her and they once again start loving each other. Drama further gets complex when another man who claims to be the real Raju Chacha and brother of Siddhant Rai appears.  Written by Abhishek KumarSee less",
        "runtimeMinutes": "163"
    },
    "2000_25": {
        "plotSummary": "Emperor Kuzco is turned into a llama by his ex-administrator Yzma, and must now regain his throne with the help of Pacha, the gentle llama herder.",
        "runtimeMinutes": "78"
    },
    "2000_250": {
        "plotSummary": "An interracial couple is attacked and the woman is gang-raped in a random attack. This prompts the woman to commit suicide and the man decides to seek revenge from the inside by joining the gang. However, once inside he learns of the ...See moreAn interracial couple is attacked and the woman is gang-raped in a random attack. This prompts the woman to commit suicide and the man decides to seek revenge from the inside by joining the gang. However, once inside he learns of the reasons (poverty, social rejection) for their existence and starts developing a kinship until he is asked to kill someone to prove his loyalty.  Written by John Sacksteder See less",
        "runtimeMinutes": "97"
    },
    "2000_251": {
        "plotSummary": "A woman puts an ad in a magazine looking for a man to fulfill her fantasy of a stringless, anonymous pornographic affair.",
        "runtimeMinutes": "80"
    },
    "2000_252": {
        "plotSummary": "Inspired by the Telugu film, \"Pelli Chuskundam,\" the plot follows the life of a rape victim (Aishwarya Rai). Now, a disgrace to her family, she is turned away from her house after the sexual assault. But she finds shelter in the character ...See moreInspired by the Telugu film, \"Pelli Chuskundam,\" the plot follows the life of a rape victim (Aishwarya Rai). Now, a disgrace to her family, she is turned away from her house after the sexual assault. But she finds shelter in the character played by Anil Kapoor.  Written by Gonz30See less",
        "runtimeMinutes": "165"
    },
    "2000_253": {
        "plotSummary": "Bittersweet Motel is a documentary about the popular rock band Phish. The film focuses on Phish's music, with little emphasis on their die-hard fan base.",
        "runtimeMinutes": "82"
    },
    "2000_254": {
        "plotSummary": "A married amnesiac returns to the town where he used to live and discovers that his life is not as he has been told, but uncovering the truth of his past may get him killed.",
        "runtimeMinutes": "93"
    },
    "2000_255": {
        "plotSummary": "After an unpleasant run-in with a group of bikers, a young convenience store robber (Marc) gets approached by the same bikers to help out with a picnic. After the picnic, seeing he has guts, the bikers propose him for membership. As the ...See moreAfter an unpleasant run-in with a group of bikers, a young convenience store robber (Marc) gets approached by the same bikers to help out with a picnic. After the picnic, seeing he has guts, the bikers propose him for membership. As the story unfolds, Marc winds up questioning his own morality and wondering whether he's going down the wrong path. The biggest problem, however, is that one of his friends got him into trouble, and he has little time to fix it...  Written by AnonymousSee less",
        "runtimeMinutes": "130"
    },
    "2000_256": {
        "plotSummary": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
        "runtimeMinutes": "76"
    },
    "2000_257": {
        "plotSummary": "Pamela Drury is unhappy and alone. On her birthday she stumbles across a photo of Robert Dickson and wonders what would've happened had she said yes to his proposal. A freak accident causes Pamela to live out the life she could've had, but...See morePamela Drury is unhappy and alone. On her birthday she stumbles across a photo of Robert Dickson and wonders what would've happened had she said yes to his proposal. A freak accident causes Pamela to live out the life she could've had, but is the grass on the other side always greener?  Written by Liam Smith See less",
        "runtimeMinutes": "104"
    },
    "2000_258": {
        "plotSummary": "On a visit to scenic Agra, Pooja meets with a reknown artist, Kabir. Kabir is instantly attracted to Pooja, and thinks that Pooja is also attracted to him. But Pooja is only attracted by his talent. On her return, she meets with her boss ...See moreOn a visit to scenic Agra, Pooja meets with a reknown artist, Kabir. Kabir is instantly attracted to Pooja, and thinks that Pooja is also attracted to him. But Pooja is only attracted by his talent. On her return, she meets with her boss Mr. Oberoi and his son, Raj Oberoi, and she instantly falls in love with Raj. Mr. Oberoi is unhappy with Pooja coming in late to work frequently, and wants to terminate her employment. A fellow employee, Maggi comes to rescue of Pooja, and tells Mr. Oberoi that Pooja has been engaged to Kabir, and shows some photographs that were taken during Pooja's visit to Agra. Pooja reluctantly goes along with this charade in order to keep her job. Kabir is encouraged to know that Pooja has announced her engagement with him. How is she going to convince Mr. Oberoi and Raj that she really loves his son, Raj?  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "143"
    },
    "2000_259": {
        "plotSummary": "In Medieval Japan, an elderly warlord retires, handing over his empire to his three sons. However, he vastly underestimates how the new-found power will corrupt them and cause them to turn on each other...and him.",
        "runtimeMinutes": "162"
    },
    "2000_26": {
        "plotSummary": "Scientist Sherman Klump's inventions, his upcoming marriage to his pretty colleague Denise Gaines and his reputation are threatened by his evil clone Buddy Love.",
        "runtimeMinutes": "106"
    },
    "2000_260": {
        "plotSummary": "A cinematic portrait of the homeless population who live permanently in the underground tunnels of New York City.",
        "runtimeMinutes": "82"
    },
    "2000_261": {
        "plotSummary": "Setting in a small mountain town, a man, looking for revenge because of his daughter's accidentally killing, mistakenly track out a young couple, troubling with their ordinary life problems.",
        "runtimeMinutes": "122"
    },
    "2000_262": {
        "plotSummary": "A notorious terrorist manipulates an Indian army major's jilted lover into helping him obtain a classified military code.",
        "runtimeMinutes": "176"
    },
    "2000_263": {
        "plotSummary": "The history of the American government's war on marijuana in the 20th century.",
        "runtimeMinutes": "80"
    },
    "2000_264": {
        "plotSummary": "An update of the classic Shakespeare story, director Kenneth Branagh shot the film like a classic 1930s musical. It tells the story of four best friends who swear off love.",
        "runtimeMinutes": "93"
    },
    "2000_265": {
        "plotSummary": "A British family is trapped between culture, tradition, and the colonial sins of the past.",
        "runtimeMinutes": "124"
    },
    "2000_266": {
        "plotSummary": "An eccentric, unconventional woman whose naive aspirations to rise from her job as a security guard to full-fledged private eye lead her into a tangled PL: mess.",
        "runtimeMinutes": "116"
    },
    "2000_267": {
        "plotSummary": "Four professional women meet at an East Los Angeles restaurant called Luminarias to share secrets about their careers, love, family, and sex.",
        "runtimeMinutes": "100"
    },
    "2000_268": {
        "plotSummary": "Street pimps, all of them African-American, discuss their lives and work: getting started, being flamboyant, pimping in various U.S. cities, bringing a woman into their group, taking a woman from another pimp, and the rules and regulations...See moreStreet pimps, all of them African-American, discuss their lives and work: getting started, being flamboyant, pimping in various U.S. cities, bringing a woman into their group, taking a woman from another pimp, and the rules and regulations of pimping. The men are clear: it's about money. The women work every night, hustle hard, turn over all their earnings, and steal anything they can from clients. We meet a few of the women, who tell us what they want from a pimp. We also listen to a women who's legally employed at a Nevada brothel; we meet her White boss, a legal pimp. He and the street pimps, some of whom are now retired, make the case for legalizing the trade.  Written by See less",
        "runtimeMinutes": "87"
    },
    "2000_269": {
        "plotSummary": "A group of children, in a depressed small town, band together to cover up a tragic mistake one summer.",
        "runtimeMinutes": "89"
    },
    "2000_27": {
        "plotSummary": "While Sidney and her friends visit the Hollywood set of Stab 3, the third film based on the Woodsboro murders, another Ghostface killer rises to terrorize them.",
        "runtimeMinutes": "116"
    },
    "2000_270": {
        "plotSummary": "Two brothers share a house in the Fairfax district of LA: Tony a feckless actor, Chris an accountant. Both have relationships on rocky ground. As these emotions swirl, Tony meets his letter carrier, a single-mom named Kathy who's come to ...See moreTwo brothers share a house in the Fairfax district of LA: Tony a feckless actor, Chris an accountant. Both have relationships on rocky ground. As these emotions swirl, Tony meets his letter carrier, a single-mom named Kathy who's come to LA from Wyoming with her daughter, a budding actress. Chris meets Anna, an Italian beauty working in the States, for a few months, wrangling animals on movie sets. Chris also befriends Clive, an aging, crusty man whose longing for his recently-deceased wife is a portrait of true love. Can Clive's example help Chris sort out his love life, and can Tony grow up enough to see the possibilities with Kathy and her daughter?  Written by See less",
        "runtimeMinutes": "90"
    },
    "2000_271": {
        "plotSummary": "While waiting for her husband to recover in a hospital, a mother stays with her estranged daughter, Maria, who fled her parents rural home in Andalusia because she could no longer bear her father's abusiveness and her mother's passivity.",
        "runtimeMinutes": "101"
    },
    "2000_272": {
        "plotSummary": "Saketh Ram's wife is raped and killed during direct action day riots in Calcutta. He is convinced that Mahatma Gandhi is responsible for all the problems happening in the country and sets out to kill him.",
        "runtimeMinutes": "186"
    },
    "2000_273": {
        "plotSummary": "A group of young actors stay overnight in their host's castle only to be hunted by a serial killer.",
        "runtimeMinutes": "90"
    },
    "2000_274": {
        "plotSummary": "A congressional candidate questions his sanity after seeing the love of his life, presumed dead, suddenly emerge.",
        "runtimeMinutes": "105"
    },
    "2000_275": {
        "plotSummary": "Spoof of 1960s Beach Party/Gidget surfing movies mixed with slasher horror films. Florence Forrest, a not-so-innocent girl in 1960s Malibu, becomes \"Chicklet\", the first girl surfer at Malibu Beach. Only Florence suffers from dissociative ...See moreSpoof of 1960s Beach Party/Gidget surfing movies mixed with slasher horror films. Florence Forrest, a not-so-innocent girl in 1960s Malibu, becomes \"Chicklet\", the first girl surfer at Malibu Beach. Only Florence suffers from dissociative identity disorder and, occasionally, her alter ego \"Ann Bowman\", a sexually aggressive, foul-speaking girl, comes out, during which time several beach goers are found murdered. The suspects include Chicklet herself, surfer Kanaka, exchange student Lars, and even Chicklet's own mother.  Written by Matthew PataySee less",
        "runtimeMinutes": "95"
    },
    "2000_276": {
        "plotSummary": "In London, during October 1993, England is playing Holland in the preliminaries of the World Cup. The Bosnian War is at its height, and refugees from the ex-Yugoslavia are arriving. Football rivals, and political adversaries from the ...See moreIn London, during October 1993, England is playing Holland in the preliminaries of the World Cup. The Bosnian War is at its height, and refugees from the ex-Yugoslavia are arriving. Football rivals, and political adversaries from the Balkans all precipitate conflict and amusing situations. Meanwhile, the lives of four English families are affected in different ways by encounter with the refugees; one of the families improbably becomes involved with a Balkan refugee through the England vs. Holland match.  Written by Guy33134See less",
        "runtimeMinutes": "107"
    },
    "2000_277": {
        "plotSummary": "Irreverent city engineer Behzad comes to a rural village in Iran to keep vigil for a dying relative. In the meanwhile the film follows his efforts to fit in with the local community and how he changes his own attitudes as a result. Read more: Synopsis",
        "runtimeMinutes": "118"
    },
    "2000_278": {
        "plotSummary": "After plunging her car into a river, a woman encounters a man who helps her come to terms with her life.",
        "runtimeMinutes": "87"
    },
    "2000_279": {
        "plotSummary": "A lush, elegant epic taking us on a time-swirling trip down the infinitely complex labyrinth that is Marcel Proust's memory lane.",
        "runtimeMinutes": "169"
    },
    "2000_28": {
        "plotSummary": "A woman and her daughter open a chocolate shop in a small French village that shakes up the rigid morality of the community.",
        "runtimeMinutes": "121"
    },
    "2000_280": {
        "plotSummary": "Spinal Tap, one of England's loudest bands, is chronicled by film director Marty DiBergi on what proves to be a fateful tour.",
        "runtimeMinutes": "82"
    },
    "2000_281": {
        "plotSummary": "When St. Jude appears to her to tell her that her daughter is still alive, Esperanza goes on a search to find her daughter. Read more: Synopsis",
        "runtimeMinutes": "105"
    },
    "2000_282": {
        "plotSummary": "Christmas, family, and infidelity. Yvette's husband has died, and her grown daughters join her at the grave: Sonia, wealthy, bourgeois, and generous; Louba, living with their dad Stanislas, singing at a Russian restaurant, penniless, the ...See moreChristmas, family, and infidelity. Yvette's husband has died, and her grown daughters join her at the grave: Sonia, wealthy, bourgeois, and generous; Louba, living with their dad Stanislas, singing at a Russian restaurant, penniless, the mistress for the past 12 years of a man who will never leave his wife; Milla, the youngest, acerbic, lonesome. Christmas was when they learned their parents were divorcing 25 years ago. Over the next few days, yuletide depression, Louba's pregnancy, Sonia's crumbling marriage, Stanislas's overtures to Yvette, and Milla's attraction to the man who's her father's rent-free lodger lead each one to re-examine self, family, and hopes. Is renewal possible?  Written by See less",
        "runtimeMinutes": "106"
    },
    "2000_283": {
        "plotSummary": "With the help of her mother, family, friends, and fellow musicians, Aiyana Elliott reaches for her father, legendary cowboy troubadour, Ramblin' Jack Elliott. She explores who he is and how he got there, working back and forth between ...See moreWith the help of her mother, family, friends, and fellow musicians, Aiyana Elliott reaches for her father, legendary cowboy troubadour, Ramblin' Jack Elliott. She explores who he is and how he got there, working back and forth between archival and contemporary footage. Born in 1932 in Brooklyn, busking through the South and West in the early 50s, a year with Woody Guthrie, six years flatpicking in Europe, a triumphant return to Greenwich Village in the early 60s, mentoring Bob Dylan, then life on the road, from gig to gig, singing and telling stories. A Grammy and the National Medal of Arts await Jack near the end of a long trail. What will Aiyana find for herself?  Written by See less",
        "runtimeMinutes": "112"
    },
    "2000_284": {
        "plotSummary": "When a village belle's brother is killed by a bandit, she vows revenge and enlists the help of two truckers-cum-theatre artists in her mission.",
        "runtimeMinutes": "172"
    },
    "2000_285": {
        "plotSummary": "An naïve young lad navigates the dirty squalid streets of 1973 Glasgow, and the poor youth around him.",
        "runtimeMinutes": "94"
    },
    "2000_286": {
        "plotSummary": "Jason Gould satirizes coming out in Hollywood in \"Inside Out\", starring Alexis Arquette and his father Elliott Gould. Lane Janger's \"Just One Time\" was a festival favorite later expanded into a feature film that turns the tables on a ...See moreJason Gould satirizes coming out in Hollywood in \"Inside Out\", starring Alexis Arquette and his father Elliott Gould. Lane Janger's \"Just One Time\" was a festival favorite later expanded into a feature film that turns the tables on a groom-to-be and his fantasies of sex with two women. Bradley Rust Gray's \"hITCH\" follows two attractive young guys on a dizzying road trip that leads them toward sexual self-discovery. David Fourier's \"Majorettes in Space\" is a witty French spoof of post-modern sex, romance, relationships, the Pope and baton-twirling majorettes. Gregory Cooke's \"$30\" is the bittersweet story of a closeted teen presented with a young prostitute on his 16th birthday.  Written by Strand See less",
        "runtimeMinutes": "79"
    },
    "2000_287": {
        "plotSummary": "A 10 year old gifted boy wants to be a jazz pianist much to the chagrin of his more classical oriented piano instructor. With his mother's help, he is an underage regular at a local nightspot, where he is teamed up with a sax superstar. ...See moreA 10 year old gifted boy wants to be a jazz pianist much to the chagrin of his more classical oriented piano instructor. With his mother's help, he is an underage regular at a local nightspot, where he is teamed up with a sax superstar. Both come to learn that each suffers from Tourette's Syndrome (thus the film title). The older man has developed mannerisms to cover up his own fallibilities and resents the boy and his mother's acceptance of the disease.  Written by John Sacksteder See less",
        "runtimeMinutes": "91"
    },
    "2000_288": {
        "plotSummary": "A noble family presides over a small town in India.",
        "runtimeMinutes": "175"
    },
    "2000_289": {
        "plotSummary": "A young, naive boy sets out alone on the road to find his wayward mother. Soon he finds an unlikely protector in a crotchety man and the two have a series of unexpected adventures along the way.",
        "runtimeMinutes": "122"
    },
    "2000_29": {
        "plotSummary": "A nice-guy cop with Dissociative Identity Disorder must protect a woman on the run from a corrupt ex-boyfriend and his associates.",
        "runtimeMinutes": "116"
    },
    "2000_290": {
        "plotSummary": "Vicky, a businessman, loves his younger brother Prem, who spends his time chasing women. The family feels that secretary Sapna will make a good wife for Vicky, but she is already in love with Prem.",
        "runtimeMinutes": "136"
    },
    "2000_291": {
        "plotSummary": "A film featuring performances of several stars of the Latin Jazz music scene.",
        "runtimeMinutes": "105"
    },
    "2000_292": {
        "plotSummary": "Flamboyant Glasgow hairdresser, Crawford Mackinzie, gets a letter from the World Hairdresser International Federation inviting him to its prestigious annual contest in L.A. Filmmaker Martin Samuels is making a fly-on-the-wall documentary ...See moreFlamboyant Glasgow hairdresser, Crawford Mackinzie, gets a letter from the World Hairdresser International Federation inviting him to its prestigious annual contest in L.A. Filmmaker Martin Samuels is making a fly-on-the-wall documentary about Crawford; he and the crew go too. After maxing out his credit card at the Century Plaza Hotel, Crawford discovers he's been invited to participate in the audience, not the contest; he tries every angle imaginable to get in the competition: he phones fellow Scot Sean Connery, he gets a union card, he asks the reigning champion for help, and he connects with Connery's publicist, who's having a bad hair day. Will he succeed, for the little people?  Written by See less",
        "runtimeMinutes": "86"
    },
    "2000_293": {
        "plotSummary": "Vatel is the cook of Prince Conde. When the prince invites Louis XIV to hunt, he has to give lavish banquets in order to fall in his favor. But when Vatel falls in love with the king's mistress, love and duty come into conflict.",
        "runtimeMinutes": "103"
    },
    "2000_294": {
        "plotSummary": "Robert is an art photographer who is totally controlled by his wife Hallie. When they go on vacation in New York, they leave their house to their friends, Zack and Sophie. When they return, they find their house a total mess, but Zack and ...See moreRobert is an art photographer who is totally controlled by his wife Hallie. When they go on vacation in New York, they leave their house to their friends, Zack and Sophie. When they return, they find their house a total mess, but Zack and Sophie ask to stay a little longer, and they agree.  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "2000_295": {
        "plotSummary": "Irish lads send an ad to the Miami Herald inviting fit and enticing women, between the ages of 20 and 21, to live in their isolated Donegal village. The whole town knows about the ad, and it sharpens everyone's sense of the opportunities ...See moreIrish lads send an ad to the Miami Herald inviting fit and enticing women, between the ages of 20 and 21, to live in their isolated Donegal village. The whole town knows about the ad, and it sharpens everyone's sense of the opportunities for happiness already at hand. Kate, a publican with a young daughter, is separating from her husband and catches the eye of a bachelor sheep farmer. Kieran the butcher realizes that his assistant Siobhan is comely, and then he discovers she's fiery as well. Ollie sends off for Dutch skin magazines that the village postmistress won't release to him. The men, and women, find counsel in their movie-loving priest. Will anyone answer the ad?  Written by See less",
        "runtimeMinutes": "93"
    },
    "2000_296": {
        "plotSummary": "Estranged twin brothers - one a con man, the other an Episcopal deacon - accidentally switch places... and find God in the process.",
        "runtimeMinutes": "106"
    },
    "2000_297": {
        "plotSummary": "Debbie, a secretary and Howard, a script writer are celebrating their wedding anniversary at home. Or so she thought. A special night together turns into a nightmare when Howard lets a man, Silk into the house to use the phone. Besides the...See moreDebbie, a secretary and Howard, a script writer are celebrating their wedding anniversary at home. Or so she thought. A special night together turns into a nightmare when Howard lets a man, Silk into the house to use the phone. Besides the car trouble that brought him to the door, he also brings along a string of frightening murders. Debbie then finds out that her husband and best friend, Tammy set a hit on her, just to earn a lot of money. But all of that backfires on everyone, especially Debbie, who gets shot by her own husband and dies, but still gets revenge on him after her demise.  Written by AnonymousSee less",
        "runtimeMinutes": "116"
    },
    "2000_298": {
        "plotSummary": "",
        "runtimeMinutes": "99"
    },
    "2000_299": {
        "plotSummary": "When a young boy is captured by a grizzly bear, he begins the most incredible journey of a lifetime, full of breathtaking excitement, harrowing danger and thrilling surprises.",
        "runtimeMinutes": "94"
    },
    "2000_3": {
        "plotSummary": "A FedEx executive undergoes a physical and emotional transformation after crash landing on a deserted island.",
        "runtimeMinutes": "143"
    },
    "2000_30": {
        "plotSummary": "Vicenarian Richard travels to Thailand and finds himself in possession of a strange map. Rumours state that it leads to a solitary beach paradise, a tropical bliss. Excited and intrigued, he sets out to find it.",
        "runtimeMinutes": "119"
    },
    "2000_300": {
        "plotSummary": "A tragic love story between a Jewish young man and a Welsh woman in the beginning of the century. The movie is mostly in English with parts in Welsh and Yiddish",
        "runtimeMinutes": "105"
    },
    "2000_301": {
        "plotSummary": "The Palestinian terrorist group Black September holds Israeli athletes hostage at the 1972 Summer Olympic Games in Munich.",
        "runtimeMinutes": "94"
    },
    "2000_302": {
        "plotSummary": "A young female terrorist goes on a suicide assassination mission, but her resolve to complete it is put to the test.",
        "runtimeMinutes": "95"
    },
    "2000_303": {
        "plotSummary": "The President of the United States must deal with an international military crisis while confined to a Colorado diner during a freak snowstorm",
        "runtimeMinutes": "104"
    },
    "2000_304": {
        "plotSummary": "The story takes place in 1999, the Year of Destiny, and the beginning of the end of the world. The future of the universe rests on one young man, Kamui Shiro, who must destroy either the Dragons of Earth or the Dragons of Heaven - two ...See moreThe story takes place in 1999, the Year of Destiny, and the beginning of the end of the world. The future of the universe rests on one young man, Kamui Shiro, who must destroy either the Dragons of Earth or the Dragons of Heaven - two opposing armies. He alone must decide whether humanity should be destroyed to create a purified universe, or whether it should be protected to preserve civilization. Two oracles, the sisters Hinoto and Kanoe foresee the coming of the Dragons and predict opposite outcomes. Each sister gathers strength and ammunition to insure her own vision for the future. However, neither sister realizes that there is one man who has an even greater power than the Dragons, and that ultimately he will determine the fate of the earth. Which sister will prevail and how does Kamui fit into their struggle? The answer to this question will forever affect humanity.  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "2000_305": {
        "plotSummary": "A group of recruits go through Advanced Infantry Training at Fort Polk, Louisiana's infamous Tigerland, last stop before Vietnam for tens of thousands of young men in 1971.",
        "runtimeMinutes": "101"
    },
    "2000_306": {
        "plotSummary": "The tale of the extraordinary life and times of Lucky, a horse that was born in captivity but achieves his dream of running free with the help of a stableboy.",
        "runtimeMinutes": "81"
    },
    "2000_307": {
        "plotSummary": "An ex convict befriends an elderly coworker as they both try to find meaning in life and forgiveness for their past.",
        "runtimeMinutes": "110"
    },
    "2000_308": {
        "plotSummary": "If you could make your deaf child hear, would you? Academy Award-nominated Sound and Fury follows the intimate, heart-rending tale of the Artinians, an extended family with deaf and hearing members across three generations. Together they ...See moreIf you could make your deaf child hear, would you? Academy Award-nominated Sound and Fury follows the intimate, heart-rending tale of the Artinians, an extended family with deaf and hearing members across three generations. Together they confront a technological device that can help the deaf to hear but may also threaten deaf culture - and their bonds with each other. For Peter Artinian and his wife, both of whom are deaf, a surgical ear implant for their five-year-old daughter Heather means a choice between two worlds - an unfamiliar hearing world and the deaf world, a robust culture in its own right united by a uniquely visual and artistic language. Heather Artinian - precocious, vivacious, and avidly curious about implant surgery - is caught between her deaf parents and her hearing grandparents, as they argue passionately about her future. The debate is sometimes silent, but by no means quiet. When all is done, Sound and Fury speaks volumes about the choices we make and the battles we fight in order to be heard..  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2000_309": {
        "plotSummary": "The new member of a samurai militia unit causes disruption as several of his colleagues fall in love with him, threatening to disturb the rigid code of their squad.",
        "runtimeMinutes": "100"
    },
    "2000_31": {
        "plotSummary": "The true story of a newly appointed African-American coach and his high school team on their first season as a racially integrated unit.",
        "runtimeMinutes": "113"
    },
    "2000_310": {
        "plotSummary": "When the Yom Kippur War breaks out, two Israeli soldiers find themselves unable to locate their unit. Eager to take part in the war effort, they join an airborne medical evacuation unit.",
        "runtimeMinutes": "117"
    },
    "2000_311": {
        "plotSummary": "Tragi-comic, romantic whodunnit set in a run down hotel which plays host to mentally ill people too poor to afford medical insurance.",
        "runtimeMinutes": "122"
    },
    "2000_312": {
        "plotSummary": "Five friends spend one lost weekend in a mix of music, love and club culture.",
        "runtimeMinutes": "99"
    },
    "2000_313": {
        "plotSummary": "An assassin is sent to kill the witness from testifying against the killers. In the process, the assassin falls in love with the witness.",
        "runtimeMinutes": "124"
    },
    "2000_314": {
        "plotSummary": "Historian Klaus Müller interviews survivors of the Nazi persecution of homosexuals because of the German Penal Code of 1871, Paragraph 175.",
        "runtimeMinutes": "81"
    },
    "2000_315": {
        "plotSummary": "Musician Prem Kapoor lives with his sister, Neelu, brother-in-law Vinod, his niece and a nephew. He has plans of getting married to his fiancee, Nisha; unfortunately on the wedding day Nisha does not turn up. When a heart-broken Prem ...See moreMusician Prem Kapoor lives with his sister, Neelu, brother-in-law Vinod, his niece and a nephew. He has plans of getting married to his fiancee, Nisha; unfortunately on the wedding day Nisha does not turn up. When a heart-broken Prem confronts Nisha for an explanation she confides to him that she is to get married to a multi-millionaire male from the U.S. who promises to aid her in maintaining the family and an ailing younger brother. Devastated Prem decides to take to alcohol; eventually time passes and Prem starts to fall in love with an acquaintance, Priya Sharma. But before Prem could express his feelings Priya announces her engagement to U.S. returned Rahul Puglia which forces Prem to take to alcohol once again but eventually there is a twist when Prem gets to find out Priya is romantically attracted to him.  Written by gavin (racktoo@hotmail.com)See less",
        "runtimeMinutes": "159"
    },
    "2000_316": {
        "plotSummary": "Documentary look at the 1996-97 effort of the dancers and support staff at a San Francisco peep show, The Lusty Lady, to unionize. Angered by arbitrary and race-based wage policies, customers' surreptitious video cameras, and no paid sick ...See moreDocumentary look at the 1996-97 effort of the dancers and support staff at a San Francisco peep show, The Lusty Lady, to unionize. Angered by arbitrary and race-based wage policies, customers' surreptitious video cameras, and no paid sick days or holidays, the dancers get help from the Service Employees International local and enter protracted bargaining with the union-busting law firm that management hires. We see the women work, sort out their demands, and go through the difficulties of bargaining. The narrator is Julia Query, a dancer and stand-up comedian who is reluctant to tell her mother, a physician who works with prostitutes, that she strips.  Written by See less",
        "runtimeMinutes": "75"
    },
    "2000_317": {
        "plotSummary": "This is a documentary film about the history of the U.S. rave scene which includes a fantastic soundtrack. Both the film and soundtrack capture the people and the music that shaped the underground subculture around electronic music in ...See moreThis is a documentary film about the history of the U.S. rave scene which includes a fantastic soundtrack. Both the film and soundtrack capture the people and the music that shaped the underground subculture around electronic music in America. Featured soundtrack artists include: Moby, Keoki, The Crystal Method, DJ Spooky, Roni Size, Psychic TV, and a host of others.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2000_318": {
        "plotSummary": "The rivalry between Enzo and Jacques, two childhood friends and now world-renowned free divers, becomes a beautiful and perilous journey into oneself and the unknown.",
        "runtimeMinutes": "168"
    },
    "2000_319": {
        "plotSummary": "A young couple from the city takes a trip to the country.",
        "runtimeMinutes": "89"
    },
    "2000_32": {
        "plotSummary": "Ash Ketchum must gather the three spheres of fire, ice and lightning in order to restore balance to the Orange Islands.",
        "runtimeMinutes": "84"
    },
    "2000_320": {
        "plotSummary": "Five years after Yippie founder Abbie Hoffman goes underground to avoid a drug-related prison sentence, he contacts a reporter to get out the story of the FBI's covert spying, harassment and inciting of violence they then blame on the Left...See moreFive years after Yippie founder Abbie Hoffman goes underground to avoid a drug-related prison sentence, he contacts a reporter to get out the story of the FBI's covert spying, harassment and inciting of violence they then blame on the Left. The skeptical reporter interviews Anita, Hoffman's wife, a single mom on welfare in New York City; Hoffman's attorney, Gerry Lefcourt; and others. As they talk, we see Hoffman's career in flashbacks, from early civil rights organizing through the trial of the Chicago Eight. While underground, as mental illness takes its toll, he meets Johanna Lawrenson, and an odd family develops: Abbie, Anita, their son, and Johanna. Will vindication ever arrive?  Written by See less",
        "runtimeMinutes": "107"
    },
    "2000_321": {
        "plotSummary": "Raju, a waiter, is in love with the famous TV reporter Greeta Kapoor. After a man is murdered, Kapoor shows up at Raju's door to ask him some questions - it turns out that Raju served the dead man his last supper, and the authorities hope ...See moreRaju, a waiter, is in love with the famous TV reporter Greeta Kapoor. After a man is murdered, Kapoor shows up at Raju's door to ask him some questions - it turns out that Raju served the dead man his last supper, and the authorities hope that he might be able to help them. Raju lies and says that he was an eye witness, in order to spend more time with Kapoor. He gives the police a false description of the killer, but it matches his best friend Kutti, so soon Kutti is wanted by the police, and the Mafia, who is responsible for the killing, is after Raju.  Written by gavin@sunny_deol2009@yahoo.comSee less",
        "runtimeMinutes": "153"
    },
    "2000_322": {
        "plotSummary": "A few young waiters at a popular New Jersey restaurant are dreaming of becoming actors or otherwise getting into the artistic community.",
        "runtimeMinutes": "107"
    },
    "2000_323": {
        "plotSummary": "Colm (Barry McEvoy) is a Catholic, and George (Brian O'Byrne) is a poetry-loving Protestant. In Belfast, Northern Ireland in the 1980s, they could have been enemies, but instead, they became business partners. After persuading a mad wig ...See moreColm (Barry McEvoy) is a Catholic, and George (Brian O'Byrne) is a poetry-loving Protestant. In Belfast, Northern Ireland in the 1980s, they could have been enemies, but instead, they became business partners. After persuading a mad wig salesman, known as the Scalper (Sir Billy Connolly), to sell them his leads, the two embark on a series of house calls - always in neighborhoods that are dangerous for one or the other partner. Then they find out they may lose their exclusive wig distributorship to competitors. Through a series of comic twists, the pair are given large orders for wigs by both sides of the Protestant and Catholic conflict. Should they compromise their principles in order to keep their business? Will it destroy their friendship? Could one of their wigs in the hands of the I.R.A. actually put one or both of them in jail, or even get them killed?  Written by Miles FowlerSee less",
        "runtimeMinutes": "103"
    },
    "2000_324": {
        "plotSummary": "In the year 1963, an awkward thirteen-year-old girl comes of age during her escapism into the world of cinema, with potentially dangerous results.",
        "runtimeMinutes": "94"
    },
    "2000_325": {
        "plotSummary": "A man is cursed with falling in love with other men's women.",
        "runtimeMinutes": "87"
    },
    "2000_326": {
        "plotSummary": "Can a young person in the South Bronx pursue a dream that isn't tied to crime, gang-banging, prostitution, violence, and racism? Tommy is a natural leader and a gifted artist. When Allen, a white kid, moves into the neighborhood with his ...See moreCan a young person in the South Bronx pursue a dream that isn't tied to crime, gang-banging, prostitution, violence, and racism? Tommy is a natural leader and a gifted artist. When Allen, a white kid, moves into the neighborhood with his single mom, he's a victim of constant harassment until Tommy offers friendship. Meanwhile, a corrupt cop hits on Allen's mother and, when she rebuffs him, vows revenge. Forces beyond Tommy and Allen's control put them in the hands of the criminal justice system. A local murder, a rivalry between two young women, and the hot temper of Tommy's older brother make things even more difficult for the friendship and dreams of the young men.  Written by See less",
        "runtimeMinutes": "105"
    },
    "2000_327": {
        "plotSummary": "A Belfast, Northern Ireland housewife takes up the peace cause, which causes her family trouble with I.R.A. sympathizers.",
        "runtimeMinutes": "100"
    },
    "2000_328": {
        "plotSummary": "A Catholic high school student, trying to perfect his soccer timing by practicing dance, falls in love with his dance partner.",
        "runtimeMinutes": "92"
    },
    "2000_329": {
        "plotSummary": "A seemingly timid but secretly ruthless ingenue insinuates herself into the lives of an aging Broadway star and her circle of theater friends.",
        "runtimeMinutes": "138"
    },
    "2000_33": {
        "plotSummary": "When retired engineer Frank Corvin (Clint Eastwood) is called upon to rescue a failing satellite, he insists that his equally old teammates accompany him into space.",
        "runtimeMinutes": "130"
    },
    "2000_330": {
        "plotSummary": "A lonely, but talented teacher enjoys a flirtation with the (married) principal of the school, who returns her affections, but is hampered by his family members. Whilst the teacher and principal can steal their fleeting moments during an ...See moreA lonely, but talented teacher enjoys a flirtation with the (married) principal of the school, who returns her affections, but is hampered by his family members. Whilst the teacher and principal can steal their fleeting moments during an eclipse.  Written by John Sacksteder See less",
        "runtimeMinutes": "93"
    },
    "2000_331": {
        "plotSummary": "Street hustler Mike cooks up a drug rip-off with his estranged half-brother Torch. Simple robbery turns fatal bloodbath, so they hide out in a claustrophobic rat hole waiting for Mike's buddy Tony, who's \"out of the life,\" or so he says.",
        "runtimeMinutes": "107"
    },
    "2000_332": {
        "plotSummary": "Four siblings gathered together for their mother's funeral in Glasgow face individual torments over night during a tumultuous storm that rips the roof off the church.",
        "runtimeMinutes": "101"
    },
    "2000_333": {
        "plotSummary": "A survival tale of two lovers, who tries their best to escape a jungle which is governed by a cold blooded dacoit.",
        "runtimeMinutes": "146"
    },
    "2000_334": {
        "plotSummary": "This documentary tells four stories of Apartheid in South Africa, as seen through the eyes of the Truth and Reconciliation commission. White soldiers who have killed ANC activists, black activists who have killed whites in political ...See moreThis documentary tells four stories of Apartheid in South Africa, as seen through the eyes of the Truth and Reconciliation commission. White soldiers who have killed ANC activists, black activists who have killed whites in political attacks: can there be forgiveness when the full truth comes out?  Written by Martin Lewison See less",
        "runtimeMinutes": "94"
    },
    "2000_335": {
        "plotSummary": "A mysterious fair that comes to a small community in the countryside could make real the illusions of two teenagers.",
        "runtimeMinutes": "86"
    },
    "2000_336": {
        "plotSummary": "A group of young employees bet a month's salary, winner takes all, on who can last the longest without going outside.",
        "runtimeMinutes": "87"
    },
    "2000_337": {
        "plotSummary": "Wealthy Anjali falls in love with poor Dev, both want to get married, but Anjali's family objects and instead get her married to equally wealthy Ram, who lives with his uncaring step-mother and siblings. Anjali finds out that Ram is not ...See moreWealthy Anjali falls in love with poor Dev, both want to get married, but Anjali's family objects and instead get her married to equally wealthy Ram, who lives with his uncaring step-mother and siblings. Anjali finds out that Ram is not respected, but does not care as she does not love him. Ram continues to be affectionate toward her and his family, but Anjali cannot get Dev out of her mind. Then things change, when Ram decides to assert himself and asks his family to leave him and his wife alone. Anjali starts warming up to Ram, when Dev shows up - this Dev is not the poor Dev that Anjali once knew, this Dev is a multi-millionaire, scheming, and devious, and a Dev who will try to win Anjali over by hook or by crook.  Written by CalistaSee less",
        "runtimeMinutes": "161"
    },
    "2000_338": {
        "plotSummary": "Wealthy Rajiv Sinha and middle-classed Amar Saxena are two childhood friends, with similar likes, and tastes. Their similar habits lead them to being in love with the same woman - Seema, who loves Amar, and is willing to marry him no ...See moreWealthy Rajiv Sinha and middle-classed Amar Saxena are two childhood friends, with similar likes, and tastes. Their similar habits lead them to being in love with the same woman - Seema, who loves Amar, and is willing to marry him no matter what. Rajiv attempts to offer money to Sapna's guardian so that he can marry her, in vain though. When Rajiv attempts to convince Amar that Sapna is being brought up by a prostitute by the name of Ratnabai, Amar is adamant, and marries Sapna, and takes her home to his brother and his family, where they are not welcomed, and asked to leave. Rajiv and Amar stop seeing each other, and regard each other as bitter enemies. Amar and Seema manage to exist, with Amar going on to become a successful prosecution attorney. Then they get the news that Rajiv has been charged with killing a young woman named Neelam Mehta. Amar is delighted for he will be given a chance to teach Rajiv a lesson, and possibly sentence him to death. During the trial, Rajiv's only defense is that he was with another woman when this murder was committed, but refuses to name this woman. While the judge is pronouncing the sentence, the court proceedings are interrupted when Rajiv's defense lawyer produces the woman who was with Rajiv that entire night - Mrs. Seema Saxena.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "180"
    },
    "2000_339": {
        "plotSummary": "Circa 1971, Gustad Noble lives in a one bedroom hall rented apartment in Byculla, Bombay. He travels to work everyday by Central Railway to Victoria Terminus and walks to Flora Fountain to his place of employment, namely the Central Bank ...See moreCirca 1971, Gustad Noble lives in a one bedroom hall rented apartment in Byculla, Bombay. He travels to work everyday by Central Railway to Victoria Terminus and walks to Flora Fountain to his place of employment, namely the Central Bank of India. He has three children, Sohrab - who has finished his college studies and is now being admitted, much to his dislike, to Indian Institute of Technology (I.I.T.); while Darius, his second son, and daughter, Roshan, are school-going; his wife, Dilnavaz, looks after the children and the household. Their neighborhood is filthy, people urinate and defecate near the wall which encloses their building. Gustad asks a pavement artist to move near his building, draw pictures of religious Gods and Goddesses depicting the four main religions: Hinduism, Islam, Christianity, and Sikhism. The Artist agrees, and soon the place is transformed into a huge temple where people of all religions come to pay their respects. It is only a handful of people who know that Gustad is involved with a rebel RAW Agent, Major Jimmy Billimoria, who is actively involved with an extremist organization in East Pakistan, Awami League, aiding them financially and with manpower to overcome the Pakistani Government. The question remains what will Gustad's plight be when the news gets out of his involvement in this activity, especially when he receives 10 lakh rupees to be deposited in small installments in his Bank, in the midst of sentiments running high, war being declared between Pakistan and India, emergency blackout conditions and air raid sirens.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "113"
    },
    "2000_34": {
        "plotSummary": "A German submarine is boarded by disguised American submariners trying to capture their Enigma cipher machine.",
        "runtimeMinutes": "116"
    },
    "2000_340": {
        "plotSummary": "A young man goes to prison and a tough, older convict takes him under his wing as a mentor.",
        "runtimeMinutes": "94"
    },
    "2000_341": {
        "plotSummary": "Anjali Khanna had always suspected her husband, Sanjay, of cheating on her, and flirting with other women. In order to keep an eye on him and his activities, she asks her friend, who is also named Anjali Khanna (Rani Mukherji) to go abroad...See moreAnjali Khanna had always suspected her husband, Sanjay, of cheating on her, and flirting with other women. In order to keep an eye on him and his activities, she asks her friend, who is also named Anjali Khanna (Rani Mukherji) to go abroad under her name, which she does so. When Sanjay finds out that Anjali to go abroad, he hires Raj Malhotra to follow Anjali and make sure she is not having an affair, Raj does so with hilarious results.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "134"
    },
    "2000_342": {
        "plotSummary": "Filled with vengeance, a simple man turns into a hardcore criminal in order to avenge the destruction of his family.",
        "runtimeMinutes": "160"
    },
    "2000_343": {
        "plotSummary": "A young woman goes in search of her midlife crisis suffering husband who left her.",
        "runtimeMinutes": "98"
    },
    "2000_344": {
        "plotSummary": "Michael is a recovering alcoholic/drug user. Back on the wagon, he's now responsible for a young, beautiful, and pregnant wife. He's working the graveyard shift at a gas station to support his new family, but the job drives him crazy. Then...See moreMichael is a recovering alcoholic/drug user. Back on the wagon, he's now responsible for a young, beautiful, and pregnant wife. He's working the graveyard shift at a gas station to support his new family, but the job drives him crazy. Then a wealthy stranger, Stuart, enters Michael's life, taking Michael through a tour of the seediest and slimiest parts of L.A. underbelly. Is Stuart leading Michael to hell, or salvation?  Written by Martin Lewison See less",
        "runtimeMinutes": "95"
    },
    "2000_345": {
        "plotSummary": "This highly unorthodox documentary follows the crooked path of Benjamin (no last name). He lives in a hidden neighborhood of Atlanta, Georgia called \"Cabbagetown.\" Drag-queen, speed-freak, all-around renegade, Benjamin left the straight (...See moreThis highly unorthodox documentary follows the crooked path of Benjamin (no last name). He lives in a hidden neighborhood of Atlanta, Georgia called \"Cabbagetown.\" Drag-queen, speed-freak, all-around renegade, Benjamin left the straight (in every sense of the word) world behind a long time ago.See less",
        "runtimeMinutes": "72"
    },
    "2000_346": {
        "plotSummary": "ACP Prithviraj is an honest cop. When he arrests the Chief Minister's son for assaulting a girl, the minister tries his best to create havoc in Prithviraj's life.",
        "runtimeMinutes": "129"
    },
    "2000_347": {
        "plotSummary": "Intense love and hate bring a man and woman through personal tragedy.",
        "runtimeMinutes": "90"
    },
    "2000_348": {
        "plotSummary": "Marian (Deborah Kara Unger) and John Kerr (Jared Harris) are expecting an old friend, Lyle (David Conrad) for a weekend visit to their beautiful upstate New York home. Emotions run high since it is the one-year anniversary of the death of ...See moreMarian (Deborah Kara Unger) and John Kerr (Jared Harris) are expecting an old friend, Lyle (David Conrad) for a weekend visit to their beautiful upstate New York home. Emotions run high since it is the one-year anniversary of the death of John's brother, the handsome and charismatic Tony (D.B. Sweeney), who had also been Lyle's lover. Marian, who is still inconsolable after losing Tony to AIDS, is upset when Lyle brings his new boyfriend, a young artist, Robert (James Duval). Meanwhile, the situation is just as tense at the Kerrs' neighbors' house, where oft-widowed, free spirit Laura Ponti (Gena Rowlands) gets a surprise visit from her resentful, angry daughter, Nina (Brooke Shields), and her married lover, Thierry (Gary Dourdan). Matters worsen when the battling mother-daughter duo joins the Kerr household for a dinner party, where the pain-riddled diners engage in a messy emotional showdown.  Written by AnonymousSee less",
        "runtimeMinutes": "97"
    },
    "2000_349": {
        "plotSummary": "Charismatic tap dancing Sean tries to find a way out of working at the steel mill. When failure brings him home he starts his own dance group wearing hardhats. He must then find inspiration in the steel mill he once tried to escape.",
        "runtimeMinutes": "95"
    },
    "2000_35": {
        "plotSummary": "A fast-lane investment broker, offered the opportunity to see how the other half lives, wakes up to find that his sports car and girlfriend have become a mini-van and wife.",
        "runtimeMinutes": "125"
    },
    "2000_350": {
        "plotSummary": "Two Irish Catholic brothers become vigilantes and wipe out Boston's criminal underworld in the name of God.",
        "runtimeMinutes": "108"
    },
    "2000_351": {
        "plotSummary": "A documentary of the successful career and assassination of San Francisco's first elected gay city supervisor.",
        "runtimeMinutes": "90"
    },
    "2000_352": {
        "plotSummary": "An unfocused twentysomething (Peter Fenton) moves in with a former co-worker (Sacha Holder), who is suffering from low self-esteem because of her weight, looks, and a case of eczema. Their relationship is based on unending drink, drugs, ...See moreAn unfocused twentysomething (Peter Fenton) moves in with a former co-worker (Sacha Holder), who is suffering from low self-esteem because of her weight, looks, and a case of eczema. Their relationship is based on unending drink, drugs, and sex. Curiously, though the two are presented in a tender and humorous light that lets the viewer get involved in concerned about their direction.  Written by John Sacksteder See less",
        "runtimeMinutes": "98"
    },
    "2000_353": {
        "plotSummary": "The sailor is \"persuaded\" by a Princess to help her rescue her kingdom from something fishy.",
        "runtimeMinutes": "85"
    },
    "2000_354": {
        "plotSummary": "Follows the life of Olympic hopeful Francis Barrett as he overcomes social and cultural barriers to realise his dream of fighting for the Irish Olympic team.",
        "runtimeMinutes": "79"
    },
    "2000_355": {
        "plotSummary": "Dev, a conman, gets killed by his wife Ritu, after she learns that the former is a debt-ridden thug who married her only to repay his debts. Her life turns upside down when she meets Anand, Dev's identical twin brother.",
        "runtimeMinutes": "157"
    },
    "2000_356": {
        "plotSummary": "Vampire in London is searching for the ideal woman to redeem him.",
        "runtimeMinutes": "98"
    },
    "2000_357": {
        "plotSummary": "Two twelve-year-old boys, Romeo and Gavin, undergo an extraordinary test of character and friendship when Morell, a naive but eccentric and dangerous stranger, comes between them. Morell befriends with the two boys and later asks them to ...See moreTwo twelve-year-old boys, Romeo and Gavin, undergo an extraordinary test of character and friendship when Morell, a naive but eccentric and dangerous stranger, comes between them. Morell befriends with the two boys and later asks them to help him pursue Romeo's beautiful elder sister. He gradually becomes more violent after she rejects him ...  Written by L.H. Wong See less",
        "runtimeMinutes": "90"
    },
    "2000_358": {
        "plotSummary": "Leah is travelling the world when she eventually settles in Beijing, China, where she meets Master Sun Zhan who teaches her the art of weiqi. Her path crosses with American Chinese Richard whose family had sent him to Beijing to arrange ...See moreLeah is travelling the world when she eventually settles in Beijing, China, where she meets Master Sun Zhan who teaches her the art of weiqi. Her path crosses with American Chinese Richard whose family had sent him to Beijing to arrange his grandfather's ashes. A romance soon blossoms between them.  Written by mahajanssenSee less",
        "runtimeMinutes": "100"
    },
    "2000_359": {
        "plotSummary": "Conman Leo Garfield is in hot water after accepting a contract to murder businessman Julius Harvey's alleged wife, Gloria. Leo's wife Lily brings trouble too when her old flame Elmo pops up again, years after she abandoned him mid-heist.",
        "runtimeMinutes": "95"
    },
    "2000_36": {
        "plotSummary": "Four college buddies embark on a road trip to retrieve an illicit tape mistakenly mailed to a female friend.",
        "runtimeMinutes": "93"
    },
    "2000_360": {
        "plotSummary": "Three sisters and their ex-con brother return home to nurse their mother, who is dying of cancer.",
        "runtimeMinutes": "101"
    },
    "2000_361": {
        "plotSummary": "The lead singer of an oldies group reminisces about the good ol' days and a potential comeback.",
        "runtimeMinutes": "97"
    },
    "2000_362": {
        "plotSummary": "The sixth or seventh best superhero team in the world pursue their rightful place in the harshly competitive world of toy tie-ins and fighting evil.",
        "runtimeMinutes": "82"
    },
    "2000_363": {
        "plotSummary": "An introvert relieves the tedium of caring for his invalid mother by spying on his neighbor.",
        "runtimeMinutes": "105"
    },
    "2000_364": {
        "plotSummary": "A young girl is plucked from small-town obscurity and thrust into the spotlight of the glamorous world of super-models.",
        "runtimeMinutes": "100"
    },
    "2000_365": {
        "plotSummary": "Handguns figure in the intertwining lives of nine people. Warren shoots his wife Helen's lover and his defense is that he thought he was shooting an intruder. She leaves him; the lawyer helps her get a job with a nutty, reclusive computer ...See moreHandguns figure in the intertwining lives of nine people. Warren shoots his wife Helen's lover and his defense is that he thought he was shooting an intruder. She leaves him; the lawyer helps her get a job with a nutty, reclusive computer wizard who waves a pistol about, sometimes at Helen. Tennel, the computer geek's ex-assistant, lands a video-store job and is smitten by Annabel Lee, an aggressive street kid who likes complaining about men to her pistol-packing psychotic brother to set him off. In secret, Annabel starts an affair with the lawyer, who has both a pistol and a gay lover, who becomes jealous. He has a pistol too. A cool (and armed) cop stays on Warren's tail.  Written by See less",
        "runtimeMinutes": "99"
    },
    "2000_366": {
        "plotSummary": "A high-priced call girl, shocked by her mother's death, decides to get out of the business and have a baby. The steps that she takes to free herself from her pimp and find a father for the baby are the central story of this movie.",
        "runtimeMinutes": "95"
    },
    "2000_367": {
        "plotSummary": "A young boy sets out to find his mother. After setting up camp in Central Park, he encounters a group of people even needier than himself.",
        "runtimeMinutes": "109"
    },
    "2000_368": {
        "plotSummary": "Monika Treut explores the worlds and thoughts of several trans-gendered individuals. As with Treuts first film, Jungfrauenmaschine, Gendernauts, enters a minority sector of San Fransisco culture. The individuals in this film are people ...See moreMonika Treut explores the worlds and thoughts of several trans-gendered individuals. As with Treuts first film, Jungfrauenmaschine, Gendernauts, enters a minority sector of San Fransisco culture. The individuals in this film are people whose (genetically) assigned gender does not match their social gender identity. The subject is pinpointed in the film independent of sexual orientation. Leave your conservative hats at the door, this is going to need your special attention.  Written by kwedgwood@hotmail.com, edited by April KesterSee less",
        "runtimeMinutes": "87"
    },
    "2000_369": {
        "plotSummary": "A New York press agent applies his show-business acumen to revitalize his ailing father's Indiana fruit farm.",
        "runtimeMinutes": "106"
    },
    "2000_37": {
        "plotSummary": "Aspiring songwriter Violet Sanford, after getting a job at a women-run NYC bar that teases its male patrons, comes out of her shell.",
        "runtimeMinutes": "100"
    },
    "2000_370": {
        "plotSummary": "In the 1960s, a group of friends at an all girls school learn that their school is going to be combined with a nearby all boys school. They concoct a plan to save their school while dealing with everyday problems along the way.",
        "runtimeMinutes": "97"
    },
    "2000_371": {
        "plotSummary": "The trials and tribulations of wealthy young Manhattanites and their sexual coming of age, a romantic comedy set at an Upper East Side prep school.",
        "runtimeMinutes": "96"
    },
    "2000_372": {
        "plotSummary": "Recovering alcoholic, ex-LAPD, private detective Fritz Brown, is hired by caddie \"Fat Dog\" to follow his kid sister, who is holed up with an old sugar daddy. The trail leads to his old police boss Cathcart, and the bodies start to pile up.",
        "runtimeMinutes": "104"
    },
    "2000_373": {
        "plotSummary": "A young Glaswegian prostitute in London tries to start a new life.",
        "runtimeMinutes": "99"
    },
    "2000_374": {
        "plotSummary": "A letter from a troubled young man changes the life of a disillusioned radio personality.",
        "runtimeMinutes": "80"
    },
    "2000_375": {
        "plotSummary": "Tempers fray and true selves are revealed when a heterosexual is accidentally invited to a homosexual party.",
        "runtimeMinutes": "118"
    },
    "2000_376": {
        "plotSummary": "Three grown daughters try to find their own personal ways to deal with their dysfunctional parents. The mother is an unorthodox woman with out-of-the-ordinary ideas, including one where she takes a jackhammer to the basement floor of their...See moreThree grown daughters try to find their own personal ways to deal with their dysfunctional parents. The mother is an unorthodox woman with out-of-the-ordinary ideas, including one where she takes a jackhammer to the basement floor of their house to build a cavern where the family can live better. Their father, an ex-cop, disappeared 15 years earlier and then re-appeared with no explanation and commandeers his wife's project by placing the whole family in a survivalist situation. Jack is the priest-brother to the mother, who is forced to counsel the family despite his own problems with his faith.  Written by John Sacksteder See less",
        "runtimeMinutes": "95"
    },
    "2000_377": {
        "plotSummary": "Rebellious teenager Stevie finds his mother's gun, and along with his girlfriend impulsively decides to rob a bank. The pair find themselves in over their heads as they take hostages and the FBI negotiates Stevie's absurd demands.",
        "runtimeMinutes": "99"
    },
    "2000_38": {
        "plotSummary": "After a teenager has a terrifying vision of him and his classmates dying in a plane explosion, he saves himself and a few others only to have Death hunt them down one by one.",
        "runtimeMinutes": "98"
    },
    "2000_39": {
        "plotSummary": "When a 12-year-old girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her.",
        "runtimeMinutes": "122"
    },
    "2000_4": {
        "plotSummary": "After an accident, a chauvinistic executive gains the ability to hear what women are really thinking.",
        "runtimeMinutes": "127"
    },
    "2000_40": {
        "plotSummary": "When the first manned mission to Mars meets with a catastrophic and mysterious disaster after reporting an unidentified structure, a rescue mission is launched to investigate the tragedy and bring back any survivors.",
        "runtimeMinutes": "114"
    },
    "2000_41": {
        "plotSummary": "An unhappy and disliked image consultant gets a second shot at life when he is mysteriously confronted by an eight-year-old version of himself.",
        "runtimeMinutes": "104"
    },
    "2000_42": {
        "plotSummary": "A talented young boy becomes torn between his unexpected love of dance and the disintegration of his family.",
        "runtimeMinutes": "110"
    },
    "2000_43": {
        "plotSummary": "New York City police detective John Shaft (nephew of the original 1970s detective) goes on a personal mission to make sure the son of a real estate tycoon is brought to justice after a racially-motivated murder.",
        "runtimeMinutes": "99"
    },
    "2000_44": {
        "plotSummary": "A struggling dentist's life is turned upside down when a famous gangster moves in next door, and his wife convinces him to inform a notorious mob boss about the gangster's whereabouts.",
        "runtimeMinutes": "98"
    },
    "2000_45": {
        "plotSummary": "An F.B.I. Agent persuades a social worker, who is adept with a new experimental technology, to enter the mind of a comatose serial killer in order to learn where he has hidden his latest kidnap victim.",
        "runtimeMinutes": "107"
    },
    "2000_46": {
        "plotSummary": "The Rugrats travel to Paris, France, where Chuckie (Christine Cavanaugh) hopes to find a new mother and keep his father from marrying an evil business woman.",
        "runtimeMinutes": "78"
    },
    "2000_47": {
        "plotSummary": "A Chinese man travels to the Wild West to rescue a kidnapped Princess. After teaming up with a train robber, the unlikely duo takes on a Chinese traitor and his corrupt boss.",
        "runtimeMinutes": "110"
    },
    "2000_48": {
        "plotSummary": "Tigger goes looking through the hundred-acre-wood to find his family.",
        "runtimeMinutes": "77"
    },
    "2000_49": {
        "plotSummary": "Futuristic action film about a man who meets a clone of himself and stumbles into a grand conspiracy about clones taking over the world.",
        "runtimeMinutes": "123"
    },
    "2000_5": {
        "plotSummary": "An orphaned dinosaur raised by lemurs joins an arduous trek to a sanctuary after a meteorite shower destroys his family home.",
        "runtimeMinutes": "82"
    },
    "2000_50": {
        "plotSummary": "An avenging cop seeks out his brother's killer and falls for the daughter of a businessman who is involved in a money-deal with his father.",
        "runtimeMinutes": "115"
    },
    "2000_51": {
        "plotSummary": "An update of the original film with new interpretations of great works of classical music.",
        "runtimeMinutes": "75"
    },
    "2000_52": {
        "plotSummary": "Romantic drama about an aging playboy who falls for a sweet, but terminally ill, young woman.",
        "runtimeMinutes": "103"
    },
    "2000_53": {
        "plotSummary": "A champion high school cheerleading squad discovers its previous captain stole all their best routines from an inner-city school and must scramble to compete at this year's championships.",
        "runtimeMinutes": "98"
    },
    "2000_54": {
        "plotSummary": "Hopeless dweeb Elliot Richards is granted seven wishes by the Devil to snare Allison, the girl of his dreams, in exchange for his soul.",
        "runtimeMinutes": "93"
    },
    "2000_55": {
        "plotSummary": "Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers and supposedly Jewish jewelers fight to track down a priceless stolen diamond.",
        "runtimeMinutes": "104"
    },
    "2000_56": {
        "plotSummary": "The story of Carl Brashear, the first African-American U.S. Navy Diver, and the man who trained him.",
        "runtimeMinutes": "129"
    },
    "2000_57": {
        "plotSummary": "A young writing prodigy finds a mentor in a reclusive author.",
        "runtimeMinutes": "136"
    },
    "2000_58": {
        "plotSummary": "Two swindlers get their hands on a map to the fabled city of gold, El Dorado.",
        "runtimeMinutes": "89"
    },
    "2000_59": {
        "plotSummary": "Two potheads wake up after a night of partying and cannot remember where they parked their car.",
        "runtimeMinutes": "83"
    },
    "2000_6": {
        "plotSummary": "On the outskirts of Whoville lives a green, revenge-seeking Grinch who plans to ruin Christmas for all of the citizens of the town.",
        "runtimeMinutes": "104"
    },
    "2000_60": {
        "plotSummary": "In the deep south during the 1930s, three escaped convicts search for hidden treasure while a relentless lawman pursues them.",
        "runtimeMinutes": "107"
    },
    "2000_61": {
        "plotSummary": "An attorney defends an officer on trial for ordering his troops to fire on civilians after they stormed a U.S. embassy in a Middle Eastern country.",
        "runtimeMinutes": "128"
    },
    "2000_62": {
        "plotSummary": "An accidental cross-time radio link connects father and son across 30 years. The son tries to save his father's life, but then must fix the consequences.",
        "runtimeMinutes": "118"
    },
    "2000_63": {
        "plotSummary": "In October 1962, the Kennedy administration struggles to contain the Cuban Missile Crisis.",
        "runtimeMinutes": "145"
    },
    "2000_64": {
        "plotSummary": "Alice hires a professional negotiator to obtain the release of her engineer husband, who has been kidnapped by anti-government guerrillas in South America.",
        "runtimeMinutes": "135"
    },
    "2000_65": {
        "plotSummary": "When a school in upstate New York is snowed in, a group of students hi-jack a plow to keep the school closed.",
        "runtimeMinutes": "89"
    },
    "2000_66": {
        "plotSummary": "A big-city newspaper columnist is forced to enter a drug and alcohol rehab center after ruining her sister's wedding and crashing a stolen limousine.",
        "runtimeMinutes": "103"
    },
    "2000_67": {
        "plotSummary": "Police inspector Emilien and his taxi-driver pal Daniel are back, this time on the tail of a group of Japanese yakuza.",
        "runtimeMinutes": "88"
    },
    "2000_68": {
        "plotSummary": "Two friends, a priest and a rabbi, fall in love with the same woman they knew in their youth, but the religious position of both men denies them romance.",
        "runtimeMinutes": "128"
    },
    "2000_69": {
        "plotSummary": "Uncle Elroy and Day Day owe money on taxes so Craig finds a way to steal from the next door neighbors to pay off the taxes so Uncle Elroy's house doesn't get put up for auction.",
        "runtimeMinutes": "98"
    },
    "2000_7": {
        "plotSummary": "Male nurse Greg Focker meets his girlfriend's parents before proposing, but her suspicious father is every date's worst nightmare.",
        "runtimeMinutes": "108"
    },
    "2000_70": {
        "plotSummary": "In this live-action prequel to The Flintstones (1994), the Flintstones and the Rubbles go on a trip to Rock Vegas, where Wilma Slaghoople (Kristen Johnston) is pursued by playboy Chip Rockefeller (Thomas Gibson).",
        "runtimeMinutes": "90"
    },
    "2000_71": {
        "plotSummary": "A rare book dealer, while seeking out the last two copies of a demon text, gets drawn into a conspiracy with supernatural overtones.",
        "runtimeMinutes": "133"
    },
    "2000_72": {
        "plotSummary": "After two of the devil's three sons escape Hell to wreak havoc on Earth, the devil must send his third son, the mild-mannered Nicky, to bring them back before it's too late.",
        "runtimeMinutes": "90"
    },
    "2000_73": {
        "plotSummary": "A young boy attempts to make the world a better place after his teacher gives him that chance.",
        "runtimeMinutes": "123"
    },
    "2000_74": {
        "plotSummary": "A man switches plane tickets with another man who dies in that plane in a crash. The man falls in love with the deceased one's wife.",
        "runtimeMinutes": "106"
    },
    "2000_75": {
        "plotSummary": "A commercial transport ship and its crew are marooned on a planet full of bloodthirsty creatures that only come out to feast at night. But then, they learn that a month-long eclipse is about to occur.",
        "runtimeMinutes": "109"
    },
    "2000_76": {
        "plotSummary": "A trio of sisters bond over their ambivalence toward the approaching death of their curmudgeonly father, to whom none of them was particularly close.",
        "runtimeMinutes": "94"
    },
    "2000_77": {
        "plotSummary": "A senior at an ivy league college, who depends on scholarships and working on the side, gets accepted into the secret society The Skulls. He hopes it betters chances at Harvard but The Skulls is not what he thought and comes at a price.",
        "runtimeMinutes": "106"
    },
    "2000_78": {
        "plotSummary": "During a pro football strike, the owners hire substitute players.",
        "runtimeMinutes": "118"
    },
    "2000_79": {
        "plotSummary": "A group of tourists arrives in Burkittsville, Maryland after seeing The Blair Witch Project to explore the mythology and phenomenon, only to come face to face with their own neuroses and possibly the witch herself.",
        "runtimeMinutes": "90"
    },
    "2000_8": {
        "plotSummary": "An unusually intense storm pattern catches some commercial fishermen unaware and puts them in mortal danger.",
        "runtimeMinutes": "130"
    },
    "2000_80": {
        "plotSummary": "A high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies them on their concert tour.",
        "runtimeMinutes": "122"
    },
    "2000_81": {
        "plotSummary": "David is a serial killer of young women. Joel was in charge of catching him in LA. He moved to Chicago a broken man. So did David and sends him photos of his next victims 24 hours before the murders.",
        "runtimeMinutes": "97"
    },
    "2000_82": {
        "plotSummary": "Rob, a record store owner and compulsive list maker, recounts his top five breakups, including the one in progress.",
        "runtimeMinutes": "113"
    },
    "2000_83": {
        "plotSummary": "A group of thieves breaks into a chamber expecting to find paintings, but instead they release the count himself, who travels to New Orleans to find his nemesis' daughter, Mary Van Helsing.",
        "runtimeMinutes": "99"
    },
    "2000_84": {
        "plotSummary": "A fortune teller with extrasensory perception is asked to help find a young woman who has mysteriously disappeared.",
        "runtimeMinutes": "112"
    },
    "2000_85": {
        "plotSummary": "A pregnant seventeen-year-old rebuilds her life after being abandoned by her boyfriend at a Walmart in Sequoyah, Oklahoma.",
        "runtimeMinutes": "120"
    },
    "2000_86": {
        "plotSummary": "Cody, a little girl abandoned by her mother and raised by her aunt, a nurse, is kidnapped. The girl's guardian, aided by an F.B.I. agent, learn that Cody has supernatural abilities, and the abductees are a Satanic cult willing to do anything to gain them.",
        "runtimeMinutes": "107"
    },
    "2000_87": {
        "plotSummary": "UN's secretary general uses covert operations to help diplomacy along. Shaw's called back 6 months after one such operation. He witnesses the murder of Chinese UN ambassador at UN, NYC, chases the assassin and ends up a suspect.",
        "runtimeMinutes": "117"
    },
    "2000_88": {
        "plotSummary": "An East European girl travels to the United States with her young son, expecting it to be like a Hollywood film.",
        "runtimeMinutes": "140"
    },
    "2000_89": {
        "plotSummary": "A down-and-out golfer attempts to recover his game and his life with help from a mystical caddy.",
        "runtimeMinutes": "126"
    },
    "2000_9": {
        "plotSummary": "In a world where mutants (evolved super-powered humans) exist and are discriminated against, two groups form for an inevitable clash: the supremacist Brotherhood, and the pacifist X-Men.",
        "runtimeMinutes": "104"
    },
    "2000_90": {
        "plotSummary": "A film school is the center of a fresh spate of killings based on urban legends.",
        "runtimeMinutes": "97"
    },
    "2000_91": {
        "plotSummary": "A concert film featuring four major African American stand up comedians.",
        "runtimeMinutes": "115"
    },
    "2000_92": {
        "plotSummary": "A young man learns that he has to find a hidden Earth ship before an enemy alien species does in order to secure the survival of humanity.",
        "runtimeMinutes": "94"
    },
    "2000_93": {
        "plotSummary": "A man who falls in love with the woman who received his wife's heart must decide which woman it is who holds his heart.",
        "runtimeMinutes": "115"
    },
    "2000_94": {
        "plotSummary": "A shy boy grows up in 1940s Mississippi with the help of his beloved dog, Skip.",
        "runtimeMinutes": "95"
    },
    "2000_95": {
        "plotSummary": "When enemies Boris, Natasha, and Fearless Leader escape into the real world with a nefarious scheme, Rocky and Bullwinkle do the same, and team up with a young F.B.I. Agent to stop the trio.",
        "runtimeMinutes": "92"
    },
    "2000_96": {
        "plotSummary": "A wealthy New York City investment banking executive, Patrick Bateman, hides his alternate psychopathic ego from his co-workers and friends as he delves deeper into his violent, hedonistic fantasies.",
        "runtimeMinutes": "101"
    },
    "2000_97": {
        "plotSummary": "Profion, a tyrant, attempts to overthrow a peaceful kingdom ruled by a tough empress.",
        "runtimeMinutes": "107"
    },
    "2000_98": {
        "plotSummary": "Astronauts, and their robotic dog AMEE (Autonomous Mapping Evaluation and Evasion), search for solutions to save a dying Earth by searching on Mars, only to have the mission go terribly awry.",
        "runtimeMinutes": "106"
    },
    "2000_99": {
        "plotSummary": "An English Professor tries to deal with his wife leaving him, the arrival of his editor who has been waiting for his book for seven years, and the various problems that his friends and associates involve him in.",
        "runtimeMinutes": "107"
    }
}