{
    "2001_1": "An orphaned boy enrolls in a school of wizardry, where he learns the truth about himself, his family and the terrible evil that haunts the magical world.",
    "2001_10": "Living in exile, Dr. Hannibal Lecter tries to reconnect with now disgraced F.B.I. Agent Clarice Starling, and finds himself a target for revenge from a powerful victim.",
    "2001_100": "Two guys by the name of Silas and Jamal decided to one day smoke something magical, which eventually helps them to ace their college entrance exam.",
    "2001_101": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love.",
    "2001_102": "After being abandoned by his parents at the Grand Canyon, Joe Dirt tells the story of his journey to find his parents.",
    "2001_103": "Widowed Liz Garfield and her son Bobby change when mysterious stranger Ted Brautigan enters their lives.",
    "2001_104": "A stressed father, a bride-to-be with a secret, a smitten event planner, and relatives from around the world create much ado about the preparations for an arranged marriage in India.",
    "2001_105": "A mysterious man is drawn to a feisty female police officer and a unusual relationship ensues, as not everything is as it seems.",
    "2001_106": "A retiring police detective pledges to catch the killer of a young child.",
    "2001_107": "In South Central L.A., a misguided 20-year-old African-American man, a \"baby boy\", faces the commitments of real life.",
    "2001_108": "A career jewel thief finds himself at tense odds with his longtime partner, a crime boss who sends his nephew to keep watch.",
    "2001_109": "A tailor living in Panama reluctantly becomes a spy for a British Agent.",
    "2001_11": "Carter and Lee head to Hong Kong for a vacation, but become embroiled in a counterfeit money scam.",
    "2001_110": "Four friends begin to question women and relationships when one of them announces impending nuptials.",
    "2001_111": "A court-martialed General rallies together twelve hundred inmates to rise against a corrupt and sadistic warden.",
    "2001_112": "A pair of buddies conspire to save their best friend from marrying the wrong woman.",
    "2001_113": "The loser son of a Mafia honcho must go undercover for the FBI.",
    "2001_114": "An emotionally beaten man with his young daughter moves to his ancestral home in Newfoundland to reclaim his life.",
    "2001_115": "When Joe is beat up by a co-worker in front of his daughter on \"Bring Your Child To Work Day\", he decides to fight back.",
    "2001_116": "A German Jewish refugee family moves to and adjusts to a farm life in 1930s Kenya.",
    "2001_117": "When a man is diagnosed with terminal cancer, he takes custody of his misanthropic teenage son, for whom quality time means getting high, engaging in small-time prostitution, and avoiding his father.",
    "2001_118": "An orphaned teenager is taken in by a Malibu couple but discovers they aren't the caring friends they seemed to be.",
    "2001_119": "At the wedding of a friend, the remaining bachelors bet on staying single. 7 years later, one of the 2 remaining loses $51000 in Vegas. He must get the other guy married to cash in and pay his debt or die. A cute woman helps him.",
    "2001_12": "After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish.",
    "2001_120": "A group of old family members bands together when a despicable family member thankfully expires.",
    "2001_121": "An arrogant career woman plays a series of heartless mind-games with her boyfriend to \"put him in line,\" only to discover that he has a few tricks up his own sleeve.",
    "2001_122": "Documentary on the migratory patterns of birds, shot over the course of three years on all seven continents.",
    "2001_123": "A horrific car accident connects three stories, each involving characters dealing with loss, regret, and life's harsh realities, all in the name of love.",
    "2001_124": "After a car wreck on the winding Mulholland Drive renders a woman amnesiac, she and a perky Hollywood-hopeful search for clues and answers across Los Angeles in a twisting venture beyond dreams and reality.",
    "2001_125": "An aging chief's last stand, lessons for the new, and the education of a young chief-to-be played against harsh Nature in Nepal's Dolpo. When his son dies returning from Tibet's salt lakes, Tinle blames Karma, his son's friend, refuses to ...See moreAn aging chief's last stand, lessons for the new, and the education of a young chief-to-be played against harsh Nature in Nepal's Dolpo. When his son dies returning from Tibet's salt lakes, Tinle blames Karma, his son's friend, refuses to give Karma his blessing as the new chief, and organizes a rival caravan to take the salt to lower Nepal to trade for grain. He, a few old men, his son's widow, his grandson, and his second son, a monk, set out on the arduous journey. Fearing storms, Karma has led his caravan out of the village before the auspicious day ordained by the lamas. Tinle's group catches Karma's before the final pass; the two stubborn men lock wills with Tinle's grandson watching.  Written by See less",
    "2001_126": "At Pacific Palisades High, a poor Latino falls hard for a troubled girl from an affluent neighborhood.",
    "2001_127": "A high school senior's girlfriend breaks up with him. His friends try to make him think of something else. His friend's sister Kelly helps him with the school musical. Spending time with Kelly has an effect.",
    "2001_128": "A rich girl whose family summers on Cape Cod has a romance with a local poor boy who hopes to become a major league baseball player.",
    "2001_129": "Shackleton's Antarctic Adventure is a giant-screen film that tells the dramatic true story of explorer Sir Ernest Shackleton's now-legendary 1914-1916 British Imperial Trans-Antarctic Expedition. A testament to heroism and human endurance,...See moreShackleton's Antarctic Adventure is a giant-screen film that tells the dramatic true story of explorer Sir Ernest Shackleton's now-legendary 1914-1916 British Imperial Trans-Antarctic Expedition. A testament to heroism and human endurance, the 28-man crew survived nearly two years in the Antarctic when its ship, the Endurance, was trapped and then crushed by pack ice.  Written by AnonymousSee less",
    "2001_13": "Jim and his friends are now in college, and they decide to meet up at the beach house for some fun.",
    "2001_130": "Lead singer of a tribute band becomes lead singer of the real band he idolizes.",
    "2001_131": "An update of Shakespeare's 'Othello' with a young cast, set in an upper class prep school, & centered around basketball player Odin.",
    "2001_132": "A laconic, chain-smoking barber blackmails his wife's boss and lover for money to invest in dry cleaning, but his plan goes terribly wrong.",
    "2001_133": "An insurance investigator and an efficency expert who hate each other are both hypnotized by a crooked hypnotist with a jade scorpion into stealing jewels.",
    "2001_134": "A gang of ex-cons rob a casino during Elvis convention week.",
    "2001_135": "Max Keeble, the victim of his 7th grade class, plots revenge when he learns he's moving; it backfires when he doesn't move after all.",
    "2001_136": "A computer programmer's dream job at a hot Portland-based firm turns nightmarish when he discovers his boss has a secret and ruthless means of dispatching anti-trust problems.",
    "2001_137": "Jason Voorhees returns with a new look, a new machete, and his same murderous attitude as he is awakened on a spaceship in the 25th century.",
    "2001_138": "A popular high-school cheerleader becomes pregnant by the star quarterback and turns to crime to support her desired lifestyle.",
    "2001_139": "A French count is in England to marry the princess. She's killed. A wizard helps him to time travel back before the murder - except they end up in Chicago, April 2000. A descendant helps him. He looks for the wizard to return to the 1100s.",
    "2001_14": "Bridget Jones is determined to improve herself while she looks for love in a year in which she keeps a personal diary.",
    "2001_140": "True story of the lifelong romance between novelist Iris Murdoch and her husband John Bayley, from their student days through her battle with Alzheimer's disease.",
    "2001_141": "The relationships of four couples unravel after the discovery of a young woman's body in Lantana bush in suburban Sydney.",
    "2001_142": "A young genius frantically races against time to crack an enemy code and solve the mystery surrounding the woman he loves.",
    "2001_143": "Harry knew Michel in high school; they meet again by accident, Harry inserts himself in Michel's life... and things take a sinister turn.",
    "2001_144": "A Japanese gangster is exiled to Los Angeles where his brother lives with a small but respectable multi-racial gang, who he inspires to expand their influence.",
    "2001_145": "A girl group find themselves in the middle of a conspiracy to deliver subliminal messages through popular music.",
    "2001_146": "A snowboarder's plans for his own snowboard park go awry when an ex-girlfriend returns to town.",
    "2001_147": "A martial artist/doctor steals from the corrupt authorities as a masked thief to give to the poor while another martial artist/doctor is forced to hunt him down. But a major threat unites them as a powerful and traitorous shaolin monk ...See moreA martial artist/doctor steals from the corrupt authorities as a masked thief to give to the poor while another martial artist/doctor is forced to hunt him down. But a major threat unites them as a powerful and traitorous shaolin monk takes over the authorities.See less",
    "2001_148": "In 1975, the dynamics of a Swedish commune begin to change upon the arrival of a beaten wife and her two kids.",
    "2001_149": "An unemployed cartoonist moves back in with his parents and younger brother Freddy. When his parents demand he leave, he begins to spread rumors that his father is sexually abusing Freddy.",
    "2001_15": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
    "2001_150": "A policeman white blood cell, with the help of a cold pill, must stop a deadly virus from destroying the human they live in, Frank.",
    "2001_151": "In 2176, a Martian police unit is sent to pick up a highly dangerous criminal at a remote mining post. Upon arrival, the cops find that the post has become a charnel house.",
    "2001_152": "5 Southern friends return home when the war ends 1865. But Yankee soldiers and Pinkerton are busy helping a railroad baron grab land from farmers along the planned railroad west. The 5 friends fight back.",
    "2001_153": "Every man has a different recollection of the beautiful young woman who wreaked havoc on their lives during one heated night.",
    "2001_154": "A young woman is attracted to a man despite her thinking she's seen him kill someone.",
    "2001_155": "An American master chemist plans to score big on a once in a lifetime drug deal. All does not go as planned and he is soon entangled in a web of deceit.",
    "2001_156": "Sandrine, a woman in her thirties gets tired of life in Paris and decides to leave her work in computers and become a farmer. She takes the required practice for two years, and after that she buys an isolated farm from Adrien, an old ...See moreSandrine, a woman in her thirties gets tired of life in Paris and decides to leave her work in computers and become a farmer. She takes the required practice for two years, and after that she buys an isolated farm from Adrien, an old farmer who decides it's time to retire. However, Adrien wants to stay a few more months before moving away from the farm, and the rough winter finds them together...  Written by Chris Makrozahopoulos See less",
    "2001_157": "A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.",
    "2001_158": "Jo and Gilly date. They find out they're brother and sister. Jo moves away. Gilly finds out that he's not Jo's brother and that Jo's getting married. Can he stop the wedding in time?",
    "2001_159": "A psychoanalyst and his family go through profound emotional trauma when their son dies in a scuba diving accident.",
    "2001_16": "Video game adventurer Lara Croft comes to life in a movie where she races against time and villains to recover powerful ancient artifacts.",
    "2001_160": "After marrying a poor woman, rich Rahul is disowned by his father and moves to London to build a new life. Years later, his now grown up little brother Rohan embarks on a mission to bring Rahul back home and reunite the family again.",
    "2001_161": "Porter Stoddard is a well-known New York architect who is at a crossroads... a nexus where twists and turns lead to myriad missteps, some with his wife Ellie, others with longtime friends Mona and her husband Griffin. Deciding which ...See morePorter Stoddard is a well-known New York architect who is at a crossroads... a nexus where twists and turns lead to myriad missteps, some with his wife Ellie, others with longtime friends Mona and her husband Griffin. Deciding which direction to take often leads to unexpected encounters with hilarious consequences.  Written by Sarah Lean See less",
    "2001_162": "In Japan for the funeral of his long-lost love, a tough French detective learns that he also has a teenage daughter and that her life is in danger from the Yakuza.",
    "2001_163": "Life at the car wash is a place where anything can and does happen to two friends (Dr. Dre and Snoop Dogg) trying to earn money to pay their rent.",
    "2001_164": "Brutal gangster Don Logan recruits \"retired\" safecracker Gal for one last job, but it goes badly for both of them.",
    "2001_165": "A woman spirals out of control while trying to keep her son from being found culpable in a murder investigation.",
    "2001_166": "The love story that transformed Juana, Queen of Spain, into Juana \"the Mad\". A story of passions, lies and jealousy with a political motive behind.",
    "2001_167": "After an Afghanistan-born woman who lives in Canada receives a letter from her suicidal sister, she takes a perilous journey through Afghanistan to try to find her.",
    "2001_168": "At age 42, Rafael Belvedere is having a crisis. He lives in the shadow of his father, he feels guilty about rarely visiting his aging mother, his ex-wife says he doesn't spend enough time with their daughter and he has yet to make a ...See moreAt age 42, Rafael Belvedere is having a crisis. He lives in the shadow of his father, he feels guilty about rarely visiting his aging mother, his ex-wife says he doesn't spend enough time with their daughter and he has yet to make a commitment to his girlfriend. At his lowest point, a minor heart attack reunites him with Juan Carlos, a childhood friend, who helps Rafael to reconstruct his past and look at the present in new ways.  Written by Sujit R. VarmaSee less",
    "2001_169": "With only the plan of moving in together after high school, two unusually devious friends seek direction in life. As a mere gag, they respond to a man's newspaper ad for a date, only to find it will greatly complicate their lives.",
    "2001_17": "A highly advanced robotic boy longs to become \"real\" so that he can regain the love of his human mother.",
    "2001_170": "A young man gets embroiled in a war against vampires.",
    "2001_171": "Over 20 years after his death by a gunshot, Jimmy Bones comes back as a ghost to wreak revenge on those who killed him and to clean up his neighborhood.",
    "2001_172": "Various lives converge on an isolated island, all connected by an author whose novel has become inextricably entwined with his own life.",
    "2001_173": "In a coma, a cartoonist finds himself trapped within his own underground creation and must find a way to get back, while racing against his popular but treacherous character, Monkeybone.",
    "2001_174": "A football star jailed for assault leads a group of inmates in a match against prison guards.",
    "2001_175": "1936, China. Ruth Harkness has come to settle the affairs of her husband, Bill, who died while observing the rare and unstudied panda bear. His journal describes the panda as shy and docile, while great white hunter Dak Johnson describes ...See more1936, China. Ruth Harkness has come to settle the affairs of her husband, Bill, who died while observing the rare and unstudied panda bear. His journal describes the panda as shy and docile, while great white hunter Dak Johnson describes them as ferocious beasts. This intrigues her, and she sets off to retrace Bill's steps and save the pandas from Johnson. She encounters many obstacles, both natural and created by Johnson, and sees many scenic vistas before encountering the pandas.  Written by Jon Reeves See less",
    "2001_176": "Prompted by the death of his father and the grief of his mother, a man recalls the story of how they met in flashback.",
    "2001_177": "A young man romantically pursues his masochistic piano teacher.",
    "2001_178": "When her husband goes missing at the beach, a female professor begins to mentally disintegrate as her denial of his disappearance becomes delusional.",
    "2001_179": "After Carlos - a 12-year-old whose father has died in the Spanish Civil War - arrives at an ominous boys' orphanage, he discovers the school is haunted and has many dark secrets which he must uncover.",
    "2001_18": "A woman who lives in her darkened old family house with her two photosensitive children becomes convinced that the home is haunted.",
    "2001_180": "Megiddo is a supernatural ride into a world teetering on the edge of the Apocalypse. It follows the rise of a Machiavellian leader bent on amassing the armies of the world for the battle of Armageddon while calamities of Biblical ...See moreMegiddo is a supernatural ride into a world teetering on the edge of the Apocalypse. It follows the rise of a Machiavellian leader bent on amassing the armies of the world for the battle of Armageddon while calamities of Biblical proportions pummel the Earth. Though both prequel and sequel to The Omega Code, Megiddo works also as a stand alone story for anyone who missed its predecessor. For at its emotional core, Megiddo is the Caine and Abel story of the two men enamoured with the same woman, raised as brothers, who grew up to find themselves pitted against each other over the fate and souls of the entire world.  Written by AnonymousSee less",
    "2001_181": "A man marries an heiress for her money even though he is actually in love with her friend.",
    "2001_182": "Three children accidentally get turned into fish after drinking a potion made by an eccentric scientist. The kids end up in the sea, with one problem. They must find and drink the antidote within 48 hours, or forever remain as fish.",
    "2001_183": "Two aspiring boxers, lifelong friends, get involved in a money-laundering scheme through a low-level organized crime group.",
    "2001_184": "She is almost deaf and he lip-reads. He is an ex-convict. She wants to help him. He thinks no one can help except himself.",
    "2001_185": "A young Scottish woman joins the French Resistance during World War II to rescue her Royal Air Force boyfriend who is lost in France.",
    "2001_186": "A young singer dates a disc jockey who helps her get into the music business, but their relationship become complicated as she ascends to super stardom.",
    "2001_187": "A \"normal\" guy who is married to a hot actress gets worried that she is involved with her costar. This worry turns into jealousy and causes problems in their relationship. This is a story about trust and a comedy about the actions between men and women.",
    "2001_188": "Bubble Boy's been in a bubble all his life due to no immune system. A cute blonde girl befriends BB. Her boyfriend proposes and BB decides to travel across USA to Niagara Falls to stop the wedding.",
    "2001_189": "Love is complex and relationships deteriorate.",
    "2001_19": "Los Angeles police officer Brian O'Conner must decide where his loyalty really lies when he becomes enamored with the street racing world he has been sent undercover to destroy.",
    "2001_190": "Bosnia and Herzegovina during 1993 at the time of the heaviest fighting between the two warring sides. Two soldiers from opposing sides in the conflict, Nino and Ciki, become trapped in no man's land, whilst a third soldier becomes a living booby trap.",
    "2001_191": "John Groberg, a farm kid from Idaho Falls, crosses an ocean to become a missionary in the remote and exotic Tongan islands during the 1950s.",
    "2001_192": "A Mexican-American master chef and father to three daughters has lost his taste for food, but not for life.",
    "2001_193": "A shy advertising employee meets his dream girl on the El train, but doesn't remember to get her phone number, resulting in an all-out search for the mystery girl",
    "2001_194": "A co-ed is caught between the world of the living and the dead.",
    "2001_195": "The Biblical prophecy of Armegeddon begins when the Rapture instantly takes all believers in Christ from the Earth. A reporter left behind learns that the Anti-Christ will soon take power.",
    "2001_196": "A young, gay student has a relationship with an older, successful businessman. The handsome playboy-businessman must choose between his comfortable, yet closeted straight life, or an honest, yet subversive life with the student.",
    "2001_197": "A gender-queer punk-rock singer from East Berlin tours the U.S. with her band as she tells her life story and follows the former lover/band-mate who stole her songs.",
    "2001_198": "Three years have passed since the tournament in France and the team formed the Boys always seem great team. When a rich businessman comes in, everything changed.",
    "2001_199": "The interlocking lives and loves of six New Yorkers.",
    "2001_2": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
    "2001_20": "A self-indulgent and vain publishing magnate finds his privileged life upended after a vehicular accident with a resentful lover.",
    "2001_200": "\"The Man\" is baffled by a chill hero's invincible weapon: gibberish.",
    "2001_201": "A man shuffles through a dream meeting various people and discussing the meanings and purposes of the universe.",
    "2001_202": "After being denied a promotion at the university where she teaches, Doctor Lily Penleric, a brilliant musicologist, impulsively visits her sister, who runs a struggling rural school in Appalachia. There she stumbles upon the discovery of ...See moreAfter being denied a promotion at the university where she teaches, Doctor Lily Penleric, a brilliant musicologist, impulsively visits her sister, who runs a struggling rural school in Appalachia. There she stumbles upon the discovery of her life - a treasure trove of ancient Scots-Irish ballads, songs that have been handed down from generation to generation, preserved intact by the seclusion of the mountains. With the goal of securing her promotion, Lily ventures into the most isolated areas of the mountains to collect the songs and finds herself increasingly enchanted - not only by the rugged purity of the music, but also by the raw courage and endurance of the local people as they carve out meaningful lives against the harshest conditions. It is not, however, until she meets Tom - a handsome, hardened war veteran and talented musician - that she's forced to examine her motivations. Is the \"Songcatcher,\" as Tom insists, no better than the men who exploit the people and extort their land?  Written by Sujit R. VarmaSee less",
    "2001_203": "After more than forty years apart, Andreas and Claire embark on an affair as reckless and intense as when they were young lovers. Widowed musician Andreas decides to get back in touch with his one great love, Claire, who is still married ...See moreAfter more than forty years apart, Andreas and Claire embark on an affair as reckless and intense as when they were young lovers. Widowed musician Andreas decides to get back in touch with his one great love, Claire, who is still married to her first husband, John. Andreas and Claire find that the connection they shared when they were young is still there and they soon become involved in a rekindled love affair. However, this time around, there are more complications, including the possibilities of ill health and death, as well as the impact their relationship might have on John.  Written by Sujit R. VarmaSee less",
    "2001_204": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a man in a large rabbit suit who manipulates him to commit a series of crimes.",
    "2001_205": "A failed London musician meets once a week with a woman for a series of intense sexual encounters to get away from the realities of life. But when he begins inquiring about her, it puts their relationship at risk.",
    "2001_206": "Under the leadership of a small-time bank robber, British inmates hatch a plan to escape by staging a musical.",
    "2001_207": "A dentist finds himself a murder suspect after a sexy patient seduces him & steals all of the drugs from his practice.",
    "2001_208": "A retelling of Sir Ernest Shackleton 's ill-fated expedition to Antarctica in 1914-1916, featuring new footage of the actual locations and interviews with surviving relatives of key expedition members, plus archived audio interviews with ...See moreA retelling of Sir Ernest Shackleton 's ill-fated expedition to Antarctica in 1914-1916, featuring new footage of the actual locations and interviews with surviving relatives of key expedition members, plus archived audio interviews with expedition members, and a generous helping of the footage and still photos shot on the expedition.  Written by Jon Reeves See less",
    "2001_209": "The friendship of two men becomes tested when they both fall for the same woman.",
    "2001_21": "A look at the top-secret, high-tech espionage war going on between cats and dogs, of which their human owners are blissfully unaware.",
    "2001_210": "A nurse eavesdrops with a friend on a cell phone conversation that describes a bank heist. She and the friend then conspire to blackmail the robbers for two million dollars.",
    "2001_211": "Mike is romantic and persistent, a social worker at a psychiatric clinic who falls for a new intern. Gabriela is passionate; she's also engaged; although her love for her fiance Patrick seems more fraternal than erotic, she has an ...See moreMike is romantic and persistent, a social worker at a psychiatric clinic who falls for a new intern. Gabriela is passionate; she's also engaged; although her love for her fiance Patrick seems more fraternal than erotic, she has an overwhelming sense of obligation to marry him. Mike gets dubious counsel from a colleague, Douglas, who's seems to have a new relationship weekly, and from his unhappy brother. She gets advice from her supervisor, whose long-term marriage ended badly. Gabriela can't seem to say no to Mike, except when he asks her to end her engagement. She heads home to Mexico to introduce Patrick to her family. What's Mike to do? Will anything change her mind?  Written by See less",
    "2001_212": "A macho man in a family on the eve of deer-hunting season must deal with the eldest son's curse of never having bagged a buck.",
    "2001_213": "Quick-witted, well-read cultured types revolve around each other in a delightful potpourri of theatre, romanticism and theft.",
    "2001_214": "A prison inmate with a green thumb goes on to compete in a national gardening competition. Based on a true story.",
    "2001_215": "Michèle, 20 years old, feels terrible after having broken up with her boy-friend. She meets Francois, who's a veterinarian and jewish. Michèle decides to convert into Judaism because she has to believe in something, if not in someone.See moreMichèle, 20 years old, feels terrible after having broken up with her boy-friend. She meets Francois, who's a veterinarian and jewish. Michèle decides to convert into Judaism because she has to believe in something, if not in someone.  Written by anonymousSee less",
    "2001_216": "A family falls into poverty during the Depression.",
    "2001_217": "King Arthur and his Knights of the Round Table embark on a surreal, low-budget search for the Holy Grail, encountering many, very silly obstacles.",
    "2001_218": "Zaza is a 31-year old Israeli bachelor, handsome and intelligent, and his family wants to see him married. But tradition dictates that Zaza has to choose a young virgin. She must be beautiful and from a good family, preferably rich. Zaza's...See moreZaza is a 31-year old Israeli bachelor, handsome and intelligent, and his family wants to see him married. But tradition dictates that Zaza has to choose a young virgin. She must be beautiful and from a good family, preferably rich. Zaza's parents, Yasha and Lily drag Zaza to meet potential brides and their families. Zaza has no choice. He plays along with his family, advocates of the suffocating traditions of their Georgian Jewish heritage. But Zaza always manages to somehow get out of being engaged. What his parents don't know is that Zaza is already in love. Judith is sensuous, strong and intriguing. She's also a divorcee with a 6-year-old daughter. So Zaza has kept Judith a secret from his family. He will have to choose between respect of the strict confines of family and tradition, or the love of his life.  Written by AnonymousSee less",
    "2001_219": "Two worlds collide when an eccentric genius falls in love with a strong-willed society beauty.",
    "2001_22": "A young linguist named Milo Thatch joins an intrepid group of explorers to find the mysterious lost continent of Atlantis.",
    "2001_220": "Traces the birth and failure of new media company govWorks.com.",
    "2001_221": "Get a chance to see NSYNC perform on your television screen in their own concert film.",
    "2001_222": "When his long-time disappeared father is entering his life again, Jean-Luc, a successful doctor, has no option but to face his own life story. Will he ever be able to forget and forgive?",
    "2001_223": "Carman must enter the boxing ring once again. Even though the doctor has advised him against it, he picks up his gloves for one last fight, for his father, for his church, for his love, and for his life.",
    "2001_224": "A young man struggles with his desire to study art when his family thinks he's headed for premed studies. Conflicts between Filipino traditions and expectations vs. personal dreams in the contemporary world erupt at his sister's debut.",
    "2001_225": "When his mother, who has sheltered him his entire 40 years, dies, Elling, a sensitive, would-be poet, is sent to live in a state institution. There he meets Kjell Bjarne, a gentle giant and female-obsessed virgin in his 40s. After two ...See moreWhen his mother, who has sheltered him his entire 40 years, dies, Elling, a sensitive, would-be poet, is sent to live in a state institution. There he meets Kjell Bjarne, a gentle giant and female-obsessed virgin in his 40s. After two years, the men are released and provided with a state-funded apartment and stipend with the hope they will be able to live on their own. Initially, the simple act of going around the corner for groceries is a challenge. Through a friendship born of desperate dependence, the skittish Elling and the boisterous, would-be lover of women, Kjell Bjarne, discover they can not only survive on the outside, they can thrive. But as their courage grows, the two find oddball ways to cope with society, striking up the most peculiar friendships in the most unlikely places.  Written by Sujit R. VarmaSee less",
    "2001_226": "A 15-year-old Long Island boy loses everything and everyone he knows, soon becoming involved in a relationship with a much older man.",
    "2001_227": "Tensions rise within an asbestos cleaning crew as they work in an abandoned mental hospital with a horrific past that seems to be coming back.",
    "2001_228": "The people of a small village in Victorian India stake their future on a game of cricket against their ruthless British rulers.",
    "2001_229": "In Nazi occupied Czechoslovakia, a childless couple agree to hide a Jewish friend at great personal risk of discovery and execution.",
    "2001_23": "A poet falls for a beautiful courtesan whom a jealous duke covets.",
    "2001_230": "A successful computer engineer meets a stripper in a cafe. He offers her $10000 and she offers 3 days and nights of no penetration in Vegas.",
    "2001_231": "The Bank is a thriller about banking, corruption and alchemy. Read more: Synopsis",
    "2001_232": "The epic tale of King Asoka's life is recounted here.",
    "2001_233": "College and high school serve as the backdrop for two stories about dysfunction and personal turmoil.",
    "2001_234": "7 guys from Paris' suburbs like challenges like climbing tall buildings and doing parkour - especially with cops/flics chasing them. When a kid fan urgently needs a heart the Yamakasis try to find a way.",
    "2001_235": "Two businesswomen bond and reveal their inner natures while getting carried away on a revenge attack against an accused rapist.",
    "2001_236": "A young Jewish man develops a fiercely anti-Semitic philosophy. Based on the factual story of a K.K.K. member in the 1960s who was revealed to be Jewish by a New York Times reporter.",
    "2001_237": "Florence and Nicolas live happily together. Until Nicolas' sister points them to a contest in which they win the first prize; an all-expenses-paid wedding at Niagara Falls.",
    "2001_238": "In pre-Revolutionary France, a young aristocratic woman left penniless by the political unrest in the country, must avenge her family's fall from grace by scheming to steal a priceless necklace.",
    "2001_239": "An unemployed man finds his life sinking more and more into trouble as he hides his situation from his family and friends.",
    "2001_24": "Dolittle must save a forest and a bear's life.",
    "2001_240": "During Napoleon's exile on St. Helena, some loyalists hire a look-alike to swap places with the deposed Emperor. While the impostor lives in luxury on the island, the real Napoleon returns to Paris in order to retake the throne.",
    "2001_241": "During the French Revolution, a Scottish aristocrat and her former lover, the Duke of Orleans, find themselves on opposite sides of the conflict.",
    "2001_242": "Benoit Jacquot reinvents the way we view opera in this magnificent production of Puccini's story of Tosca's love for the painter Cavaradossi and the intervention of Scarpia.",
    "2001_243": "As three generations of a family in a small Texas town gather for a funeral, we learn the hilarious, sad, trashy truth of their \"Sordid Lives.\"",
    "2001_244": "College freshman Krishna Reddy, who has never cared for his Indian-American cultural heritage, looks forward to a new life on campus but is surprised to find that he has been assigned Indian roommates. Through his new experiences, he ...See moreCollege freshman Krishna Reddy, who has never cared for his Indian-American cultural heritage, looks forward to a new life on campus but is surprised to find that he has been assigned Indian roommates. Through his new experiences, he struggles to understand the side of himself he has always turned his back on in order to fit in.  Written by AnonymousSee less",
    "2001_245": "Raj Singh Puri is best friends with L.K. Malhotra who is in turn younger brother to J.K. Malhotra. The brothers are business tycoons and Raj works in their company. Raj is father to three young daughters, the first one gets married through...See moreRaj Singh Puri is best friends with L.K. Malhotra who is in turn younger brother to J.K. Malhotra. The brothers are business tycoons and Raj works in their company. Raj is father to three young daughters, the first one gets married through arrangement but the second one marries her lover. After a few weeks at her in-laws, the second daughter returns home asking for divorce. After this Raj and her last daughter become strictly against love and relationships. All this changes when Isha (the third daughter) falls in love with the heir to the Malhotra empire, Ronit, L.K. Malhotra's son. The ask for Raj's blessing but he bluntly refuses and Isha understandingly shuns Ronit and Raj arranges for Ronit to be married to the daughter of another tycoon. Ronit is unhappy and makes Raj realize that his fiance's family is not right for them and Raj approaches the Malhotras to break off the engagement however J.K. Malhotra shuns him by calling him poor and small. The other Malhotras join forces to make J.K. to realize his mistake and Ronit is finally married to Isha.  Written by gavin@sunny_deol2009@yahoo.comSee less",
    "2001_246": "A young refugee traveling from Russia to America in search of her lost father falls for a gypsy horseman.",
    "2001_247": "A teacher meets a woman who turns out to be a thief and they introduce each other to new things.",
    "2001_248": "\"All Over The Guy\" is a contemporary romantic comedy about the quest to find the \"one\" when \"the one\" doesn't know he's the \"one.\" It explores the unlikely pairing of two 20-somethings thrown together by their respective best friends in ...See more\"All Over The Guy\" is a contemporary romantic comedy about the quest to find the \"one\" when \"the one\" doesn't know he's the \"one.\" It explores the unlikely pairing of two 20-somethings thrown together by their respective best friends in hopes of igniting their own romance. They do everything they can to NOT fall in love, but finally they overcome the dysfunction of their parents and surrender to their hearts.  Written by AnonymousSee less",
    "2001_249": "As four lifelong friends, Will, Bryan, Matt, and Corey, are on the road trip they've been planning their whole lives, Corey's beloved grandfather unexpectedly dies. When going to claim Corey's inheritance, the gang meets Matt's beautiful ...See moreAs four lifelong friends, Will, Bryan, Matt, and Corey, are on the road trip they've been planning their whole lives, Corey's beloved grandfather unexpectedly dies. When going to claim Corey's inheritance, the gang meets Matt's beautiful cousin Jessie and embark on a hilarious, extreme sports-filled adventure.  Written by doggansSee less",
    "2001_25": "Amelie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love.",
    "2001_250": "A man proposes to a woman he's met once, all in the same day.",
    "2001_251": "Two enamoured strangers look for a warm place in a cold world.",
    "2001_252": "",
    "2001_253": "A young Hungarian girl struggles to find her place in the world when she's reunited with her parents in the USA years after she was left behind during their flight from the communist country in the 1950s.",
    "2001_254": "An imaginary woman recollects the painful experience of adultery to a storyteller.",
    "2001_255": "Swedish composer/conductor Martin and concertmaster Barbara fall in love. After their divorces, they're happily married. While composing an opera, Martin is diagnosed with Alzheimer's. It slowly changes him.",
    "2001_256": "The lives of four women from different places are the victims of male chauvinism and marital abuse. They decide to fight for their rights and dignity against the social norms and injustice.",
    "2001_257": "The sheriff of a small Utah community searches for a serial killer.",
    "2001_258": "In 2000, a small town hosts The British Hairdressing Championship, where a former 2-time winner, his son, his run-away wife and his runaway wife's lady lover reside (not all on speaking terms).",
    "2001_259": "When ordered by his father to avenge the death of his older brother, a young man questions the tradition of violence between two rival families.",
    "2001_26": "160 elite U.S. soldiers drop into Somalia to capture two top lieutenants of a renegade warlord and find themselves in a desperate battle with a large force of heavily-armed Somalis.",
    "2001_260": "A waitress falls for a handsome customer who seduces her, her two sisters, her brother, and her brother's girlfriend.",
    "2001_261": "A cinematic portrait of various gay Orthodox Jews who struggle to reconcile their faith and their sexual orientation.",
    "2001_262": "Two sisters confront their sexual attitudes and experiences while on a family holiday.",
    "2001_263": "A ragtag group of youngsters band together after the American Civil War to form the Texas Rangers, a group charged with the dangerous, ruthless duty of cleaning up the West.",
    "2001_264": "Two Latina sisters work as cleaners in a downtown office building, and fight for the right to unionize.",
    "2001_265": "A pack of naïve teenagers conspire to murder a mutual friend, whose aggressive demeanor has proved too much.",
    "2001_266": "Ruby Weaver, a woman from New York, believes she has found the man of her dreams. And Sam Deed is really such, except for he assures that he came from the future.",
    "2001_267": "A cave-dwelling man sets out to track down the killer of a homeless boy, and bring him to justice.",
    "2001_268": "Grieving after the death of her young son Joseph, novelist Betty Fisher enters a dark depression. Hoping to bring her out of it, her mother Margot arranges to kidnap another child, Jose, to replace the son Betty lost. Although she knows ...See moreGrieving after the death of her young son Joseph, novelist Betty Fisher enters a dark depression. Hoping to bring her out of it, her mother Margot arranges to kidnap another child, Jose, to replace the son Betty lost. Although she knows it's wrong, Betty accepts Jose as her new son. Meanwhile, Jose's mother Carole is looking for her son with the help of her boyfriend Francois and some of his criminal cohorts.  Written by Sujit R. VarmaSee less",
    "2001_269": "In the waning months of World War II, a man and his wife are mistakenly identified as Jews by their anti-Semitic Brooklyn neighbors. Suddenly the victims of religious and racial persecution, they find themselves aligned with a local Jewish...See moreIn the waning months of World War II, a man and his wife are mistakenly identified as Jews by their anti-Semitic Brooklyn neighbors. Suddenly the victims of religious and racial persecution, they find themselves aligned with a local Jewish immigrant in a struggle for dignity and survival.  Written by AnonymousSee less",
    "2001_27": "Mia Thermopolis has just found out that she is the heir apparent to the throne of Genovia. With her friends Lilly and Michael Moscovitz in tow, she tries to navigate through the rest of her sixteenth year.",
    "2001_270": "At a popular NYC Italian restaurant on a dramatic, busy evening, there are 2 gangsters, cop detective, food-critic, ex bookmaker owner, his chef son, indebted gambler sous-chef etc.",
    "2001_271": "It's a high-flying adventure when Louie, a mute trumpeter swan, is given the gift of a trumpet, and finds his voice.",
    "2001_272": "The tempestuous love story between Fernando, an older man who has recently returned to his crime-ridden drug capitol hometown of Medellin, Colombia and the gun-happy 16-year-old assassin Alexis, who murders all too easily. When Alexis ...See moreThe tempestuous love story between Fernando, an older man who has recently returned to his crime-ridden drug capitol hometown of Medellin, Colombia and the gun-happy 16-year-old assassin Alexis, who murders all too easily. When Alexis himself is fatally gunned down, grief-stricken Fernando hunts for his young lover's killer in the Medellin slums, but instead encounters Wilmar, who bears an uncanny resemblance to Alexis.  Written by Sujit R. VarmaSee less",
    "2001_273": "A Nazi doctor, along with the Sonderkommando, Jews who are forced to work in the crematoria of Auschwitz against their fellow Jews, find themselves in a moral grey zone.",
    "2001_274": "A young man employed as a fluffer in the adult entertainment industry finds himself falling for a gay-for-pay porn star whose hedonistic lifestyle may lead them both to destruction.",
    "2001_275": "A 17-year-old girl has a troubled relationship with a 49-year-old man.",
    "2001_276": "A ruthless mob hit-man, has been living a new life in Canada as a Priest after faking his own death. However he must come out of hiding to avenge his brother's death.",
    "2001_277": "A true story that comically depicts the relationship between an ordinary woman and her three husbands, who live in the same house in a poor and arid small village of the Brazilian northeast.",
    "2001_278": "Various women struggle to function in the oppressively sexist society of contemporary Iran.",
    "2001_279": "Big Eden is a small, fictional northwestern Montana town.",
    "2001_28": "The children of secret-agent parents must save them from danger.",
    "2001_280": "Following the first Karmina, all the vampires need to take the special potion to be humans. The potion is made by Ghislain Chabot and sent to Transylvania for the others vampires. Chatbot's wife isn't a vampire yet and she wishes to be one...See moreFollowing the first Karmina, all the vampires need to take the special potion to be humans. The potion is made by Ghislain Chabot and sent to Transylvania for the others vampires. Chatbot's wife isn't a vampire yet and she wishes to be one. Ghislain doesn't want that, because of all the rules and responsibilities of being a vampire, so she throws Ghislain out of the house without the potion. Ghislain tries to get back in there to get the potion for the others with the help of Vlad. Meanwhile, Philippe comes to Montreal because they're running out of potion in Transylvania.  Written by Luc See less",
    "2001_281": "After a deathly car accident, Antonia starts dating her husband's friends and finds the truth about his life.",
    "2001_282": "A teenage girl travels to Paris in the 1970s trying to find out about her sister's suicide, and falls in love with her dead sister's boyfriend.",
    "2001_283": "Three old high school friends meet in a Michigan motel room to dissect painful memories from their past.",
    "2001_284": "An author works on a project on the subject of love, and, in the process, crosses paths with a former love in his life.",
    "2001_285": "A down-and-out businessman travels to a seaside town, where he meets a woman with unusual sexual powers.",
    "2001_286": "A light-hearted look at the life and career of porn star Ron Jeremy, from his devoted fanbase to his unlikely status as a sex symbol and his goal to achieve mainstream success.",
    "2001_287": "In a desolate and colorless landscape stands a dilapidated bathhouse run by a puffed-up blind man, his long-suffering wife, and their son Anton, who does all the work. He's lonely and unsophisticated, and he falls in love with the ...See moreIn a desolate and colorless landscape stands a dilapidated bathhouse run by a puffed-up blind man, his long-suffering wife, and their son Anton, who does all the work. He's lonely and unsophisticated, and he falls in love with the beautiful Eva, who comes to bathe with her father. When Eva and her father lose their home, they come to the bathhouse to stay, but bits of the ceiling fall on the old man and he dies. Eva blames Anton, and she seems to seek the arms of the brute Gregor. Can Anton win back her heart, get the bathhouse through a rigorous government inspection, and help keep his parents employed? Waiting out there somewhere is the paradise isle of Tuvalu.  Written by See less",
    "2001_288": "A newcomer to a posh girls boarding school discovers that her two senior roommates are lovers.",
    "2001_289": "Pauline is a 'little girl of 66 years old'. She is intellectually disabled and been cared after by her sister Martha. When Martha dies, her two younger sisters, Paulette and Cecile have to make a decision on the best place for Pauline to ...See morePauline is a 'little girl of 66 years old'. She is intellectually disabled and been cared after by her sister Martha. When Martha dies, her two younger sisters, Paulette and Cecile have to make a decision on the best place for Pauline to be looked after. Neither of them is ready to take care of her. Paulette has a shop to look after and Cecile has her Albert. But according to Martha's last will, her fortune will only be divided in three equal parts if one of the sisters looks after Pauline. If they decide to take her to an institution, Pauline will be the only heir.  Written by AnonymousSee less",
    "2001_29": "A man tries to transport an ancient gun called The Mexican, believed to carry a curse, back across the border, while his girlfriend pressures him to give up his criminal ways.",
    "2001_290": "The ethereally beautiful Vicky recalls her romances with Hao Hao and Jack in the neon-lit clubs of Taipei.",
    "2001_291": "Three young men pursue three beautiful women across London.",
    "2001_292": "A retired gay anthropologist revisits the native cultures he studied in his youth.",
    "2001_293": "A Spanish coming of age story focusing on the antics of two 17 year olds, who have a posh beach house almost all to themselves one summer. This is also a summer of sexual awakenings.",
    "2001_294": "Two best friends grow up on the Isle of Wight and in Brighton in the 1970s and 1980s.",
    "2001_295": "A tale revolving around the carefree and bon-vivant, Felix, who is content living with his boyfriend, Daniel in the town of Dieppe in Northern France. When Felix is laid off from his job, he decides to take a road trip to Marseilles to ...See moreA tale revolving around the carefree and bon-vivant, Felix, who is content living with his boyfriend, Daniel in the town of Dieppe in Northern France. When Felix is laid off from his job, he decides to take a road trip to Marseilles to track down the father he's never met. Backpack in tow, Felix sets out walking, hitching and borrowing cars to get to the south of France. Springtime is budding, nature is at its best, and some unique characters await Felix along the dirtroads and byways of the French countryside.  Written by Sujit R. VarmaSee less",
    "2001_296": "Details the deeply rooted musical friendship between Jerry Garcia and David Grisman. Includes live Garcia/Grisman performances as well as rare and unique personal moments from the studio, backstage and home-style jam sessions. Interviews ...See moreDetails the deeply rooted musical friendship between Jerry Garcia and David Grisman. Includes live Garcia/Grisman performances as well as rare and unique personal moments from the studio, backstage and home-style jam sessions. Interviews with friends and family are intertwined with live and archival elements, creating an intimate portrait of Jerry and David's relationship. Traces the Garcia/Grisman connection from their earliest days as budding bluegrassers, through the creation of the legendary Old & In the Way in the mid '70s, to the Garcia/Grisman Band that highlighted their love of traditional acoustic music in the '90s.  Written by See less",
    "2001_297": "The true story of controversial leader of independent Congo, Patrice Lumumba.",
    "2001_298": "Mathieu, 18, spends the summer at his mother's summer house, in Brittany. On the beach, he meets Cedric, a boy his age. A love-story begins between the two boys.",
    "2001_299": "A newspaper photographer researches an 1873 double homicide and finds her own life paralleling that of a witness who survived the tragic ordeal.",
    "2001_3": "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, 2 monsters realize things may not be what they think.",
    "2001_30": "A covert counter-terrorist unit called Black Cell led by Gabriel Shear wants the money to help finance their war against international terrorism, but it's all locked away. Gabriel brings in convicted hacker Stanley Jobson to help him.",
    "2001_300": "This movie is a biopic of Alma Mahler, the wife of composer Gustav Mahler (as well as Walter Gropius and Franz Werfel), and the mistress of Oskar Kokoschka.",
    "2001_301": "Olof lives alone on a farm after the death of his mother. Unable to read and write, he is dependent on his younger friend, Erik. Olof advertises for a housekeeper, and Ellen arrives. During summer Olof's heart and Erik's desires develops.",
    "2001_302": "Harvey, a neurotic private investigator and wannabe crime writer, gets asked to marry his best friend's mistress.",
    "2001_303": "Will the 30 y.o. Hlynur ever move out of his mother's apartment in Reykjavík? Social welfare keeps him passive but things change when his mother's Spanish friend, Lola, arrives and stays through Xmas and New Year's Eve.",
    "2001_304": "A TV program selects people at random to kill one another for fame and their freedom.",
    "2001_305": "Set on the last day of camp, in the hot summer of 1981, a group of counselors try to complete their unfinished business before the day ends.",
    "2001_306": "A crucified body dated back to the first century A.D is uncovered at an ancient cave in Jerusalem. Trouble ensues as word spreads.",
    "2001_307": "Miguel Pinero's creative and turbulent life was cut short at the age of forty. A Tony Award nominee who did time at Sing-Sing, a volatile urban poet whose work is recognized as a precursor to rap and hip-hop, and a writer of hit TV shows.",
    "2001_308": "Documentary look at the effects of globalization on Jamaican industry and agriculture.",
    "2001_309": "A watch salesman meets a young woman soon leaving for Paris and becomes infatuated, so he begins to change all the clocks in Taipei to Paris time.",
    "2001_31": "Retiring CIA agent Nathan Muir recalls his training of Tom Bishop while working against agency politics to free him from his Chinese captors.",
    "2001_310": "How, thanks to what's known as the \"Butterfly theory\" (a random series of unlinked events), can a young woman and a young man meet ?",
    "2001_311": "A streetwise young man becomes a bodyguard to score quick cash. He befriends a disillusioned mercenary determined to begin life anew. They find themselves working together to foil an assassination attempt, but their partnership can't last.",
    "2001_312": "A widower takes an offer to screen girls at a special audition, arranged for him by a friend to find him a new wife. The one he fancies is not who she appears to be after all.",
    "2001_313": "A notorious B-movie director tries for a comeback by seeking out the film rights to the life story of a serial killer who wants his biography film to be a musical.",
    "2001_314": "Chopper tells the intense story of Mark \"Chopper\" Read, a legendary criminal who wrote his autobiography while serving a jail sentence in prison. His book, \"From the Inside\", upon which the film is based, was a best-seller.",
    "2001_315": "How important is the truth when falling in love? Bella is a Manhattan cafe waitress, about to turn 35, stuck in a long-term affair going nowhere. Paul is a widower, facing old age alone. Bella's mother sets her up with Bruno, a novelist/...See moreHow important is the truth when falling in love? Bella is a Manhattan cafe waitress, about to turn 35, stuck in a long-term affair going nowhere. Paul is a widower, facing old age alone. Bella's mother sets her up with Bruno, a novelist/cabbie who likes to bed-hop and whose ex-wife expects their two children to stay with him for awhile. While Bruno learns some maturity from his young daughter, Paul answers a personals ad placed by a \"widow, 60.\" The two couples - along with one of Paul's older pals and a Jungian stripper - sort out how to initiate a relationship these days, what to do when someone you like disappoints you, and when to tell the truth.  Written by See less",
    "2001_316": "The life of Fanny Brice, famed comedienne and entertainer of the early 1900s. We see her rise to fame as a Ziegfeld girl, subsequent career, and her personal life, particularly her relationship with Nick Arnstein.",
    "2001_317": "Two girls thrown together by their boyfriends' violence accidentally kill one of them.",
    "2001_318": "A seventeen-year-old country boy working in Beijing as a courier has his bicycle stolen, and finds it with a schoolboy his age.",
    "2001_319": "With the brilliant Vietnamese summer as a setting Vertical Ray of the Sun is beautiful from beginning to end. The plot centres around three sisters, two of whom are happily married (or so it appears). The youngest sister is single and ...See moreWith the brilliant Vietnamese summer as a setting Vertical Ray of the Sun is beautiful from beginning to end. The plot centres around three sisters, two of whom are happily married (or so it appears). The youngest sister is single and living with her cute older brother, whom she is desperately in love with. A second sister is married to a man who has another woman and child elsewhere whom he loves just as much as his wife -with a few conditions, she agrees to carry on with the marriage. The third sister and her husband are overjoyed to discover she is pregnant, and though he is tempted, her husband remains loyal to her. Charming, slow-paced, face value, family saga film.  Written by K WedgwoodSee less",
    "2001_32": "Elle Woods, a fashionable sorority queen, is dumped by her boyfriend. She decides to follow him to law school. While she is there, she figures out that there is more to her than just looks.",
    "2001_320": "A thirty-years traveling diamond salesman must mentor a brash young replacement when his company downsizes him.",
    "2001_321": "A soon-to-be groom learns that he may have contracted HIV. Waiting a full seven days for the test results turns out to be the most hectic week of his life.",
    "2001_322": "Every summer war games are played out between the rich kids and the not-so-rich. To assure a possible win, war leader Marc decided to add another tactic to these games--terrorism.",
    "2001_323": "Nene & Angel and their accomplice Cuervo participate in a botched bank robbery in 1965 Buenos Aires, then hide out from the police in Uruguay while the gang breaks down.",
    "2001_324": "Two very different hitmen find themselves to be in each other's way. They use all their skill to solve the problem.",
    "2001_325": "A homage to Bruce Weber's Favourite things, these being mixing film, photography and classic movies. With portraits of a lesbian jazz singer and a 16 year old wrestler.",
    "2001_326": "A comedy about a couple (Hugh Laurie and Joely Richardson) who are trying to conceive a child.",
    "2001_327": "The tale of 4 gay African-American friends in L.A: shy, virginal photographer Marcus, outgoing Lothario Hill, hot-to-trot rich kid newbie Dante, and fabulous drag diva Crystal.",
    "2001_328": "Partners in crime Jai and Veeru set their next target on a rich businessman, Rai Bahadur. Things turn hilarious when both of them fall for his daughters.",
    "2001_329": "Varda films and interviews gleaners in France in all forms, from those picking fields after the harvest to those scouring the dumpsters of Paris.",
    "2001_33": "Four teens are tricked by Professor Oldman (Tim Curry) into visiting a haunted house for a school project.",
    "2001_330": "\"Go Tigers!\" is a rare behind-the-scenes chronicling of a remarkable season for the Massillon Tigers high school football team, played out in a small rustbelt town that draws its identity from football. During the course of the season, ...See more\"Go Tigers!\" is a rare behind-the-scenes chronicling of a remarkable season for the Massillon Tigers high school football team, played out in a small rustbelt town that draws its identity from football. During the course of the season, THREE YOUNG STARS emerge who are forced to carry the burden of the town and their teammates as they confront their uncertain future.  Written by AnonymousSee less",
    "2001_331": "When a girl is abducted by a vampire, a legendary bounty hunter is hired to bring her back.",
    "2001_332": "A film comprised of three interconnected vignettes that depict women at three stages of life in Iran. The first part centers on a young girl on her ninth birthday who is told that she can no longer play with the boys she had been playing ...See moreA film comprised of three interconnected vignettes that depict women at three stages of life in Iran. The first part centers on a young girl on her ninth birthday who is told that she can no longer play with the boys she had been playing with only the day before because she is now a woman. Told from the perspective of a 9-year-old girl who does not feel like or know what the word \"woman\" refers to, we see how devastatingly this affects both the girl and the boy with whom she had been friends. The second part is about a young woman who decides to enter a bicycle race against her husband's wishes. As first, the husband and then increasing numbers of men from her village ride beside her on horseback to convince her to return home. The race begins to symbolize a freedom that she desperately wants from the limitations that have been placed on her. Finally, the third part shows us an old woman who has come into some money and is now free to do what she wants. The way she chooses to use this freedom, however, makes one wonder just how free she is.  Written by Jonathan Beebe See less",
    "2001_333": "Ayurveda is science of life and art of healing; where body, mind and spirit are given equal importance. This voyage of thousands of miles across India and abroad takes you on a unique poetic journey, where we encounter remarkable men of ...See moreAyurveda is science of life and art of healing; where body, mind and spirit are given equal importance. This voyage of thousands of miles across India and abroad takes you on a unique poetic journey, where we encounter remarkable men of medicine or simply a villager who lives in harmony with nature. \"Hope is nature's way of enabling us to survive so that we can discover nature itself.\"  Written by AnonymousSee less",
    "2001_334": "A high school teacher in the 60s becomes an international spy and becomes involved in a plot to overthrow Fidel Castro.",
    "2001_335": "South Korean agents Ryu and Lee are tracking a female assassin from North Korea who has mysteriously disappeared. With new killings and the theft of a deadly bomb, time is running out to catch her.",
    "2001_336": "In a building site in present-day Tehran, Lateef, a 17-year-old Turkish worker is irresistibly drawn to Rahmat, a young Afghan worker. The revelation of Rahmat's secret changes both their lives.",
    "2001_337": "A non-glamorous portrayal of the lives of people who make their living at a strip club.",
    "2001_338": "A mismatched team of British Special Services agents led by an American must infiltrate, in disguise, a female-run Enigma factory in Berlin and bring back the decoding device that will end the war.",
    "2001_339": "A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psychic psychopath who can only be stopped by two teenagers and a group of psychics.",
    "2001_34": "A shallow man falls in love with a 300-pound woman because of her inner beauty.",
    "2001_340": "Thomas is a young agoraphobic man; he's afraid of coming to any kind of contact with other people, so he lives totally isolated in his apartment. The story takes place in the near future where everything can be done through computers, so ...See moreThomas is a young agoraphobic man; he's afraid of coming to any kind of contact with other people, so he lives totally isolated in his apartment. The story takes place in the near future where everything can be done through computers, so Thomas hasn't left his apartment for eight straight years. However, although his life seems complete, he misses human contact, so his psychoanalyst consults him to meet a woman through some on-line service. Is it possible for Thomas to fall in love with a woman? And if so, is he going to get out of his apartment for that woman?  Written by Chris Makrozahopoulos See less",
    "2001_341": "After being released from the hospital, the artist Jean Michel Basquiat wanders around Manhattan trying to sell art to make money and find a place to stay.",
    "2001_342": "A torrid affair between two women, a struggling artist and a flame-haired blues singer, upsets a man who has a thing for the girl.",
    "2001_343": "A bored young man meets with his former girlfriend, now a cabaret dancer and single mother, and soon finds himself falling back in love with her.",
    "2001_344": "Filmmaker Amir Bar-Lev follows two Czech Holocaust survivors, Jan Weiner and Arnost Lustig, as they revisit Terezin, a labor camp where Arnost was interned for five years and Jan's mother was murdered.",
    "2001_345": "Jean is a family man and factory worker who dreams of becoming a songwriter. Pinning his hopes on his teenage daughter, Marva, he takes her to singing contests in which the awkward and overweight girl struggles to belt out a tune. When ...See moreJean is a family man and factory worker who dreams of becoming a songwriter. Pinning his hopes on his teenage daughter, Marva, he takes her to singing contests in which the awkward and overweight girl struggles to belt out a tune. When Jean is suddenly fired because of cut backs, he is ashamed and even more desperate to have his daughter succeed. In a chance meeting Jean kidnaps the most famous pop star in the country and holds her hostage demanding to be heard by the music industry. Catching the attention of the media and the eyes of the nation, Jean and Marva realize that the show must go on until everyone is famous.  Written by Sujit R. VarmaSee less",
    "2001_346": "A young man harasses a homeless woman, another man protests, the police arrest both and the woman has to leave the country. What were their various story-lines leading up to this event?",
    "2001_347": "A traumatized member of an elite para-military police force falls for the sister of a female terrorist courier who died in front of him on duty.",
    "2001_348": "Josh has an offer to \"go perm\" at his employer and the first task is to mail 17 high priority letters....something that seems a little difficult to do.",
    "2001_349": "Jean is a clerk in a bank. His colleague Caron is a gambler and gives him the virus. In the casinos, Jean meets Jackie. Their love affair will follow their luck at the roulette.See moreJean is a clerk in a bank. His colleague Caron is a gambler and gives him the virus. In the casinos, Jean meets Jackie. Their love affair will follow their luck at the roulette.  Written by YepokSee less",
    "2001_35": "A movie publicist deals with the messy public split of his movie's co-stars while keeping reporters at bay while a reclusive director holds the film's print hostage.",
    "2001_350": "The only goal of an ageing Asian-American widow is to see her son and rebellious daughter (described as an American Born Confused Deshi or ABCD) married off to respectable Indian families.",
    "2001_351": "Adam Lewis finds himself unexpectedly stood up at his own wedding. Now, three years later, Adam cannot attend a wedding without becoming ill, much to the dismay of his new girlfriend, Holly. Adam's job is on the line when he is unable to ...See moreAdam Lewis finds himself unexpectedly stood up at his own wedding. Now, three years later, Adam cannot attend a wedding without becoming ill, much to the dismay of his new girlfriend, Holly. Adam's job is on the line when he is unable to sell the comic strip, \"Kreature Korner,\" to a single newspaper. At a lunch meeting, however, an insecure editor agrees to buy the strip on the condition that Adam serve as best man at his upcoming wedding. Despite the fact that he and Jimmy are veritable strangers, and despite his aversion to weddings, Adam succumbs to the arrangement in order to save his job. When Adam and Holly arrive in the small farm town of Grass Creek, Indiana, they discover that Jimmy has told everyone that he and Adam were best friends and roommates in college. And not only is the wedding threatened by the bride's ex-boyfriend, Adam cannot escape the feeling that he is reliving his own nightmare. His wedding phobia begins to rub off on Jimmy, and soon, Adam finds himself responsible for frightening Jimmy away from the altar. Eventually, the events surrounding the wedding put Adam and Holly's relationship to the test.  Written by AnonymousSee less",
    "2001_352": "A New York drug dealer is kidnapped, and his wife must try to come up with the money and drugs to free him from his abductors before Christmas.",
    "2001_353": "Where are we humans going? A film poem inspired by the Peruvian poet Cesar Vallejo. We meet people in the city. People trying to communicate, searching compassion and get the connection of small and large things.",
    "2001_354": "A gripping account of the prisoners uprising at the Nazi extermination camp of Sobibor in 1943.",
    "2001_355": "When 78 eligible bachelors from a small Minnesota town advertise for female companionship, women from 37 states and four foreign countries arrive, changing the men's lives forever.",
    "2001_356": "True story of the saga that was hoped to be the long-awaited justice brought to bear upon Augosto Pinochet, Chilean dictator from 1973 to 1990. In September 1998, Pinochet flew to London on a pleasure trip but experienced back pain and ...See moreTrue story of the saga that was hoped to be the long-awaited justice brought to bear upon Augosto Pinochet, Chilean dictator from 1973 to 1990. In September 1998, Pinochet flew to London on a pleasure trip but experienced back pain and underwent an operation in the London Clinic. Upon waking, he was arrested by Scotland Yard. Could it be that this was to become the first Latin American dictator to answer for crimes while serving as Head of State? After 500 days of house arrest, he nevertheless eventually returned unscathed to Chile, despite the compelling case built against him before & during this period by a young Spanish prosecutor, Carlos Castresana.  Written by Len MassaarSee less",
    "2001_357": "A dark tale of working-class life in Marseilles, a city in crisis. Interesting characters include a hard-bitten but compassionate fish market worker with a drug addicted daughter and a moody bartender with a shocking secret life.See moreA dark tale of working-class life in Marseilles, a city in crisis. Interesting characters include a hard-bitten but compassionate fish market worker with a drug addicted daughter and a moody bartender with a shocking secret life.  Written by AnonymousSee less",
    "2001_358": "A mom dying in Aberdeen, Scotland, asks her coke snorting, nympho, London lawyer daughter to get her estranged, alcoholic dad in Oslo, Norway, to Aberdeen. He's drunk at the airport, so they travel together by car and ferry.",
    "2001_359": "When a young Russian woman and her son leave Moscow to meet her fiance, who fails to show up, she declares political asylum.",
    "2001_36": "A white midwestern girl moves to Chicago, where her new boyfriend is a black teen from the South Side with a rough, semi-criminal past.",
    "2001_360": "Here is another Indian that also closely resembles another Hollywood movie. This story revolves around the lives of two look-alike sisters, who are brought up separately by their estranged parents, who had separated due to a ...See moreHere is another Indian that also closely resembles another Hollywood movie. This story revolves around the lives of two look-alike sisters, who are brought up separately by their estranged parents, who had separated due to a misunderstandings when the girls were little. The twins meet, find out about their backgrounds, and decide to switch places. One goes to live with the mother, while the second goes to live with the father. After doing so, they find out that their parents are still in love with each other, and they decide to bring them together and live as one big family. But the father, who believes that his wife was having an affair with another man; while the mother believes that she cannot return as she has been wronged by her husband and his sister. Will the twins succeed?  Written by Sumitra (corrected by Carrie)See less",
    "2001_361": "Turin at the end of the fifties: two brothers have emigrated there from Sicily and the older works very hard to let the younger study and free himself from poverty through culture. The boy however is not keen on school and would like to ...See moreTurin at the end of the fifties: two brothers have emigrated there from Sicily and the older works very hard to let the younger study and free himself from poverty through culture. The boy however is not keen on school and would like to begin to work. When after some time he gets his degree however things take a violent and dramatic turn......  Written by Salvatore santangelo See less",
    "2001_362": "Nicolas, a handsome, young waiter, is befriended by Frederic Delamont, a wealthy middle-aged businessman. Delamont, a man of power, influence and strictly refined tastes, is immediately smitten by Nicolas' charm. Lonely and phobic, ...See moreNicolas, a handsome, young waiter, is befriended by Frederic Delamont, a wealthy middle-aged businessman. Delamont, a man of power, influence and strictly refined tastes, is immediately smitten by Nicolas' charm. Lonely and phobic, Delamont offers Nicolas a lucrative job as his personal food taster. In spite of their differences, a close friendship begins to emerge between the two men. However, their bond of trust and admiration soon spirals downward into a dangerous game of deceit and obsession for which neither is prepared.  Written by Attitude FilmsSee less",
    "2001_363": "The traumatized survivors of a murderous bus hijacking come together and take a road trip to attempt to overcome their damaged selves. Meanwhile a serial killer is on the loose.",
    "2001_364": "While trying to help their widowed mother cope, each of four sisters begins to understand what is missing in their own lives and relationships, and the lessons they learn affect the entire family.",
    "2001_366": "French Canadians face execution after a revolt against British bureaucrats in Quebec.",
    "2001_367": "Simon (Noah Taylor) is an outcast from his Jewish community, because he claims that the devil talks to him, and he has the ability to put curses on crops. When Dovid (Stuart Townsend) asks the \"Squire\" (Rutger Hauer) to sell him some land ...See moreSimon (Noah Taylor) is an outcast from his Jewish community, because he claims that the devil talks to him, and he has the ability to put curses on crops. When Dovid (Stuart Townsend) asks the \"Squire\" (Rutger Hauer) to sell him some land so he can build a railway station, a ruthless businessman from the neighboring Gentile community uses Simon to find out who wants to buy the land, so he can \"persuade\" him otherwise.  Written by Rob HartillSee less",
    "2001_368": "With World War 2 looming, a prominent family in China must confront the contrasting ideas of traditionalism, communism and Western thinking, while dealing with the most important ideal of all: love and its meaning in society.",
    "2001_369": "Under the influence of signs and premonitions, a man allows himself to veer in and out of a love affair with his colleague.",
    "2001_37": "After his master dies, a peasant squire, fueled by his desire for food and glory, creates a new identity for himself as a knight.",
    "2001_370": "In May of 1997, Zubin Mehta conducts and Zhang Yimou directs Puccini's \"Turnadot\" in Florence. A year later, they stage nine performances in Beijing. This documentary focuses on the China production: a huge and elaborate set, hundreds of ...See moreIn May of 1997, Zubin Mehta conducts and Zhang Yimou directs Puccini's \"Turnadot\" in Florence. A year later, they stage nine performances in Beijing. This documentary focuses on the China production: a huge and elaborate set, hundreds of extras, three sets of principles, props and costumes matching the Ming Dynasty. Mehta, with his Indian roots and European training, revels in bringing disparate cultures together. Zhang wants the music to come through and anticipates the demands (and habits) of the Chinese audience. Rehearsals; production work; rain; talks with singers, crew, and local officials -- can it all come together? When the chorus is in full volume, no one sleeps.  Written by See less",
    "2001_371": "A young Nigerian man on the verge of being in an arranged marriage, suddenly questions his situation after an encounter with a stunning Latin woman, who is also about to be married.",
    "2001_372": "Two crooks with a fondness for old Hollywood B-movies convince a languages student to help them commit a robbery.",
    "2001_373": "A U.S. Marshal tracks a destructive clan of outlaws, while a government man claims that the Marshal is actually a ghost of his deceased self.",
    "2001_374": "Seymour's happy New York existence comes to a tragic end after he witnesses the murder of his mother, a renowned civil rights activist. When he finds a firearm in the home of his best friend, he embarks on a deranged quest for revenge.",
    "2001_375": "An artist with Tourette Syndrome falls in love with his best friend's pregnant girlfriend.",
    "2001_376": "An elite superhuman agent must stop a foreign military unit from seizing control of an ancient artifact that holds the key to ultimate power.",
    "2001_377": "A naive young man witnesses an escalation of violence in his small hometown following the arrival of a mysterious circus attraction.",
    "2001_378": "A middle-aged, down-and-out kickboxer, once contender for the heavyweight title, struggles to rebuild his shattered life as he makes his way back home to his lost love and his one last chance at redeeming his tortured soul.See moreA middle-aged, down-and-out kickboxer, once contender for the heavyweight title, struggles to rebuild his shattered life as he makes his way back home to his lost love and his one last chance at redeeming his tortured soul.  Written by MBSandlerSee less",
    "2001_379": "Documentary account of the AIDS crisis in Uganda.",
    "2001_38": "An aging thief hopes to retire and live off his ill-gotten wealth when a young kid convinces him into doing one last heist.",
    "2001_380": "In addition to declaring that Katharine's (Lynn Redgrave) head and heart line are hopelessly fused into one \"simian line\", eccentric palm reader/fortune-teller Arnita (Tyne Daly) makes a dire prediction: By the end of the year, one of the ...See moreIn addition to declaring that Katharine's (Lynn Redgrave) head and heart line are hopelessly fused into one \"simian line\", eccentric palm reader/fortune-teller Arnita (Tyne Daly) makes a dire prediction: By the end of the year, one of the couples present at a Halloween party will have broken up. But will it be Katharine and her much-younger boyfriend Rick (Harry Connick Jr.); her upstairs tenants Marta and Billy or new yuppie neighbors Sandra (Cindy Crawford) and Paul? Fueled by Arnita's prediction, each of the couples begins to drift apart in a sea of doubt and distrust. Can the \"divine\" intervention of two well-meaning ghosts (William Hurt and Samantha Mathis) keep these earthly conflicts from erupting into multiple self-fulfilling prophecies?  Written by AnonymousSee less",
    "2001_381": "When a bus breaks down in the desert, the passengers decide to stage \"King Lear.\"",
    "2001_382": "A naive drifter runs away from his army father in hopes of making it on the car racing circuit. In Las Vegas, he meets a young scam artist, who develops a crush on him. He is then introduced to a whole gang led by a young hustler. The ...See moreA naive drifter runs away from his army father in hopes of making it on the car racing circuit. In Las Vegas, he meets a young scam artist, who develops a crush on him. He is then introduced to a whole gang led by a young hustler. The racer-to-be then gets a lesson in the wild side, getting involved in one situation after another. Patsy Kensit makes a cameo as another hustler and Daryl Hannah appears as the scam artist's surrogate mom.  Written by John Sacksteder See less",
    "2001_383": "Reluctantly, a sulky adolescent returns to her parents' house for yet another boring summer vacation, dabbling in desire and the art of desirability, eventually mixing reality with vision, caged fantasies with the fierce female sexuality.",
    "2001_384": "Friendship and betrayal between two poets during the French Revolution.",
    "2001_385": "After his mother dies, 15-year-old Charley must live with his unloving, bullying father. Out of loneliness, Charley strikes up an illicit romance with 29-year-old Eban. When their families find out, they must make a life-altering decision.",
    "2001_386": "In 1904, in Dublin, James Joyce chats up Nora Barnacle, a hotel maid recently come from Galway. She enchants him with her frank, direct and uninhibited manner, and before long, he's convinced her to come with him to Trieste, where he has a...See moreIn 1904, in Dublin, James Joyce chats up Nora Barnacle, a hotel maid recently come from Galway. She enchants him with her frank, direct and uninhibited manner, and before long, he's convinced her to come with him to Trieste, where he has a job with Berlitz. Over time, Nora pulls him through phobias, tolerates his drinking, takes in his brother Stan, and bests Joyce at 'the writin' game' to bring him back to Italy from Dublin where he's gone to open a cinema. But his sexual jealousy threatens the relationship and sends her back to Galway with the children. Is there any way to tame Jim's green-eyed monster? And, will the lad ever get his stories published?  Written by See less",
    "2001_387": "When two beautiful women fall for the unluckiest guy in the world his life takes on delicious complications.",
    "2001_388": "A profile of homeless Romanian children who were born victims of the nation's reckless population growth policy during its communist era.",
    "2001_389": "Based on the book by Dan Wakefield, the film combines stunning archival footage of New York with interviews of the icons of the day - Kerouac, Ginsberg, Baldwin, Mailer, Basie, etc. Offering modern day perspectives.",
    "2001_39": "When a congressman's daughter under Secret Service protection is kidnapped from a private school, detective Alex Cross investigates the case even though he's recovering from the loss of his partner.",
    "2001_390": "World-renowned director Martin Scorsese narrates this journey through his favorites in Italian cinema.",
    "2001_391": "A photojournalist (Terry Kinney) upsets his daughter (Ellen Muth) and loses his girlfriend (Mili Avital) by covering stories in remote and dangerous locations.",
    "2001_392": "A behind the scenes look at the crazy and violent world of nightclub bouncers.",
    "2001_393": "The story of a Californian couple expecting a child and their group of friends confronted with the tragedy of a big loss.",
    "2001_394": "An Oslo detective visits a hick town to investigate some murders rumored by the locals to have been the work of 'angels'. More likely, given the unsavory types he meets, vengeance and vigilantism are the very human motivations behind.",
    "2001_395": "The history of the \"Scottsboro Boys,\" a group of African American men who were victims of a racist miscarriage of justice that became a national controversy.",
    "2001_396": "A woman becomes furious when her husband arrives home from the local pub and turns into a rat.",
    "2001_397": "As a deadly virus which infects people who have loveless sex sweeps Paris, a lonely pariah attempts to steal a potent antidote, only to fall for the mistress of his partner-in-crime. Is the infectious young love the cure to the bad blood?",
    "2001_398": "Film adaptation of David Mamet's comic play Lakeboat about a grad student who takes a summer job on a Great Lakes freighter and sees life through the eyes of his low-brow crew members.",
    "2001_399": "Lionel \"Ex\" Exley is a golf pro who returns to his hometown of New Orleans, where he befriends lawyer W. Firmin Carter. When Carter suddenly goes missing, however, the party's over for Ex, as he's the prime suspect.",
    "2001_4": "A mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back.",
    "2001_40": "A rookie cop spends his first day as a Los Angeles narcotics officer with a rogue detective who isn't what he appears to be.",
    "2001_400": "Two death-obsessed sisters, outcasts in their suburban neighborhood, must deal with the tragic consequences when one of them is bitten by a deadly werewolf.",
    "2001_401": "Harold Smith (Sir Tom Courtenay), a quiet middle-aged Englishman becomes an instant celebrity when he suddenly starts exhibiting psychic and telekinetic powers. After he is arrested for accidentally killing three pensioners by causing ...See moreHarold Smith (Sir Tom Courtenay), a quiet middle-aged Englishman becomes an instant celebrity when he suddenly starts exhibiting psychic and telekinetic powers. After he is arrested for accidentally killing three pensioners by causing their pacemakers to stop, his lawyer brings in an extremely skeptical scientist to test whether or not Harold's powers are real. Meanwhile, Harold's son Vince (Michael Legge), a disco devotee, is pining for his co-worker Joanna (Laura Fraser), who also happens to be the daughter of the scientist testing Vince's dad.  Written by Jean-Marc Rocher See less",
    "2001_402": "A north London postman who gets involved with a gang of criminals",
    "2001_403": "A Sydney lawyer defends five Aboriginal Persons in a ritualized taboo murder and in the process learns disturbing things about himself and premonitions.",
    "2001_404": "Idiots get caught peeking in on some sorority girls in their underwear, and the girls get even.",
    "2001_41": "An eight-year-old boy genius and his friends must rescue their parents after the adults are abducted by aliens.",
    "2001_42": "When the daughter of a psychiatrist is kidnapped, he's horrified to discover that the abductors' demand is that he break through to a post traumatic stress disorder suffering young woman who knows a secret...",
    "2001_43": "A fire-fighting cadet, two college professors, and a geeky but sexy government scientist work against an alien organism that has been rapidly evolving since its arrival on Earth inside a meteor.",
    "2001_44": "A mentally handicapped man fights for custody of his 7-year-old daughter and in the process teaches his cold-hearted lawyer the value of love and family.",
    "2001_45": "A Russian and a German sniper play a game of cat-and-mouse during the Battle of Stalingrad.",
    "2001_46": "Mary Fiore is San Francisco's most successful supplier of romance and glamor. She knows all the tricks. She knows all the rules. But then she breaks the most important rule of all: she falls in love with the groom.",
    "2001_47": "A Navy navigator is shot down over enemy territory and is ruthlessly pursued by a secret police enforcer and the opposing troops. Meanwhile his commanding officer goes against orders in an attempt to rescue him.",
    "2001_48": "The lives of upstairs guests and downstairs servants at a party in 1932 in a country house in England as they investigate a murder involving one of them.",
    "2001_49": "A biography of sports legend Muhammad Ali, focusing on his triumphs and controversies between 1964 and 1974.",
    "2001_5": "Danny Ocean and his ten accomplices plan to rob three Las Vegas casinos simultaneously.",
    "2001_50": "A Las Vegas casino magnate, determined to find a new avenue for wagering, sets up a race for money.",
    "2001_51": "A scientist makes a last stand on Earth with the help of a ragtag team of soldiers against an invasion of alien phantoms.",
    "2001_52": "After receiving organ transplants from various animal donors, a man finds himself taking on the traits of those animals.",
    "2001_53": "The story of how George Jung, along with the Medellín Cartel headed by Pablo Escobar, established the American cocaine market in the 1970s in the United States.",
    "2001_54": "Orin Boyd, a tough cop in an inner-city precinct discovers a web of dirty cops and corruption.",
    "2001_55": "A couple search for each other years after the night they first met, fell in love, and separated, convinced that one day they'd end up together.",
    "2001_56": "An English Duke from 1876 is inadvertedly dragged to modern day New York where he falls for a plucky advertising executive.",
    "2001_57": "The hilarious adventures of two best friends, Apachi Indian chief Abahachi and cowboy Ranger, in the Wild West.",
    "2001_58": "In Victorian-era London, a troubled clairvoyant police detective investigates the murders of Jack the Ripper.",
    "2001_59": "A rogue Multiverse agent goes on a manhunt for alternate versions of himself, getting stronger with each kill. Only the last version of himself, an LASD cop, can stop his crusade before he becomes \"The One\".",
    "2001_6": "A tale of war and romance mixed in with history. The story follows two lifelong friends and a beautiful nurse who are caught up in the horror of an infamous Sunday morning in 1941.",
    "2001_60": "The eccentric members of a dysfunctional family reluctantly gather under the same roof for various reasons.",
    "2001_61": "After dying before his time, an aspiring black comic gets a second shot at life - by being placed in the body of a wealthy white businessman.",
    "2001_62": "In 18th-century France, the Chevalier de Fronsac and his Native American friend Mani are sent to the Gevaudan province at the king's behest to investigate the killings of hundreds by a mysterious beast.",
    "2001_63": "When Cyrus Kriticos, a very rich collector of unique things, dies, he leaves house and fortune to his nephew and his family. While they're inside, they find they are not alone.",
    "2001_64": "In the town of Greenfield, a young, lonely girl's dreams and wishes are brought into reality by a collective of reality-warping Pokemon.",
    "2001_65": "Two bank robbers fall in love with the girl they've kidnapped.",
    "2001_66": "A sendup of all the teen movies that have accumulated in the past two decades.",
    "2001_67": "A workaholic executive, and an unconventional woman agree to a personal relationship for a short period. In this short period she changes his life.",
    "2001_68": "PROT is a patient at a mental hospital who claims to be from a faraway planet named K-PAX. His psychiatrist tries to help him, only to begin to doubt his own explanations. Read more: Synopsis",
    "2001_69": "A betrayed intelligence officer enlists the aid of a prostitute to prove his innocence from a deadly conspiracy while returning a favor to her.",
    "2001_7": "The mummified body of Imhotep is shipped to a museum in London, where he once again wakes and begins his campaign of rage and terror.",
    "2001_70": "When a fisherman leaves to fight with the Greek army during World War II, his fiancee falls in love with the local Italian commander.",
    "2001_71": "At the end of his career, a clueless fashion model is brainwashed to kill the Prime Minister of Malaysia.",
    "2001_72": "A murder detective must follow the footsteps of a brutal killer within the secrets of a classist college.",
    "2001_73": "A brother and sister driving home through isolated countryside for spring break encounter a flesh-eating creature which is in the midst of its ritualistic eating spree.",
    "2001_74": "A mother and daughter con team seduce and scam wealthy men.",
    "2001_75": "A homicide detective and a fire marshal must stop a pair of murderers who commit videotaped crimes to become media darlings.",
    "2001_76": "A young hot shot driver is in the middle of a championship season and is coming apart at the seams. A former CART champion is called in to give him guidance.",
    "2001_77": "When Danny witnesses his stepfather Rick murder a man, Danny's father Frank has to protect his son from the greatest danger.",
    "2001_78": "A man spreads the rumor of his fake homosexuality with the aid of his neighbor, to prevent his imminent firing at his work.",
    "2001_79": "After a family tragedy, a racist prison guard re-examines his attitudes while falling in love with the African-American wife of the last prisoner he executed.",
    "2001_8": "A decidedly odd couple with ulterior motives convince Dr. Grant to go to Isla Sorna for a holiday, but their unexpected landing startles the island's new inhabitants.",
    "2001_80": "TJ and company must save summer vacation from disappearing forever.",
    "2001_81": "An aimless young man who is scalping tickets, gambling, and drinking, agrees to coach a Little League team from the Cabrini Green housing project in Chicago as a condition of getting a loan from a friend.",
    "2001_82": "A New England couple's college-aged son dates an older woman who has two small children and an unwelcome ex-husband.",
    "2001_83": "A mailman takes care of a dog that, unbeknownst to him, is an FBI drug-sniffing superdog that has escaped from the witness protection program after becoming the target of an assassination.",
    "2001_84": "A young Shaolin follower reunites with his discouraged brothers to form a soccer team using their martial art skills to their advantage.",
    "2001_85": "Martin Lawrence plays Jamal, an employee in Medieval World amusement park. After sustaining a blow to the head, he awakens to find himself in 14th century England.",
    "2001_86": "A man with short-term memory loss attempts to track down his wife's murderer.",
    "2001_87": "Australian Outback adventurer Mick \"Crocodile\" Dundee travels to Los Angeles with his young son while his longtime companion suspects foul play at a movie studio.",
    "2001_88": "This IMAX 3D film follows a young musician, Johnny, as he explores his mysterious new home bequeathed to him by his deceased mother. Johnny quickly finds that something is amiss as ghosts and the devil himself welcome him home.",
    "2001_89": "After being jilted by her boyfriend, a talk show talent scout writes a column on the relationship habits of men which gains her national fame.",
    "2001_9": "In 2029, an Air Force astronaut crash-lands on a mysterious planet where evolved, talking apes dominate a race of primitive humans.",
    "2001_90": "A rich man catches a thief burglarizing his home and steals the thief's lucky ring, who then tries to get it back.",
    "2001_91": "In 1951, a blacklisted Hollywood writer gets into a car accident, loses his memory and settles down in a small town where he is mistaken for a long-lost son.",
    "2001_92": "Five women are stalked by an unknown assailant while preparing for Valentine's Day.",
    "2001_93": "Three young people on a road trip from Colorado to New Jersey talk to a trucker on their CB radio, then must escape when he turns out to be a psychotic killer.",
    "2001_94": "A single mother, with dreams of becoming a writer, has a son at the age of 15 in 1965, and goes through a failed marriage with the drug-addicted father.",
    "2001_95": "A woman, along with her lover, plans to con a rich man by marrying him, earning his trust, and then running away with all his money. Everything goes as planned until she falls in love with him.",
    "2001_96": "The comic \"Bluntman and Chronic\" is based on real-life stoners Jay and Silent Bob, so when they get no profit from a big-screen adaptation, they set out to wreck the movie.",
    "2001_97": "In Mexico, two teenage boys and an attractive older woman embark on a road trip and learn a thing or two about life, friendship, sex, and each other.",
    "2001_98": "Alexander Dumas' novel is updated with an eastern influence as D'Artagnan attempts to join the king's elite guards, the Royal Musketeers, and find the man who killed his parents.",
    "2001_99": "A man on the run takes another man's passport, only to find himself stuck with the identity of a street hustler."
}