{
    "2002_1": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
    "2002_10": "In a future where a special police unit is able to arrest murderers before they commit their crimes, an officer from that unit is himself accused of a future murder.",
    "2002_100": "Three years after he last terrorized his sister, Michael Myers confronts her again, before traveling to Haddonfield to deal with the cast and crew of a reality show which is being broadcast from his old home.",
    "2002_101": "A high school senior with a promising swimming career has a one-night stand with consequences.",
    "2002_102": "A teenage girl moves into a remote countryside house with her family, only to discover that their gloomy new home has a horrifying past that threatens to destroy the family.",
    "2002_103": "Two cousins work nights at a local mall as security guards. When their house is robbed on Christmas Eve they team up to track the robber down.",
    "2002_104": "The Crocodile Hunter mistakes some CIA agents for poachers and sets out to stop them from capturing a wily croc which, unbeknownst to him, has swallowed a tracking drone.",
    "2002_105": "An adaptation of the cult memoir of game show impresario Chuck Barris (Sam Rockwell), in which he purports to have been a C.I.A. hitman.",
    "2002_106": "A lovelorn screenwriter becomes desperate as he tries and fails to adapt 'The Orchid Thief' by Susan Orlean for the screen.",
    "2002_107": "A law student becomes a lieutenant during World War II, is captured and asked to defend a black prisoner of war falsely accused of murder.",
    "2002_108": "Still recovering from a heart transplant, retired F.B.I. profiler Terry McCaleb (Clint Eastwood) returns to service when his own blood analysis offers clues to the identity of a serial killer.",
    "2002_109": "A high school senior branded uncool in the ninth grade gets himself expelled so he changes his image to cool kid at the town's other high school.",
    "2002_11": "Barely 21 yet, Frank is a skilled forger who has passed as a doctor, lawyer and pilot. FBI agent Carl, becomes obsessed with tracking down the con man. But Frank not only eludes capture, he revels in the pursuit.",
    "2002_110": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.",
    "2002_111": "A troubled psychologist is sent to investigate the crew of an isolated research station orbiting a bizarre planet.",
    "2002_112": "A British officer resigns his post just before battle and subsequently receives four white feathers from his friends and fiancee as symbols of what they believe to be his cowardice.",
    "2002_113": "Vincent Lamarca, whose father was executed for a 1950s kidnapping of a child, grew up to become a police officer, only to see his own son become a murder suspect.",
    "2002_114": "In 1950s Connecticut, a housewife faces a marital crisis and mounting racial tensions in the outside world.",
    "2002_115": "Friends since childhood, a magazine editor and a hip-hop record executive stumble into romantic territory.",
    "2002_116": "A strait-laced French student moves into an apartment in Barcelona with a cast of six other characters from all over Europe. Together, they speak the international language of love and friendship.",
    "2002_117": "Ash must stop a hunter who forces the mythical Pokemon Celebi to help him destroy a forest.",
    "2002_118": "An old British reporter vies with a young U.S. doctor for the affections of a beautiful Vietnamese woman.",
    "2002_119": "Politics and sexual passions threaten to corrupt a young, newly-ordained priest in a small Mexican town.",
    "2002_12": "Two death-row murderesses develop a fierce rivalry while competing for publicity, celebrity, and a sleazy lawyer's attention.",
    "2002_120": "Bounty hunter Bucum chases bail-jumper Reggie, who runs right into the scene of a diamond heist and murder and gets shot at as well. Later they become partners in their pursuit of the $20M in diamonds and lottery ticket. Their women join.",
    "2002_121": "The big thing in 2005 is a violent sport which can have some pretty serious consequences... like dying.",
    "2002_122": "When the singing Veggies encounter some car trouble, they are stranded at an old rundown seafood joint, where nothing is quite as it seems.",
    "2002_123": "Seven-year-old Sang-woo is left with his grandmother in a remote village while his mother looks for work. Born and raised in the city, Sang-woo quickly comes into conflict with his old-fashioned grandmother and his new rural surroundings. ...See moreSeven-year-old Sang-woo is left with his grandmother in a remote village while his mother looks for work. Born and raised in the city, Sang-woo quickly comes into conflict with his old-fashioned grandmother and his new rural surroundings. Disrespectful and selfish, Sang-woo lashes out in anger, perceiving that he has been abandoned. He trades his grandmother's only treasure for a video game; he throws his food and he throws tantrums. When Sang-woo's mother finds work and finally returns for him, Sang-woo has become a different boy. Through his grandmother's boundless patience and devotion, he learns to embrace empathy, humility and the importance of family.  Written by Sujit R. VarmaSee less",
    "2002_124": "A psychologically troubled novelty supplier is nudged towards a romance with an English woman, all the while being extorted by a phone-sex line run by a crooked mattress salesman, and purchasing stunning amounts of pudding.",
    "2002_125": "A young man leaves India to find fame and fortune in America where he unexpectedly becomes a sex guru.",
    "2002_126": "Cornered by the DEA, convicted New York drug dealer Montgomery Brogan reevaluates his life in the 24 remaining hours before facing a seven-year jail term.",
    "2002_127": "Davey Stone, an alcoholic with a criminal record, is sentenced to community service under the supervision of an elderly referee. Davey is then faced with trying to reform and abandon his bad habits.",
    "2002_128": "Antwone Fisher, a young navy man, is forced to see a psychiatrist after a violent outburst against a fellow crewman. During the course of treatment a painful past is revealed and a new hope begins.",
    "2002_129": "Five Vermont state troopers, avid pranksters with a knack for screwing up, try to save their jobs and out-do the local police department by solving a crime.",
    "2002_13": "Upon learning that his father has been kidnapped, Austin Powers must travel to 1975 and defeat the aptly named villain Goldmember, who is working with Dr. Evil.",
    "2002_130": "A teenager journeys through a series of foster homes after her mother goes to prison for committing a crime of passion.",
    "2002_131": "Two thieves take control of an ancient weapon designed to defend the canal city of Altomare.",
    "2002_132": "A process server tries to serve an elusive female target.",
    "2002_133": "Asterix and Obelix go to Egypt to help architect Numerobis who is building a palace for Cleopatra.",
    "2002_134": "Tasked with destroying each other, an FBI agent and a rogue DIA agent soon discover that there's a much bigger enemy at work.",
    "2002_135": "A producer's film is endangered when his star walks off, so he decides to digitally create an actress to substitute for the star, becoming an overnight sensation that everyone thinks is a real person.",
    "2002_136": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.",
    "2002_137": "A young woman meets and falls in love with a young man who is part of a family of immortals.",
    "2002_138": "This movie tells the story of a man who goes undercover in a hi-tech prison to find out information to help prosecute those who killed his wife. While there he stumbles onto a plot involving a death-row inmate and his $200 million stash of gold.",
    "2002_139": "After undergoing a number of personal crises, a stand-up comic returns to the stage for a one-man show featuring stinging social commentary and very personal reflections about his life.",
    "2002_14": "An extreme sports athlete, Xander Cage, is recruited by the government on a special mission.",
    "2002_140": "A New York City detective investigates mysterious deaths occurring 48 hours after users log onto a site named feardotcom.",
    "2002_141": "A successful South Bronx drug dealer turns his back on his roots and gives money to a Wall Street broker to invest for him.",
    "2002_142": "Beary Barrington goes on an adventure to save Country Bear Hall by getting the Country Bears back together for a reunion concert.",
    "2002_143": "Carlo's life is thrown into a tailspin when his longtime girlfriend Giulia announces she's pregnant. As Carlo faces up to his anxieties about adulthood, his buddies Paolo, Adriano and Alberto reluctantly grapple with their own ...See moreCarlo's life is thrown into a tailspin when his longtime girlfriend Giulia announces she's pregnant. As Carlo faces up to his anxieties about adulthood, his buddies Paolo, Adriano and Alberto reluctantly grapple with their own responsibilities.  Written by Sujit R. VarmaSee less",
    "2002_144": "A mysterious man arrives at the offices of an FBI agent and recounts his childhood: how his religious fanatic father received visions telling him to destroy people who were in fact \"demons.\"",
    "2002_145": "In 1890s London, two friends use the same pseudonym (\"Ernest\") for their on-the-sly activities. Hilarity ensues.",
    "2002_146": "A rough-around-the-edges martial arts master seeks revenge for his parent's death.",
    "2002_147": "A reporter interviews a psychic, who tells her that she's going to die and her life is meaningless.",
    "2002_148": "A discount store clerk strikes up an affair with a stock boy who considers himself the incarnation of Holden Caulfield.",
    "2002_149": "A woman tries to straighten out her life, even as her past as a con-woman comes back to haunt her.",
    "2002_15": "After an acrimonious break up, the Mystery Inc. gang are individually brought to an island resort to investigate strange goings on.",
    "2002_150": "A psychology student finds all her childhood fears and phobias becoming real after a traumatic event.",
    "2002_151": "The movie shows the origin of the Powerpuff Girls before the cartoon series. It explains why they were born and why they dedicated their lives to fighting crime and the forces of evil.",
    "2002_152": "Three young Irish women struggle to maintain their spirits while they endure dehumanizing abuse as inmates of a Magdalene Sisters Asylum.",
    "2002_153": "An idealistic prep school teacher attempts to redeem an incorrigible student.",
    "2002_154": "In 1931, three half-white, half-Aboriginal girls escape after being plucked from their houses to be trained as domestic staff, and set off on a journey across the Outback.",
    "2002_155": "A thirtysomething bank clerk from St Albans has his small-town life exploded by the arrival of his Russian mail-order bride.",
    "2002_156": "A documentary portrait of a one-room school in rural France, where the students (ranging in age from 4 to 11) are educated by a single dedicated teacher.",
    "2002_157": "Arnold and company must recover a stolen document needed in order to prevent the neighborhood from being bulldozed.",
    "2002_158": "Two straight men mistakenly end up on a \"gays only\" cruise.",
    "2002_159": "When heavyweight champion George \"Iceman\" Chambers lands in prison, the resident gangster arranges a boxing match with the reigning prison champ.",
    "2002_16": "A Hawaiian girl adopts an unusual pet who is actually a notorious extra-terrestrial fugitive.",
    "2002_160": "A pair of literary sleuths unearth the amorous secret of two Victorian poets only to find themselves falling under a passionate spell.",
    "2002_161": "A director is forced to work with his ex-wife, who left him for the boss of the studio bankrolling his new film. But the night before the first day of shooting, he develops a case of psychosomatic blindness.",
    "2002_162": "A middle-class man turns to a life of crime in order to finance his niece's first year at Harvard University.",
    "2002_163": "Undocumented immigrants Okwe and Senay work at a posh London hotel and live in constant fear of deportation. One night Okwe stumbles across evidence of a bizarre murder setting off a series of events that could lead to disaster or freedom.",
    "2002_164": "A basketball star is booted out of the NBA when his on-court antics go too far, so he poses as a woman and joins the WUBA.",
    "2002_165": "The Jennings' fight for their daughters life after she is kidnapped by an experienced gang of thieves.",
    "2002_166": "The wannabe sons of mobsters go to a remote town in the Midwest, and get themselves into more trouble than anyone could anticipate.",
    "2002_167": "When the trail goes cold on a murder investigation of a policeman an undercover narcotics officer is lured back to the force to help solve the case.",
    "2002_168": "Strapped for cash, three fraternity playboys make one last attempt to live the high life - cheaply - by masquerading as girls. But their chauvinistic ways come back to haunt them as they get a crash course in the opposite sex.",
    "2002_169": "Two con artists try to swindle a stamp collector by selling him a sheet of counterfeit rare stamps (the \"nine queens\").",
    "2002_17": "A journalist must investigate a mysterious videotape which seems to cause the death of anyone one week to the day after they view it.",
    "2002_170": "An investigation of a college student's missing boyfriend becomes quite strange when she begins to see him periodically.",
    "2002_171": "A blind girl gets a cornea transplant so that she would be able to see again. However, she got more than what she bargained for when she realized she could even see ghosts.",
    "2002_172": "The incredibly spoiled and overprivileged students of Camden College are a backdrop for an unusual love triangle between a drug dealer, a virgin and a bisexual classmate.",
    "2002_173": "A young priest is sent to Rome to investigate the troubling death of the head of his order.",
    "2002_174": "Adrenaline Rush: the Science of Risk takes a look at the world of skydiving and base jumping - parachuting from a building, a bridge or a cliff. While providing breathtaking views of skydiving over the Florida Keys, the Mojave Desert and ...See moreAdrenaline Rush: the Science of Risk takes a look at the world of skydiving and base jumping - parachuting from a building, a bridge or a cliff. While providing breathtaking views of skydiving over the Florida Keys, the Mojave Desert and in the magnificent Fjords of Norway, this giant-screen experience explores the psychological and physiological forces behind risk-taking, and the physics involved in these activities. In doing so, it also shows us how risk-taking is part of everyday life. The storyline focuses on two risk-takers, Adrian Nicholas and Katarina Ollikainen. Nicholas, a veteran skydiver who has performed thousands of jumps, is the record holder for the longest unassisted human flight, a 4-minute 55-second flight at speeds of up to 200 kilometers/hour that took place in 1999. Adrenaline Rush even allows spectators to directly experience a base jump thanks to a camera strapped to one of the professional jumpers who took part in the film. You can live through a 1300-meter (4150 feet) jump from a legendary cliff in Norway, the Katthammaren Wall.  Written by Sky High EntertainmentSee less",
    "2002_175": "While filming an advertisement, some extreme sports enthusiasts unwittingly stop a group of terrorists.",
    "2002_176": "",
    "2002_177": "A woman searching for the perfect man instead discovers the perfect woman.",
    "2002_178": "As he copes with the death of his fiancee, a young man befriends her parents and must figure out what he wants out of life.",
    "2002_179": "A young woman from the future forces a local gunman to help her stop an impending alien invasion which will wipe out the human race.",
    "2002_18": "A young rapper, struggling with every aspect of his life, wants to make it big but his friends and foes make this odyssey of rap harder than it may seem.",
    "2002_180": "When a headstrong chef takes charge of her equally stubborn 8-year-old niece, the tensions between them mount... until an Italian sous-chef arrives to lighten the mood.",
    "2002_181": "This is the story of those who live as if every day was a constant Sunday, those who spend their Mondays in the sun. The story of people who worked in a dockyard but are now unemployed.",
    "2002_182": "M arrives in Helsinki only to be viciously attacked by thugs and pronounced dead by medics. He revives but with no memory of his past or his identity. He rebuilds his life from scratch, but the past inevitably catches up with him.",
    "2002_183": "A young woman, recently released from a mental hospital, gets a job as a secretary to a demanding lawyer, where their employer-employee relationship turns into a sexual, sadomasochistic one.",
    "2002_184": "A story between a mole in the police department and an undercover cop. Their objectives are the same: to find out who is the mole, and who is the cop.",
    "2002_185": "The lives of several Miami denizens, from ad agents to gunrunners to street thugs to law enforcement to school-children, intersect with humorous and dangerous results.",
    "2002_186": "Ten years after initially meeting, Anakin Skywalker shares a forbidden romance with Padme Amidala, while Obi-Wan Kenobi investigates an assassination attempt on the senator and discovers a secret clone army crafted for the Jedi.",
    "2002_187": "During WWII SS officer Kurt Gerstein tries to inform Pope Pius XII about Jews being sent to extermination camps. Young Jesuit priest Riccardo Fontana helps him in the difficult mission to inform the world.",
    "2002_188": "A kids show host, Rainbow Randolph, is fired in disgrace while his replacement, Sheldon Mopes, aka Smoochy the Rhino, finds himself a rising star. Unfortunately for Sheldon, the business of kids television isn't all child's play.",
    "2002_189": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
    "2002_19": "A man is picked up by a fishing boat, bullet-riddled and suffering from amnesia, before racing to elude assassins and attempting to regain his memory.",
    "2002_190": "In the future, an alien race uses androids as bombs to attack Earth. A government weapons specialist is accused of being one such android and sets out to prove his innocence.",
    "2002_191": "In Lausanne, the aspirant pianist Jeanne Pollet has lunch with her mother Louise Pollet, her boyfriend Axel and his mother. Lenna leans that when she was born, a nurse had mistakenly told to the prominent pianist Andre Polonski that she ...See moreIn Lausanne, the aspirant pianist Jeanne Pollet has lunch with her mother Louise Pollet, her boyfriend Axel and his mother. Lenna leans that when she was born, a nurse had mistakenly told to the prominent pianist Andre Polonski that she would be his daughter. Andre has just remarried his first wife, the heiress of a Swiss chocolate factory Marie-Claire \"Mika\" Muller and they live in Lausanne with Andre's son Guillaume Polonski. Out of the blue, Jeanne visits Andre and he offers to give piano classes to help her in her examination. Jeanne becomes closer to Andre and sooner she discovers that Mika might be drugging her stepson with Rohypnol. Further, she might have killed his second wife Lisbeth.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2002_192": "In East Los Angeles, an 18-year-old struggles between her ambitions of going to college and the desires of her domineering mother for her to get married, have children, and oversee the small, rundown family-owned textile factory.",
    "2002_193": "A gang of extreme sportsmen raises the stakes in their criminal activities.",
    "2002_194": "A bank robber arrives to do a job in a small French town and strikes up a friendship with a retired poetry teacher.",
    "2002_195": "On an impoverished Italian island, a free-spirited woman is accused of madness by townspeople fed up with her antics.",
    "2002_196": "A worn-out businessman and a beautician on the run collide in a Paris airport. Love arrives, all its hurdles be damned.",
    "2002_197": "In the future, a man struggles to keep his lunar nightclub out of the hands of the Mafia.",
    "2002_198": "A woman returns from holiday to find her husband has been murdered, and several groups of people are pressuring her to unravel the mystery of his true identity and activities during his final days.",
    "2002_199": "A young man's peculiar upbringing renders him unable to competently cope with the struggle of growing up.",
    "2002_2": "An ancient prophecy seems to be coming true when a mysterious presence begins stalking the corridors of a school of magic and leaving its victims paralyzed.",
    "2002_20": "A retired FBI agent with psychological gifts is assigned to help track down \"The Tooth Fairy\", a mysterious serial killer. Aiding him is imprisoned forensic psychiatrist Dr. Hannibal \"The Cannibal\" Lecter.",
    "2002_200": "In a time of political and social unrest in nineteenth-century Korea, an uncouth, self-taught painter explores his natural talent amidst the repressive world around him.",
    "2002_201": "A group of old friends reminisce about their lives over the years after the death of one of their crew.",
    "2002_202": "A young woman is forced to marry an old greedy man to save her father from bankruptcy although she has promised her heart to another man.",
    "2002_204": "Events over the course of one traumatic night in Paris unfold in reverse-chronological order as the beautiful Alex is brutally raped and beaten by a stranger in the underpass.",
    "2002_205": "A lead detective being stalked by a serial killer is asked to check into a clinic treating law enforcement officials who can't face their jobs.",
    "2002_206": "When geeky Ethan discovers three fellow students scamming the examination system, he blackmails them to win over the college's most popular girl.",
    "2002_207": "Bobby, a member of The Deuces, and the sister of the rival Vipers member fall in love, promoting a street war between the two factions.",
    "2002_208": "A 19th century French aristocrat, notorious for his scathing memoirs about life in Russia, travels through the Russian State Hermitage Museum and encounters historical figures from the last 200+ years.",
    "2002_209": "This is the story of a young girl named Elsa who was raised by a single mother (Isabelle) in the city. Isabelle and Elsa begin the film moving in next door to an elderly man who collects butterflies (Julien). Isabelle who \"spends a lot of ...See moreThis is the story of a young girl named Elsa who was raised by a single mother (Isabelle) in the city. Isabelle and Elsa begin the film moving in next door to an elderly man who collects butterflies (Julien). Isabelle who \"spends a lot of time with her friends\" does not pay much attention to her daughter who walks home because her mother forgot to pick her up from school. After meeting her new neighbor, Elsa finds out about the butterflies and in short annoys Julien for a while. Julien receives a mystery package from a fellow entomologist. Julien sets out on his annual attempt to find a rare species of butterfly that he had once promised his son he would find (son dead) in the French country side, specifically a region known as Vercors. Elsa stows away in his car. After being discovered she convinces him to let her come to Vercors with him. They bond while hiking and camping until Julien, who is initially annoyed by Elsa, near the end of the film seems to have a grandfather-granddaughter relationship with her. Elsa falls in a well. The police arrest Julien. Elsa tells everyone it is cool. Isabelle starts paying attention to her child. Julien and Elsa are friends. The mystery package contained a caterpillar which turned out to become the rare species of butterfly Julien set out to find. The species is called Isabelle. So Elsa finds her mother (Isabelle) and Julien finds the butterfly (Isabelle). Surprisingly happy feel for a french film.  Written by AnonymousSee less",
    "2002_21": "A lawyer decides that she's used too much like a nanny by her boss, so she walks out on him.",
    "2002_210": "The last days of legendary opera singer Maria Callas.",
    "2002_211": "A mentally disturbed man takes residence in a halfway house. His mind gradually slips back into the realm created by his illness, where he replays a key part of his childhood.",
    "2002_212": "Six bank robbers trying to pull off the perfect heist discover one of them is an undercover cop.",
    "2002_213": "A New York press agent must scramble when his major client becomes embroiled in a huge scandal.",
    "2002_214": "After his wealthy family prohibits him from marrying the woman he is in love with, Devdas Mukherjee's life spirals further and further out of control as he takes up alcohol and a life of vice to numb the pain.",
    "2002_215": "Three stories of never-ending love.",
    "2002_216": "In an oppressive future where all forms of feeling are illegal, a man in charge of enforcing the law rises to overthrow the system and state.",
    "2002_217": "A young woman who is in love with a married doctor becomes dangerous when her attempts to persuade him to leave his wife are unsuccessful. However, when things are seen from his point of view, the real situation becomes clear.",
    "2002_218": "A police detective in a South American country is dedicated to hunting down a revolutionary guerilla leader.",
    "2002_219": "The telling of an Inuit legend of an evil spirit causing strife in the community and one warrior's endurance and battle of its menace.",
    "2002_22": "A divorced woman and her diabetic daughter take refuge in their newly-purchased house's safe room, when three men break-in, searching for a missing fortune.",
    "2002_220": "Made-for-IMAX documentary about the athletes of ESPN's Summer X games, including skateboarders, BMX riders, motocrossers, and street lugers.",
    "2002_221": "After his wife leaves him for another man, Jacques hires a housekeeper, Laura, to keep his Paris apartment in order. As he starts increasing her hours and spending more time with her on her days off, Jacques is torn between the pleasure of...See moreAfter his wife leaves him for another man, Jacques hires a housekeeper, Laura, to keep his Paris apartment in order. As he starts increasing her hours and spending more time with her on her days off, Jacques is torn between the pleasure of Laura's company, and the headache that such an intrusion brings to his new domain of singlehood.  Written by Sujit R. VarmaSee less",
    "2002_222": "Self-esteem and insecurity are at the heart of this comedy about the relationship between a mother and her three confused daughters.",
    "2002_223": "Four men take time from their personal problems to reunite as a curling team and compete in a bonspiel that will restore their honour.",
    "2002_224": "A woman takes the law into her own hands after police ignore her pleas to arrest the man responsible for her husband's death, and finds herself not only under arrest for murder but falling in love with an officer.",
    "2002_225": "Desmond's wife leaves him and their 3 kids after Christmas 1953. Unemployed in Dublin, the authorities place the kids in orphanages. Employed again, Desmond tries to get his kids back.",
    "2002_226": "Cosimo gets a plan for a huge job from his cellmate. He asks his woman to find a patsy for his bungled car theft, offering $15,000. Suddenly, 7 are involved.",
    "2002_227": "Kenichi and his uncle Shunsaku Ban must find the mystery behind robot girl Tima.",
    "2002_228": "In New York City, the lives of a lawyer, an actuary, a house-cleaner, a professor and the people around them intersect as they ponder order and happiness in the face of life's cold unpredictability.",
    "2002_229": "Three female friends behave badly.",
    "2002_23": "CIA analyst Jack Ryan must stop the plans of a Neo-Nazi faction that threatens to induce a catastrophic conflict between the United States and Russia's President by detonating a nuclear weapon at a football game in Baltimore, Maryland.",
    "2002_230": "A young, compassionate man struggles to save his family and friends from the abusive exploitation of his cold-heartedly grasping uncle.",
    "2002_231": "Semi-true story of the Hollywood murder that occurred at a star-studded gathering aboard William Randolph Hearst's yacht in 1924.",
    "2002_232": "Determined to have a normal family life once his mother gets out of prison, a Scottish teenager from a tough background sets out to raise the money for a home.",
    "2002_233": "A day in the life of a group of men and women in Hollywood, in the hours leading up to a friend's birthday party.",
    "2002_234": "After the death of her husband, Lilia's life revolves solely around her teenage daughter, Salma. Whilst looking for Salma late one night, Lilia stumbles upon a belly dance cabaret and though initially reserved and taken aback by the ...See moreAfter the death of her husband, Lilia's life revolves solely around her teenage daughter, Salma. Whilst looking for Salma late one night, Lilia stumbles upon a belly dance cabaret and though initially reserved and taken aback by the culture of the place, Lilia gets consistently drawn back to it. She befriends one of the belly dancers and is encouraged into dancing for the audience. Lilia also starts a romance with one of the cabaret's musicians, who unbeknown to both of them, is also romancing Salma.  Written by madjanssenSee less",
    "2002_235": "A woman and her new husband returns to her hometown roots in coastal northern Florida, and must deal with family, business, and encroaching real estate development.",
    "2002_236": "Two angels, one from the heaven and one from the hell, come to earth to save the soul of a boxer.",
    "2002_237": "Coming-of-age story about a suave 15-year-old prep school student who falls in love with his stepmother. When her best friend responds to his advances, he suddenly finds himself in way over his head.",
    "2002_238": "A young man from Harlem, forced to cope with the 1980s drug scene, builds an illegal empire, only to have a crisis of conscience.",
    "2002_239": "When a Newsweek photojournalist disappears in war-torn Yugoslavia, his wife travels to Europe to find him.",
    "2002_24": "In 1862, Amsterdam Vallon returns to the Five Points area of New York City seeking revenge against Bill the Butcher, his father's killer.",
    "2002_240": "A jazz singer and a British jewel thief are brought together by their mutual desire to forget the past.",
    "2002_241": "In a poor working class London home Penny's love for her partner, taxi-driver Phil, has run dry, but when an unexpected tragedy occurs, they and their local community are brought together, and they rediscover their love.",
    "2002_242": "In 1976, Tony Wilson sets up Factory Records and brings Manchester's music to the world.",
    "2002_243": "A look at the work of two stand-up comics, Jerry Seinfeld and a lesser-known newcomer, detailing the effort and frustration behind putting together a successful act and career while living a life on the road.",
    "2002_244": "Interrogated by a customs officer, a young man recounts how his life was changed during the making of a film about the Armenian genocide.",
    "2002_245": "The life of TV star Bob Crane and his strange friendship with electronics expert John Henry Carpenter.",
    "2002_246": "Strange happenings occur on a WW II submarine.",
    "2002_247": "Documentary about the Funk Brothers, a group of Detroit musicians who backed up dozens of Motown artists.",
    "2002_248": "For two weeks, 20 male participants are hired to play prisoners and guards in a prison. The \"prisoners\" have to follow seemingly mild rules, and the \"guards\" are told to retain order without using physical violence.",
    "2002_249": "A criminal subculture operates among U.S. soldiers stationed in West Germany just before the fall of the Berlin wall.",
    "2002_25": "A mob enforcer's son witnesses a murder, forcing him and his father to take to the road, and his father down a path of redemption and revenge.",
    "2002_250": "Portrait of Andy Goldsworthy, an artist whose specialty is ephemeral sculptures made from elements of nature.",
    "2002_251": "Frustrated with being broke, Beans (Beanie Sigel) decides that the only way to grasp the American Dream is to take it. The film follows Beans and his crew, the ABM, as they take over the city, creating mayhem as their empire builds. Beans ...See moreFrustrated with being broke, Beans (Beanie Sigel) decides that the only way to grasp the American Dream is to take it. The film follows Beans and his crew, the ABM, as they take over the city, creating mayhem as their empire builds. Beans now struggles to maintain his family life while bumping heads with opposing gangsters and police. It all comes to a head when he cannot surpass the city's most notorious crew, run by Untouchable J (Jay-Z) and Dame (Damon Dash). The moves Beans and the ABM decide to make come with severe consequences.  Written by PhatBleekSee less",
    "2002_252": "A wealthy East Indian man gives an apparently non-East Indian woman a crash course in his culture, so he can marry her with his family's approval.",
    "2002_253": "NASA must devise a strategy to return Apollo 13 to Earth safely after the spacecraft undergoes massive internal damage putting the lives of the three astronauts on board in jeopardy.",
    "2002_254": "3 brothers are in and out of prison in connection with heists planned by their lawyer et al. He gets them out for the heists and \"looks after\" the money and one's wife.",
    "2002_255": "A group of Catholic school friends, after being caught drawing an obscene comic book, plan a heist that will outdo their previous prank and make them local legends.",
    "2002_256": "6 anarchists place a time bomb in a West Berlin building in 1987. It's a dud. It blows up in 2000. Only 2 remain anarchists. How can the 6 steal evidence from a police \"fortress\" and avoid 8 years prison?",
    "2002_257": "A failed novelist's inability to pay the bills strains relations with his wife and leads him to work at an escort service where he becomes entwined with a wealthy woman whose husband is a successful writer.",
    "2002_258": "After breaking up with his lover and boss, a smooth-talking man takes his teenaged nephew out on the town in search of sex.",
    "2002_259": "A woman, whose husband is cheating on her, and an undertaker, who has been in love with her since their childhood, decide to fake her death so they can be together.",
    "2002_26": "A young woman who's reinvented herself as a New York City socialite must return home to Alabama to obtain a divorce from her husband, after seven years of separation.",
    "2002_260": "Five Yorkshiremen try to survive after the British Rail is bought out by a private company.",
    "2002_261": "A dramatization of the Irish civil rights protest march and subsequent massacre by British troops on January 30, 1972.",
    "2002_262": " Read more: Synopsis",
    "2002_263": "In occupied France, German-run Continental Films calls the shots in the movie business. Assistant director and Resistance activist Jean Devaivre works for Continental, where he can get \"in between the wolf's teeth and avoid being chewed up...See moreIn occupied France, German-run Continental Films calls the shots in the movie business. Assistant director and Resistance activist Jean Devaivre works for Continental, where he can get \"in between the wolf's teeth and avoid being chewed up\". Fast-living screenwriter Jean Aurenche uses every possible argument to avoid working for the enemy. For both, wartime is a battle for survival.  Written by AlineSee less",
    "2002_264": "A Dogme film about an engaged couple that is torn apart after the man is paralyzed in an accident, and the woman falls in love with the husband of the woman who caused the accident.",
    "2002_265": "Separated by a checkpoint, Palestinian lovers from Jerusalem and Ramallah arrange clandestine meetings.",
    "2002_266": "Either you make decisions or life makes them for you. For an ex-con struggling to go straight, the temptation of money, women and power prove too much, especially when his best friend promises him an easy heist.",
    "2002_267": "A woman is in love with a man in love with another woman, and all three have designs on a young man raised as an ape.",
    "2002_268": "19th century. Oshin is a prostitute in a brothel of a red-light district. A disgraced samurai, Fusanosuke, rushes in the brothel seeking for a refuge, because he had wounded a powerful samurai. Oshin hides him from the authorities and ...See more19th century. Oshin is a prostitute in a brothel of a red-light district. A disgraced samurai, Fusanosuke, rushes in the brothel seeking for a refuge, because he had wounded a powerful samurai. Oshin hides him from the authorities and falls in love with him, against an older prostitute's, Kikuno's, misgiving. Fusanosuke advises Oshin to cleanse herself by giving up her line of work. Believing falsely that this is a promise for marriage, she turns her customers over to the other prostitutes, who are happy to help her. Funasukoke leaves to be reconciled to his family, but, when he returns, he reveals that he is engaged and is going to marry his fiance. Some time later a desperate itinerant, Ryosuke, appears and Oshin falls in love again. Meanwhile, an older man asks Kikuno to buy her contract and marry her, but she is entangled with an old abusive customer of hers. One night, while the madam of the brothel is away to thermal baths, a storm hits the area and everybody tries to flee. Ryosuke kills Kikuno's customer who tries to steal madam's money and runs away. Oshin and Kikuno stay at the roof hoping for a rescue from the flood. Ryosuke returns by a boat.  Written by Alkistis ZografouSee less",
    "2002_269": "Documentary about the pioneering 1970s Zephyr skating team.",
    "2002_27": "A desert warrior rises up against the evil army that is destroying his homeland. He captures the enemy's key sorcerer, takes her deep into the desert and prepares for a final showdown.",
    "2002_270": "Documentary about legendary Paramount producer Robert Evans (the film shares the same name as Evans's famous 1994 autobiography).",
    "2002_271": "\"Joshua\" tells the story of a possible second coming of Christ to a small U.S. town.",
    "2002_272": "While doing a friend a favor and searching for a runaway teenager, a police detective stumbles upon a bizarre band of criminals about to pull off a bank robbery.",
    "2002_273": "Terry Gilliam's doomed attempt to get his film, The Man Who Killed Don Quixote, off the ground.",
    "2002_274": "A Bible professor from 1890 comes forward in time to the present via a time machine and cannot believe the things that he sees! Read more: Synopsis",
    "2002_275": "The effects of the 9/11 terrorist attacks are told from different points of view around the world.",
    "2002_276": "A divorced, Mormon stand-up comedian moves after divorce to loosen the ties to the church and its singles ward. A woman from the new church calls and he responds rudely. Meeting her later, he notices that she's nice and cute.",
    "2002_277": "Three people and a baby set off on separate journeys, along the same road; their disparate dreams and stories intertwine amidst the breathtaking deserted Patagonic route.",
    "2002_278": "During the Gorbachev years, Platon Makovski and his four buddies are university students who jump on the private capitalism movement. Fast-forward 20 years, Platon finds himself the richest man in Russia, having sacrificed his friends to ...See moreDuring the Gorbachev years, Platon Makovski and his four buddies are university students who jump on the private capitalism movement. Fast-forward 20 years, Platon finds himself the richest man in Russia, having sacrificed his friends to get to the top. But with this cynical rise, comes a brutal fall.  Written by Sujit R. VarmaSee less",
    "2002_279": "After a tragic incident, a man drifts into a world populated by thugs and speed junkies.",
    "2002_28": "A defense officer, Nameless, was summoned by the King of Qin regarding his success of terminating three warriors.",
    "2002_280": "A snooty socialite is stranded on a Mediterranean island with a communist sailor.",
    "2002_281": "A film of Margaret Cho's one-woman stand-up show, in which she presents her take on modern sexual topics and minority issues.",
    "2002_282": "Based on real-life events in Canada in the late 1980's, social worker Paula Jackson investigated a commune run by a messiah-like figure who referred to himself as Moses. Jackson's findings uncovered disturbing mental and physical abuses of...See moreBased on real-life events in Canada in the late 1980's, social worker Paula Jackson investigated a commune run by a messiah-like figure who referred to himself as Moses. Jackson's findings uncovered disturbing mental and physical abuses of this cult's members by its maniacal leader. Soon, Jackson found herself fighting to save Moses's followers.  Written by AnonymousSee less",
    "2002_283": "Sixteen-year-old Lilja and her only friend, the young boy Volodja, live in Russia, fantasizing about a better life. One day, Lilja falls in love with Andrej, who is going to Sweden, and invites Lilja to come along and start a new life.",
    "2002_284": "A joinery instructor at a rehab center refuses to take a new teen as his apprentice, but then begins to follow the boy through the hallways and streets.",
    "2002_285": "Three women's escapes from their afflicted lives. Each struggles to flee from the men who confine their personal freedom.",
    "2002_286": "Mia DuBois (Calhoun) is a walking cliche--a successful therapist with an unsuccessful marriage. Her husband, Victor (St. John), is more interested in working on his laptop than on her. So she is very receptive to hearing about the wild sex...See moreMia DuBois (Calhoun) is a walking cliche--a successful therapist with an unsuccessful marriage. Her husband, Victor (St. John), is more interested in working on his laptop than on her. So she is very receptive to hearing about the wild sex life that her new client Tammy (Wilson) and Tammy's husband enjoyed, before he was murdered. Mia even accepts an invitation from Tammy to Pandora's Box, a no holds barred secret club of sex, drugs, and even more sex. She falls under the spell of a dark, handsome stranger named Hampton (White), a walking streak of sex. But is Hampton all he seems?  Written by AnonymousSee less",
    "2002_287": "The comfortable daily routines of aging Parisian actor Gilbert Valence, 76, are suddenly shaken when he learns that his wife, daughter, and son-in-law have been killed in a car crash.",
    "2002_288": "Sam Roberts thinks he has all the answers: the purpose of life, the meaning of love, the plan for a perfect future. Until Charly walks into his life.",
    "2002_289": "A conflict of interest between two high-kicking assassin sisters is complicated as they're pursued by the criminals who hired them and an equally high-kicking female cop.",
    "2002_29": "Scott Calvin has been a humble Santa Claus for nearly ten years, but it might come to an end if he doesn't find a Mrs. Claus.",
    "2002_290": "After her beloved boyfriend's suicide, a mourning supermarket worker and her best friend hit the road in Scotland, but find that grief is something that you can't run away from forever.",
    "2002_291": "A fourteen-year-old aspiring violinist finds herself under an increasing amount of pressure to keep secrets for herself, her family and her newfound best friend.",
    "2002_292": "The story of a young garage band in Sydney, Australia trying to make it big.",
    "2002_293": "Stripped of possessions and rights, German and Eastern European Jews flee to an unlikely destination to avoid persecution from the Nazis. Read more: Synopsis",
    "2002_294": "A film studying the depiction of a friendship between an art dealer named Rothman and his student, Adolf Hitler.",
    "2002_295": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.",
    "2002_296": "It's Friday night--she's moving in with her boyfriend tomorrow--so she goes out, but gets stuck in traffic--where she meets a handsome stranger.",
    "2002_297": "A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town.",
    "2002_298": "Cet Amour-là is an intimate portrait of a legendary love affair. Set against the beauty of the Breton seaside, it is also a film that revels in the insights that Marguerite Duras' writing affords.See moreCet Amour-là is an intimate portrait of a legendary love affair. Set against the beauty of the Breton seaside, it is also a film that revels in the insights that Marguerite Duras' writing affords.  Written by AnonymousSee less",
    "2002_299": "In the tomb-like quiet of their ranch-style purgatory, a divorced husband and wife fight a wordless war while mourning an unspeakable mutual loss. A sadistic lover's ritual humiliation spawns both tenderness and revenge.",
    "2002_3": "When bitten by a genetically modified spider, a nerdy, shy, and awkward high school student gains spider-like abilities that he eventually must use to fight evil as a superhero after tragedy befalls his family.",
    "2002_30": "A sweet-natured, small-town guy inherits a controlling stake in a media conglomerate and begins to do business his way.",
    "2002_300": "After seeing his ex-girlfriend (Henderson) turn down a nationally televised marriage proposal, a small-time crook (Carlyle) returns to his hometown to try and win back her heart.",
    "2002_301": "A couple elopes to get married and set up home hoping that just love will do the trick - but that's just the beginning of their story.",
    "2002_302": "In a world where luck can be taken from a lucky person by a luckier person's touch, a small group of lucky people compete to be the luckiest and for the other contestants' luck.",
    "2002_303": "A film about the war crimes of the American diplomat, Henry Kissinger.",
    "2002_304": "What happens when you get a \"gift from god\" (a financial windfall), but, many years later, find out it was just a loan -- due immediately....",
    "2002_305": "The life, success and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporaneous composer who was insanely jealous of Mozart's talent and claimed to have murdered him.",
    "2002_306": "A Princess is determined to restore her homeland's throne to its rightful heir, a young Prince with whom she falls in love.",
    "2002_307": "A young filmmaker in 1960s Paris juggles directing a cheesy sci-fi debacle, directing his own personal art film, coping with his crumbling relationship with his girlfriend, and a new-found infatuation with the sci-fi film's starlet.",
    "2002_308": "Whilst on a family vacation on the Mahurangi Peninsula in New Zealand, 13-year-old Janey begins to realize that her parents' marriage is on the rocks.",
    "2002_309": "The beauty of this movie is that you, as the reader of the subtitles, are the only one who knows what is going on. The woman and the two men all speak different languages. It is a comedy of errors up until the end.",
    "2002_31": "Stuart and Snowbell set out across town to rescue a friend.",
    "2002_310": "Tully Coates, Jr., with his good looks and chiseled body, is the local heartthrob, and while he has a new girlfriend virtually every night, he's incapable of getting close to anyone. His younger brother Earl, the shy and sensitive type, ...See moreTully Coates, Jr., with his good looks and chiseled body, is the local heartthrob, and while he has a new girlfriend virtually every night, he's incapable of getting close to anyone. His younger brother Earl, the shy and sensitive type, frequents the local revival house. The only common bond between these disparate siblings is Ella Smalley, an intelligent and even-tempered young woman who returns to their Nebraska hometown to intern at a local veterinarian's clinic. Meanwhile, their father, Tully, Sr., a rancher who gets by with the help of his two sons, carries a brooding sadness, a hint of past wounds too long in healing. The family dynamic is changed forever when several secrets surface.  Written by Sujit R. VarmaSee less",
    "2002_311": "Two corporations compete for illicit 3D manga pornography, sending spies to infiltrate each other's operations.",
    "2002_312": "A series of overlapping stories about four suburban families dealing with different maladies. Esther Gold's life is consumed by caring for her comatose son; Jim Train is sent into a tailspin when he's passed over for a promotion; Annette ...See moreA series of overlapping stories about four suburban families dealing with different maladies. Esther Gold's life is consumed by caring for her comatose son; Jim Train is sent into a tailspin when he's passed over for a promotion; Annette Jennings' family is struggling in the wake of her divorce; Helen Christianson is determined to shake up her mundane life.  Written by AnonymousSee less",
    "2002_313": "A visual social examination in the form of ten conversations between a driving woman and her various pick-ups and hitchhikers.",
    "2002_314": "First-time filmmaker and award-winning photographer Sam Jones documents the recording of Wilco's album, \"Yankee Hotel Foxtrot.\"",
    "2002_315": "A bourgeois couple, modern yet conventional. One night by accident, a young prostitute barges into their lives. Hounded down, beaten up, threatened, she will continue to struggle, with the help of a well off lady, first for her ...See moreA bourgeois couple, modern yet conventional. One night by accident, a young prostitute barges into their lives. Hounded down, beaten up, threatened, she will continue to struggle, with the help of a well off lady, first for her survival-her resurrection-then for her dignity and freedom. Stormy encounters for everyone involved.  Written by See less",
    "2002_316": "Several Jewish and Palestinian children are followed for three years and put in touch with each other, in this alternative look at the Jewish-Palestinian conflict. The three filmmakers followed a group of seven local children between 1995 ...See moreSeveral Jewish and Palestinian children are followed for three years and put in touch with each other, in this alternative look at the Jewish-Palestinian conflict. The three filmmakers followed a group of seven local children between 1995 and 1998. They all have a totally different background. These seven children tell their own story about growing up in Jerusalem. Through this portrait of their generation, we see how deep rooted and almost insoluble the problems of the Middle East have become. When the protagonists speak out in an epilogue a couple of years later, it becomes apparent that all have lost their childlike innocence.  Written by Sujit R. VarmaSee less",
    "2002_317": "After the end of World War II, a famous German conductor is accused of loyalty to the Nazi regime. He argues that art and politics are separate. An investigator thinks otherwise.",
    "2002_318": "Loose portrait of João Francisco dos Santos, also known as Madame Satã, a sometime chef, transvestite, lover, father, hero and convict from Rio de Janeiro.",
    "2002_319": "A young locksmith is forced to leave his home and family to join the Buenos Aires police force.",
    "2002_32": "Blade forms an uneasy alliance with the vampire council in order to combat the Reapers, who are feeding on vampires.",
    "2002_320": "After leaving prison, master thief Corey crosses paths with a notorious escapee and an alcoholic former policeman. The trio proceed to plot an elaborate heist.",
    "2002_321": "A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship with the cinema's projectionist.",
    "2002_322": "In 1950s Trinidad, a frustrated writer supports himself as a masseur--and soon becomes a revered mystic and politico.",
    "2002_323": "After her father suffers a stroke, his daughter is forced to take care of him.",
    "2002_324": "Operating a Television Network from Vancouver, Sardar Jasbir Singh Grewal, arranges the marriage of his only child, Simar, with Mulhapur-based, Inder Veer Singh, the son of his friend, Arjun, much to the chagrin of his snobbish wife, ...See moreOperating a Television Network from Vancouver, Sardar Jasbir Singh Grewal, arranges the marriage of his only child, Simar, with Mulhapur-based, Inder Veer Singh, the son of his friend, Arjun, much to the chagrin of his snobbish wife, Kuldip. Simar and Inder find themselves compatible, and an engagement ceremony is arranged. It is during this event that they find out that Inder has no intention of re-locating to Canada, and the ceremony is canceled. After sometime, Inder decides to visit the Grewals in order to try and convince Simar to return to India, and also visit his married sister, who he has not seen for over 7 years, as well as a former girlfriend, Jaspreet, who also live in Vancouver. Once there, he witnesses the plight of his sister, Jaspreet, and other Punjabis, making him question whether Canada is really the perceived 'heaven on Earth'; what C.B.C.D. really means; little knowing Simar has no intention of ever settling down in India.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2002_325": "A solitary embalmer meets a charming and unemployed waiter who becomes his assistant, but the two get involved in a morbid and unhealthy professional and personal relationship.",
    "2002_326": "A modernized retelling of \"MacBeth\" set in 1970s suburban Pennsylvania. Joe McBeth, an unambitious hamburger stand employee, is driven to success by his scheming wife.",
    "2002_327": "A story of doomed passion between two genius writers of the 19th century - novelist George Sand and poet Alfred de Musset.",
    "2002_328": "A romantic comedy about two trashy couples travelling to Reno to see a monster truck show.",
    "2002_329": "Zhao is an aging bachelor who hasn't been lucky in love. Thinking he has finally met the woman of his dreams, Zhao leads her to believe he is wealthy and agrees to a wedding far beyond his means. Zhao's best friend Li hatches the idea to ...See moreZhao is an aging bachelor who hasn't been lucky in love. Thinking he has finally met the woman of his dreams, Zhao leads her to believe he is wealthy and agrees to a wedding far beyond his means. Zhao's best friend Li hatches the idea to raise the money by refurbishing an abandoned bus, which they will rent out by the hour--the Happy Times Hotel--to young couples starved for privacy. Unfortunately, this plan goes awry because Zhao is too old fashioned to allow the couples to leave the bus door closed. Meanwhile, Zhao's fiancee introduces him to her spoiled son and beautiful blind stepdaughter Wu Ying, whom she sees as a burden. To be rid of the girl, she insists that Zhao take her to the Happy Times Hotel and give her a job. Zhao reluctantly agrees, then creates a series of deceptions to keep the girl occupied, including setting her up as a masseuse and enlisting his friends to pretend to be her customers. Everything that is happening between Zhao and Wu is superficially about trickery, but gradually a very real empathy grows between the young woman and the old man.  Written by Sujit R. VarmaSee less",
    "2002_33": "A Senatorial candidate falls for a hotel maid, thinking she is a socialite, when he sees her trying on a wealthy woman's dress.",
    "2002_330": "A humorous and heartwarming slice-of-life story about family and friends, dealing with the everyday struggles of people trying to bridge two cultures, as well as their attempt to find happiness and security in their new homeland.",
    "2002_331": "The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.",
    "2002_332": "It has kidnapped Roxane Labelle, a Canadian singer covered gold records and awards. To his captors, no question of release without payment of a large ransom. Father and manager of the star, Paul Labelle asks a small accountant do it. ...See moreIt has kidnapped Roxane Labelle, a Canadian singer covered gold records and awards. To his captors, no question of release without payment of a large ransom. Father and manager of the star, Paul Labelle asks a small accountant do it. Easier said than done, especially the payer also has a large sum to the Mafia and, rapidly, what Quebec account scoundrels, thieves and killers are chasing the fabulous bonanza.  Written by markyoloupSee less",
    "2002_333": "A film account and presentation of the final concert of The Band.",
    "2002_334": "A sorority girl finds her life falling apart after she develops romantic feelings for a mentally-challenged man.",
    "2002_335": "Two people who have pledged never to fall in love again then discover each other in a gay bar.",
    "2002_336": "In May 1948, shortly before the creation of the State of Israel, hundreds of immigrants from across Europe arrive in Palestine--only to risk arrest by British troops.",
    "2002_337": "Cannes, 1999. Alice, an actress, wants to direct an indie picture. Kaz, a talkative (and maybe bogus) deal maker, promises $3 million if she'll use Millie, an aging French star. But, Rick, a big producer, needs Millie for a small part in a...See moreCannes, 1999. Alice, an actress, wants to direct an indie picture. Kaz, a talkative (and maybe bogus) deal maker, promises $3 million if she'll use Millie, an aging French star. But, Rick, a big producer, needs Millie for a small part in a fall movie or he loses his star, Tom Hanks. Is Kaz for real? Can Rick sweet-talk Alice and sabotage Kaz to keep Millie from taking that deal? Millie consults with Victor, her ex, about which picture to make, Rick needs money, an ingenue named Blue is discovered, Kaz hits on Victor's new love, and Rick's factotum connects with Blue. Knives go in various backs. Wheels spin. Which deals - and pairings - will be consummated?  Written by See less",
    "2002_338": "This documentary compiles a series of Noam Chomsky's interviews and lectures that address the events of 9/11.",
    "2002_339": "The story of the hip-hop DJ from the birth of hip-hop to the invention of scratching and \"beat-juggling\" vinyl, to the more recent \"turntablism\" movement. Underdogs and virtuosos who have radically changed the way we hear and create music.",
    "2002_34": "A cynical, immature young man is taught how to act like a grown-up by a little boy.",
    "2002_340": "The story of some Vietnamese refugees as they first arrive at Camp Pendleton in the United States as the Vietnam War ends in 1975.",
    "2002_341": "Zus & Zo shows what three sisters are willing to do to stop their would-be sister-in-law from coming into possession of Paraíso, their beloved family summer home on the Portuguese coast.",
    "2002_342": "This is a comedy about mistaken identities, a hitman who sees everything in terms of the movies, and a twenty-year-old diamond heist.",
    "2002_343": "A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.",
    "2002_344": "Suraj Singh (Anil Kapoor) is in love with the beautiful and wealthy Komal (Karisma Kapoor). They dream of their perfect family together but her arrogant father Yashpal Chaudhary (Amrish Puri) detests Suraj because he is middle class youth,...See moreSuraj Singh (Anil Kapoor) is in love with the beautiful and wealthy Komal (Karisma Kapoor). They dream of their perfect family together but her arrogant father Yashpal Chaudhary (Amrish Puri) detests Suraj because he is middle class youth, with no riches whatsoever. Komal cuts all ties with her father and marries Suraj, she is soon pregnant.Komal and her estranged father meet at a family wedding and her forgives her for leaving abruptly. Yashpal agrees to meet Suraj but when they reach home they see a seductress inside, wearing Komal's gown and drinking tea in the kitchen. Suraj walks in totally oblivious to the fact that there is a woman inside her house that he does not know. Komal questions the seductress and she says she shares Komal's husband. Komal is furious and tries to commit suicide but Suraj stops her and repeatedly tries to prove his innocence. It turns out Yashpal set up the whole thing to break their marriage. Komal leaves her husband with her father. She delivers a baby boy but Yashpal wants to make sure that the one thing that can bring her daughter and Suraj together be eliminated immediately. He hires hit men to kill the baby but Suraj manages to get away with his son.They move to a unknown place and he raises his son with the help of the villagers. Suraj later meets Vaijanti (Shilpa Shetty) an eccentric fisher woman who his son sees as a mother and friend. Vaijanti begins to love Suraj, and hopes that he feels the same way.Komal depressed and lonely spots her son with Suraj. Then begins a bitter custody battle between her and Suraj.  Written by gavin@sunny_deol2009@yahoo.comSee less",
    "2002_345": "John, a gay Illinois small town cop moves to Los Angeles, hoping to fit into a place more welcoming of his sexuality. He soon discovers the \"circuit,\" where he meets an insecure hustler, who draws John into drug abuse and illicit sex.",
    "2002_346": "A documentary film about couples that swing.",
    "2002_347": "An inspirational tale about the relationship between two Sioux Indian brothers living on the Pine Ridge Indian reservation.",
    "2002_348": "Michael, a young mechanic, is forced to choose between a daring tryst with an alluring stranger and the habitual comfort of his bittersweet obsession: his beautiful young tenant.",
    "2002_349": "After Richard Alpert was fired from Harvard in 1963 for conducting psychedelic drug research, he journeyed to India, found a guru and was renamed Ram Dass (\"Servant of God\").",
    "2002_35": "From outer space countries don't exist.",
    "2002_350": "A bittersweet and intimate look at friendship, love and growing up. The easy life of summertime in Myrtle Beach is turned upside down for one local girl when two strangers come to town: a beautiful temptress and a charming drifter.",
    "2002_351": "In late nineteenth century Charante, Protestant minister Jean Barnery causes local disquiet when he arranges a separation from his obsessive wife - and more talk when he decides to take her back. By this time he has been drawn to Pauline, ...See moreIn late nineteenth century Charante, Protestant minister Jean Barnery causes local disquiet when he arranges a separation from his obsessive wife - and more talk when he decides to take her back. By this time he has been drawn to Pauline, niece of a Cognac distiller, and this precipitates him divorcing his wife, settling on her and his daughter the shares he owns in his family's porcelain factory. He resigns the ministry, marries Pauline, and moves to Switzerland and a tranquil life. On the death of his father he agrees to return home to save the factory, knowing the problems it will bring will change his life completely. So it proves, with service in the Great War having a further profound impact on him and those around him.  Written by J-26See less",
    "2002_352": "Based on the true story of two chambermaids (the Papin sisters) of 1930s France who murdered their employer and her daughter.",
    "2002_353": "Following the unexplained suicide of his wife Liza, a web designer turns to gasoline fumes and remote-control airplanes while avoiding an inevitable conflict with his mother-in-law.",
    "2002_354": "Two young women find themselves struggling to survive in Paris, street-wise Nathalie, a stripper, and naïve Sandrine, a barmaid. Together, they discover that sex can be used to their advantage, and pleasure. Both find positions in the ...See moreTwo young women find themselves struggling to survive in Paris, street-wise Nathalie, a stripper, and naïve Sandrine, a barmaid. Together, they discover that sex can be used to their advantage, and pleasure. Both find positions in the office of a large bank, where bored, under-stimulated, prey are easy pickings. After making their way though several layers of executives at the bank, with destructive, and lucrative, results, they approach Christophe, scion to the bank director. What they don't know is that he is a manipulative voyeur, whose last two lovers set themselves on fire when he rejected them. A connoisseur of high-class orgies, he is only interested in new talent to satisfy the appetites of all whom he controls. In him, the girls have found an opponent who knows all their wiles, and will challenge their simple under-class friendship with levels of jealousy and ecstasy that they have never experienced before. Will they survive?  Written by DarkStarZumaBeachSurfinApolcalypseWowSee less",
    "2002_355": "Documentary about the gender-bending San Francisco performance group who became a pop culture phenomenon in the early 1970s.",
    "2002_356": "Two brothers go to France to claim the chateau they have inherited.",
    "2002_357": "After a martini-induced rampage, a fantasy-prone young woman is placed under house arrest.",
    "2002_358": "The people of a small village in Victorian India stake their future on a game of cricket against their ruthless British rulers.",
    "2002_359": "A Russian poet and his interpreter travel to Italy to research the life of an 18th-century composer.",
    "2002_36": "Hoping to alter the events of the past, a 19th century inventor instead travels 800,000 years into the future, where he finds humankind divided into two warring races.",
    "2002_360": "Seymour Polatkin is a successful, gay Native American poet from Spokane who confronts his past when he returns to his childhood home on the reservation to attend the funeral of a dear friend.See moreSeymour Polatkin is a successful, gay Native American poet from Spokane who confronts his past when he returns to his childhood home on the reservation to attend the funeral of a dear friend.  Written by AnonymousSee less",
    "2002_361": "For years, the post office has delivered mail addressed to Santa Claus to the small isolated community of North Station, the closest thing they know name-wise to the North Pole. Sometime in the 1950's, teen-aged North Station residents ...See moreFor years, the post office has delivered mail addressed to Santa Claus to the small isolated community of North Station, the closest thing they know name-wise to the North Pole. Sometime in the 1950's, teen-aged North Station residents Samuel and his girlfriend Evelyne continue a tradition started by Samuel's grandfather Edgar - who recently passed away - of personally answering those letters as Santa Claus. Because of a snowstorm, those letters written by Samuel and Evelyne can't be delivered before Christmas, so Samuel takes it upon himself to see those letters make it out of North Station on time. However, Samuel's ski-doo is found abandoned in the woods, and Samuel is thought to have perished in the storm. Fifty years later, there are fewer letters written every year because fewer children believe in the magic of Santa Claus. One of the letters that is written is from a young girl named Satia - Evelyne's granddaughter - who has a special Christmas wish for her ailing grandmother. The letter gets into the hands of one person who doesn't quite know its meaning but thinks he can do something to fulfill its wish, and in turn help re-instill a little bit of magic back into Christmas. However, a mishap that occurs during the fulfillment of the wish might threaten the entire existence of Christmas.  Written by HuggoSee less",
    "2002_362": "The July 3rd, 1973 historic concert of the 'leper Messiah'. This was to be David Bowie's last concert with the Ziggy persona and the Spiders from Mars. A great medley of 'Wild Eyed Boy From Freecloud'/'All The Young Dudes'/'Oh! You Pretty ...See moreThe July 3rd, 1973 historic concert of the 'leper Messiah'. This was to be David Bowie's last concert with the Ziggy persona and the Spiders from Mars. A great medley of 'Wild Eyed Boy From Freecloud'/'All The Young Dudes'/'Oh! You Pretty Things', a Lou Reed cover, and a Rolling Stones cover are but some of the highlights.  Written by MasoK See less",
    "2002_363": "The life story of Milford Beeghly: Iowa farmer, early developer of hybrid seed corn, husband, father, grandfather.",
    "2002_364": "A Catholic boy tries to convert a terminally ill Jewish boy, so he will be able to go to Heaven.",
    "2002_365": "A man returns to Victoria, Australia, where he grew up, and encounters a mysterious woman who reminds him of someone he once knew.",
    "2002_366": "Documentary about French philosopher (and author of deconstructionism) Jacques Derrida, who sparked fierce debate throughout American academia.",
    "2002_367": "A wanted gangster is both king and prisoner of the Casbah. He is protected from arrest by his friends, but is torn by his desire for freedom outside. A visiting Parisian beauty may just tempt his fate.",
    "2002_368": "A visual montage portrait of our contemporary world dominated by globalized technology and violence.",
    "2002_369": "The Peruvian army captain Pantaleon Pantoja, a very serious and efficient officer, is chosen to set up a special service of 'visitors' to satisfy the sexual needs of the soldiers posted on remote jungle outposts.",
    "2002_37": "A wild stallion is captured by humans and slowly loses the will to resist training, yet, throughout his struggles for freedom, the stallion refuses to let go of the hope of one day returning home to his herd. Read more: Synopsis",
    "2002_370": "If you go down to the woods tonight be sure of the biggest surprise of your life! When Hansel and Gretel's wicked stepmother leads them into the dark forest, the children find themselves in an enchanted world of magical creatures and ...See moreIf you go down to the woods tonight be sure of the biggest surprise of your life! When Hansel and Gretel's wicked stepmother leads them into the dark forest, the children find themselves in an enchanted world of magical creatures and hideous monsters. But when they stumble upon a house made of sweets things take a turn for the worse, as inside the cottage is an evil witch who's hungry. And Hansel and Gretel have a sneaking suspicion they might be on the menu! But will the ever-forgetful Sandman and the runny-nosed Boogeyman be able to save them?  Written by AnonymousSee less",
    "2002_371": "Jenny Lamour wants to succeed in music hall. Her husband and accompanist is Maurice Martineau, a nice but jealous man. When he knew Jenny is making eyes at Brignon, an old businessman, in order to get some engagements, he looses his temper...See moreJenny Lamour wants to succeed in music hall. Her husband and accompanist is Maurice Martineau, a nice but jealous man. When he knew Jenny is making eyes at Brignon, an old businessman, in order to get some engagements, he looses his temper and threatens Brignon with death. But Jenny went anyway to a rendez-vous at the old man's, who is murdered the same evening. The criminal investigations are lead by Inspector Antoine...  Written by YepokSee less",
    "2002_372": "A Jewish strongman performs in Berlin as the blond Aryan hero Siegfried.",
    "2002_373": "A clueless boss has no idea what to do with his mundane office worker whose refusal of duties only gets worse each passing minute.",
    "2002_374": "Documentary on the deaths of Tupac Shakur and Biggie Smalls and the East Coast/West Coast, hip-hop/rap rivalry that culminated in late 1996 and early 1997.",
    "2002_375": "Biopic about notorious American serial killer Jeffrey Dahmer, taking place in both the past and the present.",
    "2002_376": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
    "2002_377": "A beautiful young woman takes her father's place as the prisoner of a mysterious beast, who wishes to marry her.",
    "2002_378": "Is today's fanaticism tomorrow's policy? In a West Bank settlement, Rabbi Meltzer has a grand design: he's building a movement \"to pray at the Temple Mount.\" His yeshiva has scholars, and the settlement is getting its own military company ...See moreIs today's fanaticism tomorrow's policy? In a West Bank settlement, Rabbi Meltzer has a grand design: he's building a movement \"to pray at the Temple Mount.\" His yeshiva has scholars, and the settlement is getting its own military company to be commanded by Menachem, a disciple of the rabbi. He also wants his daughter, Michal, to marry Pini, the yeshiva's best scholar. Michal has no interest in Pini, but she is attracted to Menachem. When she rebuffs Pini, he hatches a bold and secret plan. Is jealousy the motivation or something else? Meanwhile, the army and Mossad are closely watching the rabbi's activities and Menachem's military training. Who is trustworthy?  Written by See less",
    "2002_379": "A couple decide to pick up a hitchhiker, but he ends up being a psychotic stalker who puts in them in danger.",
    "2002_38": "A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.",
    "2002_380": "Abandoned by her lover, the aristocratic Madame Lubov Ranevskaya returns to Russia, only to see her fragrant cherry orchard in full bloom: a painful reminder of her dire economic state and the imminent foreclosure of the enviable property.",
    "2002_381": "Gordon McLeod is the manager of a second tier Scottish football team. Faced with pressure from his American owner, he is forced to bring on a marquee player to improve the fortunes of the team and prevents its being moved from the fiercely...See moreGordon McLeod is the manager of a second tier Scottish football team. Faced with pressure from his American owner, he is forced to bring on a marquee player to improve the fortunes of the team and prevents its being moved from the fiercely loyal town it's been for a century. Along the way, McLeod must battle his own demons, including long-standing tiffs with both his daughter and a former colleague who betrayed him.  Written by Chris NeumanSee less",
    "2002_382": "An honorably discharged soldier returns home to New Orleans, hoping to break away from his upbringing as a trained prostitute, but his brothel-madam mother has other expectations.",
    "2002_383": "An Iranian-born teenager living in suburban New Jersey thinks of herself as simply an American until anti-Iranian sentiment erupts in her community after American hostages are held in Iran.",
    "2002_384": "Sureel is a young, first generation East Indian-American. All he wants is to be like his American friends, but his strict, immigrant parents keep a tight rein on his life. Will he realize his dream of performing rock and roll music?",
    "2002_385": "Young and handsome Sergio works the night shift as a trash collector in Lisbon, Portugal. He can't force himself to connect with his pretty female co-worker Fatima, who displays an avid interest in him, so instead Sergio roams the city ...See moreYoung and handsome Sergio works the night shift as a trash collector in Lisbon, Portugal. He can't force himself to connect with his pretty female co-worker Fatima, who displays an avid interest in him, so instead Sergio roams the city with the trash company's pet dog. Eventually Sergio becomes fascinated with a sleek motorcycle, and then also its owner, João - a young man totally indifferent to Sergio. The frustrated trash collector's surfacing sexual desires unleash his darkest impulses, sending him down a dangerous path of violence, depravity and degradation.  Written by mikhail080@cs.comSee less",
    "2002_386": "A silent film production company and cast make a difficult transition to sound.",
    "2002_387": "A female election agent and a gun-toting soldier try to collect votes among the local islanders with mixed success.",
    "2002_388": "Documentary about Fidel Castro, covering 40 years of Cuban Revolution. Rare Fidel Castro footage: he appears swimming with a bodyguard, visiting his childhood home and school, playing with his friend Nelson Mandela, meeting kid Elián ...See moreDocumentary about Fidel Castro, covering 40 years of Cuban Revolution. Rare Fidel Castro footage: he appears swimming with a bodyguard, visiting his childhood home and school, playing with his friend Nelson Mandela, meeting kid Elián Gonzalez, and celebrating his birthday with the Buena Vista Social Club group.  Written by lukejoplin@infolink.com.brSee less",
    "2002_389": "Story of a 29-year-old Ivy League-educated, self-help author as she grudgingly falls for a shock-jock radio host with a reputation for hitting on his bimbo guests.",
    "2002_39": "The Cortez siblings set out for a mysterious island, where they encounter a genetic scientist and a set of rival spy kids.",
    "2002_390": "A documentary on the life and career of Yiddish actor Pesach Burstein and his family.",
    "2002_391": "Documentary look at five unusual homes and the people who built (or adapted) them.",
    "2002_392": "Seaside takes place in a small coastal town on the Bay of Somme. The year-round inhabitants find ways to make their lives work; Paul, a lifeguard in the summer, works at the grocery all winter. His mother, Rose (Ogier) likes to play the ...See moreSeaside takes place in a small coastal town on the Bay of Somme. The year-round inhabitants find ways to make their lives work; Paul, a lifeguard in the summer, works at the grocery all winter. His mother, Rose (Ogier) likes to play the slots just about anytime; his girlfriend Marie works in the local factory - the town's biggest business - but watching the summertime vacationers each year just makes her increasingly curious about what else might be out there. From these and several other stories, aided by close, revealing observations, we see a community perched between transition and stasis.  Written by AnonymousSee less",
    "2002_393": "Paul, a handsome and talented music student is employed as the page-turner at one of the world famous pianist Kennington's concerts in San Francisco.",
    "2002_394": "A stage-play producer devises a plan to make money by producing a sure-fire flop.",
    "2002_395": "A teenage drifter finds an opportunity to turn his life around when he joins a high-school football program with a hard-nosed coach.",
    "2002_396": "Barlow is a hard-drinking, heavy-smoking, long-haired, and deeply unhappy aspiring writer who pulls a dozen rejection slips out of his mailbox every day while trying to get through his life with some semblance of purpose.",
    "2002_397": "After hitting the road a man encounters characters that make him realize the importance of family.",
    "2002_398": "A group of friends each face an emotional crisis as they approach thirty years of age.",
    "2002_399": "A man prepares himself to be transferred to a detention center and rest home where he will relive one more time the highlights of his youth.",
    "2002_40": "A New York suburban couple's marriage goes dangerously awry when the wife indulges in an adulterous fling.",
    "2002_400": "After a bull dies in an arena, its remains are transported throughout Belgium, France, and Spain, where various characters cross its path.",
    "2002_401": "The legendary story of the Martin Handcart Company is the backdrop for this theatrically released drama directed by Kels Goodman (Producer of Tears of a King: The Latter-days of Elvis Presley and Will it Blend). Handcart follows Samuel ...See moreThe legendary story of the Martin Handcart Company is the backdrop for this theatrically released drama directed by Kels Goodman (Producer of Tears of a King: The Latter-days of Elvis Presley and Will it Blend). Handcart follows Samuel Hunter (Jaelan Petrie) as he joins the company because of his love for Mormon pioneer, Abigail (Stephanie Albach).See less",
    "2002_402": "An ecologist schoolteacher wants to create a reserve for the birds of the ponds near his village.",
    "2002_403": "An egoistic and overprotective father, tests his soon-to-be son in law whether he is suitable for his daughter or not. Mayhem ensues after he learns that his future son in law is not that what he imagined.",
    "2002_404": "A grim retelling of the television series \"The Vision of Escaflowne\".",
    "2002_405": "Irish writer and political activist Brendan Behan, is befriended as a teenager in a British labor camp by a liberal warden.",
    "2002_406": "Documentary about war photographer James Nachtwey, considered by many the greatest war photographer ever.",
    "2002_407": "Series of 12 short movies from the start of the twentieth century, compiled by Michel Reilhac. These movies were the first adult movies, most of them were made in order to explain how sex works to unexperimented young men before their ...See moreSeries of 12 short movies from the start of the twentieth century, compiled by Michel Reilhac. These movies were the first adult movies, most of them were made in order to explain how sex works to unexperimented young men before their first relation with a prostitute...  Written by AnosexymousSee less",
    "2002_408": "A collection of expertly photographed scenes of human life and religion.",
    "2002_409": "Documentary centered around Athens GA rock & roll band Widespread Panic. Featuring interviews and performances by the band, and friends of the band, including Vic Chesnutt, Col. Bruce Hampton, Taj Mahal, Jerry Joseph, Danny Hutchins and ...See moreDocumentary centered around Athens GA rock & roll band Widespread Panic. Featuring interviews and performances by the band, and friends of the band, including Vic Chesnutt, Col. Bruce Hampton, Taj Mahal, Jerry Joseph, Danny Hutchins and David Blackmon.  Written by TNJed14See less",
    "2002_41": "When a Miami dentist inherits a team of sled dogs, he's got to learn the trade or lose his pack to a crusty mountain man.",
    "2002_410": "An elderly man and his dog struggle to survive on his government pension in Rome.",
    "2002_411": "Erik is an ambitious teenager who spends more time posting fliers for his favorite rapper, Prolifik, than sitting in the classroom. When he and his best friend stumble across a dead body one night, they trigger a series of tragic events.",
    "2002_412": "In the late 1930s, three reclusive middle-aged spinster sisters live on their run down family estate in Ireland. Otto Beck, a perpetual graduate student from Bavaria with a habit of making pompous declamations, rents the back lodge to work...See moreIn the late 1930s, three reclusive middle-aged spinster sisters live on their run down family estate in Ireland. Otto Beck, a perpetual graduate student from Bavaria with a habit of making pompous declamations, rents the back lodge to work on his esoteric thesis. Imogen Langrishe, the least repressed of the sisters, begins an affair with Otto. Imogen takes the love affair seriously, but Otto just enjoys the cheap lodging and the comfort of Imogen.  Written by Will GilbertSee less",
    "2002_413": "Even though they grew up in opposite parts of France, Gwen and Lise are best friends and spend every summer vacation together on the Brittany coast where Gwen lives and Lise's family has a summer home. But this summer is different because ...See moreEven though they grew up in opposite parts of France, Gwen and Lise are best friends and spend every summer vacation together on the Brittany coast where Gwen lives and Lise's family has a summer home. But this summer is different because Lise's family isn't going on vacation for reasons that she won't explain to Gwen. Sick of her parents bickering about money and missing her bosom buddy, Gwen finds a boyfriend and mingles with some horny out-of-townees. Now fifteen, she's discovered that summer can be fun even if Lise isn't there. Then suddenly, Lise shows up at Gwen's house uninvited to stay for a couple of weeks. The following days are filled with unexpected surprises, causing the girls to reevaluate the importance of their friendship and the nature of their teenage anxieties.See less",
    "2002_414": "The story of serial killer Ted Bundy.",
    "2002_415": "Max is a lonely, recently orphaned young boy who is frequently bullied by his classmates. One night after accepting a dare, Max wanders into a mysterious mansion, where he meets the Great Zamboni, an eccentric magician.",
    "2002_416": "Alone in a foreign city, Cassandra must solve a family's darkest, deepest secrets before she can confront her own past.",
    "2002_417": "A group of thirtysomethings having problems with fidelity gets an opportunity to turn back the clock.",
    "2002_418": "Dramatization of Russian ballet star Vaclav Nijinsky's diaries which detail his madness as well as his homosexual relationship with Ballet Russe impresario Sergei Diaghilev and his marriage to his Hungarian wife.",
    "2002_419": "The story of a young journalist who journeys to Iceland to find her missing fiance only to encounter a mythical creature. She eventually forges a relationship with the being.",
    "2002_42": "The story of the first major battle of the American phase of the Vietnam War, and the soldiers on both sides that fought it, while their wives wait nervously and anxiously at home for the good news or the bad news.",
    "2002_420": "This movie tells five stories set in a single day at the famed Chelsea Hotel in New York City, involving an ensemble cast of some 30-35 characters.",
    "2002_421": "A bureaucrat tries to find a meaning in his life after he discovers he has terminal cancer.",
    "2002_422": "A basketball player strikes a deal with the mob to fix a basketball game.",
    "2002_423": "An Italian-American travels back to his ancestors land to coach a colorful team in Italy's fledgling American Football League. A beautiful young girl forces him to face the same decision as his immigrant grandfather 70 years earlier.",
    "2002_424": " Read more: Synopsis",
    "2002_425": "A woman grows increasingly fascinated with her body after suffering a disfiguring accident.",
    "2002_426": "This is the story of wronged and misunderstood Arvasu (Milind Soman), a brahman by caste, who has become a performing actor. He loves Nittilai (Sonali Kulkarni), who reciprocates his love, but seeks approval of her father and her village's...See moreThis is the story of wronged and misunderstood Arvasu (Milind Soman), a brahman by caste, who has become a performing actor. He loves Nittilai (Sonali Kulkarni), who reciprocates his love, but seeks approval of her father and her village's elders before marrying him. Arvasu's brother is Parvasu (Jackie Shroff) who has been conducting a major prayer ceremony to appease Devraj Indra (Amitabh Bachchan) so that their region may get rain. Arvasu's father is Raibhya (Mohan Agashe), who dislikes both his sons, and wishes that he cremate them before his death. Raibhyu, suspects Vishaka (Raveena Tandon) Parvasu's wife, of having an illicit affair with Yarvaki (Nagarjuna), and detests her. Yavarki loves Vishaka, but left her to worship and pray to Devraj Indra for 10 years, and on his return found her married to Parvasu. Parvasu married Vishaka, lived with her happily for 3 years, before leaving her to conduct the prayer ceremoney for Devraj Indra. On finding that Vishaka has met with Yavarki, an engraged Raibhya summons a Brahm Rakshas, a demon (Prabhu Deva) to kill Yavarki. The demon does so, and Arvasu has to cremate him; this delays his appointment with Nittilai's dad and her village elders, and as a result she is married to someone else. When Parvasu hears of the death of Yavarki, he kills his father, and subsequently blames Arvasu for this and has him badly beaten up and left for dead. When Nittilai hears of this, she comes to the rescue of Arvasu, and finds that she is being hunted by her husband and herbrother, who will kill her on sight. Sutradhar (Raghuvir Yadav) arranges an act to entertain the Devas, and as a result Arvasu goes berserk, Nittilai exposes herself and is killed by her husband; Parvasu admits failure and cremates himself. Thus one by one, whoever, was close to Arvasu is dead. Finally appeased, Devraj Indra appears, and Arvasu is allowed a wish of his choice. The only thought in Arvasu's mind is to bring Nittilai back to life, but will Devraj Indra turn history around and help Arvasu?  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2002_427": "Yankie director Don Tyler faces mounting insecurity and declining health while on location in Beijing, so his assistant hires down-and-out camerman YoYo to take the reins. Scrambling, studio boss sells the sagging picture to a Japanese ...See moreYankie director Don Tyler faces mounting insecurity and declining health while on location in Beijing, so his assistant hires down-and-out camerman YoYo to take the reins. Scrambling, studio boss sells the sagging picture to a Japanese media company. But YoYo is determined to upstage the whole production by granting the director's wish to have a grand \"comedy funeral\". To raise the money for it, he auctions off advertising and sponsorships for the funeral to companies around the world. But wait...is Don getting better?  Written by AnonymousSee less",
    "2002_428": "A sarcastic playwright in LA gets new neighbors - single mom and 8 y.o. girl. His wife wants kids and babysits the girl. He doesn't want kids yet plays with her to find out how children talk - for his play. Paternal instincts?",
    "2002_429": "A soap opera actor wants to finish Bolivar's dream of a \"Great Colombia\": a super-state of 5 Latin-American countries to stop institutional chaos, lack of opportunity and ignite the rebuilding of the region after 160 years of internal war.",
    "2002_43": "Two Los Angeles homicide detectives are dispatched to a northern town where the sun doesn't set to investigate the methodical murder of a local teen.",
    "2002_430": "Almost forty years after the John F. Kennedy assassination, an ex-Marine named Walter Ohlinger has come forward with a startling claim.",
    "2002_431": "Update on Leo Tolstoy's \"The Death of Ivan Ilyich,\" set in contemporary Hollywood.",
    "2002_432": "ETOILES: DANCERS OF THE PARIS OPERA BALLET celebrates the legacy of one of the best ballet companies in the world by weaving together rehearsals, tour snapshots and performances of classical ballets such as Swan Lake and La Sylphide, as ...See moreETOILES: DANCERS OF THE PARIS OPERA BALLET celebrates the legacy of one of the best ballet companies in the world by weaving together rehearsals, tour snapshots and performances of classical ballets such as Swan Lake and La Sylphide, as well as contemporary works such as Maurice Bejart's Ninth Symphony, Jiri Kylian's Doux Mensonge (Sweet Lies) and Pierre Darde's Orison.See less",
    "2002_433": "A North Carolina sheriff investigates the near-fatal drug overdose of an underachieving college girl, and uncovers many sordid details of her life before and during her descent into drugs and debauchery.",
    "2002_434": "French essay film focusing on global political turmoil in the 1960s and '70s, particularly the rise of the New Left in France and the development of socialist movements in Latin America.",
    "2002_435": "A Bolivian immigrant working illegally as a cook in a small restaurant in Buenos Aires suffers abuse and discrimination from its customers.",
    "2002_436": "Documentary chronicling America's justice system. Follows two female inmates - victims of horrific violence and tragedy - who are serving time in a Maryland juvenile detention center. Read more: Synopsis",
    "2002_437": "Itinerant Kurdish teachers, carrying blackboards on their backs, look for students in the hills and villages of Iran, near the Iraqi border during the Iran-Iraq war. Said falls in with a group of old men looking for their bombed-out ...See moreItinerant Kurdish teachers, carrying blackboards on their backs, look for students in the hills and villages of Iran, near the Iraqi border during the Iran-Iraq war. Said falls in with a group of old men looking for their bombed-out village; he offers to guide them, and takes as his wife Halaleh, the clan's lone woman, a widow with a young son. Reeboir attaches himself to a dozen pre-teen boys weighed down by contraband they carry across the border; they're mules, always on the move. Said and Reeboir try to teach as their potential students keep walking. Danger is close; armed soldiers patrol the skies, the roads, and the border. Is there a role for a teacher? Is there hope?  Written by See less",
    "2002_438": "An old woman helps a young boy resolve his feelings over the death of his mother.",
    "2002_439": "The problematic lives of teenager students for whom the singer Lily Chou-Chou's dreamy music is the only way to escape an alienating, violent and insensitive society.",
    "2002_44": "In London during World War II, this is the story of Wendy's daughter, Jane, who is kidnapped by Captain Hook and Peter Pan must come to the rescue.",
    "2002_440": "Chronicles the rise and fall of a prominent, and particularly ruthless English gangster.",
    "2002_441": "Teddy Bears Picnic covers an annual encampment of prominent male leaders at the Zambezi Glen, a thinly-veiled reference to the Bohemian Grove. Read more: Synopsis",
    "2002_442": "",
    "2002_443": "An actor becomes increasingly introverted and psychotic and his entire family attempts to intervene.",
    "2002_444": "Working at a fishing resort in an idyllic location, but surrounded by various facets of human unpleasantness, a young mute woman falls in love with a man on the run from the law for committing murder.",
    "2002_445": "This is the story of three horses born on the same night and charts their life stories. One horse is sent to a stud farm, but on the way it is involved in a car crash and escapes into the mountains. The second becomes a racehorse aiming to...See moreThis is the story of three horses born on the same night and charts their life stories. One horse is sent to a stud farm, but on the way it is involved in a car crash and escapes into the mountains. The second becomes a racehorse aiming to win. The final one becomes an eventer but doesn't preform well and finally becomes a stunt horse in the movies. This film shows all the ups and downs, success's and failures of the horses who started life together but now are completely different.  Written by AnonymousSee less",
    "2002_446": "A man pines for a woman for years, but is afraid to tell her, finally enlisting the help of his friends to win her love.",
    "2002_447": "A Jewish girl in nineteenth century London, dreams of becoming a stage actress.",
    "2002_448": "Seventy-six-year-old Cuban street musician Miguel Del Morales, known as El Gallo (The Rooster), travels around Cuba with his guitar, making music in the homes of friends, in bars, and on street corners, in courtyards and stairwells. His ...See moreSeventy-six-year-old Cuban street musician Miguel Del Morales, known as El Gallo (The Rooster), travels around Cuba with his guitar, making music in the homes of friends, in bars, and on street corners, in courtyards and stairwells. His rich voice, colored by a lifetime of cigarettes and rum, weathered by the sun and rain, bespeaks the joys and sufferings of his countrymen. An urban troubadour, Del Morales has been called \"a living memory of Cuban bolero.\"  Written by Sujit R. VarmaSee less",
    "2002_449": "After his students are killed by the One Armed Boxer, a vengeful and blind Kung Fu expert travels to a village where a martial arts contest is being held and vows to behead every one armed man he comes across.",
    "2002_45": "A Disney animated version of \"Treasure Island\". The only difference is that this movie is set in outer space with alien worlds and other galactic wonders.",
    "2002_450": "Psychiatrist Ty Adams doesn't believe in using drugs, but the head of Sedah State Hospital does, then 'Satan' arrives ~ walk-in patient extraordinaire... From there it's a full-on freaky ride.",
    "2002_451": "Every year the most beautiful girl will be sacrificed to the Python God. When a girl named Sia is the next to be sacrificed, she hides in the house of the village idiot, a man who goes around shouting hyper-aggressive criticisms against ...See moreEvery year the most beautiful girl will be sacrificed to the Python God. When a girl named Sia is the next to be sacrificed, she hides in the house of the village idiot, a man who goes around shouting hyper-aggressive criticisms against everything. Sia is found by the soldiers but the army commander had for some time prepared a revolt against the emperor and saves Sia on the way. Will Sia reveals the terrible secret she learned about the Python God ?  Written by Max Scharnberg, Stockholm, SwedenSee less",
    "2002_452": "During the Japanese occupation of China, two prisoners are dumped in a peasant's home in a small town. The owner is bullied into keeping the prisoners until the next New Year, at which time they will be collected. The village leaders ...See moreDuring the Japanese occupation of China, two prisoners are dumped in a peasant's home in a small town. The owner is bullied into keeping the prisoners until the next New Year, at which time they will be collected. The village leaders convene to interrogate the prisoners. The townspeople then struggle to accommodate the prisoners. One is a bellicose Japanese nationalist, the other a nervous translator. Will the townspeople manage to keep the prisoners until the New Year?  Written by Ken Miller See less",
    "2002_453": "A hitman falls in love with the boss's girlfriend, who may just be his next target.",
    "2002_454": "A look at the \"Hell House\" performed annually in October by the youth members of Trinity Church (Assemblies of God) in Cedar Hill, Texas (a Dallas suburb) - seen by over 10,000 visitors each year. We see the organization and planning of ...See moreA look at the \"Hell House\" performed annually in October by the youth members of Trinity Church (Assemblies of God) in Cedar Hill, Texas (a Dallas suburb) - seen by over 10,000 visitors each year. We see the organization and planning of the event - including auditions, construction, scripting and rehearsals - largely through the involvement of one family: a single father with 4 children (one of whom suffers from cerebral palsy) including his daughter, a cast member.  Written by scgary66See less",
    "2002_455": "A young Italian actress embarks on a self-destructive spree of sex, drugs and other excess while doing some soul searching to find the path for redemption.",
    "2002_456": "An ex-convict's plans to turn legit go awry.",
    "2002_457": "A study, mostly chronological, of the life of Nick Drake (1948-1974). Gabrielle, his older sister, tells us of her brother's birth in Burma, childhood in Warwickshire, life at Cambridge and in London, then back to his parents' home in ...See moreA study, mostly chronological, of the life of Nick Drake (1948-1974). Gabrielle, his older sister, tells us of her brother's birth in Burma, childhood in Warwickshire, life at Cambridge and in London, then back to his parents' home in Tanworth. His parents describe his habits and personality. Two friends and the producer, arranger, sound engineer, and photographer for his three albums comment. His mother, a musician and poet, is an early influence. His quiet folk style made his one tour a disaster. His lack of success and gradual withdrawal end with his death at 26. Eleven of his recordings play on the soundtrack, usually as we see his room, a city, or the Warwickshire countryside.  Written by See less",
    "2002_458": "A man who performs as a children's birthday party clown tries to piece his life back together after being gang-raped.",
    "2002_459": "Bobby G. lives life on the edge in this real, raw New York street drama. Bobby is a small-time coke dealer, always on the hustle but rarely successful. He lives in Hell's Kitchen with his Puerto Rican girlfriend Lucy, who makes ends meet ...See moreBobby G. lives life on the edge in this real, raw New York street drama. Bobby is a small-time coke dealer, always on the hustle but rarely successful. He lives in Hell's Kitchen with his Puerto Rican girlfriend Lucy, who makes ends meet as a prostitute. A typical day finds Bobby selling $20 bags to neighborhood locals and passing cars. A yuppie kid looking to score a kilo of coke approaches him to broker a deal and Bobby sees the opportunity of a lifetime to make some real money. His rough days may just be over. With the tidy profit he could even leave the business. Playing out of his league, Bobby arranges to get the kilo from Astro, a fearsome, high-level drug dealer. Though Lucy announces that she's decided to go back to Puerto Rico and pleads with him to make a fresh start too, Bobby is sticking to his deal and isn't going anywhere now, convinced he'll be 'livin' large in a matter a' days. \"On deal day the client gets nervous and the plan goes awry with Bobby turning over the merchandise without being able to hold on to the cash. He now fears for his life unless he can come up with the money, fast, to pay back Astro. Seized with panic Bobby seeks out an acquaintance, Dollar Bill, who puts him in touch with a mob figure who needs somebody \"whacked\" and is willing to pay big bucks for it too. Though Bobby has never fired a gun in his life, he carries out the execution. The act plunges him into a state of shock and torment verging on madness. In the ensuing hours, Bobby, his mind in a daze, will find redemption in a bizarre journey involving a homeless woman, the Hudson River, and a blind street-peddler named Popeet. He will also learn, that what fate may give, she is just as free to take away.  Written by Jason McCallumSee less",
    "2002_46": "The story of how the novel \"Mrs. Dalloway\" affects three generations of women, all of whom, in one way or another, have had to deal with suicide in their lives.",
    "2002_460": "A documentary about the collaboration between dance company Pilobolus and Maurice Sendak, who together created a dance-theater piece about the Holocaust.",
    "2002_461": "A lonely plumber poses as a director to meet women, and the writer whose script he's stolen builds on his ruse to get her movie made.",
    "2002_462": "Journalist Steve O'Malley wants to write a biography of a national hero who died when his car ran off a bridge. Steve receives conflicting reports and tales that make him question what the truth about the hero is.",
    "2002_463": "A painter who finds success (and true love) after a pickpocket steals one of his works, gives it a false authorship and promotes the imaginary artist to instant success so he can cash in on his ill-gotten gains.",
    "2002_464": "",
    "2002_465": "In the first scene of this dark comedy, defense lawyer Jake Jorgenson learns of his wife's infidelity when he hears her orgasmic escapades on an audio tape made by a former client. As Jake tries to reclaim the life he covets by killing his...See moreIn the first scene of this dark comedy, defense lawyer Jake Jorgenson learns of his wife's infidelity when he hears her orgasmic escapades on an audio tape made by a former client. As Jake tries to reclaim the life he covets by killing his wife's lover, his carefully constructed life begins to unravel. His decision to ask the former client for help brings three amateur hitmen into the mix. Their \"simple job\" turns bad, raising the stakes for Jake and forcing him to take matters into his own hands...  Written by www.lansdown.netSee less",
    "2002_466": "A bizarre mix of early Tod Hayne's and Phyllis Diller!",
    "2002_467": "Three stories set among the Bedouin of Jahalin in the hills of the Judean desert. On an almost deserted highway, two Israeli truckers strike a Bedouin lad accidentally. Before they can flee, the boy's people appear and circle the truckers....See moreThree stories set among the Bedouin of Jahalin in the hills of the Judean desert. On an almost deserted highway, two Israeli truckers strike a Bedouin lad accidentally. Before they can flee, the boy's people appear and circle the truckers. Retribution? In a tent, elders judge a woman seeking divorce; she wants to leave with her young daughters. They deny the suit. That night she gathers her girls and runs. Her husband pursues her. The Bedouin maid of a married Israeli hot-house farmer is discovered in adultery; with her life in danger, she seeks protection from her lover. He turns her away and involves a Bedouin farmhand in disposing of her. What tribal justice awaits?  Written by See less",
    "2002_468": "A suicidal woman and a male prostitute connect in an ATM station and begin a tenuous affair.",
    "2002_469": "Janice's father dies of a heart attack during her birth, causing her mother to plunge into a post-natal, post-mortem agoraphobic depression that endures for 23 years.",
    "2002_47": "A recently retired man embarks on a journey to his estranged daughter's wedding, only to discover more about himself and life than he ever expected.",
    "2002_470": "Signs indicate that some form of non-human intelligence is communication with us ... What's the message? Academy Award nominated documentary filmmaker William Gazecki offers a compelling and provocative look at the mysterious phenomenon of...See moreSigns indicate that some form of non-human intelligence is communication with us ... What's the message? Academy Award nominated documentary filmmaker William Gazecki offers a compelling and provocative look at the mysterious phenomenon of Crop Circles.  Written by AnonymousSee less",
    "2002_471": "\"The Mesmerist\" is a twisted black comedy about a doctor who convinces a dying man's family to allow him to put the man in a trance and what happens when he descends into the after-world",
    "2002_472": "",
    "2002_473": "New York serves as a backdrop for a cast of characters in search of love, lust or lucre including a woman who makes awkward moves on the man renovating her SoHo loft, an embezzler, a sleazy artist and a phone psychic.",
    "2002_474": "A handsome and successful young man's life begins to unravel when he develops an acute sense of paranoia. Things escalate when Jackson is convinced that a tv ad holds sinister messages aimed at him. Is Jackson losing his mind, or are the threats real?",
    "2002_475": "In the port city of Icheon, five female friends struggle to stay close while forging a life for themselves after high school. When one of the group, upwardly-mobile Hae-ju, moves to Seoul, the other girls deal with the loss in different ...See moreIn the port city of Icheon, five female friends struggle to stay close while forging a life for themselves after high school. When one of the group, upwardly-mobile Hae-ju, moves to Seoul, the other girls deal with the loss in different ways. Feeling most rejected, shy Ji-yeong finds comfort in her new friendship with rebel Tae-hee.  Written by Sujit R. VarmaSee less",
    "2002_476": "A very young college graduate attempts to obtain a position with a large corporation.",
    "2002_477": "The close friendship of two young women, each of a different race, and their struggle to find purpose in their lives during this time of social injustice and world war.",
    "2002_478": "The L.A. dog walking scene provides a colorful backdrop for the story of Ellie Moore, damaged goods on the run from her latest abusive boyfriend and on the verge of transformation. She's helped along in that process by Betsy Wright, a ...See moreThe L.A. dog walking scene provides a colorful backdrop for the story of Ellie Moore, damaged goods on the run from her latest abusive boyfriend and on the verge of transformation. She's helped along in that process by Betsy Wright, a misanthropic dog-walker in need of help with her business and struggling with her own dark past. The odd relationship between the cranky dog-walker and her unstable new apprentice proves the catalyst for the emotional journey Ellie must undertake. In Betsy, she finds a dark mirror of herself - a lonely, angry, complex woman whose own troubled past proves disturbingly close to her own. And in the dogs, she finds lost pieces of herself as she fumbles with the leash to her own life - struggling to hold on as it pulls her toward a brighter future before her past catches up with her.  Written by AnonymousSee less",
    "2002_479": "Nine women meet every Wednesday afternoon for 21 weeks of group therapy in this entirely original, ultra modern probe into the American psyche.",
    "2002_48": "A hapless chauffeur must take a comatose Secret Agent's place using his special gadget-laden tuxedo.",
    "2002_480": "",
    "2002_481": "Showdown in Arizona between the Bonnell brothers, U.S.Marshals, and Jessica Drummond, the iron-fist rancher who controls the territory.",
    "2002_482": "Told from the perspective of man reflecting on his childhood in Prague in the early years of World War 2 and the eventual destruction of his family as the Nazis rise to power.",
    "2002_483": "A series of surreal sequences that critique morality and society in a stream of consciousness style.",
    "2002_484": "Andy works in marketing but wants to create something \"real\" so he gets a job in research with huge a pay cut. He teams with 3 nerds to develop a $99 PC for 3rd world students. Then comes the dot-com crash.",
    "2002_485": "On the invitation of her childhood best friend Patsy McCann nee Willets, famed opera singer Francesca Prine - whose real name is Marie Beck - returns to Marmora, Ontario to sing in a benefit concert. Patsy and Marie were best friends from ...See moreOn the invitation of her childhood best friend Patsy McCann nee Willets, famed opera singer Francesca Prine - whose real name is Marie Beck - returns to Marmora, Ontario to sing in a benefit concert. Patsy and Marie were best friends from the time Marie and her family arrived in Marmora when she was ten years old to the time she left Marmora at age fifteen, which was thirty years prior. With the exception of Don Rayford on who Marie had a crush, Patsy was shy Marie's only friend in Marmora. However, Marie and Patsy have not been in touch since due to issues that drove Marie out of town at the time. Those issues include Marie being physically abused by her alcoholic mother, but most specifically what happened the evening of the Sadie Hawkins dance - where Don accompanied Marie - and post dance down by the railroad tracks. Marie and Patsy's reunion may not be able to endure the thirty years of silence and the events of that night.  Written by HuggoSee less",
    "2002_486": "Daisy is the love of Ken's life - she is also large... and very pretty... and on the dole. But Ken is a dreamer, all his dreams to make a fast buck ending up where they started - as dreams. With the rent unpaid, the bailiffs at the door ...See moreDaisy is the love of Ken's life - she is also large... and very pretty... and on the dole. But Ken is a dreamer, all his dreams to make a fast buck ending up where they started - as dreams. With the rent unpaid, the bailiffs at the door and Ken's dreams in tatters, Daisy sets out to bring home the bacon and gets a job in the local factory. There she meets Marlene and half a dozen other large women who are all united in a secret passion - Sumo wrestling! Ken doesn't know what's hit him...  Written by Malcolm Kohll See less",
    "2002_487": "A modern story, inspired by King Lear, set in contemporary Liverpool.",
    "2002_488": "",
    "2002_489": "A retelling of the life of the celebrated 17th-century painter through his brilliant, nearly blasphemous paintings and his flirtations with the underworld.",
    "2002_49": "A special military unit fights a powerful, out-of-control supercomputer and hundreds of scientists who have mutated into flesh-eating creatures after a laboratory accident.",
    "2002_490": "While Microsoft may be the biggest software company in the world, not every computer user is a fan of their products, or their way of doing business. While Microsoft's Windows became the most widely used operating system for personal ...See moreWhile Microsoft may be the biggest software company in the world, not every computer user is a fan of their products, or their way of doing business. While Microsoft's Windows became the most widely used operating system for personal computers in the world, many experts took issue with Microsoft's strict policies regarding licensing, ownership, distribution, and alteration of their software. The objections of many high-profile technology experts, most notably Richard Stallman, led to what has become known as \"the Open Source Movement,\" which is centered on the belief that computer software should be free both in the economic and intellectual senses of the word. Eventually, one of Stallman's admirers, Linus Torvalds, created a new operating system called Linux, a freely distributed software which many programmers consider to be markedly superior to Windows. Revolution OS is a documentary that examines the genesis of the Open Source Movement, and explores and explains the technical and intellectual issues involved in a manner understandable to computer aficionados and non-techheads alike.  Written by Mark Deming, RoviSee less",
    "2002_491": "An X-Rated 'Holly-Go-Lightly' flip flops between choosing life's uncertainty under her own direction or the \"Good Life\" provided by a twisted sister Gene.",
    "2002_492": "A hypnotic journey into the mysterious world of Afro Cuban culture.",
    "2002_493": "A radical love story.",
    "2002_494": "Ash Wednesday is set in the Manhattan of the early 1980's and is about a pair of Irish-American brothers (Burns and Wood) who become embroiled in a conflict with the Irish Mob.",
    "2002_495": "The ace cop of a totalitarian police force and a drifting android play their parts in a post-apocalyptic society. They are destined to fight. Their encounter will change them forever.",
    "2002_496": "Documentary on two alienated teenagers in a downward narcotized spiral.",
    "2002_497": "An autistic 15-year-old boy steals money from his boss to provide rent for his abusive father, who uses the money to repay a loan shark.",
    "2002_498": "Virgil Bliss is a man obsessed with living a normal life, finding a good job, marrying a decent woman, and building a family of his own. But as a recently paroled career thief with a hair-trigger temper and the social skills of a child, he...See moreVirgil Bliss is a man obsessed with living a normal life, finding a good job, marrying a decent woman, and building a family of his own. But as a recently paroled career thief with a hair-trigger temper and the social skills of a child, he faces distinct challenges. At the halfway house where he gets his first taste of freedom in over a decade, Virgil meets Manny Alvarez, a fiery miscreant who takes the emotionally naive Virgil under his wing and initiates him in the ways of the world. It's Manny who introduces Virgil to Ruby, an opportunistic junkie with whom Virgil falls instantly in love. As Virgil and Ruby learn to trust each other, they share their concerns: Ruby plans to win back custody of her four-year-old son and Virgil confesses the horrible and senseless crime that landed him in prison. After his release from the halfway house, Virgil finds work as a janitor and moves in with Ruby. But their attempts to adjust as a family come undone with the arrival of the psychotic Manny.  Written by Sujit R. VarmaSee less",
    "2002_499": "A restaurant owner falls in love with an opera singer and, desperate to impress her, travels to Italy to learn how to sing.",
    "2002_5": "Agent Jay is sent to find Agent Kay and restore his memory after the re-appearance of a case from Kay's past.",
    "2002_50": "John Quincy Archibald takes a hospital emergency room hostage when his insurance won't cover his son's heart transplant.",
    "2002_500": "Nonfiction filmmaker Jill Morley documents her exploration of the exotic dancer (stripper) experience. Through tactfully selected and edited sequences, you get an insider's view into the job itself, how clubs chauffeur dancers, protect ...See moreNonfiction filmmaker Jill Morley documents her exploration of the exotic dancer (stripper) experience. Through tactfully selected and edited sequences, you get an insider's view into the job itself, how clubs chauffeur dancers, protect them, what's required of them, how much money they can make, tricks that dancers use to make more money, and keep clients at bay. By trying to work as a dancer, Morley gives the viewer a very personal perspective on the experience. Long-time professional dancers reveal personal anecdotes and feelings about how the job effects them in candid, personal interviews. A group discussion with several dancers is likewise illuminating.  Written by David SpaldingSee less",
    "2002_501": "",
    "2002_502": "Twenty-something Samantha searches for excitement and an elusive happiness, but finds sex and dissatisfaction instead.",
    "2002_503": "",
    "2002_504": "A Banker, Husband, and Father, Mr. Smith must leave it behind him. He's made a mistake and he's trying to pay for it but he doesn't know if there is enough money in the world. Or so he tells Bobby the eighteen year old male hustler Smith ...See moreA Banker, Husband, and Father, Mr. Smith must leave it behind him. He's made a mistake and he's trying to pay for it but he doesn't know if there is enough money in the world. Or so he tells Bobby the eighteen year old male hustler Smith employs for company. Bobby quickly learns however, that Smith is no regular John, and their meeting has unintended consequences that neither of them is prepared to afford.  Written by AnonymousSee less",
    "2002_505": "By Hook or by Crook chronicles the tale of two unlikely friends who commit petty crimes as they search for a path to understanding themselves and the outside world. Silas Howard plays Shy (a transgender man), who leaves his small town ...See moreBy Hook or by Crook chronicles the tale of two unlikely friends who commit petty crimes as they search for a path to understanding themselves and the outside world. Silas Howard plays Shy (a transgender man), who leaves his small town after the death of his father, and heads to the big city to live a life of crime. Along the way, he encounters Valentine, a quirky adoptee, in search of his birth mother. An immediate kinship is sparked between these men and they become partners in crime. Suffering money troubles, emotional problems, and physical confrontations, the duo face their issues head on and learn to trust each other and support each other in pursuit of their goals.  Written by azrSee less",
    "2002_506": "When George Krikkos, middle-aged, divorced, Greek American selling vegetable produce for his father in Chicago, hears that his childhood love is returning to town to sing, his own love of opera reawakens, and reignites his singing career.",
    "2002_507": "Three African short films about young people facing social, economic and personal hardships.",
    "2002_508": "Tormented by memories of having caused a deadly car accident years ago, Matt struggles to rebuild his life with his girlfriend Dawn. But his tentative happiness is shattered when he is attacked by an ax-wielding maniac in a remote motel.",
    "2002_509": "Neely, an aspiring actress, gets a role on the popular soap opera \"Heartbreak Hospital.\" Her neighbor, Lottie, a huge fan of the show, can't differentiate between fiction and reality, and her obsession and jealousy endanger Neely and the ...See moreNeely, an aspiring actress, gets a role on the popular soap opera \"Heartbreak Hospital.\" Her neighbor, Lottie, a huge fan of the show, can't differentiate between fiction and reality, and her obsession and jealousy endanger Neely and the rest of the cast.  Written by 2manydvdsSee less",
    "2002_51": "After a brutal break-up, a young man vows to stay celibate during the forty days of Lent, but finds the girl of his dreams and is unable to do anything about it.",
    "2002_510": "The Execution of Wanda Jean chronicles the life-and-death battle of Wanda Jean Allen, the first black woman to be put to death in the United States in the modern era. Read more: Synopsis",
    "2002_511": "Shep, a depressed lobsterman, still holds a torch for fisherwoman Vicki. But she has eyes for Damien, a handsome Harvard boy summering on Cape Cod. Hoping to reunite the old lovers, a sorceress guides their destinies on a game board in her...See moreShep, a depressed lobsterman, still holds a torch for fisherwoman Vicki. But she has eyes for Damien, a handsome Harvard boy summering on Cape Cod. Hoping to reunite the old lovers, a sorceress guides their destinies on a game board in her backyard. But playing puppeteer to messy mortals proves difficult...  Written by Sujit R. VarmaSee less",
    "2002_512": "A failed New Jersey inventor embarks on a career as a standup comic, turns to drink, and labors to keep his family together.",
    "2002_513": "",
    "2002_52": "The story of what happens one day in New York City, when a young lawyer and a businessman share a small automobile accident on F.D.R. Drive, and their mutual road rage escalates into a feud.",
    "2002_53": "Four weeks after a mysterious, incurable virus spreads throughout the UK, a handful of survivors try to find sanctuary.",
    "2002_54": "A brood of fire-breathing dragons emerges from the earth and begins setting everything ablaze, establishing dominance over the planet.",
    "2002_55": "A Texas baseball coach makes the major league after agreeing to try out if his high school team made the playoffs.",
    "2002_56": "Johnny Knoxville and his band of maniacs perform a variety of stunts and gross-out gags on the big screen for the first time.",
    "2002_57": "After his family is killed by a terrorist act, a firefighter goes in search of the one responsible.",
    "2002_58": "A spoof of buddy cop movies where two very different cops are forced to team up on a new reality based television cop show, while tracking down the manufacturer and distributor of an illegally made semi-automatic firearm.",
    "2002_59": "Two U.S. Marines in World War II are assigned to protect Navajo Marines, who use their native language as an unbreakable radio cypher.",
    "2002_6": "James Bond is sent to investigate the connection between a North Korean terrorist and a diamond mogul, who is funding the development of an international space weapon.",
    "2002_60": "A day in the life of a South Side Chicago barbershop.",
    "2002_61": "Two ambitious girls, despite their parents' wishes, have their hearts set on careers in professional soccer.",
    "2002_62": "A young man, falsely imprisoned by his jealous \"friend\", escapes and uses a hidden treasure to exact his revenge.",
    "2002_63": "After years of mother-daughter tension, Siddalee receives a scrapbook detailing the wild adventures of the \"Ya-Yas\", her mother's girlhood friends.",
    "2002_64": "A troubled child summons the courage to help a friendly alien escape Earth and return to his home world.",
    "2002_65": "A girl finds she is forced to educate herself on the etiquette of wooing the opposite sex when she finally meets Mr. Right.",
    "2002_66": "A salvage crew discovers a long-lost 1962 passenger ship floating lifeless in a remote region of the Bering Sea, and soon notices that its long-dead inhabitants may still be on board.",
    "2002_67": "The Enterprise is diverted to the Romulan homeworld Romulus, supposedly because they want to negotiate a peace treaty. Captain Picard and his crew discover a serious threat to the Federation once Praetor Shinzon plans to attack Earth.",
    "2002_68": "When an Ivy League-educated C.I.A. Agent is killed during an operation, the secret agency recruits his twin brother (Chris Rock).",
    "2002_69": "When Russia's first nuclear submarine malfunctions on its maiden voyage, the crew must race to save the ship and prevent a nuclear disaster.",
    "2002_7": "A family living on a farm finds mysterious crop circles in their fields which suggests something more frightening to come.",
    "2002_70": "High powered lawyer Claire Kubik finds her world turned upside down when her husband, who has been living under a false name, is arrested by military police and placed on trial for the murder of villagers while he was in the Marines.",
    "2002_71": "A 14-year-old orphan becomes an NBA superstar after trying on a pair of sneakers with the faded initials \"M.J.\" inside.",
    "2002_72": "Three childhood best friends, and a guy they just met, take a road trip across the country, finding themselves and their friendship in the process.",
    "2002_73": "Eliza (Lacey Chabert) and Debbie (Danielle Harris) are two sisters who don't always get along. But their relationship is put to the test when Debbie's life is in danger, and Eliza might have to give up her power to talk to animals.",
    "2002_74": "Filmmaker Michael Moore explores the roots of America's predilection for gun violence.",
    "2002_75": "A band director recruits a Harlem street drummer to play at a Southern university.",
    "2002_76": "Two gifted high school students execute a \"perfect\" murder - then become engaged in an intellectual contest with a seasoned homicide detective.",
    "2002_77": "A biography of artist Frida Kahlo, who channeled the pain of a crippling injury and her tempestuous marriage into her work.",
    "2002_78": "A reporter is drawn to a small West Virginia town to investigate a series of strange events, including psychic visions and the appearance of bizarre entities.",
    "2002_79": "Mobster Paul Vitti is released into Dr. Ben Sobol's care, where only more chaos ensues.",
    "2002_8": "Set during the Ice Age, a sabertooth tiger, a sloth, and a wooly mammoth find a lost human infant, and they try to return him to his tribe.",
    "2002_80": "An attractive and popular teenager, who is mean-spirited toward others, finds herself in the body of an older man, and must find a way to get back to her original body.",
    "2002_81": "Fourteen-year-old Jason Shepherd has a reputation for stretching the truth. So, when big-time Hollywood producer Marty Wolf steals his class paper and turns it into a smash hit movie, no one believes Jason's latest tall tale.",
    "2002_82": "A grieving doctor is being contacted by his deceased wife through his patients' near death experiences.",
    "2002_83": "A mentally unstable photo developer targets a middle-class family after his obsession with them becomes more sick and disturbing than any of them could imagine.",
    "2002_84": "As a hard-core surfer girl prepares for a big competition, she finds herself falling for a football player.",
    "2002_85": "After running away fails, a terrified woman empowers herself in order to battle her abusive husband.",
    "2002_86": "A professional athlete has to help a U.S. government agent recover a missing jet.",
    "2002_87": "Two men share an odd friendship while they care for two women who are both in deep comas.",
    "2002_88": "The story of two North Carolina teens, Landon Carter and Jamie Sullivan, who are thrown together after Landon gets into trouble and is made to do community service.",
    "2002_89": "Venomous spiders get exposed to a noxious chemical that causes them to grow to monumental proportions.",
    "2002_9": "A young Greek woman falls in love with a non-Greek and struggles to get her family to accept him while she comes to terms with her heritage and cultural identity.",
    "2002_90": "In this loose sequel to Interview with the Vampire: The Vampire Chronicles, the vampire Lestat becomes a rock star whose music wakes up the equally beautiful and monstrous queen of all vampires.",
    "2002_91": "Frank Martin, who \"transports\" packages for unknown clients, is asked to move a package that soon begins moving, and complications arise.",
    "2002_92": "An Italian waiter fights off a criminal mastermind with his inherited powers of disguise.",
    "2002_93": "A guidance counselor mistakenly sends out the wrong transcripts to Stanford University under the name of an over-achieving high schooler.",
    "2002_94": "One murdered man, eight women, each seeming to be eager than the others to know the truth. Gimme, gimme, gimme some clues to make up my mind. And eventually enter the truth. Oh, thou cruel woman!",
    "2002_95": "When \"The Man\" tries to derail a black candidate's presidential campaign, Undercover Brother and his fellow secret agents come to the rescue.",
    "2002_96": "Despite guidance from the Blue Fairy and the love of his father, a wooden puppet's curious spirit leads him into one wild adventure after another.",
    "2002_97": "A teenager accidentally activates a machine that enables him to speed up his body so that other people seem to be standing still.",
    "2002_98": "The most popular kid on campus meets a beautiful journalist who makes him realize that maybe he's afraid to graduate.",
    "2002_99": "Lavinia and Suzette, former rock groupies and best friends, reconnect after twenty years; one is still as wild as ever, while the other has adopted a more conservative lifestyle."
}