{
    "2003_1": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
    "2003_10": "Two loose-cannon narcotics cops investigate the flow of Ecstasy into Florida from a Cuban drug cartel.",
    "2003_100": "A group of archaeologists become trapped in the past when they go there to retrieve a friend. The group must survive in fourteenth century France before they can escape back to the twenty-first century.",
    "2003_101": "A D.E.A. Agent investigates the disappearance of a legendary Army Ranger Drill Sergeant and several of his cadets during a training exercise gone severely awry.",
    "2003_102": "A contemporary story of love, rejection and triumph as a young Maori girl fights to fulfill a destiny her grandfather refuses to recognize.",
    "2003_103": "In 1962 New York City, love blossoms between a playboy journalist and a feminist advice author.",
    "2003_104": "Set back in the 80s when Harry met Lloyd in high school where they cross paths with a mean principal and a bunch of other outcasts much like themselves.",
    "2003_105": "A man against capital punishment is accused of murdering a fellow activist and is sent to death row.",
    "2003_106": "When a presidential candidate dies unexpectedly in the middle of the campaign, Washington, D.C. alderman, Mays Gilliam is unexpectedly picked as his replacement.",
    "2003_107": "In 1885 New Mexico, a frontier medicine woman forms an uneasy alliance with her estranged father when her daughter is kidnapped by an Apache brujo.",
    "2003_108": "Based on the very underground comic book, a Tibetan monk becomes a mentor to a young street kid who he can teach to protect a scroll.",
    "2003_109": "A senator arranges for his son, a rich white kid who fancies himself black, to be kidnapped by a couple of black actors pretending to be murderers to try and shock him out of his plans to become a rapper.",
    "2003_11": "A swinger on the cusp of being a senior citizen with a taste for young women falls in love with an accomplished woman closer to his age.",
    "2003_110": "A Hong Kong detective suffers a fatal accident involving a mysterious medallion and is transformed into an immortal warrior with superhuman powers.",
    "2003_111": "A New York advertising executive travels to a small Southern town to collect an inheritance but finds he must create a gospel choir and lead it to success before he can collect.",
    "2003_112": "A young peasant maid working in the house of painter Johannes Vermeer becomes his talented assistant and the model for one of his most famous works.",
    "2003_113": "Five college graduates rent a cabin in the woods and begin to fall victim to a horrifying flesh-eating virus, which attracts the unwanted attention of the homicidal locals.",
    "2003_114": "Amidst a sea of litigation, two New York City divorce lawyers find love.",
    "2003_115": "During the early sixteenth century, idealistic German monk Martin Luther, disgusted by the materialism in the Catholic Church, begins the dialogue that will lead to the Protestant Reformation.",
    "2003_116": "A film about the various insects in Borneo's rainforest.",
    "2003_117": "A family relocates from the city to a dilapidated house in the country that was once a grand estate. As they begin renovations, they discover their new home harbors a secret and may not be completely free of its former inhabitant.",
    "2003_118": "Chris and a group of five friends are left stranded deep in the middle of the woods after their cars collide. As they venture deeper into the woods, they face an uncertain and bloodcurdling fate.",
    "2003_119": "One prisoner tells to another that he hid a very large amount of money before the arrest. Together they manage to escape, but this is where their adventures are just beginning.",
    "2003_12": "The Angels investigate a series of murders which occur after the theft of a witness protection profile database.",
    "2003_120": "Right before his daughter's wedding, a mild-mannered foot doctor discovers that his future son-in-law's father is a free-wheeling international spy.",
    "2003_121": "A family of Irish immigrants adjust to life on the mean streets of Hell's Kitchen while also grieving the death of a child.",
    "2003_122": "A thirty-something former child star hires a foster family to re-create the childhood he never had.",
    "2003_123": "New York City writing professor, Frannie Avery, has an affair with a police detective, who is investigating the murder of a beautiful young woman in her neighborhood.",
    "2003_124": "A son of the leader of a legendary group of an urban biker gang tries to retain his championship title.",
    "2003_125": "Jake Vig is a consummate grifter about to pull his biggest con yet, one set to avenge his friend's murder. But his last scam backfired, leaving him indebted to a mob boss and his enforcer.",
    "2003_126": "When a disgraced former college dean has a romance with a mysterious younger woman haunted by her dark, twisted past, he is forced to confront a shocking fact about his own life that he has kept secret for fifty years.",
    "2003_127": "A British mystery author visits her publisher's home in the South of France, where her interaction with his unusual daughter sets off some touchy dynamics.",
    "2003_128": "James Cameron and Bill Paxton, director and actor of the 1997 film Titanic, travel to the final undersea resting place of the ill-fated ship of dreams.",
    "2003_129": "A high school loser pays a cheerleader to pose as his girlfriend so he can be considered cool.",
    "2003_13": "A series of events tests the beliefs of a small isolated countryside village.",
    "2003_130": "During his final days, a dying man is reunited with old friends, former lovers, his ex-wife, and his estranged son.",
    "2003_131": "When the head of a statue sacred to a village is stolen, a young martial artist goes to the big city and finds himself taking on the underworld to retrieve it.",
    "2003_132": "A small-town woman tries to achieve her goal of becoming a flight attendant.",
    "2003_133": "A young couple has a chance to move into a gorgeous duplex in the perfect New York neighborhood. All they have to do is bump off the current tenant, a cute little old lady.",
    "2003_134": "Join a voyage through aquatic realms where humans have rarely dared to go. Waddle with playful penguins, dart with lightning speed through schools of sharks, ride over stormy waves with massive whales and view rare alien-like creatures.",
    "2003_135": "Mockumentary captures the reunion of 1960s folk trio the Folksmen as they prepare for a show at The Town Hall to memorialize a recently deceased concert promoter.",
    "2003_136": "After a man is asked to house sit for his boss, he becomes determined to get closer to the boss's daughter, but events keep unfolding that stop him from achieving his goal.",
    "2003_137": "Eva doesn't let her 3 sisters' men push them around. She's always butting in. How to pacify Eva? Find her a man. The men pay a playboy to be that man. The problem is - he falls in love with Eva.",
    "2003_138": "A soon-to-be husband wakes up on the morning after his bachelor party in bed with another woman.",
    "2003_139": "Two young couples traveling across the backwoods of Texas searching for urban legends of murder end up as prisoners of a bizarre and sadistic backwater family of serial killers.",
    "2003_14": "When a young Inuit hunter needlessly kills a bear, he is magically changed into a bear himself as punishment with a talkative cub being his only guide to changing back.",
    "2003_140": "An abandoned wife is evicted from her house and starts a tragic conflict with her house's new owners.",
    "2003_141": "A woman on the run from the mob is reluctantly accepted in a small Colorado community in exchange for labor, but when a search visits the town she finds out that their support has a price.",
    "2003_142": "Overburdened and stuck in a greying marriage, Giovanna takes to caring for the Jewish Holocaust survivor her husband brings home. As she begins to reflect on her life, she turns to the man who lives across from her ...",
    "2003_143": "A nurse is part of the resistance in 1940s Czechoslovakia. She is discovered and must find a place to hide. A patient whose life she saved, from a remote mountain village where time stopped 150 years ago, agrees to hide her as his wife.",
    "2003_144": "A writer must turn out a novel in thirty days or face the wrath of loan sharks.",
    "2003_145": "A young American studying in Paris in 1968 strikes up a friendship with a French brother and sister. Set against the background of the '68 Paris student riots.",
    "2003_146": "After being kidnapped and imprisoned for fifteen years, Oh Dae-Su is released, only to find that he must find his captor in five days.",
    "2003_147": "When her grandson is kidnapped during the Tour de France, Madame Souza and her beloved pooch Bruno team up with the Belleville Sisters--an aged song-and-dance team from the days of Fred Astaire--to rescue him.",
    "2003_148": "A violin prodigy and his father travel to Beijing, where the father seeks the means to his son's success while the son struggles to accept the path laid before him.",
    "2003_149": "A teenager (Moore), disillusioned by too many examples of love gone wrong, refuses to believe that true love exists. Then this new guy (Ford) comes along...",
    "2003_15": "Bruce Banner, a genetics researcher with a tragic past, suffers an accident that causes him to transform into a raging green monster when he gets angry.",
    "2003_150": "The true story of two climbers and their perilous journey up the west face of Siula Grande in the Peruvian Andes in 1985.",
    "2003_151": "A group of college students travels to a mysterious island to attend a rave, which is soon taken over by bloodthirsty zombies.",
    "2003_152": "Jerry Falk (Jason Biggs) learns a lesson the hard way when he falls in love with a beautiful but flighty girl, Amanda (Christina Ricci).",
    "2003_153": "Naina, an introverted, perpetually depressed girl's life changes when she meets Aman. But Aman has a secret of his own which changes their lives forever. Embroiled in all this is Rohit, Naina's best friend who conceals his love for her.",
    "2003_155": "French vs. American social customs and behaviors are observed in a story about an American visiting her Frenchman-wed sister in Paris.",
    "2003_156": "The rise and fall of confederate general Thomas \"Stonewall\" Jackson, as he meets with military success against the Union from 1861 to 1863, when he is accidentally killed by his own soldiers. Read more: Synopsis",
    "2003_157": "In the dysfunctional Italian middle-class family Ristuccia, the middle-aged executive Carlo has a stalled life without passion, bored in his work and having a monotonous life with his wife Giulia. Giulia is a frustrated and hysterical ...See moreIn the dysfunctional Italian middle-class family Ristuccia, the middle-aged executive Carlo has a stalled life without passion, bored in his work and having a monotonous life with his wife Giulia. Giulia is a frustrated and hysterical woman because she gave up of being an actress in her youth to dedicate to the family. Their needy son Paolo feels lost and rejected, trying to find who he is and flirting with a schoolmate. Their seventeen years old daughter Valentina is decided to work in a television show, and is fighting to have an audition. When Carlo meets his former sweetheart Alessia in a class reunion, they confess to each other that their marriages are in crisis and both feel passion arising again. Meanwhile Giulia is invited to an audition in a stage production and to participate of a play. Paolo tries to make friends using marijuana in his birthday party, and Valentina has sex with different guys trying to be a dancer of the famous TV show 'Ali Babbi'. Their relationships change when Carlo has an accident.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2003_158": "A successful executive in the cosmetic industry has three sexy girlfriends in three different states. When they decide to visit him in L.A., he's in big trouble.",
    "2003_159": "Documentary on the migratory patterns of birds, shot over the course of three years on all seven continents.",
    "2003_16": "Follows the lives of eight very different couples in dealing with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London, England.",
    "2003_160": "A much-needed boost, in the form of a new factory, is promised to the residents of the tiny fishing village St. Marie-La-Mauderne, provided they can lure a doctor to take up full-time residency on the island. Inspired, the villagers devise...See moreA much-needed boost, in the form of a new factory, is promised to the residents of the tiny fishing village St. Marie-La-Mauderne, provided they can lure a doctor to take up full-time residency on the island. Inspired, the villagers devise a scheme to make Dr. Christopher Lewis a local.See less",
    "2003_161": "In Paris, a Turkish shop owner befriends a Jewish boy in his mid-teens.",
    "2003_162": "A developmentally disabled young man tries to continue the work his father did in communicating with extra-terrestrials from outer space, which leads to something miraculous and wonderful.",
    "2003_163": "A robbery homicide investigation triggers a series of events that will cause a corrupt LAPD officer to question his tactics.",
    "2003_164": "The world's cruelty is confronted with the love of two different people who tries to save mankind from poverty and war.",
    "2003_165": "In an old school Las Vegas casino, its top gambling jinx breaks his curse when he falls in love, much to his boss' consternation.",
    "2003_166": "A thirteen-year-old girl's relationship with her mother is put to the test as she discovers drugs, sex, and petty crime in the company of her cool but troubled best friend.",
    "2003_167": "Several ordinary high school students go through their daily routine as two others prepare for something more malevolent.",
    "2003_168": "A young woman conceals the fact of her terminal cancer to live her life with a passion she never had before.",
    "2003_169": "A young girl befriends a wild black stallion.",
    "2003_17": "Former cop Brian O'Conner is called upon to bust a dangerous criminal and he recruits the help of a former childhood friend and street racer who has a chance to redeem himself.",
    "2003_170": "An Irish journalist writes a series of stories about drug dealers.",
    "2003_171": "A boy is raised by a Buddhist monk in an isolated floating temple where the years pass like the seasons.",
    "2003_172": "Antoine (Auteuil) saves Louis (Garcia) from hanging himself, though in his attempt to get Louis back on his feet, Antoine gets caught in a romantic triangle.",
    "2003_173": "Marie (and her three fathers) are taking A-levels. Marie passes. She spends the summer in the country with her mother, Sylvia, who has returned from America with her Californian husband who has two sons. Marie falls in and out of love for ...See moreMarie (and her three fathers) are taking A-levels. Marie passes. She spends the summer in the country with her mother, Sylvia, who has returned from America with her Californian husband who has two sons. Marie falls in and out of love for the first time in front of her alarmed fathers, who see Marie's innocence slipping away at frightening speed, and their relationships with the two women become even more complicated.  Written by AlineSee less",
    "2003_174": "When his only friend dies, a man born with dwarfism moves to rural New Jersey to live a life of solitude, only to meet a chatty hot dog vendor and a woman dealing with her own personal loss.",
    "2003_175": "As adults, best friends Julien and Sophie continue the odd game they started as children -- a fearless competition to outdo one another with daring and outrageous stunts. While they often act out to relieve one another's pain, their game ...See moreAs adults, best friends Julien and Sophie continue the odd game they started as children -- a fearless competition to outdo one another with daring and outrageous stunts. While they often act out to relieve one another's pain, their game might be a way to avoid the fact that they are truly meant for one another.See less",
    "2003_176": "A young man with an unusual connection to rats uses them at his own sociopathic will.",
    "2003_177": "This is the story of a dysfunctional New York family, and their attempts to reconcile.",
    "2003_178": "An original mix of fiction and reality illuminates the life of comic book hero everyman Harvey Pekar.",
    "2003_179": "In this 2003 remake of the classic 1952 French film, Fanfan la Tulipe is a swashbuckling lover who is tricked into joining the army of King Louis XV by Adeline La Franchise, who tells Fanfan that by doing so, he will eventually marry one ...See moreIn this 2003 remake of the classic 1952 French film, Fanfan la Tulipe is a swashbuckling lover who is tricked into joining the army of King Louis XV by Adeline La Franchise, who tells Fanfan that by doing so, he will eventually marry one of the king's daughters.See less",
    "2003_18": "It's the wedding of Jim and Michelle and the gathering of their families and friends, including Jim's old friends from high school and Michelle's little sister.",
    "2003_180": "An elderly couple wish their children to care for them in their old age. But their children see and treat them as a burden, and they must struggle to regain their worth and dignity to themselves and others.",
    "2003_181": "Home movies, photographs, and recited poetry illustrate the life of Tupac Shakur, one of the most beloved, revolutionary, and volatile hip-hop M.Cs. of all time.",
    "2003_182": "Three generations of a wealthy Bordeaux family are caught in the crossfire when Anne decides to run for mayor, thanks to a political pamphlet that revives an old murder scandal.",
    "2003_183": "Spellbound follows eight teenagers on their quest to win the 1999 National Spelling Bee.",
    "2003_184": "A young boy accidentally discovers a deep hole in the ground, where another boy is kept prisoner.",
    "2003_185": "Larry Gigli is assigned by a crime boss to kidnap the brother of a prominent district attorney. A beautiful woman known only as Ricki is sent to stay with him to make sure he doesn't mess up the job.",
    "2003_186": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
    "2003_187": "An old man comes up with a subterfuge to reconcile his estranged sons.",
    "2003_188": "The son of Italian immigrants to Canada struggles to find the best way to reveal to his parents that he's gay.",
    "2003_189": "A love story set in 1930s England that follows 17-year-old Cassandra Mortmain, and the fortunes of her eccentric family, struggling to survive in a decaying English castle.",
    "2003_19": "Cindy must investigate mysterious crop circles and video tapes, and help the President in preventing an alien invasion.",
    "2003_190": "An innocent man becomes one of the most wanted criminals the world has ever known.",
    "2003_191": "An actress, a writer, a student, and a government worker band together in an effort to escape Paris as the Nazis move into the city.",
    "2003_192": "Ensemble drama centered around a group of ballet dancers, with a focus on one young dancer who's poised to become a principal performer.",
    "2003_193": "Best friends Marie and Alexia decide to spend a quiet weekend at Alexia's parents' secluded farmhouse. But on the night of their arrival, the girls' idyllic getaway turns into an endless night of horror.",
    "2003_194": "Two men (Hrithik Roshan, Abhishek Bachchan) vie for the love of the same woman (Kareena Kapoor), even though one is already engaged to her.",
    "2003_195": "A Chinese emissary is sent to the Gobi desert to execute a renegade soldier. When a caravan transporting a Buddhist monk and a valuable treasure is threatened by thieves, however, the two warriors might unite to protect the travelers.",
    "2003_196": "After the death of her father, Hannah becomes concerned with the strange behavior of her mother. As her mother's troubled childhood is revealed, Hannah realizes how little she ever knew.",
    "2003_197": "A man pursues a woman who is already engaged and eventually gets married to her. Differences between the two lead to a bitter separation that threatens to destroy their relationship forever.",
    "2003_198": "Arun is an Indian undercover agent enlisted to stop ISI chief Ishaq Khan. The village girl Reshma helps him but endangers her own life.",
    "2003_199": "France under occupation by the Germans during WW2: Two men inspired by a free France radio broadcast perpetrate an act of sabotage with unwitting consequences for them and their fellow villagers. Read more: Synopsis",
    "2003_2": "After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.",
    "2003_20": "After discovering he is a human, a man raised as an elf at the North Pole decides to travel to New York City to locate his real father.",
    "2003_200": "An aging gambler on a losing streak attempts to rob a casino in Monte Carlo. But someone's already tipped off the cops before he even makes a move.",
    "2003_201": "A real-time dark comedy about a science geek who tangles with a clutch of Russian gangsters after he delivers them the wrong computer disk.",
    "2003_202": "Sixteen American college students drink, flirt, fight and canoodle during their Spring Break vacation in Cancun, Mexico.",
    "2003_203": "A variety of losers in Dublin have harrowingly farcical intersecting stories of love, greed and violence.",
    "2003_204": "Four skaters follow their idol on his summer tour in an attempt to get noticed, get sponsored, and become stars themselves.",
    "2003_205": "A strait-laced French student moves into an apartment in Barcelona with a cast of six other characters from all over Europe. Together, they speak the international language of love and friendship.",
    "2003_206": "The story of America as seen through the eyes of the former Secretary of Defense under President John F. Kennedy and President Lyndon B. Johnson, Robert McNamara.",
    "2003_207": "After a space merchant vessel receives an unknown transmission as a distress call, one of the crew is attacked by a mysterious life form and they soon realize that its life cycle has merely begun.",
    "2003_208": "A waitress from Texas and a college student from Pennsylvania meet during spring break in Fort Lauderdale, Florida and come together through their shared love of singing.",
    "2003_209": "Three young Irish women struggle to maintain their spirits while they endure dehumanizing abuse as inmates of a Magdalene Sisters Asylum.",
    "2003_21": "During the Napoleonic Wars, a brash British captain pushes his ship and crew to their limits in pursuit of a formidable French war vessel around South America.",
    "2003_210": "In the Russian wilderness, two brothers face a range of new, conflicting emotions when their father - a man they know only through a single photograph - resurfaces.",
    "2003_211": "When an uptight young man and his fiancee move into his libertine mother's house, the resulting clash of life attitudes shakes everyone up.",
    "2003_212": "Caterina, forced to leave her small town at the age of thirteen, faces the complications of living in the big metropoly of Rome.",
    "2003_213": "The 1978 kidnapping of politician Aldo Moro as seen from the perspective of one of his assailants: a conflicted young woman in the ranks of the Red Brigade.",
    "2003_214": "Against the background of an Australian desert, Sandy, a geologist, and Hiromitsu, a Japanese businessman, play out a story of human inconsequence in the face of the blistering universe. The end of the journey leaves no one capable of ...See moreAgainst the background of an Australian desert, Sandy, a geologist, and Hiromitsu, a Japanese businessman, play out a story of human inconsequence in the face of the blistering universe. The end of the journey leaves no one capable of going back to where they started from.  Written by AnonymousSee less",
    "2003_215": "Documentary on the Friedmans, a seemingly typical, upper-middle-class Jewish family whose world is instantly transformed when the father and his youngest son are arrested and charged with shocking and horrible crimes.",
    "2003_216": "The story of Jesus' life as told by the apostle John, narrated by Christopher Plummer. Read more: Synopsis",
    "2003_217": "Surfers and secret spots from around the world are profiled in this documentary.",
    "2003_218": "After the rise of the Taliban in Afghanistan and the restriction of women in public life, a pre-teen girl is forced to masquerade as a boy in order to find work to support her mother and grandmother.",
    "2003_219": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
    "2003_22": "An imprisoned drug kingpin offers a huge cash reward to anyone that can break him out of police custody, and only the L.A.P.D.'s Special Weapons and Tactics team can prevent it.",
    "2003_220": "A group of over-achieving Asian-American high school seniors enjoy a power trip when they dip into extra-curricular criminal activities.",
    "2003_221": "An introspective dentist's suspicions about his wife's infidelity stresses his mental well being and family life to the breaking point.",
    "2003_222": "A mysterious and vengeful spirit marks and pursues anybody who dares enter the house in which it resides.",
    "2003_223": "A woman trying to cope with the recent disappearance of her husband finds that the event uncovers some dark secrets. Subtitled.",
    "2003_224": "When a married couple moves into a flat that is haunted by a spirit, a series of inexplicable experiences drive the wife to near madness. Now, the husband must protect his wife to save their marriage.",
    "2003_225": "A wayward daughter invites her dying mother and the rest of her estranged family to her apartment for Thanksgiving dinner.",
    "2003_226": "Emmanuelle Beart stars as a widowed schoolteacher who flees Nazi-occupied Paris with her children. A teenaged boy comes to their rescue by leading them into the forest -- their best shot at survival.",
    "2003_227": "A gangster sets out to fulfill his father's dream of becoming a doctor.",
    "2003_228": "Nello Balocchi, a 35-year-old teacher of Greek and Latin, is invited to Bologna by his father, the owner of the Papal tailor's shop in Rome. His father hopes Nello will find a soul mate in Bolgna and thus produce an heir for the business. ...See moreNello Balocchi, a 35-year-old teacher of Greek and Latin, is invited to Bologna by his father, the owner of the Papal tailor's shop in Rome. His father hopes Nello will find a soul mate in Bolgna and thus produce an heir for the business. Nello stays in a guesthouse run by Arabella, a wise woman who already knows all about his situation. He shares a room with Domenico, a crafty barber from Naples. After several unsuccessful efforts, Nello meets Angela, an exuberant, beautiful young blind girl with whom he falls hopelessly in love. The girl's father and Nello's parents do not approve of the relationship, but the real problem is Angela's temperament.  Written by Sujit R. VarmaSee less",
    "2003_23": "Carmen's caught in a virtual reality game designed by the Kids' new nemesis, the Toymaker. It's up to Juni to save his sister, and ultimately the world.",
    "2003_230": "A woman has a passionate affair with a man half her age, who is also sleeping with her daughter.",
    "2003_231": "A terrorist explosion releases a deadly virus on the masses, and it's up the bounty-hunting Bebop crew to catch the cold-blooded culprit.",
    "2003_232": "Despite guidance from the Blue Fairy and the love of his father, a wooden puppet's curious spirit leads him into one wild adventure after another.",
    "2003_233": "The story of a young journalist who fell from grace when it was discovered he fabricated over half of his articles from the publication The New Republic magazine.",
    "2003_234": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
    "2003_235": "Director Nathaniel Kahn searches to understand his father, noted architect Louis Kahn, who died bankrupt and alone in 1974.",
    "2003_236": "Story of the relationship between poets Edward James \"Ted\" Hughes (Daniel Craig) and Sylvia Plath (Gwyneth Paltrow).",
    "2003_237": "An adaptation of Evelyn Waugh's novel \"Vile Bodies\", is a look into the lives of a young novelist, his would-be lover, and a host of young people who beautified London in the 1930s.",
    "2003_238": "A Lower East Side teen-ager struggles to find some sanity while surrounded by an eccentric grandmother, a crazy new girlfriend, and a longing younger brother.",
    "2003_239": "An Italian epic that follows the lives of two brothers, from the 1960s to the 2000s.",
    "2003_24": "Dave Buznik is a businessman who is wrongly sentenced to an anger management program, where he meets an aggressive instructor.",
    "2003_240": "Problems arise when Radhey Mohan, a delinquent falls in love with a girl named Nirjara.",
    "2003_241": "After a series of Broadway flops, songwriter Bert Hanley (Dixon) goes to work at a musical camp for young performers. Inspired by the kids, he finds an opportunity to regain success by staging an altogether new production.",
    "2003_242": "A 19th century French aristocrat, notorious for his scathing memoirs about life in Russia, travels through the Russian State Hermitage Museum and encounters historical figures from the last 200+ years.",
    "2003_243": "As a little girl, Federica fantasized about having beautiful long hair that would grow back as soon as she cut it, about never-ending cones of cotton candy and about countless adventures that took her to the far side of the world. Now a ...See moreAs a little girl, Federica fantasized about having beautiful long hair that would grow back as soon as she cut it, about never-ending cones of cotton candy and about countless adventures that took her to the far side of the world. Now a charming thirty-something-single woman, Federica's fantasies have evolved, adding lovers, stardom, and motherhood to her waking dreams, where Federica continues to press for her everyday life to be as real as the fantasies that invade her. Unfortunately, Federica's daydreams can only provide a meager distraction from the reality she faces. Her career as a successful playwright is heading south, her boyfriend is pressuring her to start a family, a former lover wishes to rekindle an old affair, her sister is barely talking to her, her brother is self-centered and her loving father is terminally ill. And as if to make matters worse, Federica is rich, too rich, and the guilt that consumes her because of it is pushing her over the edge. As Federica struggles to find meaning in her life, she wrestles with her feelings about death and responsibility. She alleviates the added weight of the haunting guilt that her wealth derives through her vivid imagination, where her reality grows wonderful and, if only fleetingly, gives her the sense that all is perfect in her world.  Written by Sujit R. VarmaSee less",
    "2003_244": "A young drifter working on a river barge disrupts his employers' lives while hiding the fact that he knows more about a dead woman found in the river than he admits.",
    "2003_245": "In the police investigation of a brutal crime scene, one man was at the center of it all: legendary porn star John Holmes.",
    "2003_246": "A French gang of thieves flies over to Chicago for a one time job. However, things seem to get out of hand soon.",
    "2003_248": "Set in 1973 Spain, a struggling encyclopedia salesman and his wife take advantage of an offer to make adult films. The act turns him into an aspring legit filmmaker and her into an international sex symbol.",
    "2003_249": "'It's not about the destination, it's about the journey.' In fifty-four years of capturing the worldwide flavor of alpine skiing and kindred adventure sports, the Warren Miller crew has traveled to every corner of the globe. This season's ...See more'It's not about the destination, it's about the journey.' In fifty-four years of capturing the worldwide flavor of alpine skiing and kindred adventure sports, the Warren Miller crew has traveled to every corner of the globe. This season's Journey offers another prismatic view of the kaleidoscope of winter sports, taking the viewer on a voyage inside the soul of skiing. Ports of call include the treeless snowfields of Portillo, Chile; the savage couloirs of Chamonix, France; the sheer descents of the Chugach Range in Alaska; and the powder paradise of Bella Coola, British Columbia. A backwater romp through the wilds of Morocco provides a pungent whiff of the exotic, while a visit to a very unfrozen lake in Helena, Montana, is no less strange. As Doug Coombs remarks to his friends in a Chamonix bar after a long day of indulging diverse challenges, 'It's not about the destination, it's about the journey.' True, but there's also a lot to be said for the destinations along the trail of Warren Miller's Journey.See less",
    "2003_25": "With his wife doing a book tour, a father of twelve must handle a new job and his unstable brood.",
    "2003_250": "Documentary on comedian Eddie Griffin who heads back home to a family reunion, which includes two uncles - one a porn director and the other an ex-pimp.",
    "2003_251": "A man is coerced by his uncle to get married and assigns this task to his secretary. However the man falls for the secretary herself, who has a dark past.",
    "2003_252": "Dr. Siddharth Sinha is a dedicated selfless doctor who dreams of building a state-of-the-art hospital with all the modern instruments and amenities for patient care . His foster son Akash shares his dream . Akash falls in love with Neha ...See moreDr. Siddharth Sinha is a dedicated selfless doctor who dreams of building a state-of-the-art hospital with all the modern instruments and amenities for patient care . His foster son Akash shares his dream . Akash falls in love with Neha Mathur , an anaesthetist in the same hospital . In a friend's party , Akash meets Sonia who is a spoilt daughter of a millionaire Gulshan Kapoor . Sonia develops an infatuation for Akash . Gulshan Kapoor proposes to Dr. Siddharth Sinha that he will donate a big sum of money to his hospital , on the condition that Akash marries Sonia . Dr. Siddharth Sinha declines but dies of a heart attack a few days later . Burdened with fulfilling his father's dream , Akash decides to marry Sonia sacrificing his own love . But even after marriage Sonia is jealous of Neha and constantly accuses Akash of infidelity which leaves him in a dilemma , torn between two women .  Written by SoumitraSee less",
    "2003_253": "In Montreal, on the same day that a policeman shot twenty-one children, killing eleven, without any reason, the successful writer Thomas Roy amputates his fingers and tries to commit suicide. Completely catatonic, he is treated by Dr. Paul...See moreIn Montreal, on the same day that a policeman shot twenty-one children, killing eleven, without any reason, the successful writer Thomas Roy amputates his fingers and tries to commit suicide. Completely catatonic, he is treated by Dr. Paul Lacasse and his big fan, the pregnant Dr. Jeanne Marcoux, in a psychiatric hospital. When the journalist Charles Monette, who is writing a book about Thomas, schedules a meeting with Dr. Paul, he shows pieces of newspaper showing that Thomas was present to the last thirty-seven tragedies in Canada. Dr. Paul reads the notes and decides to investigate further the life of Thomas Roy, disclosing dark secrets about his past.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2003_254": "Coincidentally, a critic and a writer team up for Operation Nez Rouge. It seeks to take revenge on him for a very negative criticism until she falls in love. But he plays double game with her?",
    "2003_255": "The chronically suicidal Wilbur and his good-hearted big brother Harbour are in their thirties, when their father dies, leaving them with nothing but a worn down second-hand bookshop in Glasgow.",
    "2003_256": "When a storm washes a canoe bearing an infant boy ashore upon a small South Pacific island, he is at first well-received as a gift from the heavens, even to the point of the tribal chief adopting him as a successor.",
    "2003_257": "The story of Lehi and his wife Sariah and their four sons: Laman, Lemuel, Sam, and Nephi. Lehi leaves Jerusalem because he prophesied unto the people concerning the destruction of Jerusalem, and they sought his life. He journeys into the ...See moreThe story of Lehi and his wife Sariah and their four sons: Laman, Lemuel, Sam, and Nephi. Lehi leaves Jerusalem because he prophesied unto the people concerning the destruction of Jerusalem, and they sought his life. He journeys into the wilderness with his family. He sends Nephi and his brethren back to Jerusalem after the brass plates and the family of Ishmael. The sons and daughters of Lehi marry the sons and daughters of Ishmael. They take their families and continue into the wilderness. Ishmael dies in the wilderness. They come to the sea. Nephi's brethren rebel against him. He confounds them, and builds a ship. They cross the sea to the promised land in the Americas. Lehi dies in the promised land. Nephi's brethren rebel against him again. Nephi departs again into the wilderness.  Written by a fan of LDS CinemaSee less",
    "2003_258": "A Jewish-American Princess is forced to take control of a hard-core hip-hop record label and tries to rein the one of the label's most controversial rappers.",
    "2003_259": "The one joy in the lives of a mother and daughter comes from the regular letters sent to them from Paris from the family's adored son, Otar. When the daughter finds out that Otar has died suddenly, she tries to conceal the truth from her ...See moreThe one joy in the lives of a mother and daughter comes from the regular letters sent to them from Paris from the family's adored son, Otar. When the daughter finds out that Otar has died suddenly, she tries to conceal the truth from her mother, changing the course of their lives forever.  Written by Sujit R. VarmaSee less",
    "2003_26": "A realtor and his wife and children are summoned to a mansion, which they soon discover is haunted, and while they attempt to escape, he learns an important lesson about the family he has neglected.",
    "2003_260": "Set in 1955, the residents of a small Montana community are forced to move their homes to make way for a new dam.",
    "2003_261": "A brokenhearted English artist travels to Hope, USA, hoping to get on with his life. He starts by drawing faces there. He befriends the cute Mandy. But then his scheming ex shows up and wants him back.",
    "2003_262": "When his work permit expires in New York, Jaswinder Bedi gets married to a bar dancer, Sally Turner, and moves in with her. When he is informed that his Patiala-based father, Jatta Singh Bedi, is ill, he rushes home - only to find that he ...See moreWhen his work permit expires in New York, Jaswinder Bedi gets married to a bar dancer, Sally Turner, and moves in with her. When he is informed that his Patiala-based father, Jatta Singh Bedi, is ill, he rushes home - only to find that he must now get married to Richa or else his sister will remain unmarried for life. He marries Richa, leaves her behind, and returns back to Sally. Jaswinder will find himself not only in hot soup after the arrival of his father and Richa, but will also face numerous charges when Sally decides to sue him.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2003_263": "Amnesiac Cassie Grant has a premonition that someone or something wants the family that's helping her recover dead. She investigates the secrets of the town they live in and uncovers darkness, both human and supernatural.",
    "2003_264": "Seven friends, after their car breaks down in the middle of the night, find shelter and tell one another stories to kill time till dawn.",
    "2003_265": "Is he the village idiot or a genius in disguise? 17 year old Noi drifts through life on a remote fjord in the north of Iceland. In winter, the fjord is cut off from the outside world, surrounded by ominous mountains and buried under a ...See moreIs he the village idiot or a genius in disguise? 17 year old Noi drifts through life on a remote fjord in the north of Iceland. In winter, the fjord is cut off from the outside world, surrounded by ominous mountains and buried under a shroud of snow. Noi dreams of escaping from this white-walled prison with Iris, a city girl who works in a local gas station. But his clumsy attempts at escape spiral out of control and end in complete failure. Only a natural disaster will shatter Noi's universe and offer him a window into a better world.See less",
    "2003_266": "A tale about a strange young man, Bulcsú, the fellow inspectors on his team, all without exception likable characters, a rival ticket inspection team and racing along the tracks - and a tale about love.",
    "2003_267": "A con man (Matt Dillon) travels to Cambodia (also on the run from law enforcement in the U.S.) to collect his share in an insurance scam, but discovers more than he bargained for.",
    "2003_268": "Elvis Presley and a black \"JFK\" stay in a nursing home where nothing happens - until a wayward Egyptian mummy comes and sucks out the old people's souls thru their a-holes. The two decide to fight back.",
    "2003_269": "A regular suburban family man comes home from work on his birthday to find a deserted house and a videotape waiting to be played...",
    "2003_27": "After awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.",
    "2003_270": "A bank manager with: (a) a gambling problem and (b) access to a multimillion dollar account gets into a messy situation. Based on the story of the largest one-man bank fraud in Canadian history.",
    "2003_271": "A worn-out businessman and a beautician on the run collide in a Paris airport. Love arrives, all its hurdles be damned.",
    "2003_272": "Jared Phelps (Kirby Heyborne) has completed two years of full-time missionary service for The Church of Jesus Christ of Latter-day Saints. His mission president has promised him that he will be blessed for his service, and he thinks he has...See moreJared Phelps (Kirby Heyborne) has completed two years of full-time missionary service for The Church of Jesus Christ of Latter-day Saints. His mission president has promised him that he will be blessed for his service, and he thinks he has it all worked out. His girlfriend has waited for him. His boss promised that he could have his old job back, and he has already sent his application to BYU. Everything that can go wrong does go wrong. His girlfriend dumps him. His losses his job, and he isn't accepted to BYU. Then, it gets even worse, and he has to decide if choosing the right is worth all the trouble.  Written by Erin HowarthSee less",
    "2003_273": "A young snowboarder with talent but no ambition, is introduced to the profession by a professional and Machiavellian snowboarder.",
    "2003_274": "Tale of a former Nazi executioner who becomes a target of hitmen and Police investigators.",
    "2003_275": "A family is haunted by the tragedies of deaths within the family.",
    "2003_276": "In the days leading up to Partition, a Hindu woman is abducted by a Muslim man. Soon, she finds herself not only forced into marriage, but living in a new country as the borders between India and Pakistan are drawn.",
    "2003_277": "An aging hitman gets a contract to kill a General in Buenos Aires, Argentina. But when his mark becomes unavailable, he becomes involved in Argentinian tango culture.",
    "2003_278": "An 8-year-old boy, raised by his grandmother, is surrounded by problems in his family he finds only himself capable of solving.",
    "2003_279": "In a small Korean province in 1986, two detectives struggle with the case of multiple young women being found raped and murdered by an unknown culprit.",
    "2003_28": "In an alternate Victorian Age world, a group of famous contemporary fantasy, science fiction, and adventure characters team up on a secret mission.",
    "2003_280": "Isabelle's nursing student. When she starts her internship at a hospital, she meets Dr. Philip. Soon, she starts suffering from strange fainting;spells, and he calls her Bambi, as her legs aren't capable of supporting her.. Patients are ...See moreIsabelle's nursing student. When she starts her internship at a hospital, she meets Dr. Philip. Soon, she starts suffering from strange fainting;spells, and he calls her Bambi, as her legs aren't capable of supporting her.. Patients are mysteriously disappearing, and Bambi and Dr. Philip start a cat vs. mouse game, in order to catch the killer.  Written by Bruno BentonSee less",
    "2003_281": "This is the story of Mr. Brochu, whose friends like to call \"the Boss\". He runs his gas station the best he can and tries to stay happy no matter what happens. This movie relates all the small tragedies surrounding the gaz bar, such as ...See moreThis is the story of Mr. Brochu, whose friends like to call \"the Boss\". He runs his gas station the best he can and tries to stay happy no matter what happens. This movie relates all the small tragedies surrounding the gaz bar, such as hold-ups, competition from the big companies invading the neighbourhood, and the fact that is sons don't seem to be interested in the gas station. Furthermore, \"The Boss\" is starting to have Parkinson's disease...  Written by LazRockSee less",
    "2003_282": "Two couples entwine on their search for love.",
    "2003_283": "A quiet, unassuming man begins to change in a major way as a result of meeting a new, art-student girlfriend, and his friends are unsettled by the transformation.",
    "2003_284": "Based on the true story of Michael Alig, a Club Kid party organizer whose life was sent spiraling down when he bragged on television about killing his drug dealer and roommate.",
    "2003_285": "Kevin, Sam and Rob are founding members of a theoretical group which pulls off heists. Leo, a gangster, blackmails them into pulling off a real multi-million dollar heist. Now it's up to them to get out alive.",
    "2003_286": "Daphne and her four children try to cope with the abrupt death of husband/father. As the family seems to fall apart, a sudden incident gives them a chance to heal their 'broken wings'.",
    "2003_287": "After his wife leaves him, a photographer has an existential crisis and tries to cope with his cousin's visit.",
    "2003_288": "In 1980 Miami, a determined Cuban immigrant takes over a drug cartel and succumbs to greed.",
    "2003_289": "After two decades in prison for murder, a man is released on parole and returns to his hometown seeking redemption.",
    "2003_29": "A man blinded by toxic waste which also enhanced his remaining senses fights crime as an acrobatic martial arts superhero.",
    "2003_290": "A drug dealer introduces one of his customers, a 'speed freak', to the man who runs the meth lab. A crazy three-day adventure ensues. Read more: Synopsis",
    "2003_291": "A young man is torn between his individual hopes and his sense of duty when his father dies and he is expected to take over the family industry.",
    "2003_292": "Biopic of transgender Muay Thai boxer Parinya Charoenphol who pursued the sport to pay for her gender reassignment surgery.",
    "2003_293": "Based on the real story during Kargil war fought between India and Pakistan in 1999.",
    "2003_294": "This is the story of a young girl named Elsa who was raised by a single mother (Isabelle) in the city. Isabelle and Elsa begin the film moving in next door to an elderly man who collects butterflies (Julien). Isabelle who \"spends a lot of ...See moreThis is the story of a young girl named Elsa who was raised by a single mother (Isabelle) in the city. Isabelle and Elsa begin the film moving in next door to an elderly man who collects butterflies (Julien). Isabelle who \"spends a lot of time with her friends\" does not pay much attention to her daughter who walks home because her mother forgot to pick her up from school. After meeting her new neighbor, Elsa finds out about the butterflies and in short annoys Julien for a while. Julien receives a mystery package from a fellow entomologist. Julien sets out on his annual attempt to find a rare species of butterfly that he had once promised his son he would find (son dead) in the French country side, specifically a region known as Vercors. Elsa stows away in his car. After being discovered she convinces him to let her come to Vercors with him. They bond while hiking and camping until Julien, who is initially annoyed by Elsa, near the end of the film seems to have a grandfather-granddaughter relationship with her. Elsa falls in a well. The police arrest Julien. Elsa tells everyone it is cool. Isabelle starts paying attention to her child. Julien and Elsa are friends. The mystery package contained a caterpillar which turned out to become the rare species of butterfly Julien set out to find. The species is called Isabelle. So Elsa finds her mother (Isabelle) and Julien finds the butterfly (Isabelle). Surprisingly happy feel for a french film.  Written by AnonymousSee less",
    "2003_295": "The comedic stylings of four sort-of famous funnymen are brought to the big screen courtesy of this 2002 documentary.",
    "2003_296": "Mendy is a young man struggling to keep his mind focused on rabbinical school. His teacher tells him to rid himself of desires by visiting a prostitute in Tel Aviv. Mendy falls head over heels in love with a Russian harlot named Sasha.",
    "2003_297": "Lisbon, Marseilles, Naples, Athens, Istanbul, Cairo, Aden, and Bombay. Along with a university teacher and her little daughter, we embark on a long journey, experiencing different cultures and civilizations.",
    "2003_298": "Follows three men who are in love with a most beautiful waitress: An intellectual restaurant owner, a mysterious musician and an erratic businessman; taking place during the WWII.",
    "2003_299": "Small-town love story of a young man with a reputation for womanizing and his best friend's sister.",
    "2003_3": "Freedom fighters Neo, Trinity and Morpheus continue to lead the revolt against the Machine Army, unleashing their arsenal of extraordinary skills and weaponry against the systematic forces of repression and exploitation.",
    "2003_30": "Benjamin Barry is an advertising executive and ladies' man who, to win a big campaign, bets that he can make a woman fall in love with him in 10 days.",
    "2003_300": "A film about the state of Chinese occupied Tibet and its history of oppression and resistance.",
    "2003_301": "A young girl's aunt tells her the tale of a young ice skater and an enchanted reindeer.",
    "2003_302": "The remarkable story of The Weather Underground, radical activists of the 1970s, and of radical politics at its best and most disastrous.",
    "2003_303": "A talented pool hustler who has stayed out of the game for years, must go back to his old ways when his little brother gets involved with his enemy, the very man who held him back from greatness.",
    "2003_304": "A singer, whose career has gone on a downward spiral, is forced to make a comeback to the performance stage for a benefit concert.",
    "2003_305": "Passionada is a romantic comedy about a Portuguese widow whose husband, a fisherman, died at sea. The widow's naive teenage daughter wants to be a professional gambler and she convinces her mother to date a British man who's new in town. ...See morePassionada is a romantic comedy about a Portuguese widow whose husband, a fisherman, died at sea. The widow's naive teenage daughter wants to be a professional gambler and she convinces her mother to date a British man who's new in town. The widow falls for the Brit, a professional gambler who pretends to be in the fishing business.  Written by AnonymousSee less",
    "2003_306": "Three intersecting stories about people whose lives are affected by the death of a gay restaurateur.",
    "2003_307": "A teenage boy expelled from school for fighting arrives at a boarding school where the systematic bullying of younger students is encouraged as a means to maintain discipline, and decides to fight back.",
    "2003_308": "A man faces a dilemma after he accidentally kills his lover's fiancee and hides this secret from her, not knowing that it may create a rift in their lives.",
    "2003_309": "A brief look into the South American family life, while showing the hardships surrounding adoption in South America; as six woman are forced to stay in the country while awaiting approval of adopting a baby.",
    "2003_31": "After being betrayed and left for dead in Italy, Charlie Croker and his team plan an elaborate gold heist against their former ally.",
    "2003_310": "The Cremaster Cycle is a series of five feature-length films, together with related sculptures, photographs, drawings, and artist's books, created by American visual artist and filmmaker Matthew Barney.",
    "2003_311": "Set against the backdrop of the 1984 Sikh genocide, Hawayein is a 2003 film directed by Ammtoje Mann. The film is based on some real-life events and features the impact of Operation Bluestar and the subsequent assassination of Indira ...See moreSet against the backdrop of the 1984 Sikh genocide, Hawayein is a 2003 film directed by Ammtoje Mann. The film is based on some real-life events and features the impact of Operation Bluestar and the subsequent assassination of Indira Gandhi on people's lives in Punjab. Hawayein depicts the story of Sarabjeet and how he became one of the most wanted terrorists of India.See less",
    "2003_312": "When Anna and her family arrive at their holiday home, they find it occupied by strangers. This confrontation is just the beginning of a painful learning process.",
    "2003_313": "A troubled young woman is encouraged by a teacher to enter a poetry contest.",
    "2003_314": "A young man who thought himself already in love with a nice girl is drawn into a literary drama when he is captured by a deep and stimulating love affair.",
    "2003_315": "During the 16th century, as Thailand contends with both a civil war and Burmese invasion, a beautiful princess rises up to help protect the glory of the Kingdom of Ayothaya. Based on the life of Queen Suriyothai.",
    "2003_316": "Avery (Jones) returns to college as a competitive swimmer after getting his life back on track. But his life takes another unexpected turn when he and his two friends (Bonds, Casseus) are wrongly accused of murder and end up in prison.",
    "2003_317": "The Tramp struggles to live in modern industrial society with the help of a young homeless woman.",
    "2003_318": "Two lovers attempt to save their relationship in a near-future world on the brink of cosmic collapse.",
    "2003_319": "Set during a crazy afternoon in the lives of a dozen college students at a co-ed dorm that starts with the arrival of two very different women with the same name of Dominique.",
    "2003_32": "In the waning days of the American Civil War, a wounded soldier embarks on a perilous journey back home to Cold Mountain, North Carolina to reunite with his sweetheart.",
    "2003_320": "From his hospital bed, a writer suffering from a skin disease hallucinates musical numbers and paranoid plots.",
    "2003_321": "Interviews, archival footage, and filmed performances highlight the role of music in the South African struggle against apartheid.",
    "2003_322": "Antonio Banderas and Emma Thompson star in this gripping political thriller about a man with the power to see the fate of missing people - with the exception of his own beloved wife. Read more: Synopsis",
    "2003_323": "Documentary featuring interview footage with Traudl Junge, one of Hitler's personal secretaries during WWII.",
    "2003_324": "Jane Austen's classic is transplanted to modern-day Utah. While her college roommates search for love, aspiring writer Elizabeth Bennet focuses on her career but constantly finds herself fighting haughty businessman Will Darcy.",
    "2003_325": "",
    "2003_326": "A collection of the best short, animated films from across the world curated by Mike Judge and Don Hertzfeldt.",
    "2003_327": "By chance 3 employees rob their bank the same weekend.",
    "2003_328": "",
    "2003_329": "Romance blooms between two soldiers (Knoller, Levi) stationed in an Israeli outpost on the Lebanese border.",
    "2003_33": "When a lonely guy meets a woman on the internet who happens to be in prison, she breaks out to get him to prove her innocence, and proceeds to wreak havoc on his middle-class life.",
    "2003_330": "Action sports documentary that follows the industry's best big wave surfers as they travel the world searching for the largest waves that nature has to offer. The journey spanned 18 months, 6 continents and produced up to 70 foot waves.",
    "2003_331": "A refugee family is trying to reach more peaceful lands illegally inside trucks.",
    "2003_332": "An ex-pop singer kills her much-hated husband to be with her young lover. Her daughter plots Electra-like revenge.",
    "2003_333": "A racist, bitter U.S. Border Patrol Agent moonlighting with a vigilante group goes undercover posing as a Mexican migrant worker in an effort to expose an illegal alien smuggling operation.",
    "2003_334": "Romance, politics, sex and humor all collide during two men's 11-year journey of passion, self-discovery and adventure.",
    "2003_335": "Karan and Khushi fall in love, but her conservative family balks at accepting Karan's modern ideas.",
    "2003_336": "Dramatic documentary about the young German pacifist and theologian Dietrich Bonhoeffer who resisted the Nazi regime and was hanged two weeks before World War II was over.",
    "2003_337": "1930's London. Two sisters - Madeleine and Dinah - One marries Rickie, the other falls in love with him. He begins an affair which is to have repercussions throughout their lives.",
    "2003_338": "Two high school boys, reenacting historic battles, use learned strategy and team up for war on a school bully. One falls for the other's sister.",
    "2003_339": "The life and career of Andre Stander, a South African police officer turned bank robber.",
    "2003_34": "Two men, Charlie Hinton (Eddie Murphy) and Phil Ryerson (Jeff Garlin), get laid off and have to become stay-at-home dads when they can't find jobs. This inspires them to open their own day-care center.",
    "2003_340": "A cross-cultural drama about a wealthy middle-aged Frenchman's yearning for a nineteen year local girl. Raja is an orphan literally and figuratively scarred by life. Fred is an emotionally bankrupt westerner living amid his plush garden. ...See moreA cross-cultural drama about a wealthy middle-aged Frenchman's yearning for a nineteen year local girl. Raja is an orphan literally and figuratively scarred by life. Fred is an emotionally bankrupt westerner living amid his plush garden. Fred's attempt to seduce Raja, and their mutual attempt at manipulation, are fractured by their gross disparity of income, age and cultural sophistication.  Written by Sujit R. VarmaSee less",
    "2003_341": "A critically acclaimed book vanished. Its author forgotten. One reader determined to find out why.",
    "2003_342": "A friendship between two young men is tested when they go for a hike in a desert and forget to bring any water or food with them.",
    "2003_343": "Frances is in the pen for killing her abusive husband. The abused the prisoners rise up against the \"new plantation\" that harvest human labor for profit. Nothing will stop Frances and her fellow inmates in this brutal battle for justice.",
    "2003_344": "A socially awkward veterinary assistant with a lazy eye and obsession with perfection descends into depravity after developing a crush on a boy with perfect hands.",
    "2003_345": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000.",
    "2003_346": "After the death of his mother, a man tries to discover a meaning to his life, to the universe and to rebuild a relationship with the only family he has left: his brother.",
    "2003_347": "An is-she-or-isn't-she gay comedy focused on a Taiwanese teen, the boy she might like, and the girl she may love.",
    "2003_348": "On June 12, 2000, a young man with a gun took the passengers aboard Bus 174 in Rio de Janeiro, Brazil hostage. This documentary examines the event itself, the resulting media frenzy, the police response, and the perpetrator's background.",
    "2003_349": "Comedy drama based on the true story of two British Army dentists who in 1942, eager to see action, go A.W.O.L. and invade occupied France on their own.",
    "2003_35": "An overworked mother and her daughter do not get along. When they switch bodies, each is forced to adapt to the other's life for one freaky Friday.",
    "2003_350": "A father, a retiring mailman, walks his son over his job in the mountainous regions of Hunan province.",
    "2003_351": "A painter from the big city goes to a remote canyon to commit suicide. To reach some calmness, he stays at the farmstead of Ascen, an old, religious woman. Although but a few words are spoken, love grows.",
    "2003_352": "Slice-of-life look at the lives of twelve people who live or work in the same apartment complex in Tel Aviv.",
    "2003_353": "Lost Boys of Sudan is a feature-length documentary that follows two Sudanese refugees on an extraordinary journey from Africa to America. Orphaned as young boys in one of Africa's cruelest civil wars, Peter Dut and Santino Chuor survived ...See moreLost Boys of Sudan is a feature-length documentary that follows two Sudanese refugees on an extraordinary journey from Africa to America. Orphaned as young boys in one of Africa's cruelest civil wars, Peter Dut and Santino Chuor survived lion attacks and militia gunfire to reach a refugee camp in Kenya along with thousands of other children. From there, remarkably, they were chosen to come to America. Safe at last from physical danger and hunger, a world away from home, they find themselves confronted with the abundance and alienation of contemporary American suburbia.  Written by AnonymousSee less",
    "2003_354": "A quaint Australian fishing village is overcome by meteorites that turn its residents into the ravenous undead, leaving a small group of those unharmed to find a way out.",
    "2003_355": "A rich father in a fisher village plans to take on the project of writing his life story. But first he has to take on his own family, and everybody wants something...",
    "2003_356": "During the war between Iran and Iraq, a group of Iranian Kurd musicians set off on an almost impossible mission. They will try to find Hanareh, a singer with a magic voice who crossed the border and may now be in danger in the Iraqi ...See moreDuring the war between Iran and Iraq, a group of Iranian Kurd musicians set off on an almost impossible mission. They will try to find Hanareh, a singer with a magic voice who crossed the border and may now be in danger in the Iraqi Kurdistan. As in his previous films, this Kurdish director is again focusing on the oppression of his people.  Written by up and outSee less",
    "2003_357": "Bullying students are becoming deathly ill after screaming the name of a legendary ghost. What's to blame? An exotic illness? An illicit drug? Or is it the supernatural? The clues are few and time is running out for the students of Rogers ...See moreBullying students are becoming deathly ill after screaming the name of a legendary ghost. What's to blame? An exotic illness? An illicit drug? Or is it the supernatural? The clues are few and time is running out for the students of Rogers High School. The only hope is the Veritas Project, a highly trained investigative team working undercover to expose the truth. Lives hang in the balance as they scramble to unravel the mystery and protect the student body from their own hatred and fear.  Written by AnonymousSee less",
    "2003_358": "David, an independent photographer, and Katia, an unemployed woman, leave Los Angeles, en route to the southern California desert, where they search a natural set to use as a backdrop for a magazine photo shoot. They find a motel in the ...See moreDavid, an independent photographer, and Katia, an unemployed woman, leave Los Angeles, en route to the southern California desert, where they search a natural set to use as a backdrop for a magazine photo shoot. They find a motel in the town of Twentynine Palms and spend their days in their sport-utility vehicle, discovering the Joshua Tree Desert, and losing themselves on nameless roads and trails. Frantically making love all the time and almost everywhere, they regularly fight, then kiss and make up, with little else going on in their empty relationship and quite ordinary daily life--until something horrible and hideous brutally puts an end to their trip.  Written by anonymousSee less",
    "2003_359": "John, a computer whiz on the rebound from a disastrous break-up, starts an adult Internet site with his roommate, Moe. They are soon caught up in the erotic nature of the chat sessions they host, changing both their lives.See moreJohn, a computer whiz on the rebound from a disastrous break-up, starts an adult Internet site with his roommate, Moe. They are soon caught up in the erotic nature of the chat sessions they host, changing both their lives.  Written by AnonymousSee less",
    "2003_36": "After a sudden attack on MI5, Johnny English, Britain's most confident, yet unintelligent spy, becomes Britain's only spy.",
    "2003_360": "A close-knit Midwestern farm family deals with loss, change, and social progress during the 1940's.",
    "2003_361": "Maria marries Hermann Braun in the last days of World War II, only for him to go missing in the war. Alone, Maria puts to use her beauty and ambition in order to find prosperity during Germany's \"economic miracle\" of the 1950s.",
    "2003_362": "A straight-laced Spanish man falls in love with a young foreigner.",
    "2003_363": "Documentary about the music group They Might Be Giants.",
    "2003_364": "\"Washington Heights\" tells the story of Carlos Ramirez, a young illustrator burning to escape the Latino neighborhood of the same name to make a splash in New York City's commercial downtown comic book scene. When his father, who owns a ...See more\"Washington Heights\" tells the story of Carlos Ramirez, a young illustrator burning to escape the Latino neighborhood of the same name to make a splash in New York City's commercial downtown comic book scene. When his father, who owns a bodega in the Heights, is shot in a burglary attempt, Carlos is forced to put his dream on hold and run the store. In the process, he comes to understand that if he is to make it as a comic artist, he must engage with the community he comes from, take that experience back out into the world, and put it in his work.  Written by AnonymousSee less",
    "2003_365": "A comedic look at the love lives of 14 different people and how they interconnect during one hot August afternoon around the Plaza del Sol in Madrid, Spain.",
    "2003_366": "In the midst of the Chechen War, a remote psychiatric institution is left without staff leaving the patients to fend for themselves. Based on a true story.",
    "2003_367": "An Argentinian Dutch and Latin Comedy Drama where a young naive girl Marcia (Tatiana Saphir) learns about her sexuality. Marcia is kidnapped by 2 punk women Mao (Carla Crespo)& Veronica Hassan (Lenin). They take her to a coast which Marcia...See moreAn Argentinian Dutch and Latin Comedy Drama where a young naive girl Marcia (Tatiana Saphir) learns about her sexuality. Marcia is kidnapped by 2 punk women Mao (Carla Crespo)& Veronica Hassan (Lenin). They take her to a coast which Marcia had never seen before. Eventually three women get familiar to each other and end up at Lenin's Grandma's friend, Aunt Blanca's (Beatriz Thibaudin) house as paying guest. There everybody discovers and rediscovers the relationships and affect each other.  Written by khaliwaliSee less",
    "2003_368": "In April 2002, an Irish film crew is making a documentary about Venezuelan President Hugo Chavez, when a coup from the opposition is made. Read more: Synopsis",
    "2003_369": "A documentary exploring the rise and fall of 80s skateboard legend Mark \"Gator\" Rogowski.",
    "2003_37": "Adventurer Lara Croft goes on a quest to save the mythical Pandora's Box, before an evil scientist finds it, and recruits a former Marine turned mercenary to assist her.",
    "2003_370": "On Christmas Eve, three homeless people living on the streets of Tokyo discover a newborn baby among the trash and set out to find its parents.",
    "2003_371": "Three actresses at various places on the Hollywood food chain navigate the minefield of love, aging, and ambition. Oh, and they're all played by men!",
    "2003_372": "Between the heaven and the Earth exist the Zu's mountain range, where live the immortals of Omei, the highest mountain of Zu, but the kingdom is in danger by Amnesia, a renegade immortal what want to rule Zu and all the world. White ...See moreBetween the heaven and the Earth exist the Zu's mountain range, where live the immortals of Omei, the highest mountain of Zu, but the kingdom is in danger by Amnesia, a renegade immortal what want to rule Zu and all the world. White Eyebrows, Zu's leader, call to his most experts fighters for to defeat Amnesia until destroy It, but Amnesia hides in the legendary and almost myth Blood Cavern in order to make stronger his powers. While Red, Eyebrows' servant, watches the enter of Blood Cavern, King Sky and the others warriors will try to find a way of exterminate Amnesia with an ancient and powerful mystical swords, hoping to be free of the Amnesia's threat.  Written by ChockysSee less",
    "2003_373": "Two door to door vacuum cleaner salesmen hilariously compete against each other.",
    "2003_374": "George Harrison's friends, family, and bandmates unite for a tribute concert on the one-year anniversary of his death.",
    "2003_375": "Using almost no dialogue, the film follows a number of residents (both human and animal) of a small rural community in Hungary - an old man with hiccups, a shepherdess and her sheep, an old woman who may or may not be up to no good, some ...See moreUsing almost no dialogue, the film follows a number of residents (both human and animal) of a small rural community in Hungary - an old man with hiccups, a shepherdess and her sheep, an old woman who may or may not be up to no good, some folk-singers at a wedding, etc. While most of the film is a series of vignettes, there is a sinister and often barely perceptible subplot involving murder.  Written by AnonymousSee less",
    "2003_376": "An ensemble drama in which the lives of 25 people intersect, inspired by Yamanaka Sadao's classic film {Humanity and Paper Balloons}. Various men and women, living in Japan today. Presents slices of everyday life for people in various ...See moreAn ensemble drama in which the lives of 25 people intersect, inspired by Yamanaka Sadao's classic film {Humanity and Paper Balloons}. Various men and women, living in Japan today. Presents slices of everyday life for people in various situations, where things that are always the undergo change.  Written by Michael L.R.See less",
    "2003_377": "An aging, world-weary gangster is double-crossed and forced out of retirement when his best friend is kidnapped and their stash of eight stolen gold bars demanded as ransom.",
    "2003_378": "Two brothers with a problematic relationship in the past, find together again when the elder one gets a dangerous disease and asks his brother to accompany him to several doctors.",
    "2003_379": "A gay couple are hit men for the mafia.",
    "2003_38": "The lives of three men who were childhood friends are shattered when one of them has a family tragedy.",
    "2003_380": "Green Card Fever is the story of a young man in the United States who overstays his visa in the pursuit of a \"Green Card\". He naively muddles through an underworld of illegal immigrants, immigration lawyers and the INS, and the love of an ...See moreGreen Card Fever is the story of a young man in the United States who overstays his visa in the pursuit of a \"Green Card\". He naively muddles through an underworld of illegal immigrants, immigration lawyers and the INS, and the love of an American girl of Indian origin.  Written by The ProducersSee less",
    "2003_381": "A character study of five young men at crucial turning points in their lives in a small town in Italy.",
    "2003_382": "A look at Fellini's creative process. In extensive interviews, Fellini talks a bit about his background and then discusses how he works and how he creates. Several actors, a producer, a writer, and a production manager talk about working ...See moreA look at Fellini's creative process. In extensive interviews, Fellini talks a bit about his background and then discusses how he works and how he creates. Several actors, a producer, a writer, and a production manager talk about working with Fellini. Archive footage of Fellini and others on the set plus clips from his films provide commentary and illustration for the points interviewees make. Fellini is fully in charge; actors call themselves puppets. He dismisses improvisation and calls for \"availability.\" His sets and his films create images that look like reality but are not; we see the differences and the results.  Written by See less",
    "2003_383": "The story of a petty thief who meets an innocent young woman and brings her into his world of crime while she teaches him the lessons of enjoying life and being loved. Read more: Synopsis",
    "2003_384": "Three friends begin a dangerous three-way relationship that spirals out of control, leading to dire consequences that haunt them ten years later.",
    "2003_385": "In 1995, director Steve James (of 'Hoop Dreams') returned to rural Southern Illinois to reconnect with Stevie Fielding, a troubled young boy to whom he had been an \"Advocate Big Brother\" ten years earlier.",
    "2003_386": "This is the true story of the rise of a Japanese businessman from Los Angeles named Eishy Hayata from an Airline engineer into the legend of the Emerald world -- the Emerald Cowboy. He moved to Columbia in the 70's and with six guns at his...See moreThis is the true story of the rise of a Japanese businessman from Los Angeles named Eishy Hayata from an Airline engineer into the legend of the Emerald world -- the Emerald Cowboy. He moved to Columbia in the 70's and with six guns at his side fought his way to the top by 2000.  Written by AnonymousSee less",
    "2003_387": "When one of his colleagues becomes corrupted by power and goes over to the dark side, a young police officer tries to bring the offender to justice.",
    "2003_388": "A French striptease artist is desperate to become a mother. When her reluctant boyfriend suggests that his best friend impregnate her, feelings become complicated when she accepts.",
    "2003_389": "Faced with a looming death, an aging prankster makes the most of his remaining life.",
    "2003_39": "True story of the undersized Depression-era racehorse whose victories lifted not only the spirits of the team behind it but also those of their nation.",
    "2003_390": "An orthodox Jewish blaxploitation hero saves Hanukkah from the clutches of Santa Claus' evil son.",
    "2003_391": "Prey For Rock & Roll is the story of Jacki and her all-girl rock and roll band, Clam Dandy, who are trying to make it in the LA club scene of the late 1980s. After ten years of being ignored by record producers, Jacki and the band find ...See morePrey For Rock & Roll is the story of Jacki and her all-girl rock and roll band, Clam Dandy, who are trying to make it in the LA club scene of the late 1980s. After ten years of being ignored by record producers, Jacki and the band find hope in one producer who promises to see them play and consider them for a contract. Jacki resolves to play this one last gig and then throw in the towel if she does not find success. Personal tragedies, however, threaten to rip the band apart, rocking the foundation of friendship and trust the women have built together. Ultimately, the band must find its strength in the music that is their passion and the thread that holds them together, inspiring them to prevail.  Written by Cheri LovedogSee less",
    "2003_392": "Harish Kumar Patel lives with his mom and dad in Valsad, Gujarat, India, where he is studying Electronic Engineering. His dad, Satish Kumar, wants him to re-locate to the U.S., live with the Bakshis, study, and marry the girl of his choice...See moreHarish Kumar Patel lives with his mom and dad in Valsad, Gujarat, India, where he is studying Electronic Engineering. His dad, Satish Kumar, wants him to re-locate to the U.S., live with the Bakshis, study, and marry the girl of his choice. Harish must first go through the blessings of an Astrologer, Bholey Shankar Maharaj, who blesses him, informs him that he will meet a girl whose name will start with \"P\", who he will marry. An overly excited Harish travels all the way to Houston, Texas, U.S. where he is met fondly by the Bakshi family, consisting of Mrs. and Dr. Bakshi, Mohan, and Deepu. In keeping with the fear and paranoia after the September 11 attacks, Mrs. Bakshi has made it a practice to place American flags in the front pockets of her sons, and she does it now for Harish as well. Mohan is around Harish's age and shows him around the campus. Harish meets with a beautiful Malyalee girl, Priya, and falls in love with her. But things do not go as planned when Harish finds out that Mohan actually is a snob, who hates F.O.Bs. (Fresh off the Boat) Indians like him; the girl Priya is actually in love with another young man by the name of Raju, and her name's not Priya - it's Supriya; and due to Harish's accent, oily hair, & c. he is not being invited to the party where everybody else is invited. Looks like Harish is headed for more pitfalls than he had bargained for, and it also looks like the Maharaj may have been wrong after all.  Written by AnonymousSee less",
    "2003_393": "A corporate lawyer is caught in a love triangle with an ambitious cabaret singer.",
    "2003_394": "A young Austrian survives the crash of a commercial airliner. Six years later, she's a clerk, a mother, happy. Then she dies in a car accident. Over the next year, we follow her daughter, who goes through various medical blood tests, her ...See moreA young Austrian survives the crash of a commercial airliner. Six years later, she's a clerk, a mother, happy. Then she dies in a car accident. Over the next year, we follow her daughter, who goes through various medical blood tests, her husband, her best friend who's been having an affair with her husband, her sister who trades sex for shelter, her brother and his hesitant friendship with an emotionally-locked clerk at a pharmacy, the clerk's lonely mother, an unpopular high-school student with bad skin, and the boy she may connect with, who was driving the car in the fatal crash. In happenstance are there patterns? In life is there meaning?  Written by See less",
    "2003_395": "A look at how our cultural obsession with youthful good looks affects women who are told their value is dependent on their appearance.",
    "2003_396": "Raised by assassins, Yuki is the last of the Takemikazuchi royal bloodline. A deadly weapon in her own right, she learns the gruesome truth about the death of her beloved mother and joins forces with a mysterious rebel leader.",
    "2003_397": "A family saga covering several decades of Westward expansion in the nineteenth century - including the Gold Rush, the Civil War, and the building of the railroads.",
    "2003_398": "A once-idealistic writer inadvertently ignites a feeding frenzy in Hollywood with the mention of a mysterious new screenplay and its illusive author.",
    "2003_399": "An ex-office worker becomes a ventriloquist, leading to a date with his unemployment counselor; but his quirky family and a gauche female friend may thwart his new career and love life.",
    "2003_4": "Blacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.",
    "2003_40": "A depressed female psychiatrist wakes up as a patient in the asylum where she worked, with no memory of why she is there or what she has done.",
    "2003_400": "When a Mexican film director becomes fed up with the crime and corruption in his homeland, he decides to single-handedly take on a powerful band of criminals.",
    "2003_401": "After attacking another player with a bat during baseball at school, Lyle's sent to the psych ward. He meets other teenagers with problems. Will group therapy help?",
    "2003_402": "A young idealistic teacher enters her kids in a city choral competition. A victory there would not only gain funds for the school, but prove to these children of poverty how even they can afford to hope.",
    "2003_403": "A San Franciscan computer programmer falls in love with a schoolteacher in the days after the dot.com boom.",
    "2003_404": "A young woman looking to escape her life is rescued on the highway by a friendly couple in an RV. But as the miles pass the couple's motives come into question and a strange mother/daughter relationship evolves.",
    "2003_405": "Two Chinese coal miners have hit upon the perfect scam: murder one of their fellow mine workers, make the death look like an accident, and extort money from the boss to keep the incident hushed up. For their latest \"mark,\" they choose a ...See moreTwo Chinese coal miners have hit upon the perfect scam: murder one of their fellow mine workers, make the death look like an accident, and extort money from the boss to keep the incident hushed up. For their latest \"mark,\" they choose a naive teenager from a small village, and as they prepare to carry out their newest plan, things start to get complicated...  Written by Verbal-17See less",
    "2003_406": "A film featuring the veteran soul music artists and music of Stax Records.",
    "2003_407": "The raunchy, spunky tale of the rise and fall of an all-girl rock band from Portland, Oregon.",
    "2003_408": "Charlie (Gummersall), his sexy girlfriend (Jover), and his moronic best friend (Bailey) drink, drug, and self-destruct over the course of one day at Charlie's father home in Los Angeles.",
    "2003_409": "A surgeon causes an accident which leaves his daughter disfigured, and goes to extremes to give her a new face.",
    "2003_41": "A free-thinking art professor teaches conservative 1950s Wellesley girls to question their traditional social roles.",
    "2003_410": "The eight-year marriage of Liyan and Yuwen has left them both unfulfilled and distant. A visitor arrives from Shanghai, a doctor who's an old school friend of Liyan's and, unbeknownst to her husband, Yuwen's childhood sweetheart.",
    "2003_411": "14-year-old Watts Davies is estranged from his dad, a former International Karting Federation (IKF) champion. Watts's resolve to race in the upcoming IKF Regional Championships rekindles their relationship as they pursue the dream together.See more14-year-old Watts Davies is estranged from his dad, a former International Karting Federation (IKF) champion. Watts's resolve to race in the upcoming IKF Regional Championships rekindles their relationship as they pursue the dream together.  Written by AnonymousSee less",
    "2003_412": "Two unemployed Chinese teenagers have trouble resisting the temptations of the Western world.",
    "2003_413": "A ballet rendition of Bram Stoker's \"Dracula\", stylized as an Expressionistic silent film.",
    "2003_414": "Four gay shorts are rolled into one 83-minute movie.",
    "2003_415": "The story of two people who cross paths in Nouhadhibou.",
    "2003_416": "Mexico, 1949. The fable of a janitor turned Mayor on a little town lost in the Mexican desert, who gradually realizes how far his new acquainted power and corruption can get him.",
    "2003_417": "Rachel flees NYC after another traumatic breakup and arrives at her parents' home in San Diego. They are adamant to see their wayward daughter settle down with a nice girl. Rachel goes on several blind dates that misfire badly. She finally...See moreRachel flees NYC after another traumatic breakup and arrives at her parents' home in San Diego. They are adamant to see their wayward daughter settle down with a nice girl. Rachel goes on several blind dates that misfire badly. She finally lets her mother set her up with Christine, a typical Californian girl. Much to Rachel's chagrin, mom is right! Meanwhile, Rachel's friends wait for her to screw up the relationship. They know, even if she won't admit it, that she still carries a torch for her ex-girlfriend and they're not sure what would happen if she reappeared to reclaim Rachel.  Written by Helen LesnickSee less",
    "2003_418": "AKA is the story of a disaffected youth's search for love, status, and identity in late 1970s Britain. 18-year old Dean is handsome and bright, but feels hampered by his working-class background and by his family, which includes a sexually...See moreAKA is the story of a disaffected youth's search for love, status, and identity in late 1970s Britain. 18-year old Dean is handsome and bright, but feels hampered by his working-class background and by his family, which includes a sexually abusive father. In order to make something of himself, Dean assumes another identity and manages to enter high society. As he navigates this decadent new world, he meets a host of characters, including David, an older gay man who desires him, and Benjamin, a young hustler from Texas who has also managed to find a place among the aristocracy. Can Dean find love while living a lie? How much is he willing to sacrifice in order to pull off his charade? Presented through three simultaneous frames rather than one.See less",
    "2003_419": "No wonder Bisexual Attorney Alain is confused. He's bedding his female boss, his guilty of murder client, the client's hairdresser girlfriend and a precocious boy who knows what he wants and tries to convince Alain that 'he can have it all...See moreNo wonder Bisexual Attorney Alain is confused. He's bedding his female boss, his guilty of murder client, the client's hairdresser girlfriend and a precocious boy who knows what he wants and tries to convince Alain that 'he can have it all'.  Written by Havan Ironoak See less",
    "2003_42": "Mowgli, missing the jungle and his old friends, runs away from the man village unaware of the danger he's in by going back to the wild.",
    "2003_420": "The story of a mistreated donkey and the people around him. A study on saintliness and a sister piece to Bresson's Mouchette.",
    "2003_421": "Through interviews we meet some of the people who risked their lives to hide Jewish children during World War II and how this experience has continued to affect the survivors.",
    "2003_422": "Documentary following Susan Tom of Fairfield, California and her 11 adopted special needs children.",
    "2003_423": "Corruption, assassination and street rioting surround the story of the award-winning film, Power Trip, which follows an American multi-national trying to solve the electricity crisis in Tbilisi, capital of the former Soviet Republic of ...See moreCorruption, assassination and street rioting surround the story of the award-winning film, Power Trip, which follows an American multi-national trying to solve the electricity crisis in Tbilisi, capital of the former Soviet Republic of Georgia.  Power Trip provides insight into today's headlines, with a graphic, on-the-ground depiction of the challenges facing globalization in an environment of culture clash, electricity disconnections and blackouts.  Written by Press releaseSee less",
    "2003_424": "A wealthy East Indian man gives an apparently non-East Indian woman a crash course in his culture, so he can marry her with his family's approval.",
    "2003_425": "A TV interviewer and his cameraman meet a former actress and travel through her memories and career.",
    "2003_426": "Using the Internet and global satellites, a group of gangsters pull off the biggest bank heist in the Mafia's history.",
    "2003_427": "In Hawaii in 1941, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second-in-command are falling in love.",
    "2003_428": "Nick is a district attorney investigating several deaths of AIDS sufferers in the gay community of New York City's Chelsea District. Each case suggest the use of assisted suicide, which is illegal in New York.",
    "2003_429": "A prostitute, a hired killer, and a movie crew cross paths in a Venice hotel where human meat is on the menu in this freewheeling film.",
    "2003_43": "Two bored children have their lives turned upside down when a talking cat comes to visit them.",
    "2003_430": "A documentary examining the decade of the 1970s as a turning point in American cinema. Some of today's best filmmakers interview the influential directors of that time.",
    "2003_431": "This is the story of a marketing man and his shrink. A suicide attempt and a softball game; A PHD-toting stripper and a deranged Desert Storm vet; A giant sparerib costume and the world's largest peenis; John Woo-style violence and Steel ...See moreThis is the story of a marketing man and his shrink. A suicide attempt and a softball game; A PHD-toting stripper and a deranged Desert Storm vet; A giant sparerib costume and the world's largest peenis; John Woo-style violence and Steel Magnolia-esque pathos. This is the story of Martin & Orloff.  Written by AnonymousSee less",
    "2003_432": "In a Parisian porn theater, a cashier, a 50-year-old man and a young projectionist are drawn into a complex love affair.",
    "2003_433": "A woman narrates the contemplative writings of a seasoned world traveler, focusing on contemporary Japan.",
    "2003_434": "A valuable visual commentary on modern society, 'Under The Skin Of The City' follows one Iranian family in their eternal struggle to stay afloat financially and emotionally. Touba works hard at a textile factory to make ends meet during ...See moreA valuable visual commentary on modern society, 'Under The Skin Of The City' follows one Iranian family in their eternal struggle to stay afloat financially and emotionally. Touba works hard at a textile factory to make ends meet during the day, returning in the evening to face the trials and tribulations of her family: her pregnant daughter who frequently suffers at the hands of her abusive husband, a son embroiled in radical politics, and another son who hopes to escape to Japan. In their fight for self-determination and independence, Touba and her family come to represent the plight of the working class in modern day Tehran.  Written by IMVBox.comSee less",
    "2003_435": "All all-female gang of Old West bank robbers comes out of retirement to rescue a sister in peril. Read more: Synopsis",
    "2003_436": "Kati and Steffi have been best friends forever. Their love lives are heating up, so they're hitting the books less and going out to nightclubs more. When Steffi sees her father with another woman, her life begins to spiral out of control.",
    "2003_437": "Anxious to use artificial life to improve the world, Rosetta Stone, a bio-geneticist creates a Recipe for Cyborgs and uses her own DNA in order to breed three Self Replicating Automatons, part human, part computer named Ruby, Olive and ...See moreAnxious to use artificial life to improve the world, Rosetta Stone, a bio-geneticist creates a Recipe for Cyborgs and uses her own DNA in order to breed three Self Replicating Automatons, part human, part computer named Ruby, Olive and Marine. The SRA's act as 'portals' on the Internet, helping users to fulfill their dreams. The SRA's are nourished through touch. Because they were bred only with Rosetta's DNA, they need the balance of an Y chromo or male sperm to survive. Rosetta projects seduction scenes from movie clips onto Ruby, which absorbs as she sleeps. The SRA'S can not distinguish dreams from reality. Ruby acts out these scenes in real life with the men and shares her spoils with her sisters. However, Ruby's encounters suffer from impotence and unexplained rashes. Fearing a bio-gender war, the FBI sends in Agent Edward Hopper to solve the mystery. Puzzled, he turns for help from a private cyber detective. The men recover. Ruby falls in love and becomes impregnated by Sandy, a xerox shop worker. The characters struggle to find love in a world that no longer needs sex to reproduce, a world that is changing and is populated with people who use provisional identities and are seen through virtual selves and a world where love is the only thing that makes things real.  Written by wayne@wildstrawberryfilms.comSee less",
    "2003_438": "An actor holds a burglar hostage on New Year's Eve, after his girlfriend leaves him and his cat dies.",
    "2003_439": "Much as the title suggests, Beyond Vanilla explores the kinkier aspects of sex on the other side of vanilla. With interviews, demonstrations and a good dose of how-to instructions, this documentary covers the gamut of fetishes and SM ...See moreMuch as the title suggests, Beyond Vanilla explores the kinkier aspects of sex on the other side of vanilla. With interviews, demonstrations and a good dose of how-to instructions, this documentary covers the gamut of fetishes and SM practices. From bondage, flogging and fisting to knife play, fire and golden showers, director Claes Lilja takes us on an unforgettable journey to the wilder side of sex. Sharing fantasies, experiences and pleasures, the over 60 people interviewed in the film help to blur boundaries and shed new light on sexuality and sexual practices. Open your mind and the rest will follow...  Written by AnonymousSee less",
    "2003_44": "After being kicked out of his rock band, Dewey Finn becomes a substitute teacher of an uptight elementary private school, only to try and turn his class into a rock band.",
    "2003_440": "A hair stylist, who can read the minds of those whose hair he cuts, decides to act on his gathered information.",
    "2003_441": "Two Irish lads stumble through London's gay scene.",
    "2003_442": "About a Palestinian girl of 17 who wants to get married to the man of her own choosing. Rana wakes up one morning to an ultimatum delivered by her father: she must either choose a husband from a preselected list of men, or she must leave ...See moreAbout a Palestinian girl of 17 who wants to get married to the man of her own choosing. Rana wakes up one morning to an ultimatum delivered by her father: she must either choose a husband from a preselected list of men, or she must leave Palestine for Egypt with her father by 4:00 that afternoon. With ten hours to find her boyfriend in occupied Jerusalem, she sneaks out of her father's house at daybreak to find her forbidden love Khalil (Natour).  Written by [Excerpted from the MFA Film Calendar.]See less",
    "2003_443": "Luster is a refreshingly funny and sexy look at unrequited love. Jackson, a cute, lanky, blue-haired poet who works in a record store, is at the center of Everett Lewis' twisted black LA comedy. He's got a crush on the sexy young blonde, ...See moreLuster is a refreshingly funny and sexy look at unrequited love. Jackson, a cute, lanky, blue-haired poet who works in a record store, is at the center of Everett Lewis' twisted black LA comedy. He's got a crush on the sexy young blonde, Billy, who he met at an orgy the other night. But Billy's not into him, he's in love with Sonny, a musician into S&M. Even though Billy doesn't want Jackson, two other guys do: Derek, a clean-cut record store customer, and Sam, the supposedly straight record store owner. Into this mix is thrown Jed, Jackson's hunky cousin, which leads Jackson to seriously contemplate the technicalities of incest. Before he can do anything about it, though, Jed is seduced by Jackson's lesbian artist friend. What's a boy to do?  Written by AnonymousSee less",
    "2003_444": "4 American Storytellers talking about LIFE and MOVIES with a silent host.",
    "2003_445": "A story about a man trying to overcome mistakes and past events in his life.",
    "2003_446": "The story of a fire captain who lost eight men in the collapse of the World Trade Center and the editor who helps him prepare the eulogies he must deliver.",
    "2003_447": "He's the greatest fighter of all time. A sports icon that is loved throughout the world. A man driven by his ambition to be the best. Muhammad Ali is a name that to this day puts fear in the strongest of men. Hear from the people who knew ...See moreHe's the greatest fighter of all time. A sports icon that is loved throughout the world. A man driven by his ambition to be the best. Muhammad Ali is a name that to this day puts fear in the strongest of men. Hear from the people who knew him best, from experts of the world of boxing, relive the legendary fights and explore the life of boxing's greatest symbol, Ali.  Written by AnonymousSee less",
    "2003_448": "The year is 1991. The Soviet Union has collapsed and Armenia is at the threshold of her independence. It has been ten years since twenty-three-year-old Eve left her homeland and emigrated to New York City with her parents. Eve struggles to...See moreThe year is 1991. The Soviet Union has collapsed and Armenia is at the threshold of her independence. It has been ten years since twenty-three-year-old Eve left her homeland and emigrated to New York City with her parents. Eve struggles to pursue her passion as a photographer while waitressing at nights. However, amidst the ever continuous vitality of America, Eve yearns for stillness that will soothe her soul. Tragedy strikes, transforming her dreams into nightmares. Eve learns that in Armenia her childhood friend, Arman, has been killed. Unexpectedly she gets called on an assignment to photograph the events taking place in the Caucasus and finds herself on a journey that changes her life. Facing her past both culturally and emotionally, Eve finds herself caught up in the independence movement of Armenia and the crisis of committing to a man, whom she falls in love with.  Written by J F ProductionsSee less",
    "2003_449": "Fashion is considered a glamorous industry full of beautiful people. \"Garmento\" tells the other side of the story, with a dark and satirical look at New York's wholesale garment industry, where shady deals are made for a buck and ...See moreFashion is considered a glamorous industry full of beautiful people. \"Garmento\" tells the other side of the story, with a dark and satirical look at New York's wholesale garment industry, where shady deals are made for a buck and ruthlessness is a prerequisite for career success.  Written by AnonymousSee less",
    "2003_45": "Elle Woods heads to Washington, D.C. to join the staff of a Representative in order to pass a bill to ban animal testing.",
    "2003_450": "A film journey through a universe of female masculinity. A legendary Drag King Night in New York is the point of departure for an odyssey to transgendered worlds, where women become men - some for a night, others for their whole lives. ...See moreA film journey through a universe of female masculinity. A legendary Drag King Night in New York is the point of departure for an odyssey to transgendered worlds, where women become men - some for a night, others for their whole lives. What motivates them? What changes take place? What do they dream of? The drag kings of New York meet in clubs and change lustfully into their male alter egos, parodying them and exploring male eroticism and power strategies. In London we see women experiment with hormones to become new men and 'cyborgs'. Masculinity and transformation as performance, subversion or existential necessity.  Written by AnonymousSee less",
    "2003_451": "A feature length documentary by John H. Smihula",
    "2003_452": "The story of Cuban refugees who risked their lives in homemade rafts to reach the United States, and what life is like for those who succeed.",
    "2003_453": "Medea is in Corinth with Jason and their two young sons. King Kreon wants to reward Jason for his exploits: he gives the hand of his daughter, Glauce, to Jason as well as the promise of the throne. In exchange, Medea and the boys are to be...See moreMedea is in Corinth with Jason and their two young sons. King Kreon wants to reward Jason for his exploits: he gives the hand of his daughter, Glauce, to Jason as well as the promise of the throne. In exchange, Medea and the boys are to be banished. Jason explains that his actions ensure a rich future for Medea and her sons. She asks that she be allowed to stay; Kreon refuses. She asks for one more day, and begs Jason to seek the king's permission to allow their sons to stay in Corinth. Jason agrees and Medea prepares a gift for her sons to give to Glauce. Will Medea leave peacefully?  Written by See less",
    "2003_454": "A period drama/thriller about a surveyor and his fiancee who arrive in a remote Malaysian trading post and encounter a closed-fisted ivory trader and her ill-meaning family.",
    "2003_455": "When samurai Hiromasa comes to Seimei, Kyoto's court Onmyoji (a fortune teller in commune with the spirits), to warn of a plot against the government, the two discover that the court's formidable magician, Doson, is indeed planning a coup.",
    "2003_456": "Documentary covering a Stax Records-sponsored all-day concert at the 1972 Watts Summer Festival with performances by Stax Records artists such as Isaac Hayes, Rufus Thomas, The Staples Singers, and more.",
    "2003_457": "",
    "2003_458": "The lives of two brothers, who live in N'djamena, are upended when they awake one Saturday morning to find that their father has left the family. They are Amine, about eight years old, playful and asthmatic, and Tahir, 15, handsome, quiet,...See moreThe lives of two brothers, who live in N'djamena, are upended when they awake one Saturday morning to find that their father has left the family. They are Amine, about eight years old, playful and asthmatic, and Tahir, 15, handsome, quiet, his brother's protector. The boys go in search of their father, and find only trouble. Dad's leaving also debilitates their mother. The movies, a musical uncle, a village Koran school, a poster of a Moroccan beach, and a young deaf woman figure in the resolution. Is there any place for happiness, or is happiness only in storybooks?  Written by See less",
    "2003_459": "A documentary about the life of Soviet Armenian composer Aram Khachaturyan. Among other events, the film covers Khachaturyan's difficulties working as a creative artist during the Stalin era.",
    "2003_46": "A frustrated son tries to determine the fact from fiction in his dying father's life.",
    "2003_460": "A dramedy that centers on a self-procalimed anarchist and his like-minded friends.",
    "2003_461": "A young man finds solace with a young woman, his mother, and a high-school football coach who recruits him to quarterback a six-man team.",
    "2003_462": "The life of '80's fashion designer/queer icon Leigh Bowery is explored in this documentary.",
    "2003_463": "4 women fast from men for 100 days. No talking to, no touching of, no flirting with, and above all: no sex with men. When $1 million is offered to the first man who can break the fast, all hell breaks loose.",
    "2003_464": "Bruce leaves his girlfriend behind in Paris for an arts fellowship that will allow him to live and work in Rome. Staying at a villa that once belonged to the Medici and being allowed to write full time seems like a dream until he meets ...See moreBruce leaves his girlfriend behind in Paris for an arts fellowship that will allow him to live and work in Rome. Staying at a villa that once belonged to the Medici and being allowed to write full time seems like a dream until he meets Matteo, a native of Rome who works at the villa. Daily exposure to renaissance art and ancient Roman statuary and the looks of desire that he thinks he recognizes in Matteo's eyes leads Bruce to question his own sexual orientation. Why does Matteo seem to enjoy falling asleep in Bruce's bed so often? And why is Matteo so attentive one minute and so distant the next? If Matteo is interested, why does he also seem so interested in Irene, the American girl? And if Bruce is straight why does he care so much?  Written by havan_ironoak@bigfoot.comSee less",
    "2003_465": "Jimmy joins a corrupt LAPD police force as a crime scene photographer. Soon, however, his life takes a turn for the worse as he descends into madness, rearranging evidence and victims to \"resurrect\" them through his pictures.See moreJimmy joins a corrupt LAPD police force as a crime scene photographer. Soon, however, his life takes a turn for the worse as he descends into madness, rearranging evidence and victims to \"resurrect\" them through his pictures.  Written by Becca See less",
    "2003_466": "This documentary about the culture of intense cinephilia in New York City reveals the impassioned world of five obsessed movie buffs. The filmmakers expose this delightfully deranged cult by capturing the daily lives of its members. ...See moreThis documentary about the culture of intense cinephilia in New York City reveals the impassioned world of five obsessed movie buffs. The filmmakers expose this delightfully deranged cult by capturing the daily lives of its members. Interviews in movie houses, on the street and in the homes of the subjects tell the story of each individual. Many cannot hold a job, or choose not to. All of them have demoted the importance of the real world, giving all of their attention to the fantasy world of the movies. These human encyclopedias of cinema see two to five films a day, and from 600 to 2,000 films per year. Many have no physical sex lives, living instead in a world of romance with stars like James Dean or Audrey Hepburn. In Cinemania, Hollywood's biggest fans become the true stars. This is the story of their lives, their memories, their unbending habits and the films they love.  Written by Miriam HopkinsSee less",
    "2003_467": "Mechanic Stella owns a gas station with introvert Lenni. When Stella accidentally kills Lenni's abusive mother, they try to dump the body. They run into trouble, thugs and cops but stick together as they fall in love with each other.",
    "2003_468": "Fifteen years ago, their Washington Heights neighborhood was dubbed the crack-cocaine capital of the world, but today it is transforming into one of the most vibrant, Spanish-speaking communities in the United States. While the drug ...See moreFifteen years ago, their Washington Heights neighborhood was dubbed the crack-cocaine capital of the world, but today it is transforming into one of the most vibrant, Spanish-speaking communities in the United States. While the drug dealers continue to disappear, their violent legacy still casts a shadow over the neighborhood and its residents. Junior, an ex-convict struggling to get his life back on track, is a product of this legacy. His younger brother Manny, the salutatorian of his high school class, embodies the hope of the future. On the night of his graduation party, Manny finds himself faced with an ill-fated decision that could change his life forever.  Written by Sujit R. VarmaSee less",
    "2003_469": "Nola, an aspiring songwriter, leaves an abusive Kansas home and journeys to New York to find her biological father. Once there, she finds more than she expected.",
    "2003_47": "The Darling family children receive a visit from Peter Pan, who takes them to Never Never Land where an ongoing war with the evil Pirate Captain Hook is taking place.",
    "2003_470": "Documentary on Joseph Stalin's 1928 creation of the world's first Jewish homeland in the Soviet Union, in a barren stretch of land on Siberia's Far Eastern border.",
    "2003_471": "Alix is taken in by a photographer, Digna, who despite her friends' protests, tries to help Alix piece her life back together and overcome her addictions.See moreAlix is taken in by a photographer, Digna, who despite her friends' protests, tries to help Alix piece her life back together and overcome her addictions.  Written by gluba2000 (revised)See less",
    "2003_472": "This gripping documentary investigates the disappearance of young women from assembly plants that line the Mexican-American border",
    "2003_473": "Two troubled adolescents chronicle the events that ultimately lead up to a terrifying assault on their school.",
    "2003_474": "Animator Thomas Kempton gets more than he bargained for when a snowmobile trip turns to terror in the wilds of Northern Michigan. Held prisoner by two cannibalistic sisters who try unsuccessfully to add him to their long list of victims, ...See moreAnimator Thomas Kempton gets more than he bargained for when a snowmobile trip turns to terror in the wilds of Northern Michigan. Held prisoner by two cannibalistic sisters who try unsuccessfully to add him to their long list of victims, Tom becomes obsessed with tracking down his captor's long lost daughter. The ensuing drama becomes perfect material for Tom's latest Hollywood screenplay, inevitably luring one cannibal sister back to her original prey.  Written by See less",
    "2003_475": "Documentary about the life of avant-garde filmmaker Maya Deren, who led the independent film movement of the 1940s.",
    "2003_476": "Mexican English teacher Pablo Fernandez seeks a better life for himself and his spoiled daughter Christina (5) after losing his wife in a hurricane. Pablo becomes a tomato picker as illegal immigrant in California. While driving his ...See moreMexican English teacher Pablo Fernandez seeks a better life for himself and his spoiled daughter Christina (5) after losing his wife in a hurricane. Pablo becomes a tomato picker as illegal immigrant in California. While driving his illegal employer Charlie's truck, he accidentally runs over Dinah Knightly (6), who later dies. Dumb, arrogant detective Bryant and brighter but superstitious rookie Steven Lightning investigate and set chase. Petty would be-TV reporter Soid finds out first and blackmails Pablo to take her along fleeing to Mexico or she'll report him. The Fernandez's make it to Canada. On the road improvisation gets out of hand.  Written by KGF VissersSee less",
    "2003_477": "Already an outcast for crimes she did not commit, a woman struggling to raise her two children in a small village during World War II is suspected of being a saboteur.",
    "2003_478": "A veteran British barrister must defend his client in a murder trial that has surprise after surprise.",
    "2003_479": "The Assistant to a world-famous film director must hide her boss' scandalous lifestyle from reporters.",
    "2003_48": "A beautiful gold digger matches wits with a shrewd Beverly Hills divorce lawyer who is increasingly attracted to her.",
    "2003_480": "An advertising executive fails to realize that the woman of his dreams is his best friend since first grade, now married to his cheating co-worker.",
    "2003_481": "A filmic reflection about the stereotypes of \"the Jew\" and \" the Arab\" through one hundred years of film, linked with the biographies of four extraordinary people: Iraqi-Jewish communists.",
    "2003_482": "The Leroy Jenkins Story, following the controversial life of evangelist Leroy Jenkins",
    "2003_483": "In this war drama blurring the lines between documentary and fiction, the working class and the bourgeoisie of 19th century Paris are interviewed and covered on television, before and during a tragic workers' class revolt.",
    "2003_484": "A high school shooting has repercussions on the town and students.",
    "2003_485": "\"Irish Eyes\" explores the relationship between two Irish-American brothers in Boston born to immigrant parents and raised in a rough, working class Irish neighborhood. After watching their father being gunned down in front of their eyes as...See more\"Irish Eyes\" explores the relationship between two Irish-American brothers in Boston born to immigrant parents and raised in a rough, working class Irish neighborhood. After watching their father being gunned down in front of their eyes as children, Thomas and Sean Phelan grow up building their lives on opposite ends of the law. Thomas, the studious and responsible brother, creates a better life for himself through education and hard, honest work. Eventually, he builds a successful career as a US Attorney. Sean, the more rebellious of the two, gets caught up in a life of crime and rises through the ranks to become the head of the Irish Mob. Spanning from post World War II during the late 1950's through the Irish Mob wars of the 1970's and culminating in their adulthood in the 1990's, the story is set to the backdrop of backroom politics and the realities of the Irish Mob and it's gang wars. The theme of the film simultaneously addresses the similarities between the two factions of law and crime while revealing the similarities between the two brothers.  Written by Julian ValdesSee less",
    "2003_486": "Kira and Mads try to work out their marriage, after Kira has been two years in a mental institution, but is she really ready for the real world?",
    "2003_487": "High Times' Pot Luck is an upbeat pot caper that centers around a mobster who discovers the magic of marijuana.",
    "2003_488": "A man gets involved in a kidnapping scheme with the wife of a wealthy businessman. She lets herself be tied up and confined in his house while he sends the ransom demand. When he returns home that night, however, he finds her laying dead ...See moreA man gets involved in a kidnapping scheme with the wife of a wealthy businessman. She lets herself be tied up and confined in his house while he sends the ransom demand. When he returns home that night, however, he finds her laying dead on the floor. In a panic he buries her body deep in the woods and tries to return to his ordinary life. One day, he thinks he spots her walking down the street. Is his mind playing tricks on him, or has she somehow returned from the grave?  Written by Jean-Marc Rocher See less",
    "2003_489": "Jack, a 25 year old Jersey guy is scared... of moving out of his parents house...of marrying his girlfriend of seven years... of spending his life working in the nursing home... of eighty year old Helen with whom he engages in a daily ...See moreJack, a 25 year old Jersey guy is scared... of moving out of his parents house...of marrying his girlfriend of seven years... of spending his life working in the nursing home... of eighty year old Helen with whom he engages in a daily battle not to pull the fire alarm. On a rare trip into the \"foreign\" territory of New York City, Jack and his pal Merle talk their way into a hip downtown club. Wearing his best plaid shirt he fails to impress anyone, except a glamorous model, who happens to think taking care of old people is just about the nicest thing a person could do for a living. Totally smitten by her attention, Jack embraces her world. He feels guilty about cheating on his girlfriend, but he looks so good in his new Valentino suit! His buddies in the nursing home, impressed by Jack's ballet of deceit and self discovery, live vicariously through him. He's got to make a choice. But something's not right... as he discusses this new turn of events with his father, he realizes there is more to the old man than meets the eye. So which life does Jack choose?  Written by Elia ZoisSee less",
    "2003_49": "A faded movie star and a neglected young woman form an unlikely bond after crossing paths in Tokyo.",
    "2003_490": "Award-winning comedy about a lonely young man who finds himself at a restaurant with two strangers and his best friend.",
    "2003_491": "Three friends encounter violence and bigotry in a small college town.",
    "2003_492": "Shoba T. Mathur works for the Central Government in India and her job is to create awareness against child-marriage and other social evils that prevail due to general misinterpretation of the Hindu Shastras that demean women, particularly ...See moreShoba T. Mathur works for the Central Government in India and her job is to create awareness against child-marriage and other social evils that prevail due to general misinterpretation of the Hindu Shastras that demean women, particularly in Dhabri, a village in the state of Rajasthan. She does succeed in recruiting a young housewife, Saanvri, the mother of a young girl, Kamli, and wife of rickshaw driver, Sohan. Saanvri goes around the village raising awareness, and incurs the wrath of the village elders, mostly members of the Gujjar family. When Saanvri persists with her efforts, five of the men severely beat-up Sohan, and gang-rape Saanvri. A devastated Saanvri and Sohan decide to get justice. They go to the Police Station, but the Police Inspector refuses to lodge a complaint until and unless he gets a Medical report. The doctor will not issue a medical report until and until he gets Court Order. Sohan and Saanvri, with Shobha's help do go through this process, and a complaint is finally lodged. Despite of this, the Gujjars are not arrested and continue to wander around, bragging about their experience with Saanvri. Saanvri's case then gets nation-wide attention, with the Prime Minister himself entrusting this investigation to the Central Bureau of Investigation. The Gujjars are arrested and tried in Court, but are fully aware that this is nothing but a charade, for they have the backing of the local Member of the Legislative Assembly, Dhanraj Meena, who has hired a lawyer, Purohit, and has instructed him to ensure that the Gujjars are not held liable. Watch as Judge after Judge is transferred, even the Prosecuting Attorney is of a upper caste, and is under pressure from the Gujjar community. Faced with a corrupt police force, an even more corrupt Judicial system fueled more by wealth, influence, and caste rather than the rule of law, will Saanvri succeed in getting the justice she deserves?  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2003_493": "The romantic adventures of a 28-year-old gynecologist who has very little experience with women outside of the examining room.",
    "2003_494": "Documentary about artist Yvonne Bezzerra de Mello, a human rights activist and her work with homeless boys in Rio de Janeiro.",
    "2003_495": "A documentary about George W. Bush's 2000 campaign for the White House.",
    "2003_496": "In this emotionally compelling documentary, Sister Helen opens a private home for recovering addicts and alcoholics in the South Bronx after the death of her husband and two sons. The film's fly-on-the-wall technique succeeds in capturing ...See moreIn this emotionally compelling documentary, Sister Helen opens a private home for recovering addicts and alcoholics in the South Bronx after the death of her husband and two sons. The film's fly-on-the-wall technique succeeds in capturing the day-to-day existence of Sister Helen and the various residents of the home.  Written by See less",
    "2003_497": "A child molester sent to prison finds that criminals exact harsher justice than society.",
    "2003_498": "It is July, 2000 Richard Dutcher, the man who pioneered \"Mormon Cinema\" with his film \"God's Army\" is MISSING and PRESUMED DEAD!! Three amateur Mormon Filmmakers: Judy Shumway, Peter Beuhmann and Kevin Evans individually set out to make ...See moreIt is July, 2000 Richard Dutcher, the man who pioneered \"Mormon Cinema\" with his film \"God's Army\" is MISSING and PRESUMED DEAD!! Three amateur Mormon Filmmakers: Judy Shumway, Peter Beuhmann and Kevin Evans individually set out to make their first feature-length films to take Dutcher's place as the next \"Mormon Spielberg\". Who will win? Who will lose? Who will find Richard? And does EVERYONE WANT RICHARD FOUND!!? These questions and many laughs are sure to be found in the movie \"THE WORK and THE STORY\" COMING SPRING 2003.  Written by Nathan Smith JonesSee less",
    "2003_499": "Lightbulbs, fire, barbed wire, mousetraps, staple guns, thumbtacks and glass are weapons of choice in The Backyard. This undercover documentary takes you deep into the controversial arena of backyard wrestling where the limits are ...See moreLightbulbs, fire, barbed wire, mousetraps, staple guns, thumbtacks and glass are weapons of choice in The Backyard. This undercover documentary takes you deep into the controversial arena of backyard wrestling where the limits are constantly being tested...and broken. The Backyard follows several backyard wrestlers in different countries as they pursue their dream to become professional wrestlers.  Written by Paul HoughSee less",
    "2003_5": "A guy who complains about God too often is given almighty powers to teach him how difficult it is to run the world.",
    "2003_50": "What seemed like a breezy idea for an engineer to net him millions of dollars, leaves him on the run for his life and piecing together why he's being chased.",
    "2003_500": "On the brink of her world tour, at the height of her success, alternative rock violinist, Gypsy, put down her violin and walked away... A man brutally beats his girlfriend to death and tosses her remains into a local river... A retired ...See moreOn the brink of her world tour, at the height of her success, alternative rock violinist, Gypsy, put down her violin and walked away... A man brutally beats his girlfriend to death and tosses her remains into a local river... A retired Boston PD detective isn't buying the news report of a local girl accidentally drowning... While Gypsy's unprecedented disappearance perplexes the entire music industry, she retreats with her husband to the desolation of Cape Cod in winter... Seeking refuge in his past, the murderer contacts his estranged brother and falls in love with his brother's wife, Gypsy... And then a body turns up on Cape Cod... And the detective isn't convinced that this will be the last... Here, in the smallest quietest corner of New England unfolds a disquieting tale of what happens when music meets murder... and a lyrical portrait of the ever-present guardians who preserve life's natural harmony.  Written by AnonymousSee less",
    "2003_501": "The history of traffic safety educational films and their notoriously lurid content.",
    "2003_502": "Enemies tells the story of a playwright and sitcom writer Paul Halpern (Academy Award Nominee David Paymer) who can't buy a break!",
    "2003_503": "A blind Asian-American woman lives with her son and daughter-in-law. The two women barely tolerate one another and the son, a doctor simply turns himself off to avoid any confrontation with either. Into this environment, an armed intruder ...See moreA blind Asian-American woman lives with her son and daughter-in-law. The two women barely tolerate one another and the son, a doctor simply turns himself off to avoid any confrontation with either. Into this environment, an armed intruder breaks in. He is eventually revealed to be an old family friend who was sent to prison for murdering his father, but he insists that the older woman's husband, now deceased, was the actual murderer. Slowly, all the characters have to explore past hidden secrets about themselves.  Written by John Sacksteder See less",
    "2003_504": "",
    "2003_505": "",
    "2003_506": "\"The Ballad of Bering Strait\" is a cinema-verite film following seven Russian teenagers who have come to America to become country music stars. Principle photography began in July 1999 when the band, Bering Strait, entered the United ...See more\"The Ballad of Bering Strait\" is a cinema-verite film following seven Russian teenagers who have come to America to become country music stars. Principle photography began in July 1999 when the band, Bering Strait, entered the United States and began recording their first album in Nashville. The film documents the band responding to the twists and turns of the recording industry, rehearsing for their tour, preparing for their debut concert at the Grand Ole Opry, charting the course for their career with their managers, and living every-day life on the farm where they reside in rural Tennessee. The crew traveled with the band to their homes in Obninsk, Russia and to their music conservatories in Moscow, documenting how these two girls and five boys became so adept at playing American country music. The film culminates with the band's arrival on the U.S. stage at Wolf Trap National Park. \"The Ballad of Bering Strait\" is a two and a half year epic that follows Bering Strait's amazing cultural fusion-coming of age journey in America.  Written by Emerging Pictures web-siteSee less",
    "2003_507": "A womanizer returns to his hometown and confesses his sins to an angry crowd.",
    "2003_508": "In the city of angels - Los Angeles - no one is immune from the lurking spirits, neither good nor evil. As the end of time rapidly approaches, both forces have much work to do. Both sides contend for the same souls, but which force will ...See moreIn the city of angels - Los Angeles - no one is immune from the lurking spirits, neither good nor evil. As the end of time rapidly approaches, both forces have much work to do. Both sides contend for the same souls, but which force will prevail?  Written by anonymousSee less",
    "2003_509": "Harry is an irascible, aging architect trying to achieve the dream of building his masterwork. A wealthy young couple has commissioned Harry to design and rebuild a house he once owned that had burned down. Though reluctant at first, he ...See moreHarry is an irascible, aging architect trying to achieve the dream of building his masterwork. A wealthy young couple has commissioned Harry to design and rebuild a house he once owned that had burned down. Though reluctant at first, he eventually takes on the assignment and develops a new sense of purpose when his ex-wife Mercedes gives him her blessing. Harry soon realizes that the work has tapped into the vigor and promise of his youth. In the meantime Gaby has been hired to make a documentary about Harry--her project helps to reveal a complex man who, because of personal tragedy, has never attained the greatness most people felt he was destined for.  Written by AnonymousSee less",
    "2003_51": "Freddy Krueger and Jason Voorhees return to terrorize the teenage population. Except this time, they're out to get each other, too.",
    "2003_52": "After picking up a traumatized young hitchhiker, five friends find themselves stalked and hunted by a deformed chainsaw-wielding loon and his family of equally psychopathic killers.",
    "2003_53": "A young newlywed couple honeymoon in Europe, where obstacles challenge their ability to sustain the marriage.",
    "2003_54": "A brilliant young CIA trainee is asked by his mentor to help find a mole in the Agency.",
    "2003_55": "Hitman \"El Mariachi\" becomes involved in international espionage involving a psychotic CIA agent and a corrupt Mexican general.",
    "2003_56": "Publicist Stuart Shepard finds himself trapped in a phone booth, pinned down by an extortionist's sniper rifle. Unable to leave or receive outside help, Stuart's negotiation with the caller leads to a jaw-dropping climax.",
    "2003_57": "Selene, a vampire warrior, is entrenched in a conflict between vampires and werewolves, while falling in love with Michael, a human who is sought by werewolves for unknown reasons.",
    "2003_58": "A Women's Institute chapter's fundraising effort for a local hospital by posing nude for a calendar becomes a media sensation.",
    "2003_59": "When Kimberly has a violent premonition of a highway pileup she blocks the freeway, keeping a few others meant to die, safe. Or are they? The survivors mysteriously start dying and it's up to Kimberly to stop it before she's next.",
    "2003_6": "An American military advisor embraces the Samurai culture he was hired to destroy after he is captured in battle.",
    "2003_60": "Stranded at a desolate Nevada motel during a nasty rain storm, ten strangers become acquainted with each other when they realize that they're being killed off one by one.",
    "2003_61": "Two childhood friends, a New York hairstylist and a would-be musician, get caught up with the mob and are forced to deliver $50,000 to Australia, but things go haywire when the money is lost to a wild kangaroo.",
    "2003_62": "When a Chinese rebel murders Chon's estranged father and escapes to England, Chon and Roy make their way to London with revenge on their minds.",
    "2003_63": "Three friends attempt to recapture their glory days by opening up a fraternity near their alma mater.",
    "2003_64": "A Special-Ops commander leads his team into the Nigerian jungle in order to rescue a doctor who will only join them if they agree to save 70 refugees too.",
    "2003_65": "The sailor of legend is framed by the goddess Eris for the theft of the Book of Peace, and must travel to her realm at the end of the world to retrieve it and save the life of his childhood friend Prince Proteus.",
    "2003_66": "A tough aspiring chef is hired to bring home a mobster's son from the Amazon but becomes involved in the fight against an oppressive town operator and the search for a legendary treasure.",
    "2003_67": "A juror on the inside and a woman on the outside manipulate a court trial involving a major gun manufacturer.",
    "2003_68": "In 1990, to protect his fragile mother from a fatal shock after a long coma, a young man must keep her from learning that her beloved nation of East Germany as she knew it has disappeared.",
    "2003_69": "A miserable conman and his partner pose as Santa and his Little Helper to rob department stores on Christmas Eve. But they run into problems when the conman befriends a troubled kid.",
    "2003_7": "A machine from a post-apocalyptic future travels back in time to protect a man and a woman from an advanced robotic assassin to ensure they both survive a nuclear attack.",
    "2003_70": "Friends on a camping trip discover that the town they're vacationing in is being plagued in an unusual fashion by parasitic aliens from outer space.",
    "2003_71": "The only way to save Earth from catastrophe is to drill down to the core and set it spinning again.",
    "2003_72": "A wrongfully convicted boy is sent to a brutal desert detention camp where he joins the job of digging holes for some mysterious reason.",
    "2003_73": "The Looney Tunes search for a man's missing father and the mythical Blue Monkey diamond.",
    "2003_74": "A former gunslinger is forced to take up arms again when he and his cattle crew are threatened by a corrupt lawman.",
    "2003_75": "Conjoined twins from Martha's Vineyard move to Los Angeles so that one of them can pursue an acting career.",
    "2003_76": "A phobic con artist and his protege are on the verge of pulling off a lucrative swindle when the former's teenage daughter arrives unexpectedly.",
    "2003_77": "Out to stop a new gang disguised as Santa Claus, Emilien and Daniel must also handle major changes in their personal relationships.",
    "2003_78": "Set a few days after the original, a championship basketball team's bus is attacked by The Creeper, the winged, flesh-eating terror, on the last day of his 23-day feeding frenzy.",
    "2003_79": "When Piglet comes up missing his Hundred Acre Wood friends use Piglet's own Book of Memories to find him, discovering along the way just how big a role he's played in their lives.",
    "2003_8": "The human city of Zion defends itself against the massive invasion of the machines as Neo fights to end the war at another front while also opposing the rogue Agent Smith.",
    "2003_80": "Honey is a sexy, tough music video choreographer who shakes up her life after her mentor gives her an ultimatum: sleep with him or be blacklisted within their industry.",
    "2003_81": "A freak accident brings together a critically ill mathematician, a grieving mother, and a born-again ex-con.",
    "2003_82": "A writer impulsively buys a villa in Tuscany in order to change her life.",
    "2003_83": "A government agent trains Cody Banks in the ways of covert operations that require younger participants.",
    "2003_84": "Based on the life of Aileen Wuornos, a Daytona Beach prostitute who became a serial killer.",
    "2003_85": "A jewel thief's daughter is kidnapped after he steals a collection of prized black diamonds, which aren't at all what they seem.",
    "2003_86": "Lizzie McGuire has graduated from middle school and takes a trip to Rome, Italy with her class. And what was supposed to be only a normal trip, becomes a teenager's dream come true.",
    "2003_87": "A Florida police chief must solve a vicious double homicide before he himself falls under suspicion.",
    "2003_88": "The Rugrats get tangled in an exotic adventure, where they're helped by the Thornberrys, a family that travels the world making nature documentaries.",
    "2003_89": "The story of a high school coach and the developmentally challenged man who he took under his wing.",
    "2003_9": "When anti-mutant Colonel William Stryker kidnaps Professor X and attacks his school, the X-Men must ally with their archenemy Magneto to stop him.",
    "2003_90": "Two LAPD detectives who moonlight in other fields investigate the murder of an up-and-coming rap group.",
    "2003_91": "An American teenager learns that her father is a wealthy British politician running for office. Although she is eager to find him, she realizes it could cause a scandal and cost him the election.",
    "2003_92": "Two mismatched security guards are thrown together to bust a smuggling operation.",
    "2003_93": "A coming-of-age story about a shy, young boy sent by his irresponsible mother to spend the summer with his wealthy, eccentric uncles in Texas.",
    "2003_94": "A vengeful spirit has taken the form of the Tooth Fairy to exact vengeance on the town that lynched her 150 years earlier. Her only opposition is the only child, now grown up, who has survived her before.",
    "2003_95": "A biker returns from Thailand to set things straight with his girlfriend. One gang leader wants him for delivery of 2 motorbikes filled with crystal meth and another gang leader wants him for murdering his brother.",
    "2003_96": "An FBI deep-woods tracker attempts to capture a trained assassin who has made a sport of hunting humans.",
    "2003_97": "An intergalactic dog pilot from Sirius (the dog star), visits Earth to verify the rumors that dogs have failed to take over the planet.",
    "2003_98": "A grown-up woman, who kept her childish instincts and behavior, starts working as a nanny of a 8-year-old girl, who actually acts like an adult. But in the end everything turns to its right places.",
    "2003_99": "A man known as Diablo emerges to head a drug cartel after the previous leader is imprisoned."
}