{
    "2004_1": {
        "plotSummary": "Shrek and Fiona travel to the Kingdom of Far Far Away, where Fiona's parents are King and Queen, to celebrate their marriage. When they arrive, they find they are not as welcome as they thought they would be.",
        "runtimeMinutes": "93"
    },
    "2004_10": {
        "plotSummary": "Daniel Ocean recruits one more team member so he can pull off three major European heists in this sequel to Ocean's Eleven.",
        "runtimeMinutes": "125"
    },
    "2004_100": {
        "plotSummary": "Jessica, whose father killed her mother and committed suicide, is a police officer. While investigating a murder, she finds herself in the center of her own investigation, when her former lovers start being murdered.",
        "runtimeMinutes": "97"
    },
    "2004_101": {
        "plotSummary": "An examination on the effect of Franco-era religious schooling and sexual abuse on the lives of two longtime friends.",
        "runtimeMinutes": "106"
    },
    "2004_102": {
        "plotSummary": "Pierre Niemans faces the threat of the apocalypse while investigating a series of ritual murders.",
        "runtimeMinutes": "97"
    },
    "2004_103": {
        "plotSummary": "At college Paige meets Eddie, a fellow student from Denmark, whom she first dislikes but later accepts, likes, and loves; he proves to be Crown Prince Edvard. Paige follows him to Copenhagen, and he follows her back to school with a plan.",
        "runtimeMinutes": "111"
    },
    "2004_104": {
        "plotSummary": "A quietly troubled young man returns home for his mother's funeral after being estranged from his family for a decade.",
        "runtimeMinutes": "102"
    },
    "2004_105": {
        "plotSummary": "A widower must look after his precocious daughter and rebuild his life and career after he's sidelined by an unexpected tragedy and a personal blowup.",
        "runtimeMinutes": "102"
    },
    "2004_106": {
        "plotSummary": "A cockney womanizer learns the hard way about the dangers of his actions.",
        "runtimeMinutes": "103"
    },
    "2004_107": {
        "plotSummary": "Survivors of a plane crash in the Mongolian desert work together to build a new plane.",
        "runtimeMinutes": "113"
    },
    "2004_108": {
        "plotSummary": "With a plan to exact revenge on a mythical shark that killed his partner, Oceanographer Steve Zissou (Bill Murray) rallies a crew that includes his estranged wife, a journalist, and a man who may or may not be his son.",
        "runtimeMinutes": "119"
    },
    "2004_109": {
        "plotSummary": "Paul Rusesabagina, a hotel manager, houses over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda, Africa.",
        "runtimeMinutes": "121"
    },
    "2004_11": {
        "plotSummary": "In 2035, a technophobic cop investigates a crime that may have been perpetrated by a robot, which leads to a larger threat to humanity.",
        "runtimeMinutes": "115"
    },
    "2004_110": {
        "plotSummary": "A teenage girl is convinced that her home city revolves around her until her family packs up and moves to the suburbs, where she finds herself competing for attention.",
        "runtimeMinutes": "89"
    },
    "2004_111": {
        "plotSummary": "Buckle up for the wildest road trip of the year. A comedy adventure about a misfit family trying to survive outrageous obstacles (includeing each other) on a cross-country trek to their annual family reunion.",
        "runtimeMinutes": "97"
    },
    "2004_112": {
        "plotSummary": "A teenager's dreams come true when a former porn star moves in next door and they fall in love.",
        "runtimeMinutes": "109"
    },
    "2004_113": {
        "plotSummary": "A couple agree to have their deceased son cloned, under the supervision of an enigmatic doctor, but bizarre things start to happen several years after his rebirth.",
        "runtimeMinutes": "102"
    },
    "2004_114": {
        "plotSummary": "A man's uneventful life is disrupted by the zombie apocalypse.",
        "runtimeMinutes": "99"
    },
    "2004_115": {
        "plotSummary": "Underneath the sands of Egypt, Anubis, an ancient evil spirit, has awakened. It's up to Yugi, who defeated Anubis centuries ago, to use his skill and determination to rid the world of evil once again.",
        "runtimeMinutes": "100"
    },
    "2004_116": {
        "plotSummary": "With all-new gadgets, high-flying action, exciting chases and a wisecracking new handler, Derek (Anthony Anderson), Cody has to retrieve the device before the world's leaders fall under the evil control of a diabolical villain.",
        "runtimeMinutes": "100"
    },
    "2004_117": {
        "plotSummary": "When The Hood finds and invades International Rescue's secret base and traps most of the Tracy family, only young Alan Tracy and his friends can save the day.",
        "runtimeMinutes": "95"
    },
    "2004_118": {
        "plotSummary": "High school senior Katey moves to Havana in November 1958, when her dad gets a promotion at Ford. She meets a local waiter, who introduces her to sensual Cuban music/dance. They enter a big dance contest for the prize when he gets fired.",
        "runtimeMinutes": "86"
    },
    "2004_119": {
        "plotSummary": "Ella is under a spell to be constantly obedient, a fact she must hide from her new stepfamily in order to protect the prince of the land, her friend for whom she's falling.",
        "runtimeMinutes": "96"
    },
    "2004_12": {
        "plotSummary": "A historian races to find the legendary Templar Treasure before a team of mercenaries.",
        "runtimeMinutes": "131"
    },
    "2004_120": {
        "plotSummary": "Jimmy the Tulip's (Bruce Willis) quiet new life is shaken up by his old pal Oz (Matthew Perry), whose wife (Natasha Henstridge) has been kidnapped by a Hungarian mob. The Tulip and his wife Jill (Amanda Peet) spring into action.",
        "runtimeMinutes": "98"
    },
    "2004_121": {
        "plotSummary": "Based on the 1836 standoff between a group of Texan and Tejano men, led by Davy Crockett and Jim Bowie, and Mexican dictator Santa Anna's forces at the Alamo in San Antonio Texas.",
        "runtimeMinutes": "137"
    },
    "2004_122": {
        "plotSummary": "Chucky and Tiffany are resurrected by their innocent gender-confused daughter, Glenda, and hit Hollywood, where a movie depicting the killer dolls' murder spree is underway.",
        "runtimeMinutes": "87"
    },
    "2004_123": {
        "plotSummary": "A modern adaptation of Jane Austen's classic novel, Pride and Prejudice, that features the lives of four unmarried daughters in an Indian family.",
        "runtimeMinutes": "122"
    },
    "2004_124": {
        "plotSummary": "A Korean-American office worker and his Indian-American stoner friend embark on a quest to satisfy their desire for White Castle burgers.",
        "runtimeMinutes": "88"
    },
    "2004_125": {
        "plotSummary": "A young boy attempts to convince a woman that he is her dead husband reborn.",
        "runtimeMinutes": "100"
    },
    "2004_126": {
        "plotSummary": "Dumped by his girlfriend, a high school grad decides to embark on an overseas adventure in Europe with his friends.",
        "runtimeMinutes": "92"
    },
    "2004_127": {
        "plotSummary": "A big-screen look into one of America's most successful entertainment industries, NASCAR racing.",
        "runtimeMinutes": "48"
    },
    "2004_128": {
        "plotSummary": "A woman snoops through her boyfriend's palm pilot and reveals his former girlfriends, which causes her to question why they're still listed in his little black book.",
        "runtimeMinutes": "107"
    },
    "2004_129": {
        "plotSummary": "Aging baseball star who goes by the nickname, Mr. 3000, finds out many years after retirement that he didn't quite reach 3,000 hits. Now at age 47 he's back to try and reach that goal.",
        "runtimeMinutes": "104"
    },
    "2004_13": {
        "plotSummary": "The famed monster hunter is sent to Transylvania to stop Count Dracula, who is using Dr. Frankenstein's research and a werewolf for nefarious purposes.",
        "runtimeMinutes": "131"
    },
    "2004_130": {
        "plotSummary": "A young Chicago advertising executive believes a woman he sees in a cafe is his long-lost love. His belief leads to obsession, as he puts his life on hold in order to trail her.",
        "runtimeMinutes": "114"
    },
    "2004_131": {
        "plotSummary": "A small-town girl wins a date with a male celebrity through a contest. When the date goes better than expected, a love triangle forms between the girl, the male celebrity, and the girl's best friend.",
        "runtimeMinutes": "96"
    },
    "2004_132": {
        "plotSummary": "In 16th century Venice, when a merchant must default on a large loan from an abused Jewish moneylender for a friend with romantic ambitions, the bitterly vengeful creditor demands a gruesome payment instead.",
        "runtimeMinutes": "131"
    },
    "2004_133": {
        "plotSummary": "Jane and Roxy Ryan are teenage Long Island twins who find themselves on numerous misadventures when they trek into Manhattan on a school day.",
        "runtimeMinutes": "91"
    },
    "2004_134": {
        "plotSummary": "Trainees in the FBI's psychological profiling program must put their training into practice when they discover a killer in their midst.",
        "runtimeMinutes": "106"
    },
    "2004_135": {
        "plotSummary": "While examining the influence of the fast food industry, Morgan Spurlock personally explores the consequences on his health of a diet of solely McDonald's food for one month.",
        "runtimeMinutes": "100"
    },
    "2004_136": {
        "plotSummary": "Two sisters befriend a mysterious foreigner who washes up on the beach of their 1930s Cornish seaside village.",
        "runtimeMinutes": "104"
    },
    "2004_137": {
        "plotSummary": "Two alternating stories, one comedy and the other tragedy, about Melinda's attempts to straighten out her life.",
        "runtimeMinutes": "99"
    },
    "2004_138": {
        "plotSummary": "A husband-and-wife team play detective, but not in the traditional sense. Instead, the happy duo helps others solve their existential issues, the kind that keep you up at night, wondering what it all means.",
        "runtimeMinutes": "107"
    },
    "2004_139": {
        "plotSummary": "Several women enter a science fiction author's life over the course of a few years, after the author has lost the woman he considers his one true love.",
        "runtimeMinutes": "129"
    },
    "2004_14": {
        "plotSummary": "When Jason Bourne is framed for a CIA operation gone awry, he is forced to resume his former life as a trained assassin to survive.",
        "runtimeMinutes": "108"
    },
    "2004_140": {
        "plotSummary": "Growing up poor in London, Becky Sharp defies her poverty-stricken background and ascends the social ladder alongside her best friend, Amelia Sedley.",
        "runtimeMinutes": "141"
    },
    "2004_141": {
        "plotSummary": "A french girl gifted with a great voice, has a complex about her weight and her appearance.",
        "runtimeMinutes": "110"
    },
    "2004_142": {
        "plotSummary": "Inspecting a magical biographical stage musical, composer Cole Porter reviews his life and career with his wife, Linda.",
        "runtimeMinutes": "125"
    },
    "2004_143": {
        "plotSummary": "A trio of young men (Griffin, Anderson, and Imperioli) are forced to grow up quick when their girlfriends all become pregnant around the same time.",
        "runtimeMinutes": "86"
    },
    "2004_144": {
        "plotSummary": "A look at the life of Alfred Kinsey, a pioneer in the area of human sexuality research, whose 1948 publication \"Sexual Behavior in the Human Male\" was one of the first recorded works that saw science address sexual behavior.",
        "runtimeMinutes": "118"
    },
    "2004_145": {
        "plotSummary": "A girl and her two friends raid a bank, looking for the money needed for financing the cure of her dying father.",
        "runtimeMinutes": "91"
    },
    "2004_146": {
        "plotSummary": "A rising Hollywood actor decides to take personal revenge against a group of four persistent photographers to make them pay for almost causing a personal tragedy involving his wife and son.",
        "runtimeMinutes": "84"
    },
    "2004_147": {
        "plotSummary": "A fictional photographer's quest to spiritually rediscover herself is interspersed with documentary footage of scientists and theologians discussing the philosophical aspects of quantum physics.",
        "runtimeMinutes": "109"
    },
    "2004_148": {
        "plotSummary": "Nine years after Jesse and Celine first met, they encounter each other again on the French leg of Jesse's book tour.",
        "runtimeMinutes": "80"
    },
    "2004_149": {
        "plotSummary": "A lonely, obnoxious young millionaire pays a family to spend Christmas with him.",
        "runtimeMinutes": "91"
    },
    "2004_15": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2004_150": {
        "plotSummary": "A girl from a small town heads to the big city of Los Angeles to spend the summer at a performing arts high school.",
        "runtimeMinutes": "107"
    },
    "2004_151": {
        "plotSummary": "Things get raucously funny aboard the maiden flight of a black-owned airline, thanks to some last-minute passenger additions.",
        "runtimeMinutes": "86"
    },
    "2004_152": {
        "plotSummary": "A US president who has retired after two terms in office returns to his hometown of Mooseport, Maine and decides to run for Mayor against another local candidate.",
        "runtimeMinutes": "110"
    },
    "2004_153": {
        "plotSummary": "A man becomes increasingly jealous of his friend's newfound success.",
        "runtimeMinutes": "99"
    },
    "2004_154": {
        "plotSummary": "Set in 1930s London, this movie involves stage actors and actresses and their experiences with love and revenge.",
        "runtimeMinutes": "104"
    },
    "2004_155": {
        "plotSummary": "A tribe of prehistoric people is puzzled - a murder has happened. The first ever one.",
        "runtimeMinutes": "98"
    },
    "2004_156": {
        "plotSummary": "Abortionist Vera Drake finds her beliefs and practices clash with the mores of 1950s Britain--a conflict that leads to tragedy for her family.",
        "runtimeMinutes": "125"
    },
    "2004_157": {
        "plotSummary": "A pregnant Colombian teenager becomes a drug mule to make some desperately needed money for her family.",
        "runtimeMinutes": "101"
    },
    "2004_158": {
        "plotSummary": "Inspired by his fiancee (who dumped him), a man publishes a break-up hand-book for men, becoming a best-selling author in the process.",
        "runtimeMinutes": "85"
    },
    "2004_159": {
        "plotSummary": "As an executive is held captive by a former employee, it's up to his wife to deliver the ransom.",
        "runtimeMinutes": "95"
    },
    "2004_16": {
        "plotSummary": "After finding love, Bridget Jones questions if she really has everything she'd ever dreamed of having.",
        "runtimeMinutes": "108"
    },
    "2004_160": {
        "plotSummary": "Live-action sci-fi movie based on a 1973 Japanese anime of the same name (Shinzo Ningen Casshân). Theme song by Utada Hikaru.",
        "runtimeMinutes": "142"
    },
    "2004_161": {
        "plotSummary": "Anna wants to be like other girls her age (18): date a guy etc. but she's the US president's daughter and always guarded. In Prague he breaks his promise of only 2 agents following her to a concert and she runs away with Ben to see Europe.",
        "runtimeMinutes": "101"
    },
    "2004_162": {
        "plotSummary": "A destitute woman (Cruz) becomes involved with an upper-crust physician (Castellitto).",
        "runtimeMinutes": "125"
    },
    "2004_163": {
        "plotSummary": "Todd Anderson's life changes overnight when he signs a $30 million contract with the NBA. Determined not to forget who he is and where he's from, he throws a cookout for his family and friends from the hood, in his new neighborhood.",
        "runtimeMinutes": "97"
    },
    "2004_164": {
        "plotSummary": "A successful cocaine dealer gets two tough assignments from his boss on the eve of his planned early retirement.",
        "runtimeMinutes": "105"
    },
    "2004_165": {
        "plotSummary": "A mysterious serial killer is hunting other serial killers, and one F.B.I. Agent suspects there may be more to the vigilante than they imagine.",
        "runtimeMinutes": "99"
    },
    "2004_166": {
        "plotSummary": "A mob mix-up in Chicago sends two chanteuses screaming for L.A., where they score a perfect gig: posing as drag queens on the dinner theater/cabaret circuit. Things get extra-weird when a guy falls for one of the girls.",
        "runtimeMinutes": "108"
    },
    "2004_167": {
        "plotSummary": "With the intention to break free from the strict familial restrictions, a suicidal young woman sets up a marriage of convenience with a forty-year-old addict, an act that will lead to an outburst of envious love.",
        "runtimeMinutes": "121"
    },
    "2004_168": {
        "plotSummary": "In the ghettos of Paris in 2010, an undercover cop and an ex-thug try to infiltrate a gang in order to defuse a neutron bomb.",
        "runtimeMinutes": "84"
    },
    "2004_169": {
        "plotSummary": "Six high school seniors decide to break into the Princeton Testing Center so they can steal the answers to their upcoming SAT tests and all get perfect scores.",
        "runtimeMinutes": "93"
    },
    "2004_17": {
        "plotSummary": "When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle.",
        "runtimeMinutes": "119"
    },
    "2004_170": {
        "plotSummary": "In 1860s Britain, a boy inventor finds himself caught in the middle of a deadly conflict over a revolutionary advance in steam power.",
        "runtimeMinutes": "126"
    },
    "2004_171": {
        "plotSummary": "An army major goes undercover as a college student. His mission is both professional and personal: to protect his general's daughter from a radical militant, and to find his estranged half-brother.",
        "runtimeMinutes": "182"
    },
    "2004_172": {
        "plotSummary": "Brazilian MD Drauzio Varella starts AIDS prevention in Brazil's largest prison, Carandiru, in São Paulo, where the population is nearly double its 4,000 maximum. Doc learns from experience and mainly stories the tragic stories of hideous ...See moreBrazilian MD Drauzio Varella starts AIDS prevention in Brazil's largest prison, Carandiru, in São Paulo, where the population is nearly double its 4,000 maximum. Doc learns from experience and mainly stories the tragic stories of hideous crimes which landed scum there and passionate dramas adding otherwise decent people. Just when he believes to leave the prisoners happy with a soccer tournament, a silly clothing line argument kick-starts a politically opportune revolt repression.  Written by KGF VissersSee less",
        "runtimeMinutes": "145"
    },
    "2004_173": {
        "plotSummary": "The daughter of the U.S. President heads off to college where she falls for a graduate student with a secret.",
        "runtimeMinutes": "106"
    },
    "2004_174": {
        "plotSummary": "A Frenchwoman tells her marital troubles to a man she mistakes for a psychiatrist, and soon they form an unusual relationship.",
        "runtimeMinutes": "104"
    },
    "2004_175": {
        "plotSummary": "When a girl attending a Christian high school becomes pregnant, all of her former friends turn on her and she is ostracized and demonized.",
        "runtimeMinutes": "92"
    },
    "2004_176": {
        "plotSummary": "Desperate to improve their social status, four best friends enter into an all-night scavenger hunt against the popular clique in their school.",
        "runtimeMinutes": "89"
    },
    "2004_177": {
        "plotSummary": "When a mysterious fog surrounds the boundaries of California, there is a communication breakdown and all the Mexicans disappear, affecting the economy and the state stops working missing the Mexican workers and dwellers.",
        "runtimeMinutes": "100"
    },
    "2004_178": {
        "plotSummary": "In the year 2032, Batô, a cyborg detective for the anti-terrorist unit Public Security Section 9, investigates the case of a female robot--one created solely for sexual pleasure--who slaughtered her owner.",
        "runtimeMinutes": "100"
    },
    "2004_179": {
        "plotSummary": "A group of smart-talking toddlers find themselves at the center of a media mogul's experiment to crack the code to baby talk. The toddlers must race against time for the sake of babies everywhere.",
        "runtimeMinutes": "88"
    },
    "2004_18": {
        "plotSummary": "Michael Moore's view on what happened to the United States after September 11; and how the Bush Administration allegedly used the tragic event to push forward its agenda for unjust wars in Afghanistan and Iraq.",
        "runtimeMinutes": "122"
    },
    "2004_180": {
        "plotSummary": "When a Mongolian nomadic family's newest camel colt is rejected by its mother, a musician is needed for a ritual to change her mind.",
        "runtimeMinutes": "93"
    },
    "2004_181": {
        "plotSummary": "An ambitious salesman will do anything for that big promotion he's been chasing, but inevitably, he will learn that there is no such thing as the perfect crime.",
        "runtimeMinutes": "105"
    },
    "2004_182": {
        "plotSummary": "A swooning study of \"Mack the Knife\" singer Bobby Darin and specifically his relationship with wife Sandra Dee.",
        "runtimeMinutes": "118"
    },
    "2004_183": {
        "plotSummary": "An industrial worker who hasn't slept in a year begins to doubt his own sanity.",
        "runtimeMinutes": "101"
    },
    "2004_184": {
        "plotSummary": "Three activists cobble together a kidnapping plot after they encounter a businessman in his home.",
        "runtimeMinutes": "127"
    },
    "2004_185": {
        "plotSummary": "The investigation into a kidnapping of the daughter of a high-ranking US government official.",
        "runtimeMinutes": "106"
    },
    "2004_186": {
        "plotSummary": "A 19th Century samurai, held in low esteem due to an action by his late father, must resolve his history with a maid and with his close friend.",
        "runtimeMinutes": "132"
    },
    "2004_187": {
        "plotSummary": "A series of vignettes that all have coffee and cigarettes in common.",
        "runtimeMinutes": "95"
    },
    "2004_188": {
        "plotSummary": "Sameer, fast at losing his temper is re-located to Goa where he falls in love with Rani. But Sameer's new roommate Sunny, has some plans of his own.",
        "runtimeMinutes": "163"
    },
    "2004_189": {
        "plotSummary": "When a serial killer interrupts the fun at the swanky Coconut Pete's Coconut Beach Resort--a hedonistic island paradise for swingers--it's up to the club's staff to stop the violence...or at least hide it.",
        "runtimeMinutes": "104"
    },
    "2004_19": {
        "plotSummary": "A cab driver finds himself the hostage of an engaging contract killer as he makes his rounds from hit to hit during one night in Los Angeles.",
        "runtimeMinutes": "120"
    },
    "2004_190": {
        "plotSummary": "Five stages in the romance between a woman and a man.",
        "runtimeMinutes": "90"
    },
    "2004_191": {
        "plotSummary": "A mysterious gang of bikers is on a robbing spree. ACP Jai gets Ali, a mechanic, to assist him in the case. With the clock ticking, it's up to them to nab the thieves red-handed.",
        "runtimeMinutes": "129"
    },
    "2004_192": {
        "plotSummary": "Veer-Zaara is a saga of love, separation, courage and sacrifice. A love story that is an inspiration and will remain a legend forever.",
        "runtimeMinutes": "192"
    },
    "2004_193": {
        "plotSummary": "An adaptation of Bishop T.D. Jakes' self-help novel, chronciling a woman's struggle to come to terms with her legacy of abuse, addiction and poverty.",
        "runtimeMinutes": "94"
    },
    "2004_194": {
        "plotSummary": "A small-time con artist and a Hawaiian real estate developer's mischevious, enterprising mistress team up for a potential $200,000 score.",
        "runtimeMinutes": "88"
    },
    "2004_195": {
        "plotSummary": "During the Vietnam War, a South Korean base receives a radio transmission from a missing squad, presumed dead, and sends a platoon to rescue the lost squad from the R-Point.",
        "runtimeMinutes": "107"
    },
    "2004_196": {
        "plotSummary": "A writer's young assistant becomes both pawn and catalyst in his boss's disintegrating household.",
        "runtimeMinutes": "111"
    },
    "2004_197": {
        "plotSummary": "A fictional story inspired by North America's most famous female boxing promoter, Jackie Kallen. Her struggle to survive and succeed in a male dominated sport.",
        "runtimeMinutes": "110"
    },
    "2004_198": {
        "plotSummary": "Sparks fly in Glasgow's south side when a young Asian man enters into a relationship with a Caucasian woman.",
        "runtimeMinutes": "104"
    },
    "2004_199": {
        "plotSummary": "Spot (Lane) is a dog who can talk and read. Posing as a human, he sneaks into school with his master Leonard (Flemming). Educational adventures ensue.",
        "runtimeMinutes": "73"
    },
    "2004_2": {
        "plotSummary": "Harry Potter, Ron and Hermione return to Hogwarts School of Witchcraft and Wizardry for their third year of study, where they delve into the mystery surrounding an escaped prisoner who poses a dangerous threat to the young wizard.",
        "runtimeMinutes": "142"
    },
    "2004_20": {
        "plotSummary": "An Eastern European tourist unexpectedly finds himself stranded in JFK airport, and must take up temporary residence there.",
        "runtimeMinutes": "128"
    },
    "2004_200": {
        "plotSummary": "A drug kingpin's return home touches off a turf war.",
        "runtimeMinutes": "88"
    },
    "2004_201": {
        "plotSummary": "An aimless, jobless, irresponsible grown man joins the army and matures into a battlefield hero. Read more: Synopsis",
        "runtimeMinutes": "186"
    },
    "2004_202": {
        "plotSummary": "In late 1700s Korea, Lady Cho challenges the playboy Lord Jo-won into seducing and sleeping with her husband's coming young, virgin concubine. Lady Cho agrees to sleep with him if he succeeds.",
        "runtimeMinutes": "124"
    },
    "2004_203": {
        "plotSummary": "A rich woman hires an elite prostitute in order to verify her husband's faithfulness. Before long the experiment gets out of control.",
        "runtimeMinutes": "106"
    },
    "2004_204": {
        "plotSummary": "Based on a true story of 1968 Korean Republic Army plan to assassinate North Korean president Kim Il-Sung. 31 criminals and death row inmates are recruited into secret training on the island of Silmi; for two years they are subjected to ...See moreBased on a true story of 1968 Korean Republic Army plan to assassinate North Korean president Kim Il-Sung. 31 criminals and death row inmates are recruited into secret training on the island of Silmi; for two years they are subjected to maximum mental and physical abuse before the mission is cancelled and the unit terminated.  Written by kwedgwood@hotmail.comSee less",
        "runtimeMinutes": "135"
    },
    "2004_205": {
        "plotSummary": "A child molester returns to his hometown after 12 years in prison and attempts to start a new life.",
        "runtimeMinutes": "87"
    },
    "2004_206": {
        "plotSummary": "In 1923, the Korean teenager Kim Shun-Pei moves from Cheju Island, in South Korea, to Osaka, in Japan. Along the years, he becomes a cruel, greedy and violent man and builds a factory of kamaboko, processed seafood products, in his poor ...See moreIn 1923, the Korean teenager Kim Shun-Pei moves from Cheju Island, in South Korea, to Osaka, in Japan. Along the years, he becomes a cruel, greedy and violent man and builds a factory of kamaboko, processed seafood products, in his poor Korean-Japanese community exploiting his employees. He makes fortune, abuses and destroys the lives of his wife and family, having many mistresses and children and showing no respect to anybody. Later he closes the factory, lending the money with high interests and becoming a loan shark. His hatred behavior remains until his last breath, alone in North Korea.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "140"
    },
    "2004_207": {
        "plotSummary": "Meeting his handicapped son for the first time, a young father attempts to forge a relationship with the teenager.",
        "runtimeMinutes": "105"
    },
    "2004_208": {
        "plotSummary": "Following the suicide of his wife, an Israeli intelligence agent is assigned to befriend the grandchildren of a Nazi war criminal.",
        "runtimeMinutes": "103"
    },
    "2004_209": {
        "plotSummary": "Based on real life events, Assassination is set in 1974 and centers on a businessman who decides to take extreme measures to achieve his American dream.",
        "runtimeMinutes": "95"
    },
    "2004_21": {
        "plotSummary": "A determined woman works with a hardened boxing trainer to become a professional.",
        "runtimeMinutes": "132"
    },
    "2004_210": {
        "plotSummary": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
        "runtimeMinutes": "32"
    },
    "2004_211": {
        "plotSummary": "Traveling from France to Tangiers, a man looks to reunite with his former love, though their romance ended some 30 years earlier.",
        "runtimeMinutes": "94"
    },
    "2004_212": {
        "plotSummary": "Schultze is an accordion player and newly without work. When the local music club celebrates its 50th anniversary, his taste of music changes unexpectedly.",
        "runtimeMinutes": "114"
    },
    "2004_213": {
        "plotSummary": "Pierre-Louis is a successful investment broker who sees a hit and run and informs the police. As he is the only eyewitness willing to testify against the driver Jackhammer, the vicious leader of a gang of bikers, Pierre-Louis is whisked ...See morePierre-Louis is a successful investment broker who sees a hit and run and informs the police. As he is the only eyewitness willing to testify against the driver Jackhammer, the vicious leader of a gang of bikers, Pierre-Louis is whisked off to the witness protection program in a trailer park run by the kitschy Jackie Pigeon. A chapter of inept bikers called the Wanna-Bees also come to stay at the campground. When Pierre-Louis and Jackie are attracted to each other, Pierre-Louis is threatened by the investigating police officer, who also has designs on Jackie. Meanwhile Jackhammer is out on bail and contacts all the biker chapters to be on the lookout for the disguised Pierre-Louis.  Written by Will GilbertSee less",
        "runtimeMinutes": "100"
    },
    "2004_214": {
        "plotSummary": "Lost and alone on the streets of a small Mississippi town, Benji struggles to save his mom from a backyard puppy mill, avoiding two dopey dogcatchers and an unwanted sidekick.",
        "runtimeMinutes": "97"
    },
    "2004_215": {
        "plotSummary": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a man in a large rabbit suit who manipulates him to commit a series of crimes.",
        "runtimeMinutes": "113"
    },
    "2004_216": {
        "plotSummary": "Parallel storylines tell the current state of affairs for two ex-lovers: Nora's a single mother who comes to care for her terminally ill father; holed in up in mental ward, Ismael, a brilliant musician, plots his escape.",
        "runtimeMinutes": "150"
    },
    "2004_217": {
        "plotSummary": "Two documentary filmmakers chronicle their time in Sonagchi, Calcutta and the relationships they developed with children of prostitutes who work the city's notorious red light district.",
        "runtimeMinutes": "85"
    },
    "2004_218": {
        "plotSummary": "From the roaring 1920s to the ruinous Spanish Civil War and Adolf Hitler's rise into power, the lives of an Irish schoolteacher, a provocative heiress and her Spanish muse are intricately interlaced, sharing the same destiny and passion.",
        "runtimeMinutes": "132"
    },
    "2004_219": {
        "plotSummary": "A transient young man breaks into empty homes to partake of the vacationing residents' lives for a few days.",
        "runtimeMinutes": "88"
    },
    "2004_22": {
        "plotSummary": "A biopic depicting the early years of legendary Director and aviator Howard Hughes' career from the late 1920s to the mid 1940s.",
        "runtimeMinutes": "170"
    },
    "2004_220": {
        "plotSummary": "An indiscretion between two close friends tears down their respective marriages.",
        "runtimeMinutes": "101"
    },
    "2004_221": {
        "plotSummary": "Recently moved to upstate New York from the comfort of their Vermont homestead, the Benjamin Steed family makes their way into the established social structure of Palmyra. In their attempt to settle peacefully into the new community, they ...See moreRecently moved to upstate New York from the comfort of their Vermont homestead, the Benjamin Steed family makes their way into the established social structure of Palmyra. In their attempt to settle peacefully into the new community, they discover that the help they have hired to clear their land is at the center of a religious controversy - a controversy that threatens to tear the family apart. As two of the Steed brothers contend for the favor of a wealthy merchant's daughter, they find themselves on opposite sides of the religious question. Although the family struggles to smooth the contention, they soon face deeper issues of family loyalty and the pursuit of truth.  Written by SDSee less",
        "runtimeMinutes": "118"
    },
    "2004_222": {
        "plotSummary": "Worried that he costs too much to feed, Clifford runs away to join a carnival act and help win a lifetime supply of Tummy Yummies.",
        "runtimeMinutes": "74"
    },
    "2004_223": {
        "plotSummary": "Set in a world with memory recording implants, Alan Hakman is a cutter, someone with the power of final edit over people's recorded histories. His latest assignment is one that puts him in danger.",
        "runtimeMinutes": "95"
    },
    "2004_224": {
        "plotSummary": "Documentary detailing the origins and history of surf culture.",
        "runtimeMinutes": "105"
    },
    "2004_225": {
        "plotSummary": "Two 12-year-old Chilean children from different social classes become friends in 1973. They both discover each other's world as political tensions in their country increase.",
        "runtimeMinutes": "116"
    },
    "2004_226": {
        "plotSummary": "A hard-working young man meets and falls in love with his sister's bridesmaid. He soon finds out how disturbed she really is.",
        "runtimeMinutes": "111"
    },
    "2004_227": {
        "plotSummary": "A storyteller relates the creation of the world. A tall tale like all yarns. But this tall tale is a true tale - it is our very own story. The birth of the universe, the formation of the Earth, the appearance of life, the emergence from ...See moreA storyteller relates the creation of the world. A tall tale like all yarns. But this tall tale is a true tale - it is our very own story. The birth of the universe, the formation of the Earth, the appearance of life, the emergence from the waters, the colonisation of earthly paradise...a tremendous, event-filled saga unfolds before our very eyes. This \"flamboyant\" Genesis, both modern and timeless, is \"enacted\" by the direct descendants of those who were part of it - the animals.  Written by AnonymousSee less",
        "runtimeMinutes": "81"
    },
    "2004_229": {
        "plotSummary": "After she ends up in prison and loses custody of her son, a woman struggles to assimilate outside her former life and remain clean long enough to regain custody of her son.",
        "runtimeMinutes": "111"
    },
    "2004_23": {
        "plotSummary": "When a massive fire kills their parents, three children are delivered to the custody of cousin and stage actor Count Olaf, who is secretly plotting to steal their parents' vast fortune.",
        "runtimeMinutes": "108"
    },
    "2004_230": {
        "plotSummary": "An actress, a writer, a student, and a government worker band together in an effort to escape Paris as the Nazis move into the city.",
        "runtimeMinutes": "114"
    },
    "2004_231": {
        "plotSummary": "In the Yorkshire countryside, working-class tomboy Mona meets the exotic, pampered Tamsin. Over the summer season, the two young women discover they have much to teach one another, and much to explore together.",
        "runtimeMinutes": "86"
    },
    "2004_232": {
        "plotSummary": "1952, Quebec - Alys Robi, vocalist at the top of her popularity and recognized worldwide, was interned in spite of herself, by her father. Medical authorities prescribe her the only cure for a possible cure: the lobotomy. Under the bright ...See more1952, Quebec - Alys Robi, vocalist at the top of her popularity and recognized worldwide, was interned in spite of herself, by her father. Medical authorities prescribe her the only cure for a possible cure: the lobotomy. Under the bright lights of the operating room, Alys sees her 28-year life flash before her eyes. At age 13 she left alone to conquer the big city, Montreal, under the name Alys Robi. She first worked at the National Theatre with \"La Poune\" who takes her under her wing and then joined the cast of John Grimaldi. She met Olivier Guimond, her first love. Ambitious, she leaves to live a professional and romantic relationship with Lucio Asgotini who will eventually break her heart. Alys Robi charm a whole generation with her Latin rhythms such as \"Tico Tico\" and \"Besame Mucho\". She has conquered the world and Hollywood where MGM's desire and the American press call her a \"Goddess\". Alys Robi embodies the American dream, a story of triumph, glory, love, but also a story that hides a terrible truth that will change everything.  Written by AnonymousSee less",
        "runtimeMinutes": "105"
    },
    "2004_233": {
        "plotSummary": "A documentary on perception of the United States's war with Iraq, with an emphasis on Al Jazeera's coverage.",
        "runtimeMinutes": "84"
    },
    "2004_234": {
        "plotSummary": "Jim Caviezel stars as golf legend Bobby Jones, the icon who retired from competition at the tender age of 28.",
        "runtimeMinutes": "123"
    },
    "2004_235": {
        "plotSummary": "The discovery of an abandoned child by two smugglers kicks into a gear a series of tragic, comic events.",
        "runtimeMinutes": "108"
    },
    "2004_236": {
        "plotSummary": "The mesmerizing story of a young girl's romance with God. Her faith, trials, and sacrifices reveal a way of life based on love and simplicity. A contemplative film based on the true story of Saint Therese of Lisieux, the most popular saint...See moreThe mesmerizing story of a young girl's romance with God. Her faith, trials, and sacrifices reveal a way of life based on love and simplicity. A contemplative film based on the true story of Saint Therese of Lisieux, the most popular saint of modern times.  Written by Luke Films, Inc.See less",
        "runtimeMinutes": "96"
    },
    "2004_237": {
        "plotSummary": "Rennie Cray (Caviezel) embarks on a bloodthirsty rampage to avenge the death of his wife who was struck down by a serial killer - a man who hunts and kills women using his '72 El Dorado.",
        "runtimeMinutes": "80"
    },
    "2004_238": {
        "plotSummary": "Antoine and Helene drive to South France to return their kids from a holiday camp. The traffic is dense and the atmosphere growingly tense; he is an alcoholic and becomes increasingly drunk the more often they stop. After a fierce ...See moreAntoine and Helene drive to South France to return their kids from a holiday camp. The traffic is dense and the atmosphere growingly tense; he is an alcoholic and becomes increasingly drunk the more often they stop. After a fierce discussion they split and both have to face great danger during the night.  Written by Moritz Muehlenhoff See less",
        "runtimeMinutes": "105"
    },
    "2004_239": {
        "plotSummary": "In Buenos Aires, the twenty and something year old Jewish-Argentinean Ariel Makaroff has left the University of Architecture and spends his time wandering through the downtown gallery where his mother has a lingerie shop and his brother ...See moreIn Buenos Aires, the twenty and something year old Jewish-Argentinean Ariel Makaroff has left the University of Architecture and spends his time wandering through the downtown gallery where his mother has a lingerie shop and his brother runs an importation business, trying to get his Polish passport and move to Europe. Ariel has never understood why his father left him when he was a baby to fight in the Yom Kippur War in 1973. When his father returns to Buenos Aires, Ariel discovers the reason why his father left his family.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "99"
    },
    "2004_24": {
        "plotSummary": "A demystified take on the tale of King Arthur and the Knights of the Round Table.",
        "runtimeMinutes": "126"
    },
    "2004_240": {
        "plotSummary": "Five New Yorkers come together on Christmas Eve, seeking a miracle.",
        "runtimeMinutes": "96"
    },
    "2004_241": {
        "plotSummary": "In a small Tokyo apartment, twelve-year-old Akira must care for his younger siblings after their mother leaves them and shows no sign of returning.",
        "runtimeMinutes": "141"
    },
    "2004_242": {
        "plotSummary": "In 2039, the Romano-Fafard spaceship crew, led by Captain Patenaude, are still looking for a viable planet to resume mankind and accommodate Earth's six billion idiots. They may have finally found one but it won't be trouble free.",
        "runtimeMinutes": "109"
    },
    "2004_243": {
        "plotSummary": "A female theatre dresser creates a stir and sparks a revolution in seventeenth century London theatre by playing Desdemona in Othello. But what will become of the male actor she once worked for and eventually replaced?",
        "runtimeMinutes": "106"
    },
    "2004_244": {
        "plotSummary": "A close friendship between two crew teammates is tested when one slowly discovers he's gay and attracted to the other.",
        "runtimeMinutes": "98"
    },
    "2004_245": {
        "plotSummary": "In the mid-18th Century, as England and France battle over control of Canada, an epic romance between a peasant woman and a trapper unfurls.",
        "runtimeMinutes": "143"
    },
    "2004_246": {
        "plotSummary": "The video contains old footage of Metallica concerts as well as a performance of the song in Metallica's San Francisco headquarters which is included in its entirety on the St. Anger DVD.",
        "runtimeMinutes": "141"
    },
    "2004_247": {
        "plotSummary": "A successful Indian scientist returns to an Indian village to take his nanny to America with him and in the process rediscovers his roots.",
        "runtimeMinutes": "210"
    },
    "2004_248": {
        "plotSummary": "An uptight, middle-aged, repressed woman turns into a sex addict after getting hit on the head, and she then falls into an underground subculture of sex addicts in suburban Baltimore.",
        "runtimeMinutes": "89"
    },
    "2004_249": {
        "plotSummary": "A novel look at the eternal battle of the sexes and the trials and tribulations of Karan and Rhea and their attempts to understand each other.",
        "runtimeMinutes": "143"
    },
    "2004_25": {
        "plotSummary": "Jon Arbuckle buys a second pet, a dog named Odie. However, Odie is then abducted and it is up to Jon's cat, Garfield, to find and rescue the canine.",
        "runtimeMinutes": "80"
    },
    "2004_250": {
        "plotSummary": "In Montreal (Canada), the teenagers Manon, Anne, Isa, Claudie and Sophie are friends since their childhood. While spending a couple of days in the cottage of Sophie's parents nearby a lake, the girls decide to give a party, and Manon and ...See moreIn Montreal (Canada), the teenagers Manon, Anne, Isa, Claudie and Sophie are friends since their childhood. While spending a couple of days in the cottage of Sophie's parents nearby a lake, the girls decide to give a party, and Manon and Sophie hitch for a ride to the town in a jeep to buy some beers and supplies and they invite the driver to the party. On the return, the same driver stops the car and later Sophie is found stabbed, raped and covered of blood. Fifteen years later, Manon sees the guy in a car-wash and she invites her former friends to return to the house nearby the lake, where wounds of their traumatic loss are disclosed.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "87"
    },
    "2004_251": {
        "plotSummary": "A headstrong young woman returns to New Orleans after the death of her estranged mother.",
        "runtimeMinutes": "119"
    },
    "2004_252": {
        "plotSummary": "",
        "runtimeMinutes": "105"
    },
    "2004_253": {
        "plotSummary": "Two strangers become connected by a tragedy, yet one dangerously feels that the connection goes much deeper than the other is willing to admit.",
        "runtimeMinutes": "100"
    },
    "2004_254": {
        "plotSummary": "Claire (Nymark), an unmarried pregnant teenager, finds an odd relation in Madame Melikian (Ascaride), an older woman grieving over the death of her son.",
        "runtimeMinutes": "89"
    },
    "2004_255": {
        "plotSummary": "In 1714 Peru, a friar is tried by the Inquisition for questioning God's intentions when five die in the collapse of an Andean rope bridge.",
        "runtimeMinutes": "120"
    },
    "2004_256": {
        "plotSummary": "A documentary on the impact of globalization on the world's different wine regions.",
        "runtimeMinutes": "135"
    },
    "2004_257": {
        "plotSummary": "A dramatic adventure about courage, redemption and love being filmed in the rain forests of Costa Rica, and in Montreal.",
        "runtimeMinutes": "97"
    },
    "2004_258": {
        "plotSummary": "In order to prevent a recent high school graduate from getting engaged, two friends intervene by taking him on a cross-country road trip.",
        "runtimeMinutes": "93"
    },
    "2004_259": {
        "plotSummary": "In a utopian society created at the end of the third world war, a female warrior who has been plucked from the badlands begins to see cracks in this new facade. And what does this community have planned for the rest of humankind? Read more: Synopsis",
        "runtimeMinutes": "101"
    },
    "2004_26": {
        "plotSummary": "Henry Roth is a man afraid of commitment until he meets the beautiful Lucy. They hit it off and Henry think he's finally found the girl of his dreams until discovering she has short-term memory loss and forgets him the next day.",
        "runtimeMinutes": "99"
    },
    "2004_260": {
        "plotSummary": "A disillusioned war journalist's return home is blighted when he becomes implicated in the mysterious disappearance of a teenage girl he has befriended.",
        "runtimeMinutes": "127"
    },
    "2004_261": {
        "plotSummary": "Documentary that looks at the concept of the corporation throughout recent history up to its present-day dominance.",
        "runtimeMinutes": "145"
    },
    "2004_262": {
        "plotSummary": "In the first installment in director Belvaux's trilogy, Alain's eccentric behavior causes his wife, Cecile, to hire a detective to follow his every move -- which yields unexpected results.",
        "runtimeMinutes": "97"
    },
    "2004_263": {
        "plotSummary": "The magical Mole Antonelliana (the cavernous Museum of Cinema in Turin, Italy) is the setting for a very unlikely love story. One fateful evening the museum's timid night watchman, comes to the aid of an enchanting young fast-food cook on ...See moreThe magical Mole Antonelliana (the cavernous Museum of Cinema in Turin, Italy) is the setting for a very unlikely love story. One fateful evening the museum's timid night watchman, comes to the aid of an enchanting young fast-food cook on the run from the police. The museum's dreamy kingdom of silent movie characters becomes a sanctuary for her as she awaits rescue by her devilish boyfriend.  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "2004_264": {
        "plotSummary": "In London, intense sexual encounters take place between an American college student, named Lisa, and an English scientist, named Matt, between attending rock concerts.",
        "runtimeMinutes": "71"
    },
    "2004_265": {
        "plotSummary": "Three short films, one each from Directors Michelangelo Antonioni, Steven Soderbergh, and Wong Kar Wai, address the themes of love and sex.",
        "runtimeMinutes": "104"
    },
    "2004_266": {
        "plotSummary": "A boy who has experienced many losses in his life grows to manhood and enters into a love triangle with a woman and his boyhood friend.",
        "runtimeMinutes": "97"
    },
    "2004_267": {
        "plotSummary": "The blind masseur/swordsman comes to a town in control of warring gangs, and while bunking with a farming family, he meets two women with their own agenda.",
        "runtimeMinutes": "116"
    },
    "2004_268": {
        "plotSummary": "Fired from his job for exposing corrupt business practices, a former biotech executive turns to impregnating wealthy lesbians for profit.",
        "runtimeMinutes": "138"
    },
    "2004_27": {
        "plotSummary": "An American nurse living and working in Tokyo is exposed to a mysterious supernatural curse, one that locks a person in a powerful rage before claiming their life and spreading to another victim.",
        "runtimeMinutes": "91"
    },
    "2004_270": {
        "plotSummary": "A journalist and a poetess meet during the hearings of South African Truth and Reconciliation Commission.",
        "runtimeMinutes": "105"
    },
    "2004_271": {
        "plotSummary": "The story of Amedeo Modigliani's bitter rivalry with Pablo Picasso, and his tragic romance with Jeanne Hebuterne.",
        "runtimeMinutes": "128"
    },
    "2004_272": {
        "plotSummary": "The oldest daughter of an impoverished Montreal family, Monique Sparvieri vows to find a way to get out of the ghetto in which she lives. Abandoned by Michael, the love of her life, Monique finds herself alone again when her second husband...See moreThe oldest daughter of an impoverished Montreal family, Monique Sparvieri vows to find a way to get out of the ghetto in which she lives. Abandoned by Michael, the love of her life, Monique finds herself alone again when her second husband, Gaston, is sentenced to ten months in prison. While many other women her age are still dreaming of Prince Charming, Monique takes her own destiny in her hands. She and her new love, Gerald Simard, plan a series of bank robberies. Intoxicated by passion and success, Monique isn't afraid of anything and she wants to make sure that her children don't experience the same miserable upbringing as she did.  Written by Movie_BlitzSee less",
        "runtimeMinutes": "125"
    },
    "2004_273": {
        "plotSummary": "Two con artists try to swindle a currency collector by selling him a counterfeit copy of an extremely rare currency bill.",
        "runtimeMinutes": "87"
    },
    "2004_274": {
        "plotSummary": "The discovery of a corpse threatens to unravel a bumbling local politician's campaign for governor of Colorado.",
        "runtimeMinutes": "128"
    },
    "2004_275": {
        "plotSummary": "Based on a true story: a recently released convict dreams of one last heist with his old gang before retiring. Posing as electrical workers, they dig a tunnel deep under a bank vault. However, during the job, two rogue members might get ...See moreBased on a true story: a recently released convict dreams of one last heist with his old gang before retiring. Posing as electrical workers, they dig a tunnel deep under a bank vault. However, during the job, two rogue members might get tempted to betray them and go with the loot. As the works goes well, at the last moment, something goes wrong...  Written by RealLiveClaudeSee less",
        "runtimeMinutes": "109"
    },
    "2004_276": {
        "plotSummary": "In pre-Soviet Russia, Boris Savinkov leads a terrorist faction of Socialist-Revolutionary Party members responsible for the deaths of governors and ministers. Read more: Synopsis",
        "runtimeMinutes": "106"
    },
    "2004_277": {
        "plotSummary": "Four American soldiers and one Brit fighting in Europe during World War II struggle to return to Allied territory after being separated from U.S. forces during the historic Malmedy Massacre.",
        "runtimeMinutes": "90"
    },
    "2004_278": {
        "plotSummary": "The filmed account of a large Canadian rock festival train tour boasting major acts like Janis Joplin, The Grateful Dead and The Band.",
        "runtimeMinutes": "90"
    },
    "2004_279": {
        "plotSummary": "16-year-old Amalia looks to save the soul of a middle-aged doctor.",
        "runtimeMinutes": "106"
    },
    "2004_28": {
        "plotSummary": "The Mystery Inc. gang must save Coolsville from an attack of their past monsters brought to life by an evil masked figure trying to take down the gang.",
        "runtimeMinutes": "93"
    },
    "2004_280": {
        "plotSummary": "A much-needed boost, in the form of a new factory, is promised to the residents of the tiny fishing village St. Marie-La-Mauderne, provided they can lure a doctor to take up full-time residency on the island. Inspired, the villagers devise...See moreA much-needed boost, in the form of a new factory, is promised to the residents of the tiny fishing village St. Marie-La-Mauderne, provided they can lure a doctor to take up full-time residency on the island. Inspired, the villagers devise a scheme to make Dr. Christopher Lewis a local.See less",
        "runtimeMinutes": "108"
    },
    "2004_281": {
        "plotSummary": "When the kinetic Rory moves into his room in the Carrigmore Residential Home for the Disabled, his effect on the home is immediate. Most telling is his friendship with Michael, a young man with cerebral palsy and nearly unintelligible ...See moreWhen the kinetic Rory moves into his room in the Carrigmore Residential Home for the Disabled, his effect on the home is immediate. Most telling is his friendship with Michael, a young man with cerebral palsy and nearly unintelligible speech. Somehow, Rory understands Michael, and encourages him to experience life outside the confines of home.See less",
        "runtimeMinutes": "104"
    },
    "2004_282": {
        "plotSummary": "Two pairs of Mormon missionaries from America live in a beaten-up apartment in the Dutch city of Haarlem. Their personalities are distinctly different. Appropriately, the most responsible one, Elder Johnson, is the District Leader and ...See moreTwo pairs of Mormon missionaries from America live in a beaten-up apartment in the Dutch city of Haarlem. Their personalities are distinctly different. Appropriately, the most responsible one, Elder Johnson, is the District Leader and oversees their efforts. His companion, the vain Elder Van Pelt, seeks to become the assistant to the mission president (the top post available) as soon as possible, and he receives letters from three girlfriends he left behind. The capable Elder Rogers has become disillusioned and inattentive to his duties ever since a previous missionary companion returned to America, looked up and married Elder Rogers' girlfriend. As a result he is simply marking time until he returns home in a few weeks time. The three meet Elder Rogers' new companion, Elder Calhoun, in the train station. This new elder is a nerdy but enthusiastic \"greenie\" that has just arrived from the Missionary Training Center (MTC) in Utah. Unfortunately his training did not give him much fluency in the Dutch language, but as luck would have it, the first person he approaches to proselytize is a fellow American named Kyle. In the weeks that come, Elder Johnson and Van Pelt increasingly irritate each other while in contrast Elder Rogers and Calhoun begin to relate in a positive fashion as they teach Kyle about the Mormon faith.  Written by Brian GreenhalghSee less",
        "runtimeMinutes": "112"
    },
    "2004_283": {
        "plotSummary": "A priest on the lam takes up with a traveling band of actors, who then discover a murder has occurred and try to solve it by recreating the crime in a play.",
        "runtimeMinutes": "112"
    },
    "2004_284": {
        "plotSummary": "Back in town after years abroad, an idealistic woman takes upon herself to spruce up her blase sister's sentimental life by fooling around with the messages she leaves her fiance on the fridge.",
        "runtimeMinutes": "91"
    },
    "2004_285": {
        "plotSummary": "As a part of their study of the Holocaust, the children of the Whitwell, TN Middle School try to collect 6 million paper clips representing the 6 million Jews killed by the Nazis, and grows to include millions of others killed.",
        "runtimeMinutes": "82"
    },
    "2004_286": {
        "plotSummary": "State-of-the-art technology delivers stunning images of indigenous people, unique animals and spectacular landscapes that most of us will never see.",
        "runtimeMinutes": "40"
    },
    "2004_287": {
        "plotSummary": "After a disastrous failure to stop a robber gang, the police attempt to redeem themselves through a series of publicity stunts and shootouts.",
        "runtimeMinutes": "90"
    },
    "2004_288": {
        "plotSummary": "When his father dies, a young man is introduced by his attractive, amoral mother to a world of hedonism and depravity.",
        "runtimeMinutes": "110"
    },
    "2004_289": {
        "plotSummary": "Marianne, some thirty years after divorcing Johan, decides to visit her ex-husband at his summer home. She arrives in the middle of a family drama between Johan's son from another marriage and his granddaughter.",
        "runtimeMinutes": "107"
    },
    "2004_29": {
        "plotSummary": "A buttoned-up newlywed finds his strictly organized life descend into chaos when he falls in love with an old classmate.",
        "runtimeMinutes": "90"
    },
    "2004_290": {
        "plotSummary": "A team of police force escorts an alleged terrorist from Chandangarh to Mumbai. However their trip turns into a deadly survival when an ex-cop tries to stop them to reach Mumbai.",
        "runtimeMinutes": "174"
    },
    "2004_291": {
        "plotSummary": "A futuristic Brief Encounter, this is a love story in which the romance is doomed by genetic incompatibility.",
        "runtimeMinutes": "93"
    },
    "2004_292": {
        "plotSummary": "In the 1950s, fear and violence escalate as the people of Algiers fight for independence from the French government.",
        "runtimeMinutes": "121"
    },
    "2004_293": {
        "plotSummary": "A promiscuous gay party animal falls for a young Mormon missionary, leading to crisis, cliche, and catastrophe.",
        "runtimeMinutes": "107"
    },
    "2004_294": {
        "plotSummary": "Born on the original Christmas in the stable next door to Jesus Christ, Brian of Nazareth spends his life being mistaken for a messiah.",
        "runtimeMinutes": "94"
    },
    "2004_295": {
        "plotSummary": "A pair of losers marry two elderly sisters, thinking they'll inherit their fortune and Beverly Hills estate. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2004_296": {
        "plotSummary": "A musical of sorts set in Winnipeg during the Great Depression, where a beer baroness organizes a contest to find the saddest music in the world. Musicians from around the world descend on the city to try and win the $25,000 prize.",
        "runtimeMinutes": "100"
    },
    "2004_297": {
        "plotSummary": "When a teen is bullied, his brother and friends lure the bully into the woods to seek revenge.",
        "runtimeMinutes": "90"
    },
    "2004_298": {
        "plotSummary": "In Madrid, the divorced middle-age pianist Sofía discloses to her daughters Elvira, Gimena and Sol on the day of her birthday that she is in love with the talented Czech pianist Aliska, who is twenty-years younger than she. The bigoted ...See moreIn Madrid, the divorced middle-age pianist Sofía discloses to her daughters Elvira, Gimena and Sol on the day of her birthday that she is in love with the talented Czech pianist Aliska, who is twenty-years younger than she. The bigoted sisters are shocked with the revelation and do not accept the idea that their mother is lesbian. Elvira is an insecure and neurotic young aspirant writer that has a lousy job in a publishing house; Sol is the singer of a rock band; and Gimena is married with a boy and has a troubled marriage with Raúl. When they discover that her mother has lent all her savings to support the education of Aliska, they decide to seduce the girlfriend to make her leave their mother. But when Aliska returns to her country alone and their mother is very depressed, they need to try to revert the situation. Meanwhile the nervous Elvira meets the writer Miguel and has a clumsy relationship with him.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "96"
    },
    "2004_299": {
        "plotSummary": "Twin Sisters is an epic love story based on the Dutch bestseller by Tessa de Loo that has been read by more than 3.5 million readers in Holland and Germany.",
        "runtimeMinutes": "137"
    },
    "2004_3": {
        "plotSummary": "Peter Parker is beset with troubles in his failing personal life as he battles a brilliant scientist named Doctor Otto Octavius.",
        "runtimeMinutes": "127"
    },
    "2004_30": {
        "plotSummary": "During an archaeological expedition on Bouvetøya Island in Antarctica, a team of archaeologists and other scientists find themselves caught up in a battle between the two legends. Soon, the team realize that only one species can win.",
        "runtimeMinutes": "101"
    },
    "2004_300": {
        "plotSummary": "Filmed during his \"Black Album\" era, Jay-Z looks back on his career as one of rap music's most successful emcees and entrepreneurs.",
        "runtimeMinutes": "109"
    },
    "2004_301": {
        "plotSummary": "A woman decides to marry her childhood friend, after getting her heart broken by her sweetheart.",
        "runtimeMinutes": "165"
    },
    "2004_302": {
        "plotSummary": "A hypnotherapist is caught up in the pursuit of a serial killer.",
        "runtimeMinutes": "108"
    },
    "2004_303": {
        "plotSummary": "Bored of their wives, best friends, Meet, Prem and Amar, reunite after three years and decide to have an affair - but instead become the prime suspects in a murder investigation.",
        "runtimeMinutes": "166"
    },
    "2004_304": {
        "plotSummary": "The two men embark on parallel, if separate, journeys. Their yearning is a common one--for a better and different life. Dondup, delayed by the timeless pace of his village, is forced to hitchhike through the beautiful wild countryside of ...See moreThe two men embark on parallel, if separate, journeys. Their yearning is a common one--for a better and different life. Dondup, delayed by the timeless pace of his village, is forced to hitchhike through the beautiful wild countryside of Bhutan to reach his goal. He shares the road with a monk, an apple seller, a papermaker and his beautiful young daughter, Sonam. Throughout the journey, the perceptive yet mischievous monk relates the story of Tashi. It is a mystical fable of lust, jealousy and murder, that holds up a mirror to the restless Dondup, and his blossoming attraction to the innocent Sonam. The cataclysmic conclusion of the monk's tale leaves Dondup with a dilemma--is the grass truly greener on the other side?  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "108"
    },
    "2004_305": {
        "plotSummary": "The life and work of Allen Ginsberg, the greatest of the Beat Generation poets is put in focus in this film",
        "runtimeMinutes": "82"
    },
    "2004_306": {
        "plotSummary": "A cat who turns into a young woman helps a journalist protect their town from a factory boss with an evil plan.",
        "runtimeMinutes": "86"
    },
    "2004_307": {
        "plotSummary": "A documentary on Senator John Kerry's Navy tour of duty in Vietnam, his contributions to the peace movement that followed, and the ultimate shape of his future political career.",
        "runtimeMinutes": "87"
    },
    "2004_308": {
        "plotSummary": "Filmmaker Jonathan Caouette's documentary on growing up with his schizophrenic mother -- a mixture of snapshots, Super-8 film, answering machine messages, video diaries, early short films, and more - culled from nineteen years of his life.",
        "runtimeMinutes": "88"
    },
    "2004_309": {
        "plotSummary": "A gay Canadian living in London has his perfectly crafted life upset when his devoutly Muslim mother comes to visit.",
        "runtimeMinutes": "91"
    },
    "2004_31": {
        "plotSummary": "Two streetwise cops bust criminals in their red and white Ford Gran Torino, with the help of a police snitch called \"Huggy Bear\".",
        "runtimeMinutes": "101"
    },
    "2004_310": {
        "plotSummary": "A bitter, recently divorced man is goaded by his grandfather and son into going on a family road trip to reconcile with his estranged father.",
        "runtimeMinutes": "85"
    },
    "2004_311": {
        "plotSummary": "As the feudal Japan era draws to a close, a widower samurai experiences difficulty balancing clan loyalties, 2 young daughters, an aged mother, and the sudden reappearance of his childhood sweetheart.",
        "runtimeMinutes": "129"
    },
    "2004_312": {
        "plotSummary": "Michael, Arjun and Lallan, three men from three different strata of society, cross paths one morning in Calcutta and change one another's lives forever.",
        "runtimeMinutes": "161"
    },
    "2004_313": {
        "plotSummary": "A scientific observer's job of observing an old cantankerous single man's kitchen habits is complicated by his growing friendship with him.",
        "runtimeMinutes": "95"
    },
    "2004_314": {
        "plotSummary": "Four friends/fledgling entrepreneurs, knowing that there's something bigger and more innovative than the different error-checking devices they've built, wrestle over their new invention.",
        "runtimeMinutes": "77"
    },
    "2004_315": {
        "plotSummary": "A movie director-screenwriter finds a man to finance his latest project but soon discovers that the producer is actually an undercover FBI agent working on a mob sting operation.",
        "runtimeMinutes": "93"
    },
    "2004_316": {
        "plotSummary": "A girl from bourgeoisie discovers the pleasures of banditism, following her lover in his lifestyle.",
        "runtimeMinutes": "95"
    },
    "2004_317": {
        "plotSummary": "",
        "runtimeMinutes": "103"
    },
    "2004_318": {
        "plotSummary": "A former gangster reenters the criminal underworld after his brother suspiciously commits suicide.",
        "runtimeMinutes": "103"
    },
    "2004_319": {
        "plotSummary": "Two brothers must negotiate changing roles and shifting family dynamics when one is sent to war in Afghanistan.",
        "runtimeMinutes": "117"
    },
    "2004_32": {
        "plotSummary": "A romantic comedy where a bored, overworked Estate Lawyer, upon first sight of a beautiful instructor, signs up for ballroom dancing lessons.",
        "runtimeMinutes": "106"
    },
    "2004_320": {
        "plotSummary": "Calgary-based businessman Kanwaljit Singh Tilon sends money home to his brother, Deep, to invest in some property. Now with his wife; son, Mehr; and medical-student daughter, Aman; he returns home to Kapurthala to live with Deep for a year...See moreCalgary-based businessman Kanwaljit Singh Tilon sends money home to his brother, Deep, to invest in some property. Now with his wife; son, Mehr; and medical-student daughter, Aman; he returns home to Kapurthala to live with Deep for a year. They are very well received by Deep and his wife, Harbans, with Mehr and Aman both finding life partners in the outspoken Palli and Dr. Balvinder. Things change dramatically after Kanwaljit announces that he will not be returning to Canada, and will reside there permanently.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "179"
    },
    "2004_321": {
        "plotSummary": "Longtime couple Venla and Antero come to a serious impasse. After years with Antero, Venla wants to start a family, but her boyfriend, worried that parenthood will stifle his speed-skating career, secretly gets a vasectomy. Determined to ...See moreLongtime couple Venla and Antero come to a serious impasse. After years with Antero, Venla wants to start a family, but her boyfriend, worried that parenthood will stifle his speed-skating career, secretly gets a vasectomy. Determined to have a child, Venla seeks help from a female fertility doctor, a decision that breeds new possibilities for the prospective mother when she falls in love with the doctor.  Written by AnonymousSee less",
        "runtimeMinutes": "102"
    },
    "2004_322": {
        "plotSummary": "Documentary on reported Conservative bias of the Rupert Murdoch-owned Fox News Channel (FNC), which promotes itself as \"Fair and Balanced\". Material includes interviews with former FNC employees and the inter-office memos they provided.",
        "runtimeMinutes": "75"
    },
    "2004_323": {
        "plotSummary": "A group of hustlers encounter \"The Dean\" and pull off a successful sting that results in their pursuit by a vengeful gangster.",
        "runtimeMinutes": "101"
    },
    "2004_324": {
        "plotSummary": "A man is accused of sexual harassment by his former lover and he has to prove his innocence in order to restore his dignity.",
        "runtimeMinutes": "160"
    },
    "2004_325": {
        "plotSummary": "Every 12 years over 70 million pilgrims gather at the meeting of India's holiest rivers, the Ganges and the Yamuna, for a spectacular spiritual festival: the Kumbh Mela. This documentary takes a voyage of discovery through this colorful ...See moreEvery 12 years over 70 million pilgrims gather at the meeting of India's holiest rivers, the Ganges and the Yamuna, for a spectacular spiritual festival: the Kumbh Mela. This documentary takes a voyage of discovery through this colorful event through the eyes of several Westerners and an ebullient young Hindu monk, Swami Krishnanand. Featuring encounters with some of India's most respected holy men and exclusive footage of His Holiness the Dalai Lama.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2004_326": {
        "plotSummary": "When a woman shelters a group of girls from suffering female genital mutilation, she starts a conflict that tears her village apart.",
        "runtimeMinutes": "124"
    },
    "2004_327": {
        "plotSummary": "A documentary on Henry Darger, visionary artist, janitor, and novelist.",
        "runtimeMinutes": "81"
    },
    "2004_328": {
        "plotSummary": "American nuclear weapons testing results in the creation of a seemingly unstoppable, dinosaur-like beast.",
        "runtimeMinutes": "96"
    },
    "2004_329": {
        "plotSummary": "Professional motorcycle racer Bud Clay heads from New Hampshire to California to race again. Along the way he meets various needy women who provide him with the cure to his own loneliness, but only a certain woman from his past will truly satisfy him.",
        "runtimeMinutes": "93"
    },
    "2004_33": {
        "plotSummary": "A group of misfits enter a Las Vegas dodgeball tournament in order to save their cherished local gym from the onslaught of a corporate health fitness chain.",
        "runtimeMinutes": "92"
    },
    "2004_330": {
        "plotSummary": "An Iranian pizza delivery man sees the worst of corruption and social unbalance in his city and is driven to crime.",
        "runtimeMinutes": "97"
    },
    "2004_331": {
        "plotSummary": "A look at the Boston Red Sox's 2003 season, from Spring Training to their meeting with the New York Yankees in the American League Championship Series, and the team's relationship with their fans.",
        "runtimeMinutes": "110"
    },
    "2004_332": {
        "plotSummary": "Anti-corporate activists travel from conference to conference, impersonating member of the World Trade Organization.",
        "runtimeMinutes": "83"
    },
    "2004_333": {
        "plotSummary": "The story of the punk rock band The Ramones.",
        "runtimeMinutes": "110"
    },
    "2004_334": {
        "plotSummary": "Previously unreleased material outlines the campaign against Bill Clinton's presidency, from his days in Arkansas up to his impeachment trial.",
        "runtimeMinutes": "90"
    },
    "2004_335": {
        "plotSummary": "Mario Van Peebles' half-documentary/half-homage to his father Melvin Van Peebles' movie Sweet Sweetback's Baadasssss Song.",
        "runtimeMinutes": "109"
    },
    "2004_336": {
        "plotSummary": "Interviews and archival footage are used to tell the story of post-war Broadway through the 1960s.",
        "runtimeMinutes": "111"
    },
    "2004_337": {
        "plotSummary": "Pedro, a gay man with an active social life and many friends, takes in his nephew Bernardo for a couple weeks. When the arrangement becomes permanent , Pedro turns to his friends for guidance as he and Bernardo forge a household together.",
        "runtimeMinutes": "100"
    },
    "2004_338": {
        "plotSummary": "A woman employs a gay man to spend four nights at her house to watch her when she's \"unwatchable\".",
        "runtimeMinutes": "77"
    },
    "2004_339": {
        "plotSummary": "A young man's experience in a juvenile detention center that touches on the tumultuous changes that befall his family and the community in which he lives.",
        "runtimeMinutes": "108"
    },
    "2004_34": {
        "plotSummary": "Alexander, the King of Macedonia and one of the greatest army leaders in the history of warfare, conquers much of the known world.",
        "runtimeMinutes": "175"
    },
    "2004_340": {
        "plotSummary": "A sheep rancher's visit to the big city triggers a mischevious adventure with his teenage computer-whiz grandson.",
        "runtimeMinutes": "99"
    },
    "2004_341": {
        "plotSummary": "A twelve-year-old boy escapes from a Bulgarian Communist concentration camp and sets out on a journey to reach Denmark.",
        "runtimeMinutes": "90"
    },
    "2004_342": {
        "plotSummary": "Documentary on Charles Bukowski, author of 'Notes of a Dirty Old Man', 'Love Is a Dog from Hell', and the autobiographical novels, 'Women', 'Hollywood', and 'Post Office'.",
        "runtimeMinutes": "130"
    },
    "2004_343": {
        "plotSummary": "Filmmaker Louis Schwartzberg hits the road to capture America's people and its natural beauty.",
        "runtimeMinutes": "84"
    },
    "2004_344": {
        "plotSummary": "Peaches, a hair stylist from Baltimore, and her estranged sister, Angela, the owner of an upscale salon in Beverly Hills, get reacquainted when Peaches decides to attend a celebration for Angela in LA. The reunion is bittersweet and ...See morePeaches, a hair stylist from Baltimore, and her estranged sister, Angela, the owner of an upscale salon in Beverly Hills, get reacquainted when Peaches decides to attend a celebration for Angela in LA. The reunion is bittersweet and worsens when Angela finds out that Peaches is on the run from the IRS and has only a few days to pay $50,000 in back taxes. After some hilarious moments and passionate exchanges, the two sisters join forces to fight off a pesky rival salon owner Marcella and save Peaches from her troubles by competing for a lucrative cash prize and bragging rights at the city's annual hair show. BEAUTY SHOP proves that blood and family run thicker than water.  Written by UrbanWorks EntertainmentSee less",
        "runtimeMinutes": "105"
    },
    "2004_345": {
        "plotSummary": "Zhou Yu, a ceramic decorative artist, travels twice a week from her home town of San Ming to Chongyang to visit her boyfriend, Chen Qing, a government worker and budding poet. The two met at a dance while Chen Qing was in San Ming, his old...See moreZhou Yu, a ceramic decorative artist, travels twice a week from her home town of San Ming to Chongyang to visit her boyfriend, Chen Qing, a government worker and budding poet. The two met at a dance while Chen Qing was in San Ming, his old home town, on a business trip. She is the inspiration for the best of his poetry. Zhou Yu is a strong willed woman, whereas Cheng Qing is a sensitive soul. These differences in addition to the growing disparity in their life situations places an unspoken strain in their relationship, despite each truly loving the other. As such, Zhou Yu befriends Zhang Qiang, a veterinarian who travels on the same trains as her. Like Zhou Yu, Zhang Qiang is a strong personality whose emotional temperament more closely matches hers. Ultimately, the three, individually and collectively, have to decide if, and if so how each of the others fits into his/her future life, especially as Cheng Qing has to make a further decision about his professional life.  Written by HuggoSee less",
        "runtimeMinutes": "97"
    },
    "2004_346": {
        "plotSummary": "A widowed lawyer wanted by the IRS assumes a new identity and signs his now-too-old son up for one more year of Little League. However, this may have been a mistake, as his son's dominance captures the media's attention as his team careens...See moreA widowed lawyer wanted by the IRS assumes a new identity and signs his now-too-old son up for one more year of Little League. However, this may have been a mistake, as his son's dominance captures the media's attention as his team careens toward the Little League World Series.  Written by StrunkinatorSee less",
        "runtimeMinutes": "105"
    },
    "2004_347": {
        "plotSummary": "The Travis family façade is destroyed by an event incomprehensible to them -- an event which will open locked doors and finally reveal the secrets that have haunted them for decades.See moreThe Travis family façade is destroyed by an event incomprehensible to them -- an event which will open locked doors and finally reveal the secrets that have haunted them for decades.  Written by AnonymousSee less",
        "runtimeMinutes": "111"
    },
    "2004_348": {
        "plotSummary": "An indictment of modern times divided into three \"kingdoms\": \"Enfer\" (\"Hell\"), \"Purgatoire\" (\"Purgatory\") and \"Paradis\" (\"Paradise\").",
        "runtimeMinutes": "80"
    },
    "2004_349": {
        "plotSummary": "Filmmaker Lars Von Trier challenges Jørgen Leth, the filmmaker behind The Perfect Human (1967), to remake his classic short under circumstances of increasing constraint.",
        "runtimeMinutes": "90"
    },
    "2004_35": {
        "plotSummary": "A young soprano becomes the obsession of a disfigured and murderous musical genius who lives beneath the Paris Opera House.",
        "runtimeMinutes": "143"
    },
    "2004_350": {
        "plotSummary": "An unfulfilled divorced woman gets the chance to relive her past when she meets a young man who appears to be her high school sweetheart who died many years before.",
        "runtimeMinutes": "97"
    },
    "2004_351": {
        "plotSummary": "Jeff Santo explores the life and career of his father, Chicago Cub great Ron Santo. Read more: Synopsis",
        "runtimeMinutes": "86"
    },
    "2004_352": {
        "plotSummary": "Gilles' wife, Elise, who smiles when she thinks of him, cooks and scrubs and cheerfully makes love to him, suspects during her third pregnancy that he is having an affair with her coquettish younger sister, Victorine. Elise suffers, ...See moreGilles' wife, Elise, who smiles when she thinks of him, cooks and scrubs and cheerfully makes love to him, suspects during her third pregnancy that he is having an affair with her coquettish younger sister, Victorine. Elise suffers, usually in silence. She listens to her husband rave; she asks her priest; she breaks picture frames; she weeps. She decides on a strategy to keep him. Will she succeed?  Written by See less",
        "runtimeMinutes": "103"
    },
    "2004_353": {
        "plotSummary": "When a man finds out his mother is dying and tries to hitchhike his way to the hospital, he is picked up by a stranger with a deadly secret.",
        "runtimeMinutes": "98"
    },
    "2004_354": {
        "plotSummary": "During his journey to Jerusalem young James learns the meaning of being Israeli.",
        "runtimeMinutes": "91"
    },
    "2004_355": {
        "plotSummary": "It's ten years after the kidnapping of Martin Bristol. Taken from a backyard swing at his home at the age of six, he is forced to witness unspeakable crimes of a deranged madman. For years, Martin's whereabouts have remained a mystery...until now.",
        "runtimeMinutes": "90"
    },
    "2004_356": {
        "plotSummary": "A look at the history of fame in the world through the eyes of pop star impresario, Rodney Bingenheimer.",
        "runtimeMinutes": "94"
    },
    "2004_357": {
        "plotSummary": "A musical look at the lives and struggles of people in the small fictional town called Greendale.",
        "runtimeMinutes": "87"
    },
    "2004_358": {
        "plotSummary": "Dean has been stumped for some time in his attempt to produce a follow-up to \"I was a Teenage Speed Freak,\" his incredibly successful graphic novel. His fans expect great things from him and his editor, Louise, is hounding him. Instead of ...See moreDean has been stumped for some time in his attempt to produce a follow-up to \"I was a Teenage Speed Freak,\" his incredibly successful graphic novel. His fans expect great things from him and his editor, Louise, is hounding him. Instead of working, however, Dean spends his time searching for his Argentine lover Pablo, who went out one night for cigarettes and never came back.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "105"
    },
    "2004_359": {
        "plotSummary": "In this documentary feature, filmmaker Robert Greenwald chronicles the Bush Administration's case to invade Iraq following the events of Sept. 11, 2001. The film examines the administration's argument for war through interviews with U.S ...See moreIn this documentary feature, filmmaker Robert Greenwald chronicles the Bush Administration's case to invade Iraq following the events of Sept. 11, 2001. The film examines the administration's argument for war through interviews with U.S intelligence and defense officials, foreign service experts and U.N. weapons inspectors -- including a former CIA director, a former ambassador to Saudi Arabia and even President Bush's Secretary of the Army.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "83"
    },
    "2004_36": {
        "plotSummary": "The Bride continues her quest of vengeance against her former boss and lover Bill, the reclusive bouncer Budd, and the treacherous, one-eyed Elle.",
        "runtimeMinutes": "137"
    },
    "2004_360": {
        "plotSummary": "When a famous American film director, Rudolph Grichenberg, comes to Paris to cast a Yiddish version of 'The Merchant of Venice,' Maurice Kurtz and his friends try out for the role of Shylock. Thinking he has finally been cast in an ...See moreWhen a famous American film director, Rudolph Grichenberg, comes to Paris to cast a Yiddish version of 'The Merchant of Venice,' Maurice Kurtz and his friends try out for the role of Shylock. Thinking he has finally been cast in an important film role after years of obscurity, Maurice rushes home to tell his beloved wife, Perla. Later, Maurice discovers the part has gone to a famous American star, but he must play the role of his life to be sure Perla, who has become very ill with cancer, doesn't find out.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "89"
    },
    "2004_361": {
        "plotSummary": "A documentary on the once-promising American rock bands The Brian Jonestown Massacre and The Dandy Warhols, and the friendship/rivalry between their respective founders, Anton Newcombe and Courtney Taylor.",
        "runtimeMinutes": "107"
    },
    "2004_362": {
        "plotSummary": "The abolition of slavery in the British Caribbean in 1834 prompts Gillanders, Arbuthnot & Company in Calcutta, a part of the East India Company, to recruit Coolies from India to fill the resulting labor void. The company hires Sinha, a ...See moreThe abolition of slavery in the British Caribbean in 1834 prompts Gillanders, Arbuthnot & Company in Calcutta, a part of the East India Company, to recruit Coolies from India to fill the resulting labor void. The company hires Sinha, a fierce small-timer to sell dreams of El Dorado to the unsuspecting, impoverished Coolies who are signed to five-year contracts as indentured servants. Upon the Coolies' arrival in British Guiana in 1838, the British planters promptly enslave them to ensure that the growth of sugar in the British West Indies will continue uninterrupted. John Scoble of the British and Foreign Anti Slavery Society arrives on the colony a year later to discover a new form of slavery; this time on the backs of Indians.  Written by AnonymousSee less",
        "runtimeMinutes": "120"
    },
    "2004_363": {
        "plotSummary": "Director Michael Almereyda's documentary on the weeks just prior to Sam Shepard's stage production of his play \"The Late Henry Moss.\"",
        "runtimeMinutes": "89"
    },
    "2004_364": {
        "plotSummary": "The true story of Jean Dominique, a Haitian radio journalist and human rights activist.",
        "runtimeMinutes": "90"
    },
    "2004_365": {
        "plotSummary": "An absurd comedy about a Parking Enforcement Officer, who - despite constant abuse from the public - finds truth, honour and serenity in the act of ticketing. His religious devotion to the work is challenged however, when his best friend ...See moreAn absurd comedy about a Parking Enforcement Officer, who - despite constant abuse from the public - finds truth, honour and serenity in the act of ticketing. His religious devotion to the work is challenged however, when his best friend and personal mentor is run down by an irate motorist and knocked into a deep coma. With the help of an angry young filmmaker, a Russian sound recordist hoping to break into the local film industry, and a seven-foot tall tow truck driver from Quebec, he embarks on a comical investigation into... the delicate art of parking.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2004_366": {
        "plotSummary": "Greg and Nelson are two complete opposites on a mission to complete their Home Teaching on the last day of the month--even if it kills them.",
        "runtimeMinutes": "82"
    },
    "2004_367": {
        "plotSummary": "Antoine Fuqua's documentary on the blues, shot at Radio City Music Hall in New York City.",
        "runtimeMinutes": "103"
    },
    "2004_368": {
        "plotSummary": "A pilot and his passenger struggle for survival after crashing in the Arctic tundra.",
        "runtimeMinutes": "103"
    },
    "2004_369": {
        "plotSummary": "A \"beyond the shoes\" documentary on the former first lady of the Philippines, Imelda Marcos.",
        "runtimeMinutes": "103"
    },
    "2004_37": {
        "plotSummary": "To save their farm, the resident animals go bounty hunting for a notorious outlaw.",
        "runtimeMinutes": "76"
    },
    "2004_370": {
        "plotSummary": "Or shoulders a lot: she's 17 or 18, a student, works evenings at a restaurant, recycles cans and bottles for cash, and tries to keep her mother Ruthie from returning to streetwalking in Tel Aviv. Ruthie calls Or \"my treasure,\" but Ruthie ...See moreOr shoulders a lot: she's 17 or 18, a student, works evenings at a restaurant, recycles cans and bottles for cash, and tries to keep her mother Ruthie from returning to streetwalking in Tel Aviv. Ruthie calls Or \"my treasure,\" but Ruthie is a burden. She's just out of hospital, weak, and Or has found her a job as a house cleaner. The call of the quick money on the street is tough for Ruthie to ignore. Or's emotions roil further when the mother of the youth she's in love with comes to the flat to warn her off. With love fading and Ruthie perhaps beyond help, Or's choices narrow.  Written by See less",
        "runtimeMinutes": "97"
    },
    "2004_371": {
        "plotSummary": "2142: Pollution and climate change wiped out most of Earth's population. Ecoban city is built to withstand this. Suppression results in revolt. A childhood couple find each other as adults on opposing sides.",
        "runtimeMinutes": "86"
    },
    "2004_372": {
        "plotSummary": "A man tries to find out who his real mother is after the woman who raised him tells him the truth.",
        "runtimeMinutes": "100"
    },
    "2004_373": {
        "plotSummary": "A young man is hellbent to destroy his arch enemy and his lover, who destroyed his life.",
        "runtimeMinutes": "122"
    },
    "2004_374": {
        "plotSummary": "An examination of political consultant Karl Rove's influence on George W. Bush's candidacy.",
        "runtimeMinutes": "80"
    },
    "2004_375": {
        "plotSummary": "The film follows a rebellious teenager on leave from the Marines who falls in love with a female musician. The relationship is threatened when she develops a mental illness...",
        "runtimeMinutes": "97"
    },
    "2004_376": {
        "plotSummary": "Longwinded, USA: a small but divided, feuding town of 262 Mormons and 262 Baptists. One man will try anything to end the ridiculous feud, bring the town together, and keep the peace-loving girl of his dreams from leaving town.",
        "runtimeMinutes": "92"
    },
    "2004_377": {
        "plotSummary": "Tamanna Sahni (Shilpa Shetty) is a dedicated staff member of a top advertising agency, her ideas and designs have mainly contributed to the success of the agency. She leaves for a college reunion and meets her college sweetheart Rohit (...See moreTamanna Sahni (Shilpa Shetty) is a dedicated staff member of a top advertising agency, her ideas and designs have mainly contributed to the success of the agency. She leaves for a college reunion and meets her college sweetheart Rohit (Salman Khan). They rekindle their love for each other and share some intimate moments together. Eventually Rohit leaves and Tamanna settles back into her normal daily routine. When her sister, Tanya, has an accident she decides to give her own blood to save her. However her doctor, Dr. Raisingh (Revathi), tells her that she has been tested positive for HIV. Tamanna's world turns upside down and she desperately tries to get into contact with Rohit but in vain. Her situation is soon spread around the office and she loses her job. Angered by her unfair dismissal she searches for a lawyer to fight her case. Eventually Tarun Anand (Abhishek Bachchan) agrees to represent her. The rest of the story shows if Tarun can help destroy the prejudice put upon Tamanna.  Written by gavin@sunny_deol2009@yahoo.comSee less",
        "runtimeMinutes": "142"
    },
    "2004_378": {
        "plotSummary": "Lee Hyun-min, who works reconstructing faces from their skull, quits his work in a institute to stay with his Beta-allergic daughter Jin that was submitted to a transplant of heart by the specialist Dr. Yoon. The newcomer researcher to the...See moreLee Hyun-min, who works reconstructing faces from their skull, quits his work in a institute to stay with his Beta-allergic daughter Jin that was submitted to a transplant of heart by the specialist Dr. Yoon. The newcomer researcher to the institute Jung Sun-young comes to his house bringing the skull of a victim of a serial-killer that had her whole body melted down with acid by the murderer. Hyun-min refuses the assignment, but he is haunted by the ghost of the victim and scared he decides to reconstruct the face of the woman. When Jin has trouble with the transplanted heart, Hyun-min requests the donor case history to Dr. Yoon, but the doctor refuses to give the information, claiming confidentiality issue. Dr. Yoon becomes the prime suspect of Detective Suh, who is in charge of the investigation of the murder cases, and he discloses the identity of the victim based on the reconstructed face. Meanwhile Hyun-min has a premonition and finds another skull buried a long time ago below the sand in a field. He reconstructs the face, unraveling a supernatural secret.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "92"
    },
    "2004_379": {
        "plotSummary": "An Aussie becomes a national sensation when he lifts off in his deck chair tied to balloons.",
        "runtimeMinutes": "100"
    },
    "2004_38": {
        "plotSummary": "SpongeBob SquarePants takes leave from the town of Bikini Bottom in order to track down King Neptune's stolen crown.",
        "runtimeMinutes": "87"
    },
    "2004_380": {
        "plotSummary": "Feeling undervalued by her boyfriend, a young woman begins to explore her sexuality with other people.",
        "runtimeMinutes": "81"
    },
    "2004_381": {
        "plotSummary": "Joint Commissioner of Police Dev Pratap Singh, a duty-bound, self-righteous officer, and Special Commissioner Tejinder Khosla, the balancing force between the political interests of Chief Minister Bhandarker and Dev's commitment to the law...See moreJoint Commissioner of Police Dev Pratap Singh, a duty-bound, self-righteous officer, and Special Commissioner Tejinder Khosla, the balancing force between the political interests of Chief Minister Bhandarker and Dev's commitment to the law, are lifelong friends, each with his own ideals. Farhaan, a law graduate, was brought up with ideals of non-violence and patriotism. Dev unwittingly gives Farhaan the wound that plunges him into rage and violence after witnessing the death of his father during a peace demonstration. Taking advantage of the situation, corrupt politician Latif sets the vulnerable young man on a path of violence and destruction that threatens to ignite the city. Aalyn is the light in Farhaan's life. Beautiful and innocent, the young woman also gets caught in extraordinary circumstances that transform her life and she dares to stand up for the truth.  Written by gavin (gunmasterM@hotmail.com)See less",
        "runtimeMinutes": "172"
    },
    "2004_382": {
        "plotSummary": "",
        "runtimeMinutes": "94"
    },
    "2004_383": {
        "plotSummary": "In 1965, Jimmy McMahon and his group of Liverpudlians plot to win the annual ceilí music competition in Ireland.",
        "runtimeMinutes": "90"
    },
    "2004_384": {
        "plotSummary": "Pig farmer John's wife died and he's having problems with the oldest of 2 sons. John's just out of prison brother joins them. He spells trouble.",
        "runtimeMinutes": "108"
    },
    "2004_385": {
        "plotSummary": "A bad scientist and wife, a mad scientist and skeleton, two aliens and their escaped pet are all searching for the elusive element \"atmospherium\".",
        "runtimeMinutes": "90"
    },
    "2004_386": {
        "plotSummary": "A Belgian woman looks back on her year at a Japanese corporation in Tokyo in 1990. She is Amelie, born in Japan, living there until age 5. After college graduation, she returns with a one-year contract as an interpreter. The vice president...See moreA Belgian woman looks back on her year at a Japanese corporation in Tokyo in 1990. She is Amelie, born in Japan, living there until age 5. After college graduation, she returns with a one-year contract as an interpreter. The vice president and section leader, both men, are boors, but her immediate supervisor, Ms. Mori, is beautiful and trustworthy. Amelie's downfall begins when she speaks perfect Japanese to clients. She compounds her failure by writing an excellent report for an enterprising colleague. The person she least expects to stab her in the back exposes her work. Thus begins her humiliations. What can become of her and of her relationship with Ms. Mori and with Japan?  Written by See less",
        "runtimeMinutes": "107"
    },
    "2004_387": {
        "plotSummary": "A whimsical comedy about three women who cry at funerals, professionally.",
        "runtimeMinutes": "111"
    },
    "2004_388": {
        "plotSummary": "Four tales: a robot baby as a pre-adoption test, a mother and her dying son's toy robot collection, a lonely robot office worker, and a sculptor contemplating robot-enabled immortality.",
        "runtimeMinutes": "85"
    },
    "2004_389": {
        "plotSummary": "The life and times of Howard Zinn: the historian, activist, and author of several classics including \"A Peoples History of the United States\". Archival footage, and commentary by friend, colleagues and Zinn himself.",
        "runtimeMinutes": "78"
    },
    "2004_39": {
        "plotSummary": "Now settled in Genovia, Princess Mia faces a new revelation: she is being primed for an arranged marriage to an English suitor.",
        "runtimeMinutes": "113"
    },
    "2004_390": {
        "plotSummary": "A sexy urban comedy about how a guy who is addicted to watching pornography discovers love is stronger than fantasy when he meets and falls in love with the girl of his dreams.See moreA sexy urban comedy about how a guy who is addicted to watching pornography discovers love is stronger than fantasy when he meets and falls in love with the girl of his dreams.  Written by imX CommunicationsSee less",
        "runtimeMinutes": "100"
    },
    "2004_391": {
        "plotSummary": "In the style of many reality shows, six people (three men and three women) vie for a cash prize of $10,000 by performing risque stunts and offering up scintillating confessionals on camera.",
        "runtimeMinutes": "97"
    },
    "2004_392": {
        "plotSummary": "A group of Indian POW (Prisoners Of War) rebels against Pakistani army and tries to escape from their captivity during India-Pakistan war in 1971.",
        "runtimeMinutes": "163"
    },
    "2004_393": {
        "plotSummary": "A look at the obsessive world of competitive Scrabble.",
        "runtimeMinutes": "80"
    },
    "2004_394": {
        "plotSummary": "Good versus evil in this epic tale which chronicles Ronald Reagan's crusade to destroy the most tyrannical and depraved political systems the world has ever known.",
        "runtimeMinutes": "110"
    },
    "2004_395": {
        "plotSummary": "How can Napoleon, the man of war and pioneering military strategist, meekly accept being locked up on a storm-lashed rock in the middle of the Atlantic ocean? What system of defence, and thus of attack, can he dream up to loosen his ...See moreHow can Napoleon, the man of war and pioneering military strategist, meekly accept being locked up on a storm-lashed rock in the middle of the Atlantic ocean? What system of defence, and thus of attack, can he dream up to loosen his jailers' grip? On Saint Helena, the far-flung island chosen by his enemies, Napoleon fights a mysterious battle, his last and most important, and one that History has kept secret all these years?  Written by AnonymousSee less",
        "runtimeMinutes": "120"
    },
    "2004_396": {
        "plotSummary": "The new math teacher and new school principal discover the 16-year-old underachiever failing classes is really a genius, and the kid's own family's too busy relying on him to mend family fences to notice his brilliance either.",
        "runtimeMinutes": "94"
    },
    "2004_397": {
        "plotSummary": "A shy, young woman, living a sheltered life in a small southern town, embarks on a journey to self-awareness when she falls in love with an eccentric rock star.",
        "runtimeMinutes": "109"
    },
    "2004_398": {
        "plotSummary": "History, speculation, experimental footage, and even animation is all used to explore the impact of Carlos Castaneda's teachings of perceiving non-ordinary reality.",
        "runtimeMinutes": "91"
    },
    "2004_399": {
        "plotSummary": "Jewish tailor Albert (Abkarian) and his wife Lea (Breitman) are reestablishing their business in 1946 Paris. Albert hires six people, more than he needs to meet current slow season demand, and all but Jacqueline (Lubna Azabal) are Jews who...See moreJewish tailor Albert (Abkarian) and his wife Lea (Breitman) are reestablishing their business in 1946 Paris. Albert hires six people, more than he needs to meet current slow season demand, and all but Jacqueline (Lubna Azabal) are Jews who somehow survived the occupation. Slowly, tentatively they get to know each other as they cut, stitch, press, and fit men's and women's clothes. But each has to reestablish his or her life and relationships among sometimes indifferent or hostile Parisians.  Written by Maple-2See less",
        "runtimeMinutes": "94"
    },
    "2004_4": {
        "plotSummary": "A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world.",
        "runtimeMinutes": "115"
    },
    "2004_40": {
        "plotSummary": "Blade, now a wanted man by the FBI, must join forces with the Nightstalkers to face his most challenging enemy yet: Dracula.",
        "runtimeMinutes": "113"
    },
    "2004_400": {
        "plotSummary": "February 4, 1974, Patty Hearst, granddaughter of William Randolph Heart, was kidnapped by the Symbionese Liberation Army (SLA), who first demanded a prisoner swap for Hearst, then, as it failed, demanded $6 million worth of food for the ...See moreFebruary 4, 1974, Patty Hearst, granddaughter of William Randolph Heart, was kidnapped by the Symbionese Liberation Army (SLA), who first demanded a prisoner swap for Hearst, then, as it failed, demanded $6 million worth of food for the poor of the Bay Area.  Written by Ulf Kjell GürSee less",
        "runtimeMinutes": "89"
    },
    "2004_401": {
        "plotSummary": "",
        "runtimeMinutes": "77"
    },
    "2004_402": {
        "plotSummary": "Nick Broomfield's second documentary about serial killer Aileen Wuornos, focusing on her mental state on death row.",
        "runtimeMinutes": "93"
    },
    "2004_403": {
        "plotSummary": "Flavors tells the stories of 13 different main characters in 5 parallel story lines.",
        "runtimeMinutes": "118"
    },
    "2004_404": {
        "plotSummary": "This film attempts to correct the record when it comes to the left's attacks on President Bush, 9/11 and the war in Iraq and Kerry's 20-year tenure in the Senate.",
        "runtimeMinutes": "72"
    },
    "2004_405": {
        "plotSummary": "A black comedy that follows three generations of a family, who come together for the funeral of the patriarch - unveiling a litany of family secrets and covert relationships.",
        "runtimeMinutes": "91"
    },
    "2004_406": {
        "plotSummary": "Two months shy of their wedding, a couple decide to allow each other last flings until their wedding.",
        "runtimeMinutes": "90"
    },
    "2004_407": {
        "plotSummary": "Luke and Roger are just another couple of college guys trying to lose their virginity. But when Luke sees something unusual, he begins to suspect that the girls on campus aren't exactly human.",
        "runtimeMinutes": "95"
    },
    "2004_408": {
        "plotSummary": "A drama that looks back on the Harlem Renaissance from the perspective of an elderly, black writer who meets a gay teenager in a New York homeless shelter.",
        "runtimeMinutes": "94"
    },
    "2004_409": {
        "plotSummary": "Ginger's sister Brigitte, now a werewolf herself, must try to find a cure for her blood lust before the next full moon while hiding out in a rehab clinic from a relentless werewolf.",
        "runtimeMinutes": "94"
    },
    "2004_41": {
        "plotSummary": "In Mexico City, a former CIA operative swears vengeance on those who committed an unspeakable act against the family he was hired to protect.",
        "runtimeMinutes": "146"
    },
    "2004_410": {
        "plotSummary": "",
        "runtimeMinutes": "90"
    },
    "2004_411": {
        "plotSummary": "North Carolina produces more tobacco than any other state in America. Bright Leaves describes a journey taken across the social, economic, and psychological tobacco terrain of North Carolina by a native Carolinian, Ross McElwee, whose ...See moreNorth Carolina produces more tobacco than any other state in America. Bright Leaves describes a journey taken across the social, economic, and psychological tobacco terrain of North Carolina by a native Carolinian, Ross McElwee, whose great-grandfather created the famous brand of tobacco known as Bull Durham. The comedic chronicle is a subjective, autobiographical meditation on the allure of cigarettes and their troubling legacy for the state of North Carolina. It's also a film about family history, addiction, denial, and filmmaking--as McElwee, noted director of Sherman's March, grapples with the legacy of an obscure Hollywood melodrama that is purportedly based on this curious man that was his great-grandfather.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "107"
    },
    "2004_412": {
        "plotSummary": "The inspirational life story of Australian swimmer Tony Fingleton.",
        "runtimeMinutes": "114"
    },
    "2004_413": {
        "plotSummary": "A father and his son live together in a roof-top apartment. They have lived alone for years in their own private world, full of memories and daily rites. Sometimes they seem like brothers. Sometimes even like lovers. Following in his ...See moreA father and his son live together in a roof-top apartment. They have lived alone for years in their own private world, full of memories and daily rites. Sometimes they seem like brothers. Sometimes even like lovers. Following in his father's path, Aleksei attends military school. He likes sports, tends to be irresponsible and has problems with his girlfriend. She is jealous of Aleksei's close relationship with his father. Despite knowing that all sons must one day live their own lives, Aleksei is conflicted; his father knows he should accept a better job in another city, perhaps search for a new wife, but who will ease the pain of Aleksei's nightmares?  Written by craig47See less",
        "runtimeMinutes": "97"
    },
    "2004_414": {
        "plotSummary": "Post-war provincial Iceland: around 1950, Freyja, who'd been a plump teen, returns from America, a widow with a 20-inch waist, seven suitcases of dresses, and a list of who ever wronged or slighted her. She moves in with an aunt and ...See morePost-war provincial Iceland: around 1950, Freyja, who'd been a plump teen, returns from America, a widow with a 20-inch waist, seven suitcases of dresses, and a list of who ever wronged or slighted her. She moves in with an aunt and socialist uncle: finding a new husband is high on her agenda, and she's mistrusted by Agga, a pre-teen who's our eyes and ears. The social order and Freyja are more complicated than they seem at first, and so may be her prospects. Class divisions, families ties, pride, the onset of puberty, and the power of Eros sliver the ice.  Written by See less",
        "runtimeMinutes": "102"
    },
    "2004_415": {
        "plotSummary": "\"Kissing Metal\" is the story of Philippe, a down and out European film producer, who lives in a tent in the shadow of his unfinished house in Brentwood. Philippe is struggling to sell a film he made five years ago to foreign distributors. ...See more\"Kissing Metal\" is the story of Philippe, a down and out European film producer, who lives in a tent in the shadow of his unfinished house in Brentwood. Philippe is struggling to sell a film he made five years ago to foreign distributors. Nearly broke, and on the verge of eviction, he seeks spiritual help from Master Atchoum, a Buddhist Guru. Master Atchoum pushes him into practicing Buddhism and convinces him to buy an expensive metal sculpture of Buddha. Empowered by the support of his new-found \"religion,\" Philippe starts turning things around. Through a series of serendipitous events...and some very unorthodox maneuvering, he becomes a success. But, he soon discovers that all is not what it appears to be...  Written by AnonymousSee less",
        "runtimeMinutes": "99"
    },
    "2004_416": {
        "plotSummary": "A lawyer in his 30s named Danny still dreams about becoming a cowboy when his fiancee leaves him on the eve of their wedding ceremony. Fortunately, for him, not one, but two contrasting girls appear on his life to take her place: the ...See moreA lawyer in his 30s named Danny still dreams about becoming a cowboy when his fiancee leaves him on the eve of their wedding ceremony. Fortunately, for him, not one, but two contrasting girls appear on his life to take her place: the bubbly Jo Jo and the more traditional Candice. But who will win out?  Written by Kevin See less",
        "runtimeMinutes": "97"
    },
    "2004_417": {
        "plotSummary": "A Catholic Priest and an English teacher get stranded in a school in Kigali during the 1994 Rwandan genocide.",
        "runtimeMinutes": "115"
    },
    "2004_418": {
        "plotSummary": "In a remote, isolated Yazidi Kurdish village in post-Soviet Armenia, Hamo, a widower with a pitiful pension and three worthless sons, travels daily to his wife's grave. There he meets the lovely Nina, who is communing with her late husband...See moreIn a remote, isolated Yazidi Kurdish village in post-Soviet Armenia, Hamo, a widower with a pitiful pension and three worthless sons, travels daily to his wife's grave. There he meets the lovely Nina, who is communing with her late husband. The two are penniless--she works in a local bar that is about to close down, while he has been forced to start selling his meager possessions. All seems hopelessly bleak, yet when Hamo begins to court Nina, their unexpected love revitalizes them.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "90"
    },
    "2004_419": {
        "plotSummary": "After nearly fifteen years behind bars, lefty revolutionary Bruno escapes and heads back to Grenoble, France. His plan? Settle some old scores, hook up with his foxy ex-lover, and avoid the cop on his tail. An unexpected event, however, ...See moreAfter nearly fifteen years behind bars, lefty revolutionary Bruno escapes and heads back to Grenoble, France. His plan? Settle some old scores, hook up with his foxy ex-lover, and avoid the cop on his tail. An unexpected event, however, brings cop and crook closer than they ever could have expected.  Written by IMDb EditorsSee less",
        "runtimeMinutes": "111"
    },
    "2004_42": {
        "plotSummary": "Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George.",
        "runtimeMinutes": "97"
    },
    "2004_420": {
        "plotSummary": "Elizabeth is a popular thirteen year old who can't wait for the day the Queen of England visits her quaint New Zealand hometown. Her excitement becomes almost too much to bear upon learning that she might get to meet the Queen face to face...See moreElizabeth is a popular thirteen year old who can't wait for the day the Queen of England visits her quaint New Zealand hometown. Her excitement becomes almost too much to bear upon learning that she might get to meet the Queen face to face! But as the rest of the town busies itself in eager anticipation of the big day, Elizabeth finds herself drawn to the elderly and mysterious outcast Hira.  Written by AnonymousSee less",
        "runtimeMinutes": "107"
    },
    "2004_421": {
        "plotSummary": "The film follows the story of Duncan, a fourteen-year-old misfit farm boy trying to fill the void and alleviate the numbness left by his mother's passing. Unable to let her go quite yet, Duncan mimics his dead mother. He talks in her voice...See moreThe film follows the story of Duncan, a fourteen-year-old misfit farm boy trying to fill the void and alleviate the numbness left by his mother's passing. Unable to let her go quite yet, Duncan mimics his dead mother. He talks in her voice at the dinner table and wears her fur coat to bed. Edgar, Duncan's distant sixty-year-old father, doesn't understand the strange manifestations of his son's mourning. Why can't Duncan grieve like a normal person? Macho mate Perry Foley, who has it physically even harder on his dad's farm, usually comforts Duncan and defends his 'wimpiness' to their cocky ruffian mates Travis, Scotty and Brent. But although clearly attracted to gentle Duncan himself, the socially unacceptable suggestion of 'sissy' homosexuality makes Perry over-react and turn on his friend.  Written by KGF VissersSee less",
        "runtimeMinutes": "94"
    },
    "2004_422": {
        "plotSummary": "An interracial gay love story set in early 18th century South Africa about two men -- a black prisoner living in a Cape Town penal colony and a Dutch sailor -- who weather injustices as a result of their affair.",
        "runtimeMinutes": "97"
    },
    "2004_423": {
        "plotSummary": "On their first anniversary, Vera comes home to discover her boyfriend Tim in bed with another man.",
        "runtimeMinutes": "86"
    },
    "2004_424": {
        "plotSummary": "A yakuza enforcer is ordered to secretly drive his beloved colleague to be assassinated. But when the colleague unceremoniously disappears en route, the trip that follows is a twisted, surreal and horrifying experience.",
        "runtimeMinutes": "130"
    },
    "2004_425": {
        "plotSummary": "One hundred fifty digital video cameras are distributed to everyday Iraqis, they encouraged to record their feelings about their life. They are also encouraged to pass the cameras along to get as many Iraqis across the country to ...See moreOne hundred fifty digital video cameras are distributed to everyday Iraqis, they encouraged to record their feelings about their life. They are also encouraged to pass the cameras along to get as many Iraqis across the country to participate in this project as possible. The cameras are in circulation from April to September 2004, shortly after the American bombing of Fallujah and the fall of the dictatorial regime of Saddam Hussein, the resulting footage which is compiled as this movie. Most of the subjects talk about issues around Hussein versus the Americans, and whether their lives and of Iraqis in general are better off now or then, their thoughts about democracy in general and how it applies to Iraq, and what they want to see for their future. A few also steer clear of politics altogether, they wanting to focus on happier things in their life. As the cameras move around the country, regional differences emerge, such as the Kurds of the north, who were persecuted by Hussein, having a unique perspective. Differences also emerge based on individual exposure to Hussein and/or his associates, or to what recently occurred in Fallujah. This digital camera footage is interspersed with other videos, including propaganda video by jihadis, and found unofficial videos recorded by Hussein's regime documenting their actions while in power, and with western media headlines about the Iraqi situation which has largely shaped the western view of life in Iraq.  Written by HuggoSee less",
        "runtimeMinutes": "80"
    },
    "2004_426": {
        "plotSummary": "A meditation on the separation fence in Israel-Palestine that imprisons one people while enclosing the other.",
        "runtimeMinutes": "96"
    },
    "2004_427": {
        "plotSummary": "Divan is the quest for a turn of the century Hungarian couch upon which Hassidic rabbis slept.",
        "runtimeMinutes": "90"
    },
    "2004_428": {
        "plotSummary": "It's 1922; somewhere in Australia. When a Native Australian man is accused of murdering a white woman, three white men (The Fanatic, The Follower and The Veteran) are given the mission of capturing him with the help of an experienced ...See moreIt's 1922; somewhere in Australia. When a Native Australian man is accused of murdering a white woman, three white men (The Fanatic, The Follower and The Veteran) are given the mission of capturing him with the help of an experienced Native Australian (The Tracker). So they start their quest in the outback, not knowing that their inner wrestles against and for racism will be more dangerous that the actual hunting for the accused.  Written by Bruno BentonSee less",
        "runtimeMinutes": "90"
    },
    "2004_429": {
        "plotSummary": "The tale of a spunky young boy named Buddy and his prize-winning calf, Hokey, as they climb from the underdog position up through the ranks of several Texas stock shows to ultimately fight to win the coveted title of Grand Champion.",
        "runtimeMinutes": "93"
    },
    "2004_43": {
        "plotSummary": "Alice wakes up in the Raccoon City hospital after the area has been overrun by zombies, and must now make it out of the city before a nuclear bomb is dropped.",
        "runtimeMinutes": "94"
    },
    "2004_430": {
        "plotSummary": "The satirical journey of two guys in Los Angeles making their film as they go through the twisted world that is: Hollywood.",
        "runtimeMinutes": "92"
    },
    "2004_431": {
        "plotSummary": "Heart-broken after several affairs, a woman finds herself torn between a Poet and a TV Host.",
        "runtimeMinutes": "99"
    },
    "2004_432": {
        "plotSummary": "Menachem Daum, the son of holocaust survivors, and a New York Orthodox Jew worries that both of his sons, full time yeshiva students who live with their families in Israel, are becoming seduced to intolerance by their religious studies. \"...See moreMenachem Daum, the son of holocaust survivors, and a New York Orthodox Jew worries that both of his sons, full time yeshiva students who live with their families in Israel, are becoming seduced to intolerance by their religious studies. \"All religions today are in danger of being hijacked by extremists.\" To open their perspectives just a little he sets off with his wife, Rifka, and both sons, Tzvi Dovid and Akiva, to visit the Polish towns where his parents grew up and to try to find the Catholic farmers who hid his father-in-law from the Germans. Enduring the bemused tolerance of his sons, Menachem persists until they find Honorata Matuszezyk Mucha who as a young woman brought food nightly to Rifka's father and his two brothers for 28 months until the end of World War II. The Daum sons perspectives widen a bit to allow for good Gentiles, but they also encounter some resentment from the Poles who heard no word from the three brothers after they left their hiding place, not even a postcard with a thank you. A lot of issues are surfaced but left unresolved in this well crafted documentary.  Written by Maple-2See less",
        "runtimeMinutes": "97"
    },
    "2004_433": {
        "plotSummary": "When the President of India is kidnapped by Kashmiri terrorists in Locarno, Switzerland, an Indian secret agent is sent to find him and set him free. With the help of an Indian singer he will make the \"Impossible\" to complete the mission.",
        "runtimeMinutes": "139"
    },
    "2004_434": {
        "plotSummary": "When Vincent finds himself a victim of outing in his high school, he must accept to live with the drastic changes it provokes, and redefine his relationships with his friends and family.",
        "runtimeMinutes": "86"
    },
    "2004_435": {
        "plotSummary": "Gerardo, a 17-year old guy has just finished his relationship with Bruno and starts wandering hopeless through the streets of the city. In his wandering he's tortured by images: each masculine body he sees reminds him of his lover. Gerardo...See moreGerardo, a 17-year old guy has just finished his relationship with Bruno and starts wandering hopeless through the streets of the city. In his wandering he's tortured by images: each masculine body he sees reminds him of his lover. Gerardo is determined to keep what's left of his dying love. The only comfort he has is a letter that Bruno left him with his boss.  Written by U.W.See less",
        "runtimeMinutes": "83"
    },
    "2004_436": {
        "plotSummary": "A queer \"Oliver Twist\" update set in the hustler district of modern-day Toronto.",
        "runtimeMinutes": "97"
    },
    "2004_437": {
        "plotSummary": "In 1950's Hollywood, movie star Guy Stone must marry a studio secretary in order to conceal his homosexuality. Sally has no idea her marriage is a sham, though, and turns Guy's life upside-down. Then he falls in love.",
        "runtimeMinutes": "96"
    },
    "2004_438": {
        "plotSummary": "Lana's only chance to escape the war-torn Balkans is her long-lost brother, a street-smart gangster with vengeful enemies. But her illusions are shattered as she is forced to survive by any means possible on the streets of Chicago.",
        "runtimeMinutes": "107"
    },
    "2004_439": {
        "plotSummary": "A group of cinematic spend a holiday in the French countryside. The film provides insight in their relationships, including that between a young man and a local girl, Lili. She uses the opportunity to work her way into the cinematic world,...See moreA group of cinematic spend a holiday in the French countryside. The film provides insight in their relationships, including that between a young man and a local girl, Lili. She uses the opportunity to work her way into the cinematic world, and for which she swaps her young friend for his mother's lover. This settled filmmaker takes Lili on a trip to Paris. A few years later the young man has become a filmmaker himself. His first film is inspired by the mentioned holiday. Lili, by now an actress, learns about it and works herself in a refined way into its cast. Ending up as the star of this production. No more than that, for the young filmmaker remains faithful to his wife and young daughter.  Written by FarhanSee less",
        "runtimeMinutes": "104"
    },
    "2004_44": {
        "plotSummary": "The story of the life and career of the legendary rhythm and blues musician Ray Charles, from his humble beginnings in the South, where he went blind at age seven, to his meteoric rise to stardom during the 1950s and 1960s.",
        "runtimeMinutes": "152"
    },
    "2004_440": {
        "plotSummary": "Set in the south of France, Riki Kandinski and his elder brother Fredrico, come back to their family castle for their father's funeral. They haven't seen each other in a long time and Fredrico knows nothing about his younger brother, but ...See moreSet in the south of France, Riki Kandinski and his elder brother Fredrico, come back to their family castle for their father's funeral. They haven't seen each other in a long time and Fredrico knows nothing about his younger brother, but he notices that he is making big money and living in luxury all for a few days work a week. By pure chance, Fredrico gets his hands on a gay porn magazine and sees his brother in it. According to Riki, he's had more than six hundred men and only four women. The brothers who grew up apart will have to get to know another again but both their lives change drastically when they witness a woman's death in a car crash.  Written by russart.comSee less",
        "runtimeMinutes": "101"
    },
    "2004_441": {
        "plotSummary": "Death and spiritual torment stalk three American students visiting the Carpathian mountain homeland of Vlad Tepes. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2004_442": {
        "plotSummary": "A documentary about Tom Dowd, who was an innovative recording engineer and producer of noted albums with John Coltrane, Ornette Coleman, Otis Redding, Eric Clapton, the Allman Brothers and many others.",
        "runtimeMinutes": "90"
    },
    "2004_443": {
        "plotSummary": "A look at the debate over same sex marriage in the USA. The reasons behind it are illustrated with real life couples that have run afoul of current laws despite varying levels of planning. Also, the reasons against it are debunked by ...See moreA look at the debate over same sex marriage in the USA. The reasons behind it are illustrated with real life couples that have run afoul of current laws despite varying levels of planning. Also, the reasons against it are debunked by proponents.  Written by havan_ironoak@bigfoot.comSee less",
        "runtimeMinutes": "81"
    },
    "2004_444": {
        "plotSummary": "A director struggles to film a difficult, intimate sex scene between two actors who happen to hate each other.",
        "runtimeMinutes": "92"
    },
    "2004_445": {
        "plotSummary": "A prostitute and her teenager daughter, will have to run away after the girl stabs her mother's pimp. The woman will try to find her son, which she hasn't seen in 8 years.",
        "runtimeMinutes": "93"
    },
    "2004_446": {
        "plotSummary": "Carter is a fed-up public defender who decides to take on the corrupt system. He sets up a law office in the inner city and begins organizing and activist group in the hopes of exposing the dishonest powers behind the scenes.",
        "runtimeMinutes": "104"
    },
    "2004_447": {
        "plotSummary": "After being accused of a triple-murder, a man films his every moment of his to provide an alibi. Things takes a worst turn when a detective suspects him and the tapes goes missing which can prove his innocence.",
        "runtimeMinutes": "99"
    },
    "2004_448": {
        "plotSummary": "A documentary exploring the myth of the Loch Ness monster.",
        "runtimeMinutes": "94"
    },
    "2004_449": {
        "plotSummary": "A young woman separated from her lover by war faces a life-altering decision.",
        "runtimeMinutes": "91"
    },
    "2004_45": {
        "plotSummary": "A poor yet passionate young man falls in love with a rich young woman, giving her a sense of freedom, but they are soon separated because of their social differences.",
        "runtimeMinutes": "123"
    },
    "2004_450": {
        "plotSummary": "Michael Abcarian is a young Armenian man living in Glendale, California with a growing sense of obligation to his father, Leon, who had sacrificed everything to get his family to America. Leon, in his late 50s, has just lost his wife and ...See moreMichael Abcarian is a young Armenian man living in Glendale, California with a growing sense of obligation to his father, Leon, who had sacrificed everything to get his family to America. Leon, in his late 50s, has just lost his wife and is forced to face his own survival issues--if he could only drive a car on an Los Angeles freeway, he might even be able to get a job, which would reduce his own guilt about being a burden to his son. With a tremendous desire to be responsible for himself and his family, Michael nonetheless must confront the conflicting moral codes represented by two epople who are close to him: Avo, the blow-hard who defends his honor with force; and Ana, Michael' s fiancee, who continually goads him into facing the fact that maturity doesn't always include getting one's own way. In Michael's struggle to fit in, he faces not only what it means to be on the outside, but also, what price it costs to gain entrance into respectability.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "87"
    },
    "2004_451": {
        "plotSummary": "On a dark, wet night a historic and regal Chinese cinema sees its final film. Together with a small handful of souls they bid \"Goodbye, Dragon Inn.\"",
        "runtimeMinutes": "82"
    },
    "2004_452": {
        "plotSummary": "Fired from a TV show, a writer looks into becoming a chorus boy while a documentary crew follows his efforts.",
        "runtimeMinutes": "93"
    },
    "2004_453": {
        "plotSummary": "A surrealist tale of a man and a woman who are passionately in love with each other, but their attempts to consummate that passion are constantly thwarted by their families, the Church, and bourgeois society.",
        "runtimeMinutes": "60"
    },
    "2004_454": {
        "plotSummary": "A suicidal, obsessively compulsive Japanese librarian is forced to lie low in Thailand with a pot-smoking woman coping with the recent loss of her sister.",
        "runtimeMinutes": "112"
    },
    "2004_455": {
        "plotSummary": "A man believes that his ex, shrink and colleagues are out to get him and that he's being followed by someone or something.",
        "runtimeMinutes": "84"
    },
    "2004_456": {
        "plotSummary": "A left-wing terrorist group, consisting of several homosexual men and a female leader, kidnaps the son of a wealthy industrialist.",
        "runtimeMinutes": "90"
    },
    "2004_457": {
        "plotSummary": "The life of Dino Condito is about to take a surprising turn. After letting down his softball team by striking out in the bottom of the ninth, his crew brands him the chooch.",
        "runtimeMinutes": "81"
    },
    "2004_458": {
        "plotSummary": "The film in not about auto-parts workers in suburban Buenos Aires, but about workers of a ceramic floors factory in Neuquen, several hundred miles southward, in Argentinian Patagonia.",
        "runtimeMinutes": "87"
    },
    "2004_459": {
        "plotSummary": "There were two wars in Iraq--a military assault and a media war. The former was well-covered; the latter was not. Until now... Independent filmmaker, Emmy-award winningTV journalist, author and media critic, Danny Schechter turns the ...See moreThere were two wars in Iraq--a military assault and a media war. The former was well-covered; the latter was not. Until now... Independent filmmaker, Emmy-award winningTV journalist, author and media critic, Danny Schechter turns the cameras on the role of the media. His new film, WMD, is an outspoken assessment of how Pentagon propaganda and media complicity misled the American people, while selling the war to influence international public opinion. Schechter compares and contrasts coverage on a global basis, including exclusive material and insider interviews. WMD is a serious film that exposes the media role--the biggest scandal of our time.  Written by AnonymousSee less",
        "runtimeMinutes": "98"
    },
    "2004_46": {
        "plotSummary": "After being told that their children never existed, a man and woman soon discover there is a much bigger enemy at work.",
        "runtimeMinutes": "91"
    },
    "2004_460": {
        "plotSummary": "Two young misfits head for New York City to celebrate their idol and muse, Stevie Nicks, at The Night of 1,000 Stevies. Along the road, in order for them to escape their painful pasts, they must discover their strengths and learn ...See moreTwo young misfits head for New York City to celebrate their idol and muse, Stevie Nicks, at The Night of 1,000 Stevies. Along the road, in order for them to escape their painful pasts, they must discover their strengths and learn self-acceptance.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "94"
    },
    "2004_461": {
        "plotSummary": "",
        "runtimeMinutes": "92"
    },
    "2004_462": {
        "plotSummary": "Sweden, shortly before Christmas. Surgeon Rickard is told the job he expected goes to a Dane, because of his substance abuse. It's too late to cancel dinner with his in-laws. The guest couple announces their in-vitro is a success. Then ...See moreSweden, shortly before Christmas. Surgeon Rickard is told the job he expected goes to a Dane, because of his substance abuse. It's too late to cancel dinner with his in-laws. The guest couple announces their in-vitro is a success. Then Richard's wife learns he cheated on her with Sofie. Meanwhile, ugly hag Anita trades drugs to afford a taser to use on her ex, Olaf, and his former physiotherapist. Workaholic builder Anders is disgusted by his grieve-deranged client Knut's plan and decides to spend time on his family, not just money.  Written by KGF VissersSee less",
        "runtimeMinutes": "110"
    },
    "2004_463": {
        "plotSummary": "Two brothers need household help after their Ma passes away. They decide to join a romance tour to Russia to find and bring home a traditionally minded wife.",
        "runtimeMinutes": "94"
    },
    "2004_464": {
        "plotSummary": "An examination of the conflicting attitudes of the opponents of the Vietnam War.",
        "runtimeMinutes": "112"
    },
    "2004_465": {
        "plotSummary": "\"Jackie Curtis is not a drag queen. Jackie is an artist. A pioneer without a frontier.\" -- Andy Warhol. Superstar in a Housedress examines the life and legend of Warhol transvestite superstar Jackie Curtis who was a poet, playwright, ...See more\"Jackie Curtis is not a drag queen. Jackie is an artist. A pioneer without a frontier.\" -- Andy Warhol. Superstar in a Housedress examines the life and legend of Warhol transvestite superstar Jackie Curtis who was a poet, playwright, performer, and one of the great personalities of his time. Jackie both lived and performed sometimes as a man, sometimes as a woman - and died tragically of a drug overdose under bizarre circumstances when he was only 38. The film features on-camera interviews with actor Harvey Fierstein who played Jackie's mother in \"Americka Cleopatra\" when he was 18, Ellen Stewart, founder of LaMama Experimental Theater Club, John Vaccaro, founder of the Playhouse of the Ridiculous, Paul Morrissey, Director of the Andy Warhol films, and surviving superstars Holly Woodlawn and Joe Dallesandro, plus 24 other friends and colleagues of Jackie's. The film includes never-before-seen video and film clips of Jackie performing in stage plays including \"Femme Fatale,\" \"Glamour, Glory and Gold,\" and \"Vain Victory: The Vicissitudes of the Damned.\" and cabarets. The music of jazz musician and composer Paul Serrato is featured, as is the photography of Jack Mitchell who took more photographs of Curtis and the Warhol crowd than any other professional. Interviews with media personalities, writers and editors put the work and life of Jackie Curtis in historical perspective. Narrated by Lily Tomlin.  Written by Craig HighbergerSee less",
        "runtimeMinutes": "95"
    },
    "2004_466": {
        "plotSummary": "In the final chapter of director Belvaux's trilogy, Pascal, now a disgraced cop, seeks redemption by capturing Bruno, a fugitive with a strange connection to Agnes, Pascal's heroin-addicted wife.",
        "runtimeMinutes": "124"
    },
    "2004_467": {
        "plotSummary": "Julianna (Jenna Mattison) is a struggling actress in a dead end relationship with Danny (Brad Rowe), a fireman who no longer lights her fire. When she decides to leave him and go \"find herself\" she ends up falling in love with an ...See moreJulianna (Jenna Mattison) is a struggling actress in a dead end relationship with Danny (Brad Rowe), a fireman who no longer lights her fire. When she decides to leave him and go \"find herself\" she ends up falling in love with an egotistical director, Michael (Bryan Callen), who can barely fit her in between Pilates classes.  Written by WomanInLoveSee less",
        "runtimeMinutes": "97"
    },
    "2004_468": {
        "plotSummary": "It's time for hockey! There's no telling what will happen when the Winnipeg Maroons' own star player Guy becomes embroiled in the twisted lives of Meta, a vengeful Chinoise, and her hairdresser/abortionist mother Liliom. Innocent Veronica,...See moreIt's time for hockey! There's no telling what will happen when the Winnipeg Maroons' own star player Guy becomes embroiled in the twisted lives of Meta, a vengeful Chinoise, and her hairdresser/abortionist mother Liliom. Innocent Veronica, caught in the middle, is treated to both services! Meanwhile poor, dithering, cowardly Guy can only stand by and watch.  Written by Anony-MooseSee less",
        "runtimeMinutes": "60"
    },
    "2004_469": {
        "plotSummary": "Maestro, tells the story of how a group of people found refuge and a call for life outside the mainstream. What evolved was a scene that set the ground work for what was to come in dance music culture worldwide, a rare insight into the ...See moreMaestro, tells the story of how a group of people found refuge and a call for life outside the mainstream. What evolved was a scene that set the ground work for what was to come in dance music culture worldwide, a rare insight into the secret underground world. It's the first time this story is told in a motion Picture, included in the film are pioneer dance music DJs and producers, \"founding fathers\", its center being Larry Levan, as well as high-profile DJs of today. Opting for a more personal and candid approach, MAESTRO shows the true history of the people through a realistic creative aesthetic. Tracing the underground's dance origin, MAESTRO brings out a real understanding of this intense lifestyle, and the lives they lived and died for.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2004_47": {
        "plotSummary": "The story of Sir J.M. Barrie's friendship with a family who inspired him to create Peter Pan.",
        "runtimeMinutes": "106"
    },
    "2004_470": {
        "plotSummary": "Two best friends from Minneapolis struggle to open a restaurant in the food capital of the world, as the city's legendary chefs and restaurateurs reflect on their lives in the business.",
        "runtimeMinutes": "80"
    },
    "2004_471": {
        "plotSummary": "Set right before the fall of Thailand's old capital, Ayuttaya, Bang Rajan draws on the legend of a village of fighters who bravely fended off the Burmese armies.",
        "runtimeMinutes": "113"
    },
    "2004_472": {
        "plotSummary": "A unique documentary on the notorious S-21 prison, today the Tuol Sleng Genocide Museum in Phnom Penh, Cambodia, with testimony by the only surviving prisoners and former Khmer Rouge guards.",
        "runtimeMinutes": "101"
    },
    "2004_473": {
        "plotSummary": "Nello Balocchi, a 35-year-old teacher of Greek and Latin, is invited to Bologna by his father, the owner of the Papal tailor's shop in Rome. His father hopes Nello will find a soul mate in Bolgna and thus produce an heir for the business. ...See moreNello Balocchi, a 35-year-old teacher of Greek and Latin, is invited to Bologna by his father, the owner of the Papal tailor's shop in Rome. His father hopes Nello will find a soul mate in Bolgna and thus produce an heir for the business. Nello stays in a guesthouse run by Arabella, a wise woman who already knows all about his situation. He shares a room with Domenico, a crafty barber from Naples. After several unsuccessful efforts, Nello meets Angela, an exuberant, beautiful young blind girl with whom he falls hopelessly in love. The girl's father and Nello's parents do not approve of the relationship, but the real problem is Angela's temperament.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "107"
    },
    "2004_474": {
        "plotSummary": "Television director and producer Michael Pressman mounts a production of Frankie and Johnny in the Clare de Lune starring his wife, Lisa Chess. But their attempts to stage the play and work on their marriage, keep running afoul, and ...See moreTelevision director and producer Michael Pressman mounts a production of Frankie and Johnny in the Clare de Lune starring his wife, Lisa Chess. But their attempts to stage the play and work on their marriage, keep running afoul, and everything's threatened by their difficult male lead, Alan Rosenberg. Michael's best hope, as a husband and producer, is to step into the character that Alan has abandoned.See less",
        "runtimeMinutes": "95"
    },
    "2004_475": {
        "plotSummary": "Sheldon Kasner gets drawn into the underworld of money laundering and concocts an elaborate scheme involving the \"Chevrah Kadisha\", the society of devout Jewish men who prepare bodies for burial.",
        "runtimeMinutes": "94"
    },
    "2004_476": {
        "plotSummary": "A documentary analyzing the role of the modern American media and its effects on democracy. Read more: Synopsis",
        "runtimeMinutes": "84"
    },
    "2004_477": {
        "plotSummary": "A hot young phone sex addict and his narcissistic opera diva mom. A dangerously agitated hustler and a half-dozen dangerously agitated hustlers who look just like him. A tittering neurotic who thinks she's Vanessa Redgrave and Vanessa ...See moreA hot young phone sex addict and his narcissistic opera diva mom. A dangerously agitated hustler and a half-dozen dangerously agitated hustlers who look just like him. A tittering neurotic who thinks she's Vanessa Redgrave and Vanessa Redgrave herself. Pot brownies, puke jokes, a gay dad, a flying lesbian, Jerry Hall, a dead body and a fetish for Brian DePalma movies! Anchoring the mayhem is Elisabeth Beaumont, an American opera star visiting Paris to perform \"Turandot\" and dabble in some belated mothering of her 23 year-old son Thomas. Thomas doesn't need mothering; he needs some good hot manhandling. And, in the best DePalma tradition, the quest for sex leads to voyeurism and voyeurism, leads to murder. From there, it's just a short path to therapy. Unfortunately, the psychiatrist that Thomas visits is a little on the dead side herself, and a nutty patient has taken her place.  Written by a fan from miamiSee less",
        "runtimeMinutes": "91"
    },
    "2004_478": {
        "plotSummary": "A dramatization of the horrific and notorious Manson Family Murders, in the form of super 8 home movies.",
        "runtimeMinutes": "95"
    },
    "2004_479": {
        "plotSummary": "On a pilgrimage to Mashad from Tehran, a couple's transportation breaks down, far from any major town. The husband, a photographer, seeks help at a nearby village and encounters a teacher who offers to help. Whilst the husband and teacher ...See moreOn a pilgrimage to Mashad from Tehran, a couple's transportation breaks down, far from any major town. The husband, a photographer, seeks help at a nearby village and encounters a teacher who offers to help. Whilst the husband and teacher go off to find a spare part, the wife, who used to be a teacher, takes over the teaching lessons in the village. It is clear that the children live there, in this strange deserted place, without any men, save the teacher and an old signal guard. As the day draws on, the children help to bring a new hope and life into the wife's heart.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "88"
    },
    "2004_48": {
        "plotSummary": "The wanted criminal Richard Bruno Riddick (Vin Diesel) arrives on a planet called Helion Prime and finds himself up against an invading empire called the Necromongers, an army that plans to convert or kill all humans in the universe.",
        "runtimeMinutes": "119"
    },
    "2004_480": {
        "plotSummary": "An anthropology student exploring the nature of prostitution is drawn deeper into that profession than she ever expected.",
        "runtimeMinutes": "87"
    },
    "2004_481": {
        "plotSummary": "Cynthia is a young Chinese woman in love with Itami, a Japanese man about to be sent home for military service.",
        "runtimeMinutes": "127"
    },
    "2004_482": {
        "plotSummary": "Bo is a transexual prostitute in Brussels who left home after being abused by her father. She's now in an abusive relationship with a neighbor and suspected by the police in a series of transexual murders. In order to clear herself she ...See moreBo is a transexual prostitute in Brussels who left home after being abused by her father. She's now in an abusive relationship with a neighbor and suspected by the police in a series of transexual murders. In order to clear herself she must turn detective.  Written by havan_ironoak@bigfoot.comSee less",
        "runtimeMinutes": "105"
    },
    "2004_483": {
        "plotSummary": "Two young guys work in a plant that manufactures oshibori (those moist hand-towels found in some Japanese restaurants). Their weird bond is based on uncontrollable rage--something neither can articulate or control--and the strange ...See moreTwo young guys work in a plant that manufactures oshibori (those moist hand-towels found in some Japanese restaurants). Their weird bond is based on uncontrollable rage--something neither can articulate or control--and the strange jellyfish that they keep as a pet.  Written by AnonymousSee less",
        "runtimeMinutes": "115"
    },
    "2004_484": {
        "plotSummary": "The first film to go inside the MotoGP world since television took a sport watched by a few thousand spectators at race tracks and turned it into prime-time entertainment for over 350 million people worldwide. The MotoGP world championship...See moreThe first film to go inside the MotoGP world since television took a sport watched by a few thousand spectators at race tracks and turned it into prime-time entertainment for over 350 million people worldwide. The MotoGP world championship is the pinnacle of motorcycle sport, a series of sixteen races on five continents contested by twenty-four of the world's top riders. Filmed around the world during the 2001 and 2002 seasons, FASTER asks this question: How do you go faster than the rest, how do you win at this glamorous, dangerous game? The movie could be subtitled: How do you beat Valentino Rossi? The 24 year old Italian, world champion in 2001 and 2002, currently dominates MotoGP, and he's the charismatic center of the film. In addition, FASTER focuses on three other riders: Rossi's bitter rival Max Biaggi; the brilliant but injury-prone Garry McCoy; and the rising teenage star John Hopkins. Tales told by a supporting cast include former world champions including Mick Doohan, Kevin Schwantz, Wayne Rainey, Kenny Roberts and Barry Sheene.  Written by AnonymousSee less",
        "runtimeMinutes": "103"
    },
    "2004_485": {
        "plotSummary": "The story of two college graduates from the Midwest who move to Los Angeles, where their love is tested for the first time.",
        "runtimeMinutes": "99"
    },
    "2004_486": {
        "plotSummary": "John Cadigan was diagnosed with schizophrenia in 1993. He talks about what it's like living with mental illness. He shows us how his art, his friends and family help him have a meaningful life.",
        "runtimeMinutes": "84"
    },
    "2004_487": {
        "plotSummary": "Filmmaker Bruce Weber is a professed animal lover, and his newest film centers on his own dogs, a family of gorgeous golden retrievers, including \"True.\"",
        "runtimeMinutes": "78"
    },
    "2004_488": {
        "plotSummary": "A young woman's life falls apart while filming a surfing documentary.",
        "runtimeMinutes": "87"
    },
    "2004_489": {
        "plotSummary": "Shortly after returning to his hometown to deal with issues from his past, David's father is found dead. While the cause of death is initially thought to be suicide, a rumor soon spreads that his death was not, in fact, of his own doing.",
        "runtimeMinutes": "99"
    },
    "2004_49": {
        "plotSummary": "The relationships of two couples become complicated and deceitful when the man from one couple meets the woman of the other.",
        "runtimeMinutes": "104"
    },
    "2004_490": {
        "plotSummary": "Tom (Speedman) and Dan's (Marsden) one-night stand turns into an intense power-play between captor and captive.",
        "runtimeMinutes": "92"
    },
    "2004_491": {
        "plotSummary": "Through an Internet service, a Montreal professor arranges for himself a Mexican bride. But both husband and wife, even with their good intentions, are in for a bumpy ride toward marital harmony.",
        "runtimeMinutes": "100"
    },
    "2004_492": {
        "plotSummary": "An autobiographical film taken from the experiences of writer-director Rob Moretti, CRUTCH is a coming-of-age tale about a young man's struggle with family problems and substance abuse. Behind a facade of suburban middle class perfection, ...See moreAn autobiographical film taken from the experiences of writer-director Rob Moretti, CRUTCH is a coming-of-age tale about a young man's struggle with family problems and substance abuse. Behind a facade of suburban middle class perfection, David's home life is falling apart. As he tries to cope with the impossible situation, the troubled and impressionable teenager falls under the spell of Kenny, a georgous, thirty-something, has-been actor turned theatre coach. When Kenny's \"support\" escalates into seduction, David slowly decends into an abyss of drinking and drug addition from which he must escape if he is to survive. CRUTCH is a dramatic tale of the confusion of youth and the difficulties in finding oneself.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2004_493": {
        "plotSummary": "The film is a cheerful stylized musical comedy a la 8 femmes. The story happens in the guest-house of sister Klivia in one of the Dutch towns. The inhabitants of the guest-house are very cheerful and good-hearted persons whose open ...See moreThe film is a cheerful stylized musical comedy a la 8 femmes. The story happens in the guest-house of sister Klivia in one of the Dutch towns. The inhabitants of the guest-house are very cheerful and good-hearted persons whose open communal lifestyle is contrasted with the life of somewhat nasty and complaining neighbor behind the wall heer Boordevool. Boordevool has spent ages looking for reasons to shut the guest-house. One day a girl from the guest-house meets a nice young guy Gerrit. Sister Klivia lets Gerrit stay regardless of him being a thief. Will that give a chance to the insinuations of the neighbor?  Written by Natalie-7See less",
        "runtimeMinutes": "100"
    },
    "2004_494": {
        "plotSummary": "A documentary about freestyling--the improvised, on-the-spot rhymes that demonstrate the skills of hip-hop MCs.",
        "runtimeMinutes": "60"
    },
    "2004_495": {
        "plotSummary": "Young Eddie loses his parents in an accident and his uncle leaves him for ten years in the care of his Hispanic rancher. In high school he reconnects with a girl from his past, and their grow an interracial relationship.",
        "runtimeMinutes": "107"
    },
    "2004_496": {
        "plotSummary": "The Dust Factory is an adventure about the love and friendship between two teenagers who help each other through a difficult time in their lives.",
        "runtimeMinutes": "99"
    },
    "2004_497": {
        "plotSummary": "A young man with a beautiful and bright fiancee has a meaningless one-night stand. When she discovers his infidelity, she angrily breaks off their engagement. Soon she has to consider whether to pursue a relationship with a wealthier ...See moreA young man with a beautiful and bright fiancee has a meaningless one-night stand. When she discovers his infidelity, she angrily breaks off their engagement. Soon she has to consider whether to pursue a relationship with a wealthier suitor who has made it clear that he sees her as a potential wife. As her former fiance struggles to convince her to take him back and she examines her past and present life situation, they both learn some important lessons about love and forgiveness.  Written by Leslye Allen (L. J. Allen-2)See less",
        "runtimeMinutes": "108"
    },
    "2004_498": {
        "plotSummary": "In Los Angeles, the young Jenny has a nice childhood with her Korean parents Joanne and David Kim. However, after the divorce of her parents, the judge gives her custody to her selfish mother that neglects Jenny while the disappointed ...See moreIn Los Angeles, the young Jenny has a nice childhood with her Korean parents Joanne and David Kim. However, after the divorce of her parents, the judge gives her custody to her selfish mother that neglects Jenny while the disappointed David returns to Seoul. Six years later, Jenny is a troubled and reckless teenager expelled from the public school that has easy sex and uses drugs and booze, and her best friend is the orphan drug dealer Becky. The lawyer Elliot Krasner decides to call his former friend David to tell him about the self-destructive behavior of Jenny, and David returns to Los Angeles. He brings Jenny to live with him and support her, but the lack of emotional structure of Jenny imposes tough difficulties for their relationship.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "93"
    },
    "2004_499": {
        "plotSummary": "\"Rigoletto\" retold at Christmas time in Manhattan's corporate world. Rick, an executive at Image, is a jerk to a woman applying for a job. That evening, he's out for drinks with his much younger boss, Duke, and the same women is their ...See more\"Rigoletto\" retold at Christmas time in Manhattan's corporate world. Rick, an executive at Image, is a jerk to a woman applying for a job. That evening, he's out for drinks with his much younger boss, Duke, and the same women is their waitress. Rick's continued rudeness leads to her getting fired. She puts a curse on him. A potential rift with Duke quickly surfaces. Rick is approached by the hail-fellow Buck, who runs his own company, offering to rid Rick of Duke. At dinner later that night, Rick and Duke's paths cross again. This time Rick is with his stunning and beloved daughter, Eve, a student who has a secret relationship with Duke. All paths lead to the office holiday party.  Written by See less",
        "runtimeMinutes": "100"
    },
    "2004_5": {
        "plotSummary": "Depicts the final twelve hours in the life of Jesus of Nazareth, on the day of his crucifixion in Jerusalem.",
        "runtimeMinutes": "127"
    },
    "2004_50": {
        "plotSummary": "Two disgraced FBI agents go way undercover in an effort to protect hotel heiresses the Wilson sisters from a kidnapping plot.",
        "runtimeMinutes": "109"
    },
    "2004_500": {
        "plotSummary": "Dorian Shanley, is a heart surgeon who abuses alcohol and drugs. Dorian trades stolen pharmaceuticals for cocaine , provided by his best friend and enabler, Teddy. While Dorian's life and career take a nosedive, Shanley numbs the pain of ...See moreDorian Shanley, is a heart surgeon who abuses alcohol and drugs. Dorian trades stolen pharmaceuticals for cocaine , provided by his best friend and enabler, Teddy. While Dorian's life and career take a nosedive, Shanley numbs the pain of losing his father, William Shanley, to a form of Alzheimer's common in prizefighters. To further complicate circumstances, Dorian falls in love with his girlfriend's best friend from college, Anna. The film follows Shanley through a maze of pharmacies, clubs and binges and surgeries, into the heart of drug abuse.  Written by AnonymousSee less",
        "runtimeMinutes": "109"
    },
    "2004_501": {
        "plotSummary": "Hollywood's Pauly Shore loses everything, fakes his own death, and gets caught.",
        "runtimeMinutes": "82"
    },
    "2004_502": {
        "plotSummary": "",
        "runtimeMinutes": "120"
    },
    "2004_503": {
        "plotSummary": "Five seemingly unrelated people decide to take huge risks in their personal lives in an effort to find happiness.",
        "runtimeMinutes": "134"
    },
    "2004_504": {
        "plotSummary": "When Clinton's decided heterosexuality was placed under fire during the Starr Investigation and ensuing impeachment hearings, gay people strongly identified with the President's discomfort and outrage. Today, public ambitions inspire (or ...See moreWhen Clinton's decided heterosexuality was placed under fire during the Starr Investigation and ensuing impeachment hearings, gay people strongly identified with the President's discomfort and outrage. Today, public ambitions inspire (or even require) lying, covering up, and shading personal truths for survival. Barney Frank - the first openly gay politician on Capitol Hill - understands a thing or two about survival on Capitol Hill. After overcoming his own sex scandal in the early 90's, Frank emerged as one of Clinton's most eloquent and sympathetic defenders during the impeachment hearings. Well-loved for his political wit, Barney Frank has also emerged as one of the most popular Congressmen in the United States. Via interviews, news clippings, and exclusive footage shot during the Clinton impeachment hearings, \"Let's Get Frank\" is an intelligent and humorous look not only at life upon Capitol Hill, but also the dynamics of political scandal.  Written by AnonymousSee less",
        "runtimeMinutes": "75"
    },
    "2004_505": {
        "plotSummary": "An irresponsible and childish ex-con befriends a girl with cerebral palsy and develops a progressively stronger bond with her.",
        "runtimeMinutes": "133"
    },
    "2004_506": {
        "plotSummary": "Documentary on contemporary Cuban music, filmed on location in Cuba.",
        "runtimeMinutes": "95"
    },
    "2004_507": {
        "plotSummary": "When a teenager finds herself pregnant, with no memory of having had sex, she determines that she is carrying the child of God.",
        "runtimeMinutes": "116"
    },
    "2004_508": {
        "plotSummary": "It is a love story told by a singer whose music takes us on a social, political and geographic voyage of Mali from 1960 to our days.",
        "runtimeMinutes": "76"
    },
    "2004_509": {
        "plotSummary": "A graduate student preparing his thesis on mythology leads his friends on a research expedition to an old plantation estate on the outskirts of the Big Easy. The site is reputed to mysteriously cause madness and death to all who enter it.",
        "runtimeMinutes": "88"
    },
    "2004_51": {
        "plotSummary": "Two men reaching middle age with not much to show but disappointment embark on a week-long road trip through California's wine country, just as one is about to take a trip down the aisle.",
        "runtimeMinutes": "127"
    },
    "2004_510": {
        "plotSummary": "On the distant planet Axis, Kaena, a rebellious, high-spirited teenage girl, will defy the High Priest and her people's ancestral beliefs to take a perilous journey and discover what dark secrets lie beyond the clouds.",
        "runtimeMinutes": "85"
    },
    "2004_511": {
        "plotSummary": "Documentary filmmaker Peter Gilbert unearths the legacy of the landmark Supreme Court decision in Brown v. Board of Education -- where it was ruled that \"in the field of public education, the doctrine of 'separate but equal' has no place\" ...See moreDocumentary filmmaker Peter Gilbert unearths the legacy of the landmark Supreme Court decision in Brown v. Board of Education -- where it was ruled that \"in the field of public education, the doctrine of 'separate but equal' has no place\" -- via never-before-heard stories from people directly responsible for, and greatly affected by, the original case.  Written by AnonymousSee less",
        "runtimeMinutes": "110"
    },
    "2004_512": {
        "plotSummary": "A group of friends who take Halloween way too seriously kidnap Anna Nicole Smith's beloved pet Sugar-Pie. It's up to a bunch of drag queens dressed as Anna to bring Sugar-Pie back.",
        "runtimeMinutes": "92"
    },
    "2004_513": {
        "plotSummary": "1979. A village in Pakistan. A widow sees her 17 years old son being attracted to Islamist militants. It brings her past back...",
        "runtimeMinutes": "99"
    },
    "2004_514": {
        "plotSummary": "In the film, \"Wake\", the fateful reunion of four brothers quickly dissolves into a night of drinking, deceit, perversions, and death. They don't realize until it is too late that the party they are having is, in fact, a wake.See moreIn the film, \"Wake\", the fateful reunion of four brothers quickly dissolves into a night of drinking, deceit, perversions, and death. They don't realize until it is too late that the party they are having is, in fact, a wake.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2004_515": {
        "plotSummary": "A documentary on how Los Angeles has been used and depicted in the movies.",
        "runtimeMinutes": "169"
    },
    "2004_516": {
        "plotSummary": "In the end of WW2 a group of four Jewish prisoners trying to escape through the forest The arrive to a small cabin where the find shelter and food, but soon enough a group of nazi soldiers return to the cabin and find the Jews in there A ...See moreIn the end of WW2 a group of four Jewish prisoners trying to escape through the forest The arrive to a small cabin where the find shelter and food, but soon enough a group of nazi soldiers return to the cabin and find the Jews in there A game of psychological battle begins, which changes everyone and everythingSee less",
        "runtimeMinutes": "100"
    },
    "2004_517": {
        "plotSummary": "Rob Baskin, a businessman who travels to Lake Tahoe in order to spread the ashes of his late mother, meets Ann Field, a woman who'll change his life forever.",
        "runtimeMinutes": null
    },
    "2004_518": {
        "plotSummary": "Kenneth is a socially awkward office worker who has little experience with romance. He buys a life-like sex doll in an attempt to rid him of his loneliness, but soon finds there may be a dark side to 'Nikki'.",
        "runtimeMinutes": "88"
    },
    "2004_519": {
        "plotSummary": "An examination of the Jewish culture that thrives in 21st-century Poland despite the absence of a large Jewish population.",
        "runtimeMinutes": "85"
    },
    "2004_52": {
        "plotSummary": "In 1890, a down-and-out cowboy and his horse travel to Arabia to compete in a deadly cross desert horse race.",
        "runtimeMinutes": "136"
    },
    "2004_520": {
        "plotSummary": "A young painter and a writer come together over 24 hours and must confront their past to forge a relationship.",
        "runtimeMinutes": "101"
    },
    "2004_521": {
        "plotSummary": "Documentary on the civil rights activist, Viola Liuzzo, who was murdered in 1965 as she campaigned for black suffrage in Selma, Alabama, and its effect on her family.",
        "runtimeMinutes": "75"
    },
    "2004_522": {
        "plotSummary": "Interviews with Christo, Chuck Close, Roy Lichtenstein, Judith Malina, James Rosenquist and others help illuminate the life and work of Warhol contemporary Ray Johnson.",
        "runtimeMinutes": "90"
    },
    "2004_523": {
        "plotSummary": "Maria has worked as a prostitute since her mother died 15 years ago. Her younger sister Catarina is now a shy 17-year old, devoted to art and music, and the lover of her elder sibling, who allows her to leave the apartment only to attend ...See moreMaria has worked as a prostitute since her mother died 15 years ago. Her younger sister Catarina is now a shy 17-year old, devoted to art and music, and the lover of her elder sibling, who allows her to leave the apartment only to attend dance class. But when Catarina meets a man there, another forbidden love blossoms.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "93"
    },
    "2004_524": {
        "plotSummary": "In the end of the 70's, the dysfunctional Kenneth Bianchi lives with his mother and is obsessed with joining the police force. When his application is refused, his mother sends him to Los Angeles to live with his sadistic cousin Angelo ...See moreIn the end of the 70's, the dysfunctional Kenneth Bianchi lives with his mother and is obsessed with joining the police force. When his application is refused, his mother sends him to Los Angeles to live with his sadistic cousin Angelo Buono. Kenneth unsuccessfully tries to join LAPD, and Angelo convinces him to start a prostitution business with him. They force two girls from Tucson to work for them, but their competitors destroy their business and steals their money. The frustrated Kenneth and Angelo decide on revenge against a prostitute, and Kenneth strangles her, feeling a great pleasure with her death. The two cousins become addicted to death, initially killing prostitutes and then attacking single women, dumping their bodies on the hill.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "98"
    },
    "2004_525": {
        "plotSummary": "As the Beatles did in the 1960s, Michael Caine convinces Jack Nicholson, Joe Pesci, Al Pacino, Mick Jagger and Keith Richards to move to Stella Street, an unassuming residential area of Surrey. But along with the new neighbors come hoods ...See moreAs the Beatles did in the 1960s, Michael Caine convinces Jack Nicholson, Joe Pesci, Al Pacino, Mick Jagger and Keith Richards to move to Stella Street, an unassuming residential area of Surrey. But along with the new neighbors come hoods and thieves, all determined to make off with the stars' cash. Based on the BBC sketch comedy series.See less",
        "runtimeMinutes": "80"
    },
    "2004_526": {
        "plotSummary": "When legendary thief Max Cruz is framed by the CIA, he has no choice but to help them with a top-secret mission. Mexican crimelord Beno Gildemontes has stolen classified intelligence data. Max must steal it back. Max plays it cool as he ...See moreWhen legendary thief Max Cruz is framed by the CIA, he has no choice but to help them with a top-secret mission. Mexican crimelord Beno Gildemontes has stolen classified intelligence data. Max must steal it back. Max plays it cool as he infiltrates Beno's palace stronghold in the steamy jungle of the Yucatan. Max is surrounded by treachery and can trust no one, including Natalie, the dangerously beautiful CIA agent assigned to watch over him. But he finds an unlikely ally in Sofia, Beno's sultry mistress.  Written by AnonymousSee less",
        "runtimeMinutes": "95"
    },
    "2004_527": {
        "plotSummary": "After living together for seven years in a seemingly accepting community in New York City, Edward DeBonis and Vincent Maniscalco decide to get married. But unlike many other gay couples who formalize their relationship in a domestic union,...See moreAfter living together for seven years in a seemingly accepting community in New York City, Edward DeBonis and Vincent Maniscalco decide to get married. But unlike many other gay couples who formalize their relationship in a domestic union, Vincent and Edward, both devout Catholics, will settle for nothing short of the \"Holy Sacrament of Marriage.\" The couple's request to The New York Times to announce their wedding in the weekly \"Styles\" section throws the newspaper into disarray. Publishing the first Catholic gay wedding announcement presents the editors with numerous controversial questions: Is a gay priest a real priest? Can a gay union be called a wedding? Can a gay couple be considered Catholic? As America stands on the verge of legal acceptance of gay and lesbian unions, \"Saints and Sinners\" explores the social, political and religious aspects of same-sex marriage and examines its effect on American society.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2004_528": {
        "plotSummary": "Georges, a wealthy Parisian, has a mistress who wants to marry him, but he has no intention of divorcing his wife, the source of his money. The mistress, meanwhile, has a jealous boyfriend, so when Georges dumps her, two people are angry ...See moreGeorges, a wealthy Parisian, has a mistress who wants to marry him, but he has no intention of divorcing his wife, the source of his money. The mistress, meanwhile, has a jealous boyfriend, so when Georges dumps her, two people are angry with him. Add Georges' wife, who suspects the affair. The mistress calls Georges to say she's coming to tell his wife everything, so Georges asks Maurice, a stranger who's passing by, to pose as his wife and scare off the mistress. In this farce, nothing goes as Georges plans.  Written by See less",
        "runtimeMinutes": "102"
    },
    "2004_529": {
        "plotSummary": "2 Danish friends are tired of their employer and open their own butcher shop. An electrician accidentally dies in the freezer and he's sold as marinated chicken and business picks up. What happens when they run out of \"chicken\"?",
        "runtimeMinutes": "100"
    },
    "2004_53": {
        "plotSummary": "The secret to a Stepford wife lies behind the doors of the Men's Association.",
        "runtimeMinutes": "93"
    },
    "2004_530": {
        "plotSummary": "Left behind by a circus, a camel wanders to the house of a simple middle-aged couple. Although the wife is initially bewildered by the strange and unexpected animal, her husband immediately adopts it as a pet. As the man and his new ...See moreLeft behind by a circus, a camel wanders to the house of a simple middle-aged couple. Although the wife is initially bewildered by the strange and unexpected animal, her husband immediately adopts it as a pet. As the man and his new companion take their daily walks in the village, neighbors are drawn to the odd sight and approach him about riding the camel or using it for any number of purposes. He declines to exploit or capitalize on the friendly animal, and is met with barely veiled hostility. In time, the camel becomes a burden on both the town and the man, who's edged out of community affairs and lives on shaky ground with his wife.  Written by nitorchSee less",
        "runtimeMinutes": "73"
    },
    "2004_531": {
        "plotSummary": "",
        "runtimeMinutes": "85"
    },
    "2004_532": {
        "plotSummary": "John Kerry and his Mekong Delta Navy fastboat unit in Vietnam get together to relive their past and visit the Vietnam Veterans Memorial Wall in Washington, D.C.",
        "runtimeMinutes": "68"
    },
    "2004_533": {
        "plotSummary": "Bob Moog shaped musical culture with some of the most inspiring electronic instruments ever created. This \"compelling documentary portrait of a provocative, thoughtful and deeply sympathetic figure\" (New York Times) peeks into the ...See moreBob Moog shaped musical culture with some of the most inspiring electronic instruments ever created. This \"compelling documentary portrait of a provocative, thoughtful and deeply sympathetic figure\" (New York Times) peeks into the inventor's mind and the worldwide phenomenon he fomented.  Written by ZU33See less",
        "runtimeMinutes": "72"
    },
    "2004_534": {
        "plotSummary": "COCKFIGHT is a voyage into the underground world of rooster fighting. The film chronicles the harrowing and hilarious adventures of three wildly different characters. The first, Manuel, is a salty 73-year old who attends illegal cockfights...See moreCOCKFIGHT is a voyage into the underground world of rooster fighting. The film chronicles the harrowing and hilarious adventures of three wildly different characters. The first, Manuel, is a salty 73-year old who attends illegal cockfights in California and fights to preserve the ancient but embattled sport. The second, Clara, is a vibrant Latina who was forced to quit cockfighting when the sport was outlawed in Arizona. The third, Larry, is a firebrand ex-patriot exiled to Mexico where he fights roosters for a living. Cockfight pierces the veil of secrecy that cloaks this enormously popular yet controversial activity. By bringing you in contact with people whose daily lives are defined by cockfighting, the film seeks to demonstrate how people can draw meaning, value and humor from something many see as savage and barbaric.  Written by Tiller Russell and Loren MendellSee less",
        "runtimeMinutes": "45"
    },
    "2004_535": {
        "plotSummary": "There are times when it's right and proper to simply bury the dead. This is not one of those times... Gram Parsons was one of the most influential musicians of his time; a bitter, brilliant, genius who knew Elvis, tripped with the Stones ...See moreThere are times when it's right and proper to simply bury the dead. This is not one of those times... Gram Parsons was one of the most influential musicians of his time; a bitter, brilliant, genius who knew Elvis, tripped with the Stones and fatally overdosed on morphine and tequila in 1973. And from his dying came a story. A story from deep within folklore; a story of friendship, honour and adventure; a story so extraordinary that if it didn't really happen, no one would believe it. Two men, a hearse, a dead rock star, five gallons of petrol, and a promise. And the most extraordinary chase of modern times.  Written by AnonymousSee less",
        "runtimeMinutes": "88"
    },
    "2004_536": {
        "plotSummary": "A cerebral and existential story of Tamla, a kitten from the Planet of Cats, who sets out to solve the mystery of her birth.",
        "runtimeMinutes": "92"
    },
    "2004_537": {
        "plotSummary": "The hero is an ordinary farmer, Philip Safronov, whose peaceful life is aggressively interrupted when his land is appropriated by a mysterious group to exploit its oil resources.",
        "runtimeMinutes": "95"
    },
    "2004_538": {
        "plotSummary": "The true-life story of 19-year-old Jürgen Bartsch, a German pedophile serial killer who murdered four boys, based on his correspondence, over the course of eight years, with German American author Paul Moor.",
        "runtimeMinutes": "83"
    },
    "2004_539": {
        "plotSummary": "A can of worms is opened within the Irish Catholic Church following two controversial incidents, the suicide of Frank Sweeney, a parish priest and the expulsion of Daniel McLaughlin, a young trainee priest from a nearby seminary, on the ...See moreA can of worms is opened within the Irish Catholic Church following two controversial incidents, the suicide of Frank Sweeney, a parish priest and the expulsion of Daniel McLaughlin, a young trainee priest from a nearby seminary, on the grounds that he was open to the sexual advances of a male colleague. A local journalist, David Foley, is convinced that Sweeney's death and Daniel's expulsion are linked. Desperate to clear his good name and be re-instated, Daniel agrees to talk to Foley. As the story gathers momentum, the Church closes ranks.  Written by http://www.beyond.com.au/film/catalogue/film_catalogue/5.html#conspiracy_of_silenceSee less",
        "runtimeMinutes": "90"
    },
    "2004_54": {
        "plotSummary": "Two strangers awaken in a room with no recollection of how they got there, and soon discover they're pawns in a deadly game perpetrated by a notorious serial killer.",
        "runtimeMinutes": "103"
    },
    "2004_540": {
        "plotSummary": "",
        "runtimeMinutes": "88"
    },
    "2004_541": {
        "plotSummary": "A struggling musician happens upon a nightclub that's frozen in time.",
        "runtimeMinutes": "98"
    },
    "2004_542": {
        "plotSummary": "A young French-Algerian woman travels to Algeria in search for her fiance. Determined to find his whereabouts, she is facing political and religious obstacles in a country that is struggling with the aftermath of a civil war.",
        "runtimeMinutes": "95"
    },
    "2004_543": {
        "plotSummary": "Motocross kids race about their farm.",
        "runtimeMinutes": "82"
    },
    "2004_544": {
        "plotSummary": "A young Afghan-American on a journey of \"self-discovery\".",
        "runtimeMinutes": "79"
    },
    "2004_545": {
        "plotSummary": "This romantic-kitsch story goes from Paris to Marseille, from Amsterdam to Morocco via Jean Genet's grave in Larache, and on to Tangiers. The movie tells the story of an Algerian-French heterosexual young man beginning a sociology study of...See moreThis romantic-kitsch story goes from Paris to Marseille, from Amsterdam to Morocco via Jean Genet's grave in Larache, and on to Tangiers. The movie tells the story of an Algerian-French heterosexual young man beginning a sociology study of gay islamic homosexualities and discovering gay love with a young French steward.  Written by up and outSee less",
        "runtimeMinutes": "70"
    },
    "2004_546": {
        "plotSummary": "A woman continuously solves crossword puzzles everywhere she goes; in subway trains, on buses, and on the streets of New York City.",
        "runtimeMinutes": "74"
    },
    "2004_547": {
        "plotSummary": "A documentary concerning the detention of Muslim-Americans in the wake of 9/11.",
        "runtimeMinutes": "63"
    },
    "2004_548": {
        "plotSummary": "Documentary on Rockets Redglare (aka Michael Morra), a colorful figure on the New York City art scene up until his death in 2001. In his life, Redglare was the bodyguard/drug dealer to Sid Vicious and Jean Michel Basquiat, a stand-up ...See moreDocumentary on Rockets Redglare (aka Michael Morra), a colorful figure on the New York City art scene up until his death in 2001. In his life, Redglare was the bodyguard/drug dealer to Sid Vicious and Jean Michel Basquiat, a stand-up comedian (he toured with Steve Buscemi), and an actor in over 30 films, including \"Stranger Than Paradise\", \"Down by Law\", and \"Mystery Train\". Redglare died from liver failure and hepatitis C, which was brought on by years of heroin abuse and plenty of other drugs.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2004_549": {
        "plotSummary": "Three groomsmen try to hook up with the wedding's bridesmaids.",
        "runtimeMinutes": "85"
    },
    "2004_55": {
        "plotSummary": "A nurse, a policeman, a young married couple, a salesman and other survivors of a worldwide plague that is producing aggressive, flesh-eating zombies, take refuge in a mega Midwestern shopping mall.",
        "runtimeMinutes": "101"
    },
    "2004_550": {
        "plotSummary": "This story is about how an old man tried to show his grandson the preciousness and beauty of life in a no win situation such as cancer. It is about keeping a positive attitude towards life.",
        "runtimeMinutes": "107"
    },
    "2004_551": {
        "plotSummary": "Julián Torralba is a former movie stuntman in Almeria, Spain. He and several of his colleagues, who once made a living in American Westerns shot in Spain, now are reduced to doing stunt shows for minuscule audiences on the decaying set ...See moreJulián Torralba is a former movie stuntman in Almeria, Spain. He and several of his colleagues, who once made a living in American Westerns shot in Spain, now are reduced to doing stunt shows for minuscule audiences on the decaying set built for those old Westerns. Julián wrestles with dark memories of the death of his son, also a stuntman, and with estrangement from his daughter-in-law Laura and her son Carlos. Carlos, a young boy, becomes intrigued with his late father's life and runs away to join Julián and his band of has-beens. There Carlos is initiated into the rambunctious life of these hard-drinking faux cowboys. But when Laura, a powerful executive looking for a new site for a tourist resort, learns that Carlos has joined the hated Julián, she moves to destroy even this remnant of Julián's once-proud career. Julián and the cowboys decide to fight back the only way they know how.  Written by Jim Beaver See less",
        "runtimeMinutes": "124"
    },
    "2004_552": {
        "plotSummary": "The doctor and soccer player in the leisure time Jo Hauser decides to move to Berlin and be an intern in a famous clinic, expecting to increase his knowledge and expertize, and help his handicap brother Willi Hauser. He joins a secret ...See moreThe doctor and soccer player in the leisure time Jo Hauser decides to move to Berlin and be an intern in a famous clinic, expecting to increase his knowledge and expertize, and help his handicap brother Willi Hauser. He joins a secret fraternity of doctors, under the leadership of Prof. Muller-LaRousse, who is researching the use of bionic muscles in human beings without any ethics or respect to the laws. The team is also volunteer to the experiences, and is under investigation of Paula Henning. When Jo gets close to a Filipino nurse, and becomes addicted in the drugs used in experience, he realizes the truth hidden in the methods used by the secret society in the development of science.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "101"
    },
    "2004_553": {
        "plotSummary": "Six Catholics share their thoughts and problems with Jesus in different churches. The camera accompanies them.",
        "runtimeMinutes": "87"
    },
    "2004_554": {
        "plotSummary": "A village elder veteran expecting his pension buys a mill on credit for the community, but the repeated requests ignored by the government bring back his fighting spirit.",
        "runtimeMinutes": "90"
    },
    "2004_56": {
        "plotSummary": "In Shanghai, China in the 1940s, a wannabe gangster aspires to join the notorious \"Axe Gang\" while residents of a housing complex exhibit extraordinary powers in defending their turf.",
        "runtimeMinutes": "99"
    },
    "2004_57": {
        "plotSummary": "A firefighter, injured and trapped in a burning building, has flashbacks of his life as he drifts in and out of consciousness. Meanwhile, fellow firefighters led by the Chief attempt to rescue him.",
        "runtimeMinutes": "115"
    },
    "2004_58": {
        "plotSummary": "A demon, raised from infancy after being conjured by and rescued from the Nazis, grows up to become a defender against the forces of darkness.",
        "runtimeMinutes": "122"
    },
    "2004_59": {
        "plotSummary": "Evan Treborn suffers blackouts during significant events of his life. As he grows up, he finds a way to remember these lost memories and a supernatural way to alter his life by reading his journal.",
        "runtimeMinutes": "113"
    },
    "2004_6": {
        "plotSummary": "Jack Hall, paleoclimatologist, must make a daring trek from Washington, D.C. to New York City to reach his son, trapped in the cross-hairs of a sudden international storm which plunges the planet into a new Ice Age.",
        "runtimeMinutes": "124"
    },
    "2004_60": {
        "plotSummary": "With their daughter, Blair, away, Luther and Nora Krank decide to skip Christmas all together until she decides to come home, causing an uproar when they have to celebrate it at the last minute.",
        "runtimeMinutes": "99"
    },
    "2004_61": {
        "plotSummary": "A girl makes a wish on her thirteenth birthday, and wakes up the next day as a thirty-year-old woman.",
        "runtimeMinutes": "98"
    },
    "2004_62": {
        "plotSummary": "In the midst of the Gulf War, soldiers are kidnapped and brainwashed for sinister purposes.",
        "runtimeMinutes": "129"
    },
    "2004_63": {
        "plotSummary": "A successful writer in the midst of a painful divorce is stalked at his remote lake house by a would-be scribe who accuses him of plagiarism.",
        "runtimeMinutes": "96"
    },
    "2004_64": {
        "plotSummary": "A romantic police captain breaks a beautiful member of a rebel group out of prison to help her rejoin her fellows, but things are not what they seem.",
        "runtimeMinutes": "119"
    },
    "2004_65": {
        "plotSummary": "Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.",
        "runtimeMinutes": "156"
    },
    "2004_66": {
        "plotSummary": "Ron Burgundy is San Diego's top-rated newsman in the male-dominated broadcasting of the 1970s, but that's all about to change for Ron and his cronies when an ambitious woman is hired as a new anchor.",
        "runtimeMinutes": "94"
    },
    "2004_67": {
        "plotSummary": "A shy woman, endowed with the speed, reflexes, and senses of a cat, walks a thin line between criminal and hero, even as a detective doggedly pursues her, fascinated by both of her personas.",
        "runtimeMinutes": "104"
    },
    "2004_68": {
        "plotSummary": "The new teacher at a severely administered boys' boarding school works to positively affect the students' lives through music.",
        "runtimeMinutes": "97"
    },
    "2004_69": {
        "plotSummary": "Years before Father Lankester Merrin helped save Regan MacNeil's soul, he first encounters the demon Pazuzu in East Africa. This is the tale of Father Merrin's initial battle with Pazuzu and the rediscovery of his faith.",
        "runtimeMinutes": "114"
    },
    "2004_7": {
        "plotSummary": "All hell breaks loose when the Byrnes family meets the Focker family for the first time.",
        "runtimeMinutes": "115"
    },
    "2004_70": {
        "plotSummary": "An eccentric, if not charming Southern professor and his crew pose as a classical ensemble in order to rob a casino, all under the nose of his unsuspecting but sharp old landlady.",
        "runtimeMinutes": "104"
    },
    "2004_71": {
        "plotSummary": "When two brothers are forced to fight in the Korean War, the elder decides to take the riskiest missions if it will help shield the younger from battle.",
        "runtimeMinutes": "140"
    },
    "2004_72": {
        "plotSummary": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories.",
        "runtimeMinutes": "108"
    },
    "2004_73": {
        "plotSummary": "After their friend dies, three men decide to fulfill their childhood dream by going on a camping expedition for the lost D. B. Cooper bounty, with calamitous results.",
        "runtimeMinutes": "95"
    },
    "2004_74": {
        "plotSummary": "To win a bet, an eccentric British inventor, beside his Chinese valet and an aspiring French artist, embarks on a trip full of adventures and dangers around the world in exactly eighty days.",
        "runtimeMinutes": "120"
    },
    "2004_75": {
        "plotSummary": "A scientific expedition sets out for Borneo to seek a flower called the Blood Orchid, which could grant longer life. Meanwhile, they run afoul of snakes and each other.",
        "runtimeMinutes": "97"
    },
    "2004_76": {
        "plotSummary": "A mouthy and feisty taxicab driver has hot tips for a green and inept cop set on solving a string of New York City bank robberies committed by a quartet of female Brazilian bank robbers.",
        "runtimeMinutes": "97"
    },
    "2004_77": {
        "plotSummary": "Routinely exploited by her wicked stepmother, the downtrodden Samantha Montgomery is excited about the prospect of meeting her Internet beau at the school's Halloween dance.",
        "runtimeMinutes": "95"
    },
    "2004_78": {
        "plotSummary": "Tells the story of a young woman's relentless search for her fiance, who has disappeared from the trenches of the Somme during World War One.",
        "runtimeMinutes": "133"
    },
    "2004_79": {
        "plotSummary": "The owner of an historic South Side Chicago barbershop is pressured to sell out to a land developer, but must face the impact this would have on his close-knit community.",
        "runtimeMinutes": "106"
    },
    "2004_8": {
        "plotSummary": "An adaptation of Homer's great epic, the film follows the assault on Troy by the united Greek forces and chronicles the fates of the men involved.",
        "runtimeMinutes": "163"
    },
    "2004_80": {
        "plotSummary": "An FBI profiler is called in by French Canadian police to catch a serial killer who takes on the identity of each new victim.",
        "runtimeMinutes": "103"
    },
    "2004_81": {
        "plotSummary": "The true story of Herb Brooks, the player-turned-coach who led the 1980 U.S. Olympic hockey team to victory over the seemingly invincible Soviet squad.",
        "runtimeMinutes": "135"
    },
    "2004_82": {
        "plotSummary": "The story of what happens after a master thief achieves his last big score, when the F.B.I. Agent who promised he'd capture him, is about to do just that.",
        "runtimeMinutes": "97"
    },
    "2004_83": {
        "plotSummary": "Two tigers are separated as cubs and taken into captivity, only to be reunited years later as enemies by an explorer who inadvertently forces them to fight each other.",
        "runtimeMinutes": "109"
    },
    "2004_84": {
        "plotSummary": "Based on H.G. Bissinger's book, which profiled the economically depressed town of Odessa, Texas and their heroic high school football team, The Permian High Panthers.",
        "runtimeMinutes": "118"
    },
    "2004_85": {
        "plotSummary": "A middle-aged ad exec is faced with a new boss who's nearly half his age... and who also happens to be sleeping with his daughter.",
        "runtimeMinutes": "110"
    },
    "2004_86": {
        "plotSummary": "After New York City receives a series of attacks from giant flying robots, a reporter teams up with a pilot in search of their origin, as well as the reason for the disappearances of famous scientists around the world.",
        "runtimeMinutes": "106"
    },
    "2004_87": {
        "plotSummary": "A young man receives an emergency phone call on his cell phone from an older woman. The catch? The woman claims to have been kidnapped; and the kidnappers have targeted her husband and child next.",
        "runtimeMinutes": "94"
    },
    "2004_88": {
        "plotSummary": "The dramatization of a motorcycle road trip Che Guevara went on in his youth that showed him his life's calling.",
        "runtimeMinutes": "126"
    },
    "2004_89": {
        "plotSummary": "A former U.S. soldier returns to his hometown to find it overrun by crime and corruption, which prompts him to clean house.",
        "runtimeMinutes": "86"
    },
    "2004_9": {
        "plotSummary": "When a son of a gangster shark boss is accidentally killed while on the hunt, his would-be prey and his vegetarian brother decide to use the incident to their own advantage.",
        "runtimeMinutes": "90"
    },
    "2004_90": {
        "plotSummary": "A woman and her daughter emigrate from Mexico for a better life in America, where they start working for a family where the patriarch is a newly celebrated chef with an insecure wife.",
        "runtimeMinutes": "131"
    },
    "2004_91": {
        "plotSummary": "An undercover FBI agent becomes a vigilante assassin and sets out to unleash his wrath upon the corrupt businessman who slaughtered his entire family at a reunion.",
        "runtimeMinutes": "124"
    },
    "2004_92": {
        "plotSummary": "Based on the true story of two scuba divers accidentally stranded in shark infested waters after their tour boat has left.",
        "runtimeMinutes": "79"
    },
    "2004_93": {
        "plotSummary": "Popular Broadway actor Gary Johnston is recruited by the elite counter-terrorism organization Team America: World Police. As the world begins to crumble around him, he must battle with terrorists, celebrities and falling in love.",
        "runtimeMinutes": "98"
    },
    "2004_94": {
        "plotSummary": "In order to achieve their dream of opening a recording studio, two friends (Omarion, Houston) must first win their city's dance contest -- a fierce competition that pits them against a group of tough street dancers.",
        "runtimeMinutes": "95"
    },
    "2004_95": {
        "plotSummary": "After her sister and brother-in-law die in a car accident, a young woman becomes the guardian of their three children.",
        "runtimeMinutes": "119"
    },
    "2004_96": {
        "plotSummary": "Fat Albert and the Cosby Kids come to life and step out of their animated, inner-city Philadelphia world.",
        "runtimeMinutes": "93"
    },
    "2004_97": {
        "plotSummary": "A listless and alienated teenager decides to help his new friend win the class presidency in their small western high school, while he must deal with his bizarre family life back home.",
        "runtimeMinutes": "96"
    },
    "2004_98": {
        "plotSummary": "The factual story of Spaniard Ramon Sampedro, who fought a thirty-year campaign in favor of euthanasia and his own right to die.",
        "runtimeMinutes": "126"
    },
    "2004_99": {
        "plotSummary": "A pro tennis player has lost his ambition and has fallen in rank to 119. Fortunately for him, he meets a young player on the women's circuit who helps him recapture his focus for Wimbledon.",
        "runtimeMinutes": "98"
    }
}