{
    "2005_1": {
        "plotSummary": "Harry Potter finds himself competing in a hazardous tournament between rival schools of magic, but he is distracted by recurring nightmares.",
        "runtimeMinutes": "157"
    },
    "2005_10": {
        "plotSummary": "A smooth-talking man falls for a hardened columnist while helping a shy accountant woo a beautiful heiress.",
        "runtimeMinutes": "118"
    },
    "2005_100": {
        "plotSummary": "Single-girl anxiety causes Kat Ellis to hire a male escort to pose as her boyfriend at her sister's wedding. Her plan, an attempt to dupe her ex-fiance, who dumped her a couple years prior, proves to be her undoing.",
        "runtimeMinutes": "90"
    },
    "2005_101": {
        "plotSummary": "The living dead have taken over the world, and the last humans live in a walled city to protect themselves as they come to grips with the situation.",
        "runtimeMinutes": "93"
    },
    "2005_102": {
        "plotSummary": "A tale of an inner city drug dealer who turns away from crime to pursue his passion, rap music.",
        "runtimeMinutes": "117"
    },
    "2005_103": {
        "plotSummary": "A thick mist full of vengeful spirits haunts a prosperous island town off the coast of Oregon, as its inhabitants try to learn their town's dark secret in order to stop it.",
        "runtimeMinutes": "100"
    },
    "2005_104": {
        "plotSummary": "A group of divers find themselves in deep trouble with a drug lord after they come upon the illicit cargo of a sunken airplane.",
        "runtimeMinutes": "110"
    },
    "2005_105": {
        "plotSummary": "Deuce is tricked again into man-whoring by T.J., only in Amsterdam while other man-whores are being murdered in his midst.",
        "runtimeMinutes": "83"
    },
    "2005_106": {
        "plotSummary": "A mother and daughter, still wounded from a bitter custody dispute, hole up in a run-down apartment building, where they are targeted by the ghost of a former resident.",
        "runtimeMinutes": "105"
    },
    "2005_107": {
        "plotSummary": "Unacquainted Emily and Oliver join the mile-high club together on the way from LAX to NYC--end of story. Except that they keep meeting constantly over the next seven years..",
        "runtimeMinutes": "107"
    },
    "2005_108": {
        "plotSummary": "An adaptation of the classic Dickens tale, where an orphan meets a pickpocket on the streets of London. From there, he joins a household of boys who are trained to steal for their master.",
        "runtimeMinutes": "130"
    },
    "2005_109": {
        "plotSummary": "Four best girlfriends hatch a plan to stay connected with one another as their lives start off in different directions: they pass around a pair of secondhand jeans that fits each of their bodies perfectly.",
        "runtimeMinutes": "119"
    },
    "2005_11": {
        "plotSummary": "A group of astronauts gain superpowers after a cosmic radiation exposure and must use them to oppose the plans of their enemy, Doctor Victor Von Doom.",
        "runtimeMinutes": "106"
    },
    "2005_110": {
        "plotSummary": "The crew of the ship Serenity try to evade an assassin sent to recapture one of their members who is telepathic.",
        "runtimeMinutes": "119"
    },
    "2005_111": {
        "plotSummary": "A young guy's only option to erase a really bad debt is to rig the Special Olympics by posing as a contestant.",
        "runtimeMinutes": "94"
    },
    "2005_112": {
        "plotSummary": "This program strives to give the viewer an impression of what it is like to actually be on the moon. It provides a romantic, inspirational depiction of the Apollo astronauts travels on the moon peppered by their quotations of their ...See moreThis program strives to give the viewer an impression of what it is like to actually be on the moon. It provides a romantic, inspirational depiction of the Apollo astronauts travels on the moon peppered by their quotations of their impressions.  Written by David FossSee less",
        "runtimeMinutes": "40"
    },
    "2005_113": {
        "plotSummary": "Cale Crane catalyzes the rescue and rehabilitation of Sonador, a race horse with a broken leg.",
        "runtimeMinutes": "106"
    },
    "2005_114": {
        "plotSummary": "After putting together another Broadway flop, down-on-his-luck producer Max Bialystock teams up with timid accountant Leo Bloom in a get-rich-quick scheme to put on the world's worst show.",
        "runtimeMinutes": "134"
    },
    "2005_115": {
        "plotSummary": "The fabled romantic Giacomo Casanova, after failing to win the affection of the Venetian woman Francesca Bruni, strives to discover the real meaning of love.",
        "runtimeMinutes": "112"
    },
    "2005_116": {
        "plotSummary": "A determined hairstylist (Queen Latifah) competes with her former boss (Kevin Bacon) after opening her own business in Atlanta.",
        "runtimeMinutes": "105"
    },
    "2005_117": {
        "plotSummary": "A police sergeant must rally the cops and prisoners together to protect themselves on New Year's Eve, just as corrupt policeman surround the station with the intent of killing all to keep their deception in the ranks.",
        "runtimeMinutes": "109"
    },
    "2005_118": {
        "plotSummary": "",
        "runtimeMinutes": "40"
    },
    "2005_119": {
        "plotSummary": "A grizzled little league coach tries to turn his team of misfits into champs.",
        "runtimeMinutes": "113"
    },
    "2005_12": {
        "plotSummary": "After ruining his reputation with the town, a courageous chicken must come to the rescue of his fellow citizens when aliens start an invasion.",
        "runtimeMinutes": "81"
    },
    "2005_120": {
        "plotSummary": "A mischievous dog befriends a lonely young girl in a new town and helps her make new friends.",
        "runtimeMinutes": "106"
    },
    "2005_121": {
        "plotSummary": "Blood-thirsty creatures await a pack of divers who become trapped in an underwater cave network.",
        "runtimeMinutes": "97"
    },
    "2005_122": {
        "plotSummary": "Eight unsuspecting high school seniors at a posh boarding school, who delight themselves on playing games of lies, come face-to-face with terror and learn that nobody believes a liar - even when they're telling the truth.",
        "runtimeMinutes": "90"
    },
    "2005_123": {
        "plotSummary": "This is the film version of the Pulitzer and Tony Award winning musical about Bohemians in the East Village of New York City struggling with life, love and AIDS, and the impacts they have on America.",
        "runtimeMinutes": "135"
    },
    "2005_124": {
        "plotSummary": "The story of the English exploration of Virginia, and of the changing world and loves of Pocahontas.",
        "runtimeMinutes": "135"
    },
    "2005_125": {
        "plotSummary": "Empowered by the love of a slave (Jang), a royal concubine (Cheung) is given the chance to make an extraordinary decision.",
        "runtimeMinutes": "121"
    },
    "2005_126": {
        "plotSummary": "Three backpackers stranded in the Australian outback are plunged inside a hellish nightmare of insufferable torture by a sadistic psychopathic local.",
        "runtimeMinutes": "99"
    },
    "2005_127": {
        "plotSummary": "After suffering a career-ending knee injury, a former college football star aligns himself with one of the most renowned touts in the sports-gambling business.",
        "runtimeMinutes": "122"
    },
    "2005_128": {
        "plotSummary": "A werewolf loose in Los Angeles changes the lives of three young adults who, after being mauled by the beast, learn they must kill it in order to avoid becoming werewolves themselves.",
        "runtimeMinutes": "97"
    },
    "2005_129": {
        "plotSummary": "When her husband unexpectedly disappears, a sharp-witted suburban wife and her daughters juggle their mom's romantic dilemmas and family dynamics.",
        "runtimeMinutes": "118"
    },
    "2005_13": {
        "plotSummary": "John Beckwith and Jeremy Grey, a pair of committed womanizers who sneak into weddings to take advantage of the romantic tinge in the air, find themselves at odds with one another when John meets and falls for Claire Cleary.",
        "runtimeMinutes": "119"
    },
    "2005_130": {
        "plotSummary": "Laura Henderson (Dame Judi Dench) buys an old London theater and opens it up as the Windmill, a performance hall which goes down in history for, amongst other things, its all-nude revues.",
        "runtimeMinutes": "103"
    },
    "2005_131": {
        "plotSummary": "With the help of her coach, her mom, and the boy who drives the Zamboni machine, nothing can stop Casey (Trachtenberg) from realizing her dream to be a champion figure skater.",
        "runtimeMinutes": "98"
    },
    "2005_132": {
        "plotSummary": "The extremely talented Santiago Muñez is spotted by a Newcastle United scout and given a chance at professional football.",
        "runtimeMinutes": "118"
    },
    "2005_133": {
        "plotSummary": "A young fighter named Kham must go to Australia to retrieve his stolen elephant. With the help of a Thai-born Australian detective, Kham must take on all comers, including a gang led by an evil woman and her two deadly bodyguards.",
        "runtimeMinutes": "111"
    },
    "2005_134": {
        "plotSummary": "A talking dog and his friends fight to stop an evil wizard.",
        "runtimeMinutes": "85"
    },
    "2005_135": {
        "plotSummary": "A modern-day pirate plans a massive attack on North and South Korea.",
        "runtimeMinutes": "124"
    },
    "2005_136": {
        "plotSummary": "A love-struck Italian poet is stuck in Iraq at the onset of an American invasion.",
        "runtimeMinutes": "114"
    },
    "2005_137": {
        "plotSummary": "A fictionalized account of the first major successful sexual harassment case in the United States, Jenson vs. Eveleth Mines, where a woman who endured a range of abuse while working as a miner filed and won the landmark 1984 lawsuit.",
        "runtimeMinutes": "126"
    },
    "2005_138": {
        "plotSummary": "After being wrongfully imprisoned for thirteen years and having her child taken away from her, a woman seeks revenge through increasingly brutal means.",
        "runtimeMinutes": "115"
    },
    "2005_139": {
        "plotSummary": "Five years after their summer together in Barcelona, Xavier, William, Wendy, Martine and Isabelle reunite.",
        "runtimeMinutes": "125"
    },
    "2005_14": {
        "plotSummary": "In a robot world, a young idealistic inventor travels to the big city to join his inspiration's company, only to find himself opposing its sinister new management.",
        "runtimeMinutes": "91"
    },
    "2005_140": {
        "plotSummary": "With help from his friends, a Memphis pimp in a mid-life crisis attempts to become a successful hip-hop emcee.",
        "runtimeMinutes": "116"
    },
    "2005_141": {
        "plotSummary": "A recounting of Domino Harvey's life story. The daughter of actor Laurence Harvey turned away from her career as a Ford model to become a bounty hunter.",
        "runtimeMinutes": "127"
    },
    "2005_142": {
        "plotSummary": "A Texas Ranger must protect a group of cheerleaders who have witnessed a murder.",
        "runtimeMinutes": "100"
    },
    "2005_143": {
        "plotSummary": "A Gulf war veteran is wrongly sent to a mental institution for insane criminals, where he becomes the object of a doctor's experiments, and his life is completely affected by them.",
        "runtimeMinutes": "103"
    },
    "2005_144": {
        "plotSummary": "The murderous, backwoods Firefly family take to the road to escape the vengeful Sheriff Wydell, who is not afraid of being as ruthless as his target.",
        "runtimeMinutes": "107"
    },
    "2005_145": {
        "plotSummary": "A lonely mother begins receiving romantic e-mails from a secret admirer, unaware that this perfect man is really a creation of her daughter who is trying to cheer her up.",
        "runtimeMinutes": "100"
    },
    "2005_146": {
        "plotSummary": "A Chicago weather man, separated from his wife and children, debates whether professional and personal success are mutually exclusive.",
        "runtimeMinutes": "102"
    },
    "2005_147": {
        "plotSummary": "Young employees at Shenaniganz restaurant collectively stave off boredom and adulthood with their antics.",
        "runtimeMinutes": "94"
    },
    "2005_148": {
        "plotSummary": "Desperate to provide care for her daughter, down-on-her-luck Jean moves in with her father in-law from whom she is estranged. Through time, they learn to forgive each other and heal old wounds.",
        "runtimeMinutes": "108"
    },
    "2005_149": {
        "plotSummary": "A pastor preoccupied with writing the perfect sermon fails to realize that his wife is having an affair, and his children are up to no good.",
        "runtimeMinutes": "99"
    },
    "2005_15": {
        "plotSummary": "Supernatural exorcist and demonologist John Constantine helps a policewoman prove her sister's death was not a suicide, but something more.",
        "runtimeMinutes": "121"
    },
    "2005_150": {
        "plotSummary": "The story of New Zealander Burt Munro, who spent years rebuilding a 1920 Indian motorcycle, which helped him set the land speed world record at Utah's Bonneville Salt Flats in 1967.",
        "runtimeMinutes": "127"
    },
    "2005_151": {
        "plotSummary": "A fantasy-thriller set in present-day Moscow where the respective forces that control daytime and nighttime do battle.",
        "runtimeMinutes": "114"
    },
    "2005_152": {
        "plotSummary": "In December 1914, an unofficial Christmas truce on the Western Front allows soldiers from opposing sides of the First World War to gain insight into each other's way of life.",
        "runtimeMinutes": "116"
    },
    "2005_153": {
        "plotSummary": "In the summer of 1978, a teenager and his group of friends face new challenges when their neighborhood roller-skating rink closes, forcing them to visit a different rink.",
        "runtimeMinutes": "112"
    },
    "2005_154": {
        "plotSummary": "An acclaimed college basketball coach is demoted to a junior varsity team after a public meltdown.",
        "runtimeMinutes": "86"
    },
    "2005_155": {
        "plotSummary": "A globetrotting hitman and a crestfallen businessman meet in a hotel bar in Mexico City in an encounter that draws them together in a way neither expected.",
        "runtimeMinutes": "96"
    },
    "2005_156": {
        "plotSummary": "A married couple is terrorized by a series of surveillance videotapes left on their front porch.",
        "runtimeMinutes": "117"
    },
    "2005_157": {
        "plotSummary": "A young boy is chosen as the defender of good and must team up with Japan's ancient spirits and creatures of lore to destroy the forces of evil.",
        "runtimeMinutes": "124"
    },
    "2005_158": {
        "plotSummary": "A murder mystery brings together a private eye, a struggling actress, and a thief masquerading as an actor.",
        "runtimeMinutes": "103"
    },
    "2005_159": {
        "plotSummary": "This is a story about a successful young R&B singer that has an unlikely homecoming when his father, the bishop, becomes ill.",
        "runtimeMinutes": "105"
    },
    "2005_16": {
        "plotSummary": "A bereaved woman and her daughter are flying home from Berlin to America. At 30,000 feet, the child vanishes, and nobody will admit she was ever on the plane.",
        "runtimeMinutes": "98"
    },
    "2005_160": {
        "plotSummary": "In the 1913 US Open, 20-year-old Francis Ouimet played golf against his idol, 1900 US Open champion, Englishman Harry Vardon.",
        "runtimeMinutes": "120"
    },
    "2005_161": {
        "plotSummary": "A preoperative transgender woman takes an unexpected journey when she learns that she fathered a son, now a teenage runaway hustling on the streets of New York.",
        "runtimeMinutes": "103"
    },
    "2005_162": {
        "plotSummary": "The daughter of a brilliant but mentally disturbed mathematician, recently deceased, tries to come to grips with her possible inheritance: his insanity. Complicating matters are one of her father's ex-students, who wants to search through ...See moreThe daughter of a brilliant but mentally disturbed mathematician, recently deceased, tries to come to grips with her possible inheritance: his insanity. Complicating matters are one of her father's ex-students, who wants to search through his papers, and her estranged sister, who shows up to help settle his affairs.See less",
        "runtimeMinutes": "100"
    },
    "2005_163": {
        "plotSummary": "Special Agent Derrick Vann is a man out to get the man who killed his partner, but a case of mistaken identity leads him to Andy Fiddler, a salesman with too many questions and a knack of getting in Vann's way.",
        "runtimeMinutes": "83"
    },
    "2005_164": {
        "plotSummary": "The film follows the surf and skateboarding trends that originated in Venice, California during the 1970's.",
        "runtimeMinutes": "107"
    },
    "2005_165": {
        "plotSummary": "Working class New York bus driver Ralph Kramden is always coming up with get-rich-quick schemes for him and his best friend, Ed Norton, who's always around to help him get in (and out of) trouble.",
        "runtimeMinutes": "90"
    },
    "2005_166": {
        "plotSummary": "James Cameron teams up with NASA scientists to explore the Mid-Ocean Ridge, a submerged chain of mountains that band the Earth and are home to some of the planet's most unique life forms.",
        "runtimeMinutes": "100"
    },
    "2005_167": {
        "plotSummary": "\"My Big Fat Independent Movie\" is a spoof along the lines of \"Scary Movie\" and \"Not Another Teen Movie.\" It includes parodies of some of the indie film world's most renowned movies such as \"Memento,\" \"Pulp Fiction,\" \"Magnolia,\" \"My Big Fat...See more\"My Big Fat Independent Movie\" is a spoof along the lines of \"Scary Movie\" and \"Not Another Teen Movie.\" It includes parodies of some of the indie film world's most renowned movies such as \"Memento,\" \"Pulp Fiction,\" \"Magnolia,\" \"My Big Fat Greek Wedding,\" \"Amelie,\" \"Run Lola Run,\" \"El Mariachi,\" \"The Good Girl,\" \"Pi,\" \"Swingers\" and many others.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2005_168": {
        "plotSummary": "Ranch foreman Pete Perkins looks to fulfill the promise to his recently deceased best friend by burying him in his hometown in Mexico.",
        "runtimeMinutes": "121"
    },
    "2005_169": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2005_17": {
        "plotSummary": "Balian of Ibelin travels to Jerusalem during the Crusades of the 12th century, and there he finds himself as the defender of the city and its people.",
        "runtimeMinutes": "144"
    },
    "2005_170": {
        "plotSummary": "Ethics, being human and the soul come to the fore when a 7-year old finds a bag of Pounds just days before the currency is switched to Euros and learns what we are really made of.",
        "runtimeMinutes": "98"
    },
    "2005_171": {
        "plotSummary": "A film adaptation of Steve Martin's novel about a complex love triangle between a bored salesgirl, a wealthy businessman and an aimless young man.",
        "runtimeMinutes": "106"
    },
    "2005_172": {
        "plotSummary": "A single mistake in the past, by a time travel company in the future, has devastating and unforeseen consequences.",
        "runtimeMinutes": "110"
    },
    "2005_173": {
        "plotSummary": "Follows two young boys dealing with their parents' divorce in Brooklyn in the 1980s.",
        "runtimeMinutes": "81"
    },
    "2005_174": {
        "plotSummary": "Will Thomas still lead a life of crime and cruelty, just like his thuggish father, or will he pursue his dream of becoming a pianist?",
        "runtimeMinutes": "108"
    },
    "2005_175": {
        "plotSummary": "The story of John Wilmot, a.k.a. the Earl of Rochester, a 17th century poet who famously drank and debauched his way to an early grave, only to earn posthumous critical acclaim for his life's work.",
        "runtimeMinutes": "114"
    },
    "2005_176": {
        "plotSummary": "A dramatization of the final days of Sophie Scholl, one of the most famous members of the German World War II anti-Nazi resistance movement, The White Rose.",
        "runtimeMinutes": "120"
    },
    "2005_177": {
        "plotSummary": "Taking place towards the end of WWII, 500 American Soldiers have been entrapped in a camp for 3 years. Beginning to give up hope they will ever be rescued, a group of Rangers goes on a dangerous mission to try and save them.",
        "runtimeMinutes": "132"
    },
    "2005_178": {
        "plotSummary": "A detective of the paranormal slowly unravels mysterious events with deadly results.",
        "runtimeMinutes": "99"
    },
    "2005_179": {
        "plotSummary": "A successful DJ manages to rescue a powerful mobster one night. In order to repay him, the mobster gives him the task of protecting his daughter.",
        "runtimeMinutes": "95"
    },
    "2005_18": {
        "plotSummary": "When an affluent couple lose all their money following a series of blunders, they turn to a life of crime to make ends meet.",
        "runtimeMinutes": "90"
    },
    "2005_180": {
        "plotSummary": "A shady lawyer attempts a Christmas Eve crime, hoping to swindle the local mob out of some money. But his partner, a strip club owner, might have different plans for the cash.",
        "runtimeMinutes": "92"
    },
    "2005_181": {
        "plotSummary": "A beautiful woman helps an inept scam artist get his game together.",
        "runtimeMinutes": "91"
    },
    "2005_182": {
        "plotSummary": "A drag queen comes to the rescue of a man who, after inheriting his father's shoe factory, needs to diversify his product if he wants to keep the business afloat.",
        "runtimeMinutes": "107"
    },
    "2005_183": {
        "plotSummary": "Six days in the violent life of a young Johannesburg gang leader.",
        "runtimeMinutes": "95"
    },
    "2005_184": {
        "plotSummary": "A Palestinian family is trapped inside a house commandeered by Israeli soldiers.",
        "runtimeMinutes": "90"
    },
    "2005_185": {
        "plotSummary": "A quirky take on life and relationships as it looks at a fairy tale with a bit of a squint and an endearing look at what being in love really means.",
        "runtimeMinutes": "158"
    },
    "2005_186": {
        "plotSummary": "The students of several New York City elementary schools learn ballroom dancing and compete in a city wide dance competition.",
        "runtimeMinutes": "105"
    },
    "2005_187": {
        "plotSummary": "Unable to get intimate with her husband of 10 years, a woman embarks on a steamy affair with his brother.",
        "runtimeMinutes": "89"
    },
    "2005_188": {
        "plotSummary": "A psychiatrist attempts to prevent one of his patients from committing suicide while trying to maintain his own grip on reality.",
        "runtimeMinutes": "99"
    },
    "2005_189": {
        "plotSummary": "Friendship and love in the world of prostitution in Madrid.",
        "runtimeMinutes": "113"
    },
    "2005_19": {
        "plotSummary": "Having recovered from wounds received in a failed rescue operation, Navy SEAL Shane Wolfe is handed a new assignment: Protect the five Plummer kids from enemies of their recently deceased father -- a government scientist whose top-secret ...See moreHaving recovered from wounds received in a failed rescue operation, Navy SEAL Shane Wolfe is handed a new assignment: Protect the five Plummer kids from enemies of their recently deceased father -- a government scientist whose top-secret experiment remains in the kids' house.See less",
        "runtimeMinutes": "95"
    },
    "2005_190": {
        "plotSummary": "A Journalist of Jewish descent in Berlin feels that he is a loser of the political changes in Germany after 1989. When his mother dies, he has to meet his brother to whom he has not talked for years and to meet all his other family members...See moreA Journalist of Jewish descent in Berlin feels that he is a loser of the political changes in Germany after 1989. When his mother dies, he has to meet his brother to whom he has not talked for years and to meet all his other family members. But during the preparations for the funeral he plays a snooker-cup for paying his debts with the money for the victory, and many other things mixes up.  Written by Benjamin StelloSee less",
        "runtimeMinutes": "95"
    },
    "2005_191": {
        "plotSummary": "This is a film about the leader of the 1857 mutiny and his fight against the British rule.",
        "runtimeMinutes": "150"
    },
    "2005_192": {
        "plotSummary": "A lonely shoe salesman and an eccentric performance artist struggle to connect in this unique take on contemporary life.",
        "runtimeMinutes": "91"
    },
    "2005_193": {
        "plotSummary": "A young boy, in an effort to have a normal childhood in 1980's El Salvador, is caught up in a dramatic fight for his life as he desperately tries to avoid the war which is raging all around him.",
        "runtimeMinutes": "120"
    },
    "2005_194": {
        "plotSummary": "A 1930s American socialite creates a scandal in the expatriate high society of the Amalfi Coast of Italy when she forms a secretive relationship with a wealthy American unbeknownst to his young wife.",
        "runtimeMinutes": "93"
    },
    "2005_195": {
        "plotSummary": "A wife and mother begins a downward emotional spiral, as her husband avoids their collapsing marriage by immersing himself in his 11 year-old daughter's quest to become a spelling bee champion.",
        "runtimeMinutes": "104"
    },
    "2005_196": {
        "plotSummary": "One hundred superstar comedians tell the same very, VERY dirty, filthy joke--one shared privately by comics since Vaudeville.",
        "runtimeMinutes": "89"
    },
    "2005_197": {
        "plotSummary": "At her new job in a rundown children's hospital, a nurse desperately tries to keep her patients safe from a plague of random, mysterious attacks.",
        "runtimeMinutes": "101"
    },
    "2005_198": {
        "plotSummary": "A family in financial crisis is forced to sell Lassie, their beloved dog. Hundreds of miles away from her true family, Lassie escapes and sets out on a journey home.",
        "runtimeMinutes": "100"
    },
    "2005_199": {
        "plotSummary": "A hearing impaired factory worker gives up her first holiday in years and instead travels out to an oil rig, where she cares for a man suffering from severe burns.",
        "runtimeMinutes": "115"
    },
    "2005_2": {
        "plotSummary": "Three years into the Clone Wars, the Jedi rescue Palpatine from Count Dooku. As Obi-Wan pursues a new threat, Anakin acts as a double agent between the Jedi Council and Palpatine and is lured into a sinister plan to rule the galaxy.",
        "runtimeMinutes": "140"
    },
    "2005_20": {
        "plotSummary": "Wallace and his loyal dog, Gromit, set out to discover the mystery behind the garden sabotage that plagues their village and threatens the annual giant vegetable growing contest.",
        "runtimeMinutes": "85"
    },
    "2005_200": {
        "plotSummary": "The new teacher at a severely administered boys' boarding school works to positively affect the students' lives through music.",
        "runtimeMinutes": "97"
    },
    "2005_201": {
        "plotSummary": "Happily Ever After is a trilogy. Each is a love story with a touch of magic, comedy and whimsy. Tying all the segments together is a seemingly fake fortune teller, who uses a science sphere she got at a novelty store as a crystal ball! \"I ...See moreHappily Ever After is a trilogy. Each is a love story with a touch of magic, comedy and whimsy. Tying all the segments together is a seemingly fake fortune teller, who uses a science sphere she got at a novelty store as a crystal ball! \"I LOVE YOU BABE\": Gio & Jenny are Gen Y youths belonging to two feuding families a la Romeo and Juliet in the colorful town of Barangay Kapayapaan. Gio is the son of the former Barangay Captain, a man who spends far 'too much time criticizing the new Barangay Captain, who is Jenny's mom. Gio has always had a crush on Jenny, whom he sends secret love letters to. Jenny likes to fantasize that the letters are from her boyfriend, the handsome but insensitive Briggs. When Gio's flirtatious girlfriend Barbie is involved in a cellphone video scandal and Jenny's boyfriend Briggs is revealed to be a closet homosexual, it seems that the stars are conspiring to bring Gio and Jenny together. Will their \"union\" finally bring Barangay Kapayapaan the elusive peace which it's been looking for? \"PLAYBOY KUBA\": When a jilted lover demands that handsome womanizer Vince marry her, he leaves Manila and flees to a faraway province to get away from her. There, Vince meets a lovely barrio lass named Laura. Like Vince, Laura too is being forced to marry someone she has no feelings for, the wealthy Eugene. Laura and Vince soon fall in love with one another in a secluded cave. But when he's told he can return to Manila because his \"stalker fiancee\" has left the country, Vince dumps Laura. What Vince doesn't know is that Laura's mother is a mangkukulam, and she places a curse on him which transforms him into an ugly, disfigured hunchback. A contemporary Filipino retelling of \"Beauty and The Beast\". \"MULTONG BAKLA\": Abby and her family return to the Philippines after several years in the USA. They move into an upper middle-class subdivision, where Abby meets Ogie, a handsome lower-middle class boy who plays for the neighborhood basketball team. Abby and Ogie soon become very fond of each other, but Abby's parents don't want their pretty teen daughter to have anything to do with the poor Ogie. Ogie discovers a large abandoned, unfinished house in the area where Abby's folks will never think of looking for them. Turns out, however, that the house is being haunted by the ghosts of gay houseboy Pampee and his 7-year old alaga Leeboy: death doesn't have to be the end of a great love life!  Written by REGALSee less",
        "runtimeMinutes": null
    },
    "2005_202": {
        "plotSummary": "Sabina has a regular life. She is satisfied with her job and her love for Franco. Lately nightmares start disturbing her, and almost in the same time she discovers to be pregnant. Step by step she remembers her childhood spent within a ...See moreSabina has a regular life. She is satisfied with her job and her love for Franco. Lately nightmares start disturbing her, and almost in the same time she discovers to be pregnant. Step by step she remembers her childhood spent within a severe middle-class family. But a big secret is hidden within her heart. Sabina wants to contact again her brother, a University teacher in the US, to try to understand what is happened in their past. What is the secret? She is determined to bring clarity and serenity in her life. She finally manages to free herself from her \"beast inside the heart\".  Written by 1felcoSee less",
        "runtimeMinutes": "120"
    },
    "2005_203": {
        "plotSummary": "A young detective goes undercover at an elite private school to destroy an international stolen car ring.",
        "runtimeMinutes": "95"
    },
    "2005_204": {
        "plotSummary": "A man embarks on journey to find his love in Dubai, only to learn she has different suitors and admirers.",
        "runtimeMinutes": "158"
    },
    "2005_205": {
        "plotSummary": "Bruno and Sonia, a young couple living off her benefit and the thefts committed by his gang, have a new source of money: their newborn son.",
        "runtimeMinutes": "95"
    },
    "2005_206": {
        "plotSummary": "A lawman apprehends a notorious outlaw and gives him nine days to kill his older brother, or else they'll execute his younger brother.",
        "runtimeMinutes": "104"
    },
    "2005_207": {
        "plotSummary": "An examination of life inside the Grande Chartreuse, the head monastery of the reclusive Carthusian Order in France. Read more: Synopsis",
        "runtimeMinutes": "169"
    },
    "2005_208": {
        "plotSummary": "A documentary about the Enron corporation, its faulty and corrupt business practices, and how they led to its fall.",
        "runtimeMinutes": "110"
    },
    "2005_209": {
        "plotSummary": "Set in colonial India against Gandhi's rise to power, it's the story of 8-year-old Chuyia, who is widowed and sent to a home to live in penitence; once there, Chuyia's feisty presence deeply affects the lives of the other residents.",
        "runtimeMinutes": "117"
    },
    "2005_21": {
        "plotSummary": "Prison inmates form a football team to challenge the prison guards.",
        "runtimeMinutes": "113"
    },
    "2005_210": {
        "plotSummary": "An aging cowboy movie star deserts a film set and tries to reconnect with his mother, whom he hasn't seen in thirty years, only to learn that he has a child he never knew about.",
        "runtimeMinutes": "122"
    },
    "2005_211": {
        "plotSummary": "Rize chronicles a dance movement that rises out of South Central Los Angeles with roots in clowning and street youth culture.",
        "runtimeMinutes": "86"
    },
    "2005_212": {
        "plotSummary": "Hoping to foil his own gold-digging wife's plan, a loathsome businessman arranges his own kidnapping, only to realize that there are plenty of other people interested in his wealth as well.",
        "runtimeMinutes": "95"
    },
    "2005_213": {
        "plotSummary": "Upon discovering a den of corrupt policemen, a fresh-faced journalist makes shaky allies in a jaded reporter and investigator for a powerful district attorney.",
        "runtimeMinutes": "99"
    },
    "2005_214": {
        "plotSummary": "Set in 1930s Shanghai, where a blind American diplomat develops a curious relationship with a young Russian refugee who works odd -- and sometimes illicit -- jobs to support members of her dead husband's aristocratic family.",
        "runtimeMinutes": "135"
    },
    "2005_215": {
        "plotSummary": "A devastating and heart-rending take on grizzly bear activists Timothy Treadwell and Amie Huguenard, who were killed in October of 2003 while living among grizzly bears in Alaska.",
        "runtimeMinutes": "103"
    },
    "2005_216": {
        "plotSummary": "A rookie policeman from provincial Le Havre volunteers for the high pressure Parisian homicide bureau and is assigned to a middle-aged woman detective.",
        "runtimeMinutes": "110"
    },
    "2005_217": {
        "plotSummary": "In the 1970s, a young trans woman, Patrick \"Kitten\" Braden, comes of age by leaving her Irish town for London, in part to look for her mother and in part because her gender identity is beyond the town's understanding.",
        "runtimeMinutes": "128"
    },
    "2005_218": {
        "plotSummary": "All but abandoned by her family in a London retirement hotel, an elderly woman strikes up a curious friendship with a young writer.",
        "runtimeMinutes": "108"
    },
    "2005_219": {
        "plotSummary": "A wrongfully expelled Harvard undergrad moves to London, where he is introduced to the violent underworld of football hooliganism.",
        "runtimeMinutes": "109"
    },
    "2005_22": {
        "plotSummary": "A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis, and Carl Perkins.",
        "runtimeMinutes": "136"
    },
    "2005_220": {
        "plotSummary": "Friedrich's boxing skills gets him in an elite Nazi high school in a castle in 1942. He enrolls against his dad's wish as it promises a brighter future. It's not what he expected.",
        "runtimeMinutes": "117"
    },
    "2005_221": {
        "plotSummary": "A young Jewish American man endeavors to find the woman who saved his grandfather during World War II in a Ukrainian village, that was ultimately razed by the Nazis, with the help of an eccentric local.",
        "runtimeMinutes": "106"
    },
    "2005_222": {
        "plotSummary": "After developing a flying web-cam Alain has his boss and wife over for dinner. She turns up to be very rude, and the same night Alain finds a live rare Scandinavian lemming clogging up the kitchen sink. The night things start going wrong.",
        "runtimeMinutes": "129"
    },
    "2005_223": {
        "plotSummary": "Two childhood friends are recruited for a suicide bombing in Tel Aviv.",
        "runtimeMinutes": "91"
    },
    "2005_224": {
        "plotSummary": "Karen O'Connor, a young journalist known for her celebrity profiles, is consumed with discovering the truth behind a long-buried incident that affected the lives and careers of showbiz team Vince Collins and Lanny Morris.",
        "runtimeMinutes": "107"
    },
    "2005_225": {
        "plotSummary": "7 Spanish top corporate job candidates are left in a room and informed on computer screens about their tasks and that one of them is an observer. Let the psyching begin.",
        "runtimeMinutes": "115"
    },
    "2005_226": {
        "plotSummary": "A comedy about two brothers, uptight Ed and playboy Cooper. Ed has a weekend to save his career, but Cooper has other plans for the weekend; to help his stressed out brother get lucky with the ladies.",
        "runtimeMinutes": "85"
    },
    "2005_227": {
        "plotSummary": "A couple's marriage is complicated by the introduction of a third party.",
        "runtimeMinutes": "85"
    },
    "2005_228": {
        "plotSummary": "The little Nansal finds a baby dog in the Mongolian veld, who becomes her best friend against all rejections of her parents.",
        "runtimeMinutes": "93"
    },
    "2005_229": {
        "plotSummary": "A dealer in \"outsider\" art travels from Chicago to North Carolina to meet her new in-laws, challenging the equilibrium of this middle class Southern home.",
        "runtimeMinutes": "106"
    },
    "2005_23": {
        "plotSummary": "The story of a forbidden and secretive relationship between two cowboys, and their lives over the years.",
        "runtimeMinutes": "134"
    },
    "2005_230": {
        "plotSummary": "A small town pair become the legendary Bunty and Babli as caper after caper they turn the world on its head. Till they meet a very upset cop.",
        "runtimeMinutes": "170"
    },
    "2005_231": {
        "plotSummary": "Faced with the suspicious death of their father, two brothers must motivate one another to get back on their bikes and take the Las Vegas Motocross Championships by storm.",
        "runtimeMinutes": "80"
    },
    "2005_233": {
        "plotSummary": "Set in the Little Saigon district outside of Sydney, a woman (Blanchett) trying to escape her past becomes embroiled in a drug deal.",
        "runtimeMinutes": "114"
    },
    "2005_234": {
        "plotSummary": "Five mothers cope with the drama that surrounds their gay sons at a mass wedding.",
        "runtimeMinutes": "107"
    },
    "2005_235": {
        "plotSummary": "A homeless musician finds meaning to his life when he starts a friendship with dozens of parrots.",
        "runtimeMinutes": "83"
    },
    "2005_236": {
        "plotSummary": "Marc is sitting in his bath one morning and asks his wife, \"how would you feel if I shaved off my mustache?\" She doesn't think it's a great idea, for the 15 years they've been married, she's never known him without his 'stache. He shaves ...See moreMarc is sitting in his bath one morning and asks his wife, \"how would you feel if I shaved off my mustache?\" She doesn't think it's a great idea, for the 15 years they've been married, she's never known him without his 'stache. He shaves it off anyway, but when he sees his wife, she doesn't notice, neither do their friends at dinner that night, neither do his co-workers. Marc finally flips out, shouts at everyone, tells them he's tired of their little joke, and what do they really think. His wife and co-workers are appalled, what is he talking about, he's never had a mustache. In fact, he's imagining other things as well, or is he?  Written by poco locoSee less",
        "runtimeMinutes": "87"
    },
    "2005_237": {
        "plotSummary": "\"G\" is a Gatsbyesque love story set against Hip-Hop's invasion of the Hamptons.",
        "runtimeMinutes": "97"
    },
    "2005_238": {
        "plotSummary": "When the retired seventy-seven years old hypochondriac widower Fred moves to an apartment in Madrid, his temperamental daughter Cuca has an incident with his next door neighbor, the elder Argentinean Elsa. Later, they meet each other and ...See moreWhen the retired seventy-seven years old hypochondriac widower Fred moves to an apartment in Madrid, his temperamental daughter Cuca has an incident with his next door neighbor, the elder Argentinean Elsa. Later, they meet each other and Elsa seduces Fred with her reckless behavior and view of life and they have a romance.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "108"
    },
    "2005_239": {
        "plotSummary": "A documentary on the effect of fishing the Nile perch in Tanzania's Lake Victoria. The predatory fish, which has wiped out the native species, is sold in European supermarkets, while starving Tanzanian families have to make do with the leftovers.",
        "runtimeMinutes": "107"
    },
    "2005_24": {
        "plotSummary": "Goaded by his buddies, a nerdy guy who's never \"done the deed\" only finds the pressure mounting when he meets a single mother.",
        "runtimeMinutes": "116"
    },
    "2005_240": {
        "plotSummary": "A fashion photographer with terminal cancer elects to die alone, preparing others to live past him rather than prolong the inevitable with chemotherapy or be smothered in sympathy by those who know him.",
        "runtimeMinutes": "81"
    },
    "2005_241": {
        "plotSummary": "The marriage between Gabrielle and Jean begins to fray after the discovery of a letter that belongs to Gabrielle.",
        "runtimeMinutes": "90"
    },
    "2005_242": {
        "plotSummary": "This drama centers on Hank Chinaski, the fictional alter-ego of \"Factotum\" author Charles Bukowski, who wanders around Los Angeles, CA trying to live off jobs which don't interfere with his primary interest, which is writing. Along the way...See moreThis drama centers on Hank Chinaski, the fictional alter-ego of \"Factotum\" author Charles Bukowski, who wanders around Los Angeles, CA trying to live off jobs which don't interfere with his primary interest, which is writing. Along the way, he fends off the distractions offered by women, drinking and gambling.See less",
        "runtimeMinutes": "94"
    },
    "2005_243": {
        "plotSummary": "14-year-old György's life is torn apart in WWII Hungary, as he is deported first to Auschwitz and then to Buchenwald, where he is forced to become a man in the midst of hatred, and what it really means to be Jewish.",
        "runtimeMinutes": "140"
    },
    "2005_244": {
        "plotSummary": "During one unusually hot and tragic weekend, four people struggle after hearing some life-changing news, this in turn brings them together.",
        "runtimeMinutes": "100"
    },
    "2005_245": {
        "plotSummary": "A Seattle musician's life and career are reminiscent to those of Kurt Cobain.",
        "runtimeMinutes": "97"
    },
    "2005_246": {
        "plotSummary": "For summer vacation, Marc (Melki) and Beatrix (Tedeschi) take their two kids to the seaside house of Marc's youth, where their daughter takes up with a biker and their sons roams the beach with his best friend, who is in love with him. ...See moreFor summer vacation, Marc (Melki) and Beatrix (Tedeschi) take their two kids to the seaside house of Marc's youth, where their daughter takes up with a biker and their sons roams the beach with his best friend, who is in love with him. Things get steamier when Beatrix's lover Mathieu shows up, and Marc's old flame appears.See less",
        "runtimeMinutes": "96"
    },
    "2005_247": {
        "plotSummary": "A neo-nazi sentenced to community service at a church clashes with the blindly devotional priest.",
        "runtimeMinutes": "94"
    },
    "2005_248": {
        "plotSummary": "A folk tale - supernatural love story about a ghost who falls in love with a newlywed woman.",
        "runtimeMinutes": "140"
    },
    "2005_249": {
        "plotSummary": "Ishwar Chandra Thakur is living the good life, content with his loving wife Sumitra and son Adiya. There is but one thing which gradually comes to annoy Ishwar: his son's laziness and dependency on his father. When Adiya marries his ...See moreIshwar Chandra Thakur is living the good life, content with his loving wife Sumitra and son Adiya. There is but one thing which gradually comes to annoy Ishwar: his son's laziness and dependency on his father. When Adiya marries his father's enemy's daughter and gets her pregnant, Ishwar decides to teach his son a lesson in the poverty that he himself experienced and fought himself out of.See less",
        "runtimeMinutes": "153"
    },
    "2005_25": {
        "plotSummary": "6 months after the incidents involving the lethal videotape, new clues prove that there is a new evil lurking in the darkness.",
        "runtimeMinutes": "110"
    },
    "2005_250": {
        "plotSummary": "Justin throws himself and everyone around him into chaos when he attempts to break free from his addiction to his thumb.",
        "runtimeMinutes": "96"
    },
    "2005_251": {
        "plotSummary": "A rib tickling tale of two flirts who constantly flirt with women despite one of them being engaged. Chaos ensues when the fiance finds out that her to-be groom is cheating on her.",
        "runtimeMinutes": "146"
    },
    "2005_252": {
        "plotSummary": "An ordinary 60 plus couple - Vidhyadhar Patwardhan and his wife are forced to search for their faith in human values and society after the death of their only son Amar. In the process they undergo the most testing struggle of their lives.",
        "runtimeMinutes": "132"
    },
    "2005_253": {
        "plotSummary": "In November of 1833, the state of Missouri turned a blind eye as hundreds of its peaceful inhabitants were hunted down and driven from their homes in the dead of night. Against this impending strife, a young man with a divine vision leads ...See moreIn November of 1833, the state of Missouri turned a blind eye as hundreds of its peaceful inhabitants were hunted down and driven from their homes in the dead of night. Against this impending strife, a young man with a divine vision leads a people against the aggression of an anti-hero with a vulnerable past. With more than two million copies sold, the second volume of Gerald N. Lund's epic series The Work and the Glory now brings a pivotal moment in American history to the big screen. \"The Work and The Glory: American Zion\" sets the story of the fictional Steed family against the historically factual backdrop of the Mormon people's move into the West. Divided by their diverse reactions to a nascent ideology, the Steeds struggle to hold together as the strength of their convictions and their filial bonds are tested. The stirring narrative of the faith that led a persecuted people to Missouri and beyond is one of the most poignant untold tales of American history. It is the account of a valiant struggle to exercise the rights promised by a fledgling nation. \"The Work and the Glory: American Zion\" unearths the story of the passion behind the movement which eventually launched the largest American migration and the colonization of the West: the vision of a promised land in America.  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "2005_254": {
        "plotSummary": "Young couple Carla (Maestro) and Martin (Leroux) are abducted by three men and spend a terrifying night in Caracas as they wait for Carla's father (Blades) to hand over the ransom.",
        "runtimeMinutes": "90"
    },
    "2005_255": {
        "plotSummary": "A deluded taxidermist plans the perfect crime.",
        "runtimeMinutes": "134"
    },
    "2005_256": {
        "plotSummary": "A love story about a young man who runs away up an isolated Australian river and gets a job with eighth generation oyster famers.",
        "runtimeMinutes": "91"
    },
    "2005_257": {
        "plotSummary": "Quadriplegics, who play full-contact rugby in wheelchairs, overcome unimaginable obstacles to compete in the Paralympic Games in Athens, Greece.",
        "runtimeMinutes": "88"
    },
    "2005_258": {
        "plotSummary": "Three Philadelphia-based gangstas -- Beans, Dame and Loco -- are on a collision course with one another for turf. Alliances are forged and broken and lifelong friendships end in violence as each crime lord schemes to get the upper hand.",
        "runtimeMinutes": "94"
    },
    "2005_259": {
        "plotSummary": "The adventures and misadventures of New York Spanish-language radio personalities Luis Jimenez and Moonshadow, from the morning program El Vacilón de la Mañana.",
        "runtimeMinutes": "90"
    },
    "2005_26": {
        "plotSummary": "A man living in a futuristic sterile colony begins to question his circumscribed existence when his friend is chosen to go to the Island, the last uncontaminated place on earth.",
        "runtimeMinutes": "136"
    },
    "2005_260": {
        "plotSummary": "Happy Endings weaves multiple stories to create a witty look at love, family and the sheer unpredictability of life itself.",
        "runtimeMinutes": "128"
    },
    "2005_261": {
        "plotSummary": "After having responded to her son's numerous letters in the guise of his father, a woman hires a stranger to pose as his dad when meeting him.",
        "runtimeMinutes": "105"
    },
    "2005_262": {
        "plotSummary": "A woman becomes very curious about one of her psychiatrist husband's inmates, a man who was found guilty in the murder and disfigurement of his former wife.",
        "runtimeMinutes": "99"
    },
    "2005_263": {
        "plotSummary": "A famous DJ in the Ibiza club scene finds the alcohol and drug-fueled party that is his life threatened by the progressive loss of his hearing.",
        "runtimeMinutes": "90"
    },
    "2005_264": {
        "plotSummary": "Captives of the very relationships that define and sustain them, nine women resiliently meet the travails and disappointments of life.",
        "runtimeMinutes": "115"
    },
    "2005_265": {
        "plotSummary": "An Orthodox Jewish couple's faith is tested after praying to the Lord for a child on the Succoth holiday.",
        "runtimeMinutes": "90"
    },
    "2005_266": {
        "plotSummary": "The lifelong romance between Lolita (Balan) and Shekar (Khan) is upset by the arrival of another man.",
        "runtimeMinutes": "130"
    },
    "2005_267": {
        "plotSummary": "A teenage hustler and a young man obsessed with alien abductions cross paths, together discovering a horrible, liberating truth.",
        "runtimeMinutes": "105"
    },
    "2005_268": {
        "plotSummary": "In Majdal Shams, the largest Druze village in Golan Heights on the Israeli-Syrian border, the Druze bride Mona is engaged to get married with Tallel, a television comedian that works in the Revolution Studios in Damascus, Syria. They have ...See moreIn Majdal Shams, the largest Druze village in Golan Heights on the Israeli-Syrian border, the Druze bride Mona is engaged to get married with Tallel, a television comedian that works in the Revolution Studios in Damascus, Syria. They have never met each other because of the occupation of the area by Israel since 1967; when Mona moves to Syria, she will lose her undefined nationality and will never be allowed to return home. Mona's father Hammed is a political activist pro-Syria that is on probation by the Israeli government. His older son Hatten married a Russian woman eight years ago and was banished from Majdal Shams by the religious leaders and his father. His brother Marwan is a wolf trader that lives in Italy. His sister Amal has two teenager daughters and has the intention to join the university, but her marriage with Amin is in crisis. When the family gathers for Mona's wedding, an insane bureaucracy jeopardizes the ceremony.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "97"
    },
    "2005_269": {
        "plotSummary": "In Patagonia, a mechanic who dreams of a different life starts to think big after his adopted pup wins first prize at a local dog show.",
        "runtimeMinutes": "97"
    },
    "2005_27": {
        "plotSummary": "Political intrigue and deception unfold inside the United Nations, where a U.S. Secret Service agent is assigned to investigate an interpreter who overhears an assassination plot.",
        "runtimeMinutes": "128"
    },
    "2005_270": {
        "plotSummary": "Saint Ralph is the unlikely story of Ralph Walker, a ninth grader who outran everyone's expectations except his own in his bold quest of trying to win the 1954 Boston Marathon.",
        "runtimeMinutes": "98"
    },
    "2005_271": {
        "plotSummary": "\"Being Cyrus\" is a dark, comedic venture by the debutante director Homi Adajania that spins around the Sethnas - a Parsi family.",
        "runtimeMinutes": "90"
    },
    "2005_272": {
        "plotSummary": "Narrative digressions on sex, race, politics, and more from comedienne Sarah Silverman.",
        "runtimeMinutes": "72"
    },
    "2005_273": {
        "plotSummary": "Ballets Russes is an intimate portrait of a group of pioneering artists -- now in their 70s, 80s and 90s -- who gave birth to modern ballet.",
        "runtimeMinutes": "118"
    },
    "2005_274": {
        "plotSummary": "An eleven-year-old girl watches her father come down with a crippling depression. Over one summer, she learns answers to several mysteries, and comes to terms with love and loss.",
        "runtimeMinutes": "108"
    },
    "2005_275": {
        "plotSummary": "Spanning twenty-four hours, Heights follows five New Yorkers challenged to choose their destiny before the sun comes up the next day.",
        "runtimeMinutes": "93"
    },
    "2005_276": {
        "plotSummary": "The cathartic tale of a young woman who can't see, hear or talk and the teacher who brings a ray of light into her dark world.",
        "runtimeMinutes": "122"
    },
    "2005_277": {
        "plotSummary": "Anjali, living in Canada with her parents, hides her relationship to the musician Raja from her parents. When her sister dies during the birth of twins, she abandons her love, marries the widower Aditya and moves to New Delhi to become the...See moreAnjali, living in Canada with her parents, hides her relationship to the musician Raja from her parents. When her sister dies during the birth of twins, she abandons her love, marries the widower Aditya and moves to New Delhi to become the new mother of her sister's children. Three years later, when Raja visits Delhi on his concert tour their love inflames again.  Written by Moritz Muehlenhoff See less",
        "runtimeMinutes": "151"
    },
    "2005_278": {
        "plotSummary": "A Chinese-American lesbian and her traditionalist mother are reluctant to go public with secret loves that clash against cultural expectations.",
        "runtimeMinutes": "91"
    },
    "2005_279": {
        "plotSummary": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
        "runtimeMinutes": "32"
    },
    "2005_28": {
        "plotSummary": "Nitta Sayuri reveals how she transcended her fishing-village roots and became one of Japan's most celebrated geisha.",
        "runtimeMinutes": "145"
    },
    "2005_280": {
        "plotSummary": "Kishan and Sunny's life are troubled after their womanizing friend Prem sets them up with a hooker named Bobby, leading to web of lies and confusions.",
        "runtimeMinutes": "158"
    },
    "2005_281": {
        "plotSummary": "Indigo is a film about loneliness, redemption, and the healing powers and grace of the new generation of Indigo (psychic and gifted) children being born into the world. Although the story is fictional, the emotions and actions of the film ...See moreIndigo is a film about loneliness, redemption, and the healing powers and grace of the new generation of Indigo (psychic and gifted) children being born into the world. Although the story is fictional, the emotions and actions of the film resonate with the spiritual dynamics of life today. The dramatic core of the film is the relationship that develops between a man whose life and family have dissolved due to a fateful mistake and his 10 year-old granddaughter with whom he goes on the run to protect her from a would-be kidnapper. Along the way, he discovers the power of his granddaughter's gifts which forever alter the lives of everyone she encounters.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2005_282": {
        "plotSummary": "A 10-year-old boy and an 11-year-old girl find love in New York City.",
        "runtimeMinutes": "84"
    },
    "2005_283": {
        "plotSummary": "Agents of an oil tycoon vanish while exploring a swamp marked for drilling. The local sheriff investigates and faces a Seminole legend come to life: Man-Thing, a shambling swamp-monster whose touch burns those who feel fear.",
        "runtimeMinutes": "106"
    },
    "2005_284": {
        "plotSummary": "A group of aspiring entertainers try to establish careers for themselves in the city of Los Angeles.",
        "runtimeMinutes": "97"
    },
    "2005_285": {
        "plotSummary": "Near the Iraqi-Turkish border on the eve of an American invasion, refugee children like 13-year-old Kak (Ebrahim), gauge and await their fate.",
        "runtimeMinutes": "98"
    },
    "2005_286": {
        "plotSummary": "Frank determines to salvage his self-esteem and tackle his demons by attempting the ultimate test of endurance - swimming the English Channel.",
        "runtimeMinutes": "95"
    },
    "2005_287": {
        "plotSummary": "An orphaned cheetah becomes the best friend and pet of a young boy living in South Africa.",
        "runtimeMinutes": "100"
    },
    "2005_288": {
        "plotSummary": "Five of the world's best snowboarders are taken to the mountains of Alaska for some outrageous \"Big Mountain\" rides.",
        "runtimeMinutes": "110"
    },
    "2005_289": {
        "plotSummary": "A father and daughter isolated on an island off the East Coast and living on a once-thriving commune grapple with the limits of family and sexuality.",
        "runtimeMinutes": "112"
    },
    "2005_29": {
        "plotSummary": "A movie that explores the dark and miserable town, Basin City, tells the story of three different people, all caught up in violent corruption.",
        "runtimeMinutes": "124"
    },
    "2005_290": {
        "plotSummary": "In a chain of unfortunate events, a 17-year-old schoolgirl narrowly escapes a possible rapist, is caught up in a terror attack, and drinks contaminated water that poisons her.",
        "runtimeMinutes": "180"
    },
    "2005_291": {
        "plotSummary": "A group of teenagers fear for their lives in the swamps of Louisiana, chased by Mr. Jangles, a man possessed by 13 evil souls, and now relentless in his pursuit of new victims.",
        "runtimeMinutes": "87"
    },
    "2005_292": {
        "plotSummary": "In a fantasy world of opposing kingdoms, a fifteen-year-old girl must find the fabled MirrorMask in order to save the kingdom and get home.",
        "runtimeMinutes": "101"
    },
    "2005_293": {
        "plotSummary": "The Virgin Mary delivers a message to an 11-year-old girl.",
        "runtimeMinutes": "83"
    },
    "2005_294": {
        "plotSummary": "Ben's dad, Sam, shows up one night with a note that Ben's mother has left. While Ben's wife and his three sisters try to find her, Ben takes Sam on a day trip to see a farmhouse that is for sale.",
        "runtimeMinutes": "96"
    },
    "2005_295": {
        "plotSummary": "A frustrated war correspondent, unable to find the war he's been asked to cover, takes the risky path of coopting the identity of a dead arms dealer acquaintance.",
        "runtimeMinutes": "126"
    },
    "2005_296": {
        "plotSummary": "A suspense thriller about a reporter from Miami who travels to Ecuador in pursuit of a serial killer known as the \"Monster of Babahoyo.\"",
        "runtimeMinutes": "108"
    },
    "2005_297": {
        "plotSummary": "Through the eyes of a British \"documentary\", this film takes a satirically humorous, and sometimes frightening, look at the history of an America where the South won the Civil War.",
        "runtimeMinutes": "89"
    },
    "2005_298": {
        "plotSummary": "An examination of the infamous pornographic film Deep Throat, covering aspects from the film's creation to its cultural impact.",
        "runtimeMinutes": "89"
    },
    "2005_299": {
        "plotSummary": "A tiger expert, his wife, two tourists and a village chief engage in a battle for survival against supernatural beasts within Jim Corbett National Wildlife Park.",
        "runtimeMinutes": "126"
    },
    "2005_3": {
        "plotSummary": "Four kids travel through a wardrobe to the land of Narnia and learn of their destiny to free it with the guidance of a mystical lion.",
        "runtimeMinutes": "143"
    },
    "2005_30": {
        "plotSummary": "The love life of Charlotte is reduced to an endless string of disastrous blind dates, until she meets the perfect man, Kevin. Unfortunately, his merciless mother will do anything to destroy their relationship.",
        "runtimeMinutes": "101"
    },
    "2005_300": {
        "plotSummary": "Aviva is thirteen, awkward and sensitive. Her mother Joyce is warm and loving, as is her father, Steve, a regular guy who does have a fierce temper from time to time. The film revolves around her family, friends and neighbors.",
        "runtimeMinutes": "100"
    },
    "2005_301": {
        "plotSummary": "Award-winning director Fatih Akin takes us on a journey through Istanbul, the city that bridges Europe and Asia, and challenges familiar notions of east and west. He looks at the vibrant musical scene which includes traditional Turkish ...See moreAward-winning director Fatih Akin takes us on a journey through Istanbul, the city that bridges Europe and Asia, and challenges familiar notions of east and west. He looks at the vibrant musical scene which includes traditional Turkish music plus rock and hip-hop.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2005_302": {
        "plotSummary": "In order to support her ten children, Evelyn Ryan enters a commercial jingle-writing contest.",
        "runtimeMinutes": "99"
    },
    "2005_303": {
        "plotSummary": "A story of slavery, set in the southern U.S. in the 1930s.",
        "runtimeMinutes": "139"
    },
    "2005_304": {
        "plotSummary": "Two youths sent for a Maoist \"re-education\" in the mountains fall in love with the village tailor's granddaughter.",
        "runtimeMinutes": "110"
    },
    "2005_305": {
        "plotSummary": "In this film, told almost entirely in iambic pentameter, She is a scientist in a loveless marriage to Anthony, a devious politician. He is a Lebanese doctor in self-imposed exile, working as a chef in a London restaurant. They meet at a ...See moreIn this film, told almost entirely in iambic pentameter, She is a scientist in a loveless marriage to Anthony, a devious politician. He is a Lebanese doctor in self-imposed exile, working as a chef in a London restaurant. They meet at a banquet and fall into a carefree, passionate relationship. But the contempt He perceives as a Muslim immigrant to the UK causes him to break up with She, offering little in the way of explanation, and return to his homeland. She drags his reasons out of him little by little and tries to sympathize. Keenly feeling the loss of his love, She flies to Havana to sort things out on the beach and in the cabarets. She sends him a ticket, but harbors no illusions that He will join her in this Carribean melting pot...  Written by Joe JurcaSee less",
        "runtimeMinutes": "100"
    },
    "2005_306": {
        "plotSummary": "A documentary on the Baja 1000, an annual off-road race held in Baja, Mexico that attracts hundreds of racers, their souped-up machines, and thousands of fans.",
        "runtimeMinutes": "97"
    },
    "2005_307": {
        "plotSummary": "American soldiers of the 2/3 Field Artillery, a group known as the \"Gunners,\" tell of their experiences in Baghdad during the Iraq War. Holed up in a bombed out pleasure palace built by Sadaam Hussein, the soldiers endured hostile ...See moreAmerican soldiers of the 2/3 Field Artillery, a group known as the \"Gunners,\" tell of their experiences in Baghdad during the Iraq War. Holed up in a bombed out pleasure palace built by Sadaam Hussein, the soldiers endured hostile situations some four months after President George W. Bush declared the end of major combat operations in the country.See less",
        "runtimeMinutes": "85"
    },
    "2005_308": {
        "plotSummary": "A young boy in a nameless, timeless American town establishes a gang of youthful misfits united in their love of guns and their code of honor.",
        "runtimeMinutes": "105"
    },
    "2005_309": {
        "plotSummary": "Three stories set in three times, 1911, 1966 and 2005. Two actors play the two main characters in each story.",
        "runtimeMinutes": "139"
    },
    "2005_31": {
        "plotSummary": "A detective and his team must rescue 8 people trapped in a factory by the twisted serial killer known as Jigsaw.",
        "runtimeMinutes": "93"
    },
    "2005_310": {
        "plotSummary": "Depicts the final twelve hours in the life of Jesus of Nazareth, on the day of his crucifixion in Jerusalem.",
        "runtimeMinutes": "127"
    },
    "2005_311": {
        "plotSummary": "When technical illustrator Tony Takitani asks his wife to resist her all-consuming obsession for designer clothes, the consequences are tragic.",
        "runtimeMinutes": "105"
    },
    "2005_312": {
        "plotSummary": "Two inner-city teenagers engage in an obsessive, innocent flirtation fueled by Lila's sexually explicit overtures.",
        "runtimeMinutes": "89"
    },
    "2005_313": {
        "plotSummary": "A diverse group of high school students band together to peacefully stick it to their overbearing principal. Read more: Synopsis",
        "runtimeMinutes": "91"
    },
    "2005_314": {
        "plotSummary": "A 15-year-old girl incites chaos among her friends and a media frenzy when she accuses her drama teacher of sexual harassment.",
        "runtimeMinutes": "110"
    },
    "2005_315": {
        "plotSummary": "A story about a man's personal struggle to victory in the 1971 Madison, Indiana hydro-plane regatta.",
        "runtimeMinutes": "94"
    },
    "2005_316": {
        "plotSummary": "Kothari finds himself in a jam when his hair-growth, water colors for students, and Agarbatti products misfire resulting in lawsuits. He decides to kill himself but is saved by three men: Raj, Veer and Aryan, who give him alternate ideas ...See moreKothari finds himself in a jam when his hair-growth, water colors for students, and Agarbatti products misfire resulting in lawsuits. He decides to kill himself but is saved by three men: Raj, Veer and Aryan, who give him alternate ideas to market his products with such positive results that he hires them. He finds out that all three married to Bhavna (who is so engrossed with Bhagwan Shri Tirupathi that she has no time for her Pati); Diya (a busy film actress); and Sonia (an equally busy lawyer) respectively but are sex-starved. He confides in them that he has three unmarried daughters, Rekha, Madhuri, and Dimple, who would prefer to fall in love with and then get married. He asks the trio to woo and then betray them so that he can get them married to boys of his choice. The trio agree to do so and re-locate abroad to meet the three females. To their pleasant surprise they turn out to be real beauties and they decide to woo and keep them. Aided by Kothari himself the trio have no problems in making the nymphets falls in love with them, and that done they return home to find that their respective wives have a newfound brother, Lakhwinder Singh Lakha. The Kothari sisters are unable to keep away from their lovers and follow them back home and the three males meet them on the sly. Hilarious complications, with a touch of popular Filmi dialogs and references to old Bollywood hits, arise when Lakhwinder discovers their dirty little secret and is all set to tell their respective wives leaving the hapless friends no choice but to decide to do away with him. Watch what happens after they finally succeed in doing away with Lakhwinder.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "129"
    },
    "2005_317": {
        "plotSummary": "A man befriends and protects a British girl from a group of nationalists that want England to hand India back to them. They fall for each other, but the man is due to marry.",
        "runtimeMinutes": "171"
    },
    "2005_318": {
        "plotSummary": "Vincke and Verstuyft are the best detectives of the Antwerp police department. They are confronted with the murder on a leading executive and put all their effort to catch the murderer.",
        "runtimeMinutes": "123"
    },
    "2005_319": {
        "plotSummary": "After reuniting with his mother in Ho Chi Minh City, a family tragedy causes Binh to flee from Viet Nam to America. Landing in New York, Binh begins a road trip to Texas, where his American father is said to live.",
        "runtimeMinutes": "137"
    },
    "2005_32": {
        "plotSummary": "A lawyer takes on a negligent homicide case involving a priest who performed an exorcism on a young girl.",
        "runtimeMinutes": "119"
    },
    "2005_320": {
        "plotSummary": "Hsiao-Kang, now working as a pornographic actor, meets Shiang-chyi once again. Meanwhile, the city of Taipei faces a water shortage that makes the sales of watermelons skyrocket.",
        "runtimeMinutes": "114"
    },
    "2005_321": {
        "plotSummary": "A beautiful Jewish young woman still living with her orthodox family in a Parisian suburb, falls in love with a Muslim co-worker.",
        "runtimeMinutes": "96"
    },
    "2005_322": {
        "plotSummary": "Two women embark on a road trip after they are brought together by circumstance. Rebecca (Portman) flees her hotel after a fight with her mother-in-law (Maura) and hails a taxi driven by Hanna (Lazlo).",
        "runtimeMinutes": "90"
    },
    "2005_323": {
        "plotSummary": "A Mafia family from New Jersey is placed in the Witness Relocation Program to an all-Mormon community in Utah.",
        "runtimeMinutes": "90"
    },
    "2005_324": {
        "plotSummary": "When Anthony's African-American girlfriend Alissa meets his Italian-American family at his grandfather's funeral, confrontations, confessions, and a hilarious race to the altar ensue!",
        "runtimeMinutes": "92"
    },
    "2005_325": {
        "plotSummary": "A man in his early 30s (Keane) struggles with the supposed loss of his daughter from the Port Authority Bus Terminal in New York, while fighting serious battles with schizophrenia. We can never be sure if the loss is real or imaginary; or ...See moreA man in his early 30s (Keane) struggles with the supposed loss of his daughter from the Port Authority Bus Terminal in New York, while fighting serious battles with schizophrenia. We can never be sure if the loss is real or imaginary; or whether his overt interest in helping young girls is innocent and of a fatherly nature, or is of a darker, scarier motive.  Written by Heidi LevittSee less",
        "runtimeMinutes": "100"
    },
    "2005_326": {
        "plotSummary": "By working through problems stemming from his past, Tom Warshaw, an American artist living in Paris, begins to discover who he really is, and returns to his home to reconcile with his family and friends.",
        "runtimeMinutes": "97"
    },
    "2005_327": {
        "plotSummary": "Based on a true story, this film tells the tale of the 1950 U.S. soccer team, who, against all odds, beat England 1 - 0 in the city of Belo Horizonte, Brazil. Although no U.S. team has ever won a World Cup title, this story is about the ...See moreBased on a true story, this film tells the tale of the 1950 U.S. soccer team, who, against all odds, beat England 1 - 0 in the city of Belo Horizonte, Brazil. Although no U.S. team has ever won a World Cup title, this story is about the family traditions and passions which shaped the lives of the players who made up this team of underdogs.See less",
        "runtimeMinutes": "101"
    },
    "2005_328": {
        "plotSummary": "Two affluent suburban girls clash with the Latino gang culture of East Los Angeles.",
        "runtimeMinutes": "85"
    },
    "2005_329": {
        "plotSummary": "To remedy his financial problems, a travel agent has his eye on a frozen corpse, which just happens to be sought after by two hitmen.",
        "runtimeMinutes": "100"
    },
    "2005_33": {
        "plotSummary": "Maggie Peyton, the new owner of Herbie, Number 53, the free-wheelin' Volkswagen bug with a mind of its own, puts the car through its paces on the road to becoming a NASCAR competitor.",
        "runtimeMinutes": "101"
    },
    "2005_330": {
        "plotSummary": "A darkly satiric story about life crumbling in the midst of a seemingly idyllic suburbia.",
        "runtimeMinutes": "108"
    },
    "2005_331": {
        "plotSummary": "A grief-stricken screenwriter unknowingly enters a three-way relationship with a woman and her film executive husband - to chilling results.",
        "runtimeMinutes": "92"
    },
    "2005_332": {
        "plotSummary": "In this suburban drama, a widower confronts his older son's decision to leave home and his younger son's self-destructive behavior.",
        "runtimeMinutes": "90"
    },
    "2005_333": {
        "plotSummary": "Twenty 12-year-old black boys from one of the most violent ghettos in Baltimore, Maryland, are taken 10,000 miles away to an experimental boarding school in rural Kenya, to try to take advantage of the educational opportunities they can't ...See moreTwenty 12-year-old black boys from one of the most violent ghettos in Baltimore, Maryland, are taken 10,000 miles away to an experimental boarding school in rural Kenya, to try to take advantage of the educational opportunities they can't get in their own country.  Written by frankfob2@yahoo.comSee less",
        "runtimeMinutes": "84"
    },
    "2005_334": {
        "plotSummary": "Take a joyride with Neal and Nikki as they travel all across Canada to find what they want most. And it's going to be quite a trip.",
        "runtimeMinutes": "122"
    },
    "2005_335": {
        "plotSummary": "A WWII Drama about a German/Jewish industrialist who, in order to ensure his family's safe passage out of Germany, is forced to hand over his business to the Nazis.",
        "runtimeMinutes": "120"
    },
    "2005_336": {
        "plotSummary": "A self-assured businessman murders his employer, the husband of his mistress, which unintentionally provokes an ill-fated chain of events.",
        "runtimeMinutes": "91"
    },
    "2005_337": {
        "plotSummary": "Young lovers in London are wrapped up in a love triangle that may not be exactly what it seems.",
        "runtimeMinutes": "92"
    },
    "2005_338": {
        "plotSummary": "During the holidays at a ski resort in Utah run by a Native American tribe, the overworked manager and a widowed woman from the big city overcome mistaken identities and intrusive guests in their pursuit of romance.",
        "runtimeMinutes": "96"
    },
    "2005_339": {
        "plotSummary": "Suryaveer, an ex-army officer, is assigned the task of protecting a young girl, Anamika. When Anamika gets kidnapped, he decides to use all his skills to rescue her.",
        "runtimeMinutes": "142"
    },
    "2005_34": {
        "plotSummary": "Despite trying to keep his swashbuckling to a minimum, a threat to California's pending statehood causes the adventure-loving Don Alejandro de la Vega and his wife, Elena, to take action.",
        "runtimeMinutes": "129"
    },
    "2005_340": {
        "plotSummary": "\"If you don't take risks, you'll have a wasted soul.\" - Drew Barrymore. Ever since the second grade when he first saw her in E.T. The Extraterrestrial, Brian Herzlinger has had a crush on Drew Barrymore. Now, 20 years later he's decided to...See more\"If you don't take risks, you'll have a wasted soul.\" - Drew Barrymore. Ever since the second grade when he first saw her in E.T. The Extraterrestrial, Brian Herzlinger has had a crush on Drew Barrymore. Now, 20 years later he's decided to try to fulfill his lifelong dream by asking her for a date. There's one small problem: She's Drew Barrymore and he's, well, Brian Herzlinger, a broke 27-year-old aspiring filmmaker from New Jersey. But that doesn't stop Brian and his film school pals from doing everything they can think of to convince Barrymore to go out with him - and documenting their quest along the way. Equipped with a video camera they have to return to Circuit City in 30 days and the $1,100 Brian won on a game show (where the winning answer was, prophetically, \"Drew Barrymore\"), they've got one month to accomplish their mission. To succeed, they'll need to negotiate an army of publicists, agents, producers and assistants who surround the star so Brian can pop the question. My Date with Drew is the award-winning, inspirational story of an ordinary guy who, despite incredibly long odds, puts everything on the line to pursue his lifelong dream. It's also an astute and often hilarious look at contemporary dating rituals, the culture of celebrity and the power of passion.  Written by Andrew HindesSee less",
        "runtimeMinutes": "90"
    },
    "2005_341": {
        "plotSummary": "Marcos lusts after his boss's promiscuous daughter, but after botching an extortion scheme, he becomes wracked with guilt.",
        "runtimeMinutes": "98"
    },
    "2005_342": {
        "plotSummary": "Years before Father Lankester Merrin helped save Regan MacNeil's soul, he first encounters the demon Pazuzu in East Africa. Merrin's initial battle with Pazuzu leads to the rediscovery of his faith.",
        "runtimeMinutes": "117"
    },
    "2005_343": {
        "plotSummary": "Krimo a 15 years old shy boy falls in love for Lídia who is his classmate.To be able to assume his love for her he decides to take a part in the play that was to be one of his friends.",
        "runtimeMinutes": "117"
    },
    "2005_344": {
        "plotSummary": "A chronicle of gay culture in New York during the post-Stonewall, pre-AIDs era.",
        "runtimeMinutes": "67"
    },
    "2005_345": {
        "plotSummary": "A collection of the best short, animated films from across the world curated by Mike Judge and Don Hertzfeldt.",
        "runtimeMinutes": "94"
    },
    "2005_346": {
        "plotSummary": "The story of the Hakoah Vienna Jewish womens swim team of the 1930s, their forced separation, and their reunion decades later.",
        "runtimeMinutes": "80"
    },
    "2005_347": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2005_348": {
        "plotSummary": "The taboo relationship between young Nadav and his Aunt Nina transcends definition on its way to odd highs and lows.",
        "runtimeMinutes": "106"
    },
    "2005_349": {
        "plotSummary": "A recovering alcoholic and recently converted Mormon, Arthur \"Killer\" Kane, of the rock band The New York Dolls, is given a chance at reuniting with his band after 30 years.",
        "runtimeMinutes": "75"
    },
    "2005_35": {
        "plotSummary": "Thinking he can overshadow an unknown actress in the part, an egocentric actor unknowingly gets a witch cast in an upcoming television remake of the classic sitcom Bewitched.",
        "runtimeMinutes": "102"
    },
    "2005_350": {
        "plotSummary": "A small town Pinewood Derby competition transforms an average group of dads into an awkward bunch of competitors.",
        "runtimeMinutes": "90"
    },
    "2005_351": {
        "plotSummary": "An exploration on the impact of urbanization and globalization on a traditional culture.",
        "runtimeMinutes": "143"
    },
    "2005_352": {
        "plotSummary": "Kamran is a 12 year old boy in the present day who discovers that his ancestor is the 11th Century Mathematician, Astronomer, Poet of Persia, Omar Khayyam. The story has been passed down in his family from one generation to another, and ...See moreKamran is a 12 year old boy in the present day who discovers that his ancestor is the 11th Century Mathematician, Astronomer, Poet of Persia, Omar Khayyam. The story has been passed down in his family from one generation to another, and now it is his responsibility to keep the story alive for future generations. The film takes us from the modern day to the epic past where the relationship between Omar Khayyam, Hassan Sabbah (the original creator of the sect of Assassins) and their mutual love for a beautiful woman separate them from their eternal bond of friendship. Filmed almost entirely on location in Samarkand and Bukhara, Uzbekistan.  Written by Kayvan Mashayekh, Writer/Director \"The Keeper: The Legend of Omar Khayyam\"See less",
        "runtimeMinutes": "95"
    },
    "2005_353": {
        "plotSummary": "A documentary following American women (some of whom emigrated from Afghanistan in the early 1980s) who return to the capital city of Kabul to open an American-style school for beauticians. Some of their students are women who maintained \"...See moreA documentary following American women (some of whom emigrated from Afghanistan in the early 1980s) who return to the capital city of Kabul to open an American-style school for beauticians. Some of their students are women who maintained \"underground\" beauty salons while the city was under strict Taliban control.  Written by RBFSSee less",
        "runtimeMinutes": "74"
    },
    "2005_354": {
        "plotSummary": "Lifelong friends Deco and Naldinho, who own a small steaming boat in Bahia, meet strip-dancer Karinna. Both men fall for her and their friendship is deeply shattered.",
        "runtimeMinutes": "98"
    },
    "2005_355": {
        "plotSummary": "Never-before-seen testimony is included in this documentary on Emmett Louis Till, who, in 1955, was brutally murdered after he whistled at a white woman.",
        "runtimeMinutes": "70"
    },
    "2005_356": {
        "plotSummary": "The lives of a street preacher, an aspiring actress, a Mormon missionary, and a young gang banger intersect in this ensemble drama set in present-day Santa Monica, California.",
        "runtimeMinutes": "128"
    },
    "2005_357": {
        "plotSummary": "A romance between young Parisians, shown through a series of vignettes.",
        "runtimeMinutes": "110"
    },
    "2005_358": {
        "plotSummary": "It is loosely based on Hans Christian Anderson's classic fairy tale. Because the evil prince Laird did not inherit the crown of Corazion, he sought his revenge by secretly switching his newborn daughter with that of his brother's, King ...See moreIt is loosely based on Hans Christian Anderson's classic fairy tale. Because the evil prince Laird did not inherit the crown of Corazion, he sought his revenge by secretly switching his newborn daughter with that of his brother's, King Heath. The real princess is raised as a peasant, unaware of her royal lineage. Years later, Prince Rollo comes to the kingdom in search of a wife. Unless Sebastian, the court historian, discovers the secret of the pea, dire consequences await the kingdom of Corazion. The plot thickens when Rollo meets and falls in love with a peasant girl. Though she is everything his heart desires, she is not a princess. With time running out, Laird returns with a scheme that could put him on the throne. The characters all come together for an exciting castle top finale, in which the fate of the kingdom will finally be decided.  Written by AnonymousSee less",
        "runtimeMinutes": "75"
    },
    "2005_359": {
        "plotSummary": "Sophie Jacobs is going through the most difficult time of her life. Now, she just has to find out if it's real.",
        "runtimeMinutes": "73"
    },
    "2005_36": {
        "plotSummary": "Based on the true story of the Black September aftermath, about the five men chosen to eliminate the ones responsible for that fateful day.",
        "runtimeMinutes": "164"
    },
    "2005_360": {
        "plotSummary": "A chronicle of the sordid life and suspicious death of Rolling Stones co-founder Brian Jones, who was found in the bottom of his swimming pool weeks after being let go from the band.",
        "runtimeMinutes": "102"
    },
    "2005_361": {
        "plotSummary": "Halloween in West Hollywood, two guys making out in a park are interrupted by a serial killer. Later that night, a group of gay kids decide to visit to the site of the murders.",
        "runtimeMinutes": "84"
    },
    "2005_362": {
        "plotSummary": "In the style of a Howard Hawks comedy, Baxter follows the twists and turns of a young man's life during the two weeks before his wedding.",
        "runtimeMinutes": "91"
    },
    "2005_363": {
        "plotSummary": "A documentary about the rise of anti-Semitism in the USA after the terrorist attacks of September 11, 2001.",
        "runtimeMinutes": "95"
    },
    "2005_364": {
        "plotSummary": "A documentary which explores the connections among sound, rhythm, time, and the body by following percussionist Evelyn Glennie, who is nearly deaf.",
        "runtimeMinutes": "99"
    },
    "2005_365": {
        "plotSummary": "A Russian woman living in Memphis with a much older rock-'n'-roll legend experiences a personal awakening when her husband's estranged son comes to visit.",
        "runtimeMinutes": "108"
    },
    "2005_366": {
        "plotSummary": "A distant, slightly dysfunctional family is brought closer together when the father's long-estranged Uncle Nino comes from Italy to Chicago for a surprise visit.",
        "runtimeMinutes": "104"
    },
    "2005_367": {
        "plotSummary": "A 16th century prince falls in love with a court dancer and battles with his emperor father.",
        "runtimeMinutes": "197"
    },
    "2005_368": {
        "plotSummary": "A dark, offbeat comedy about a group of Mexico City teens embroiled in a kidnapping involving a retired wrestling legend and a parrot.",
        "runtimeMinutes": "99"
    },
    "2005_369": {
        "plotSummary": "Flama and Moko are fourteen years old; they have been best friends since they were kids. They have everything they need to survive yet another boring Sunday: an apartment without parents, videogames, porn magazines, soft drinks and pizza ...See moreFlama and Moko are fourteen years old; they have been best friends since they were kids. They have everything they need to survive yet another boring Sunday: an apartment without parents, videogames, porn magazines, soft drinks and pizza delivery. The electricity company, Rita, the neighbor, Ulises, a pizza deliveryman, eleven seconds, the Real Madrid-Manchester game, some chocolate brownies and a horrible painting of ducks, all combine to break the harmony of what promised to be a placid Sunday, and reveal issues such as the parents' divorce, loneliness, the confusion between adolescent love and friendship, as well as frustration in adult life. \"Temporada de Patos\" is a movie that shows that, when the lights go off, we can see the stars.  Written by Syndicat Francais de la Critique de CinemaSee less",
        "runtimeMinutes": "90"
    },
    "2005_37": {
        "plotSummary": "The Bakers, while on vacation, find themselves competing with a rival family of eight children. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2005_370": {
        "plotSummary": "After getting dumped by his slutty girlfriend, Caleb falls in love with Gwen. However, thanks to Caleb's roommate, Gwen thinks he's gay and sets him up with her roommate, Marc.",
        "runtimeMinutes": "90"
    },
    "2005_371": {
        "plotSummary": "In a small town of rolling fields and endless skies, isolated 16 year old Mason lives in a world where families exist in fragmented silence and love seems to have gone missing. Then Mason meets Danny, a sensitive and troubled girl, and ...See moreIn a small town of rolling fields and endless skies, isolated 16 year old Mason lives in a world where families exist in fragmented silence and love seems to have gone missing. Then Mason meets Danny, a sensitive and troubled girl, and their tender bond is soon tested after a fatal accident and a series of complications takes Mason away for something he didn't do. Upon his return, the two find what they're looking for - but with tragic consequences.  Written by IMDB EditorsSee less",
        "runtimeMinutes": "94"
    },
    "2005_372": {
        "plotSummary": "This coming-of-age drama deals with a young man, realizing who he really is and which things he will never do. Loic, 18 years old, being annoyed by his work in a chocolate factory, cruises in the internet by night to have sex with older ...See moreThis coming-of-age drama deals with a young man, realizing who he really is and which things he will never do. Loic, 18 years old, being annoyed by his work in a chocolate factory, cruises in the internet by night to have sex with older men. His life is turned upside down by a row of events such as his friendship to a man who is not just interested in his body and the suicide of his best friend...  Written by fippi2000See less",
        "runtimeMinutes": "94"
    },
    "2005_373": {
        "plotSummary": "A high school has a tradition of dirty deeds the night before homecoming (if there's any volunteer) where, to win, the person performs 10 dirty deeds in 12 hours. Will Harper make it?",
        "runtimeMinutes": "87"
    },
    "2005_374": {
        "plotSummary": "Oscar-nominated filmmaker Daniel Anker spent five years with members of the Philadelphia Orchestra to craft this fascinating feature-length documentary uncovering the human side to the magic of making music.",
        "runtimeMinutes": "89"
    },
    "2005_375": {
        "plotSummary": "Momoko, a strange and seemingly emotionless girl obsessed with 18th century France, befriends a Yanki biker and the two experience the ups and downs of their unusual lives in a rural Japanese town.",
        "runtimeMinutes": "102"
    },
    "2005_376": {
        "plotSummary": "Giorgio's Lobster Farm has been a tradition in Brooklyn for over 65 years. Manned by an eccentric crew and serving the best seafood in the state, the renowned establishment now faces grave financial troubles. The Giorgio family must find a...See moreGiorgio's Lobster Farm has been a tradition in Brooklyn for over 65 years. Manned by an eccentric crew and serving the best seafood in the state, the renowned establishment now faces grave financial troubles. The Giorgio family must find a way to hold on to the business or risk losing the cornerstone of their identity. Under pressure, each member of the family is forced to take a new tack in their personal relationships.  Written by AnonymousSee less",
        "runtimeMinutes": "94"
    },
    "2005_377": {
        "plotSummary": "A drama loosely based on Jean Bernard's Nazi-era prison diary.",
        "runtimeMinutes": "98"
    },
    "2005_378": {
        "plotSummary": "A man takes up residence with a mysterious marquis and is soon persuaded to enter into an asylum for preventative therapy. Things are not what they seem, and the marquis may be even more sinister than what the young man may've predicted.",
        "runtimeMinutes": "118"
    },
    "2005_379": {
        "plotSummary": "Be Here to Love Me - Chronicles the fascinating and often turbulent life of musician Townes van Zandt.",
        "runtimeMinutes": "99"
    },
    "2005_38": {
        "plotSummary": "In the Antarctic, every March since the beginning of time, the quest begins to find the perfect mate and start a family.",
        "runtimeMinutes": "80"
    },
    "2005_380": {
        "plotSummary": "Depicts cross-cultural romance with ups and downs.",
        "runtimeMinutes": "144"
    },
    "2005_381": {
        "plotSummary": "Will, Kirby, and Danny are the hottest new sensation in Mormon pop music. Together, they make up the band \"Everclean\" and they have taken the Mormon boy band scene by storm, fighting to become the most spiritual Mormon boy band in history.",
        "runtimeMinutes": "93"
    },
    "2005_382": {
        "plotSummary": "Three overlapping stories of estranged families in three regions of North Carolina.",
        "runtimeMinutes": "95"
    },
    "2005_383": {
        "plotSummary": "A gripping, emotionally charged film that follows wrongfully convicted men freed by DNA evidence after decades in prison as they struggle to transition back into society.",
        "runtimeMinutes": "95"
    },
    "2005_384": {
        "plotSummary": "A fear-obsessed freelance cameraman (Shinya Tsukamoto) investigates an urban legend involving mysterious spirits that haunt the subways of Tokyo.",
        "runtimeMinutes": "92"
    },
    "2005_385": {
        "plotSummary": "A young boy trying to deal with his mother's heroin addiction befriends a waitress who helps him cope with the tough situation.",
        "runtimeMinutes": "96"
    },
    "2005_386": {
        "plotSummary": "Plaid-skirted schoolgirls are groomed by a secret government agency to become the newest members of the elite national-defense group, D.E.B.S.",
        "runtimeMinutes": "91"
    },
    "2005_387": {
        "plotSummary": "Abel Davos is a criminal, hunted in Italy. The police are closing in, so he and his pal Raymond arrange to flee back to France with Abel's wife, Therèse, and their two young sons. Abel and Raymond commit a brazen robbery to get funds, ...See moreAbel Davos is a criminal, hunted in Italy. The police are closing in, so he and his pal Raymond arrange to flee back to France with Abel's wife, Therèse, and their two young sons. Abel and Raymond commit a brazen robbery to get funds, killing two men; in the escape, more die. Abel arrives in Nice with the boys, calls his pals in Paris, and gets the brush-off. Reluctantly, they send a stranger, Eric Stark, to bring Abel to Paris, but he's getting the message he's on his own. Honor, friendship, and debt now count for little. What can Abel, a wanted man with two small children and only Stark as a friend, do? \"Never give ground,\" he tells Eric, but how long can he hold to his code?  Written by See less",
        "runtimeMinutes": "110"
    },
    "2005_388": {
        "plotSummary": "Meet Arjun Verma, a conman who plays the biggest odds and wins. Trained in the belly of Bombay, he knows how to score with women, money, and the law. His playground is his alone - AND NOBODY F***S WITH THAT...",
        "runtimeMinutes": "143"
    },
    "2005_389": {
        "plotSummary": "Two groups of people discover evidence that suggests spirits may be trying to invade the human world through the Internet.",
        "runtimeMinutes": "119"
    },
    "2005_39": {
        "plotSummary": "A governess uses magic to rein in the behavior of seven ne'er-do-well children in her charge.",
        "runtimeMinutes": "97"
    },
    "2005_390": {
        "plotSummary": "A young man returns home on the threshold of the Lunar New Year and finds himself a stranger within his own family. The cold silence surrounding the disappearance of his younger sister forces him on a quest for answers.",
        "runtimeMinutes": "89"
    },
    "2005_391": {
        "plotSummary": "An Asian cross-cultural trilogy of horror films from accomplished indie directors.",
        "runtimeMinutes": "118"
    },
    "2005_392": {
        "plotSummary": "Three high school guys attempt to make a porno movie.",
        "runtimeMinutes": "90"
    },
    "2005_393": {
        "plotSummary": "Marnie just graduated from college, drinks likes she's still in school, and is looking for a temporary job but a permanent boyfriend. She loves a guy who doesn't love her (?), ping-pongs between awkward romantic alternatives and even less ...See moreMarnie just graduated from college, drinks likes she's still in school, and is looking for a temporary job but a permanent boyfriend. She loves a guy who doesn't love her (?), ping-pongs between awkward romantic alternatives and even less suitable jobs.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2005_394": {
        "plotSummary": "A British documentary that follows two young North Korean girls as they prepare for the Mass Games, the world's largest choreographed gymnastics performance.",
        "runtimeMinutes": "94"
    },
    "2005_395": {
        "plotSummary": "THE FUTURE OF FOOD offers an in-depth investigation into the disturbing truth behind the unlabeled, patented, genetically engineered foods that have quietly filled grocery store shelves for the past decade.",
        "runtimeMinutes": "88"
    },
    "2005_396": {
        "plotSummary": "Twenty years after the accident that claimed his son's life and permanently injured his wife, a man returns to his home in search of redemption.",
        "runtimeMinutes": "106"
    },
    "2005_397": {
        "plotSummary": "Searching for The Wrong-Eyed Jesus is a captivating and compelling road trip through the creative spirit of the the Southern U.S. Director Andrew Douglas's film follows \"Alt Country\" singer Jim White through a gritty terrain of churches, ...See moreSearching for The Wrong-Eyed Jesus is a captivating and compelling road trip through the creative spirit of the the Southern U.S. Director Andrew Douglas's film follows \"Alt Country\" singer Jim White through a gritty terrain of churches, prisons, truck stops, biker bars and coal mines. This is a journey through a very real contemporary Southern U.S., a world of marginalised white people and their unique and home-made society. Along the way are road-side encounters with modern musical mavericks including The Handsome Family, Johnny Dowd, 16 Horsepower and David Johansen; old time banjo player Lee sexton; rockabilly and mountain Gospel churches - and novelist Harry Crews telling grisly stories down a dirt track.  Written by Steve HaismanSee less",
        "runtimeMinutes": "82"
    },
    "2005_398": {
        "plotSummary": "A Pakistani involved in a planned attack in New York City experiences a crisis of conscience.",
        "runtimeMinutes": "90"
    },
    "2005_399": {
        "plotSummary": "Having failed to break into professional opera in his native Germany (where, as an usher in West Berlin's Deutsche Oper, he would serenade the staff after the 'real' performances were over) the diminutive Klaus Nomi headed for NYC in 1972....See moreHaving failed to break into professional opera in his native Germany (where, as an usher in West Berlin's Deutsche Oper, he would serenade the staff after the 'real' performances were over) the diminutive Klaus Nomi headed for NYC in 1972. The vibrant New Wave/avant-garde gestalt of the mid/late '70's East Village proved to be fertile ground for the development of his unique talents. Working by day as a high-end pastry chef, Nomi began to stage his outlandish performances, first launching himself upon an unsuspecting public at the New Wave Vaudeville in 1978. The hip and cynical young audience was stunned by this weird combination of falsetto arias, booming classical orchestration, Kraftwerk-style electronica, futuristic costumes and outer space imagery. An odd assortment of artists, choreographers, designers, songwriters and musicians jumped on to the Nomi bandwagon and the phenomenon began to take off - first attracting thousands to South Manhattan events (including performances at the legendary Max's Kansas City) and culminating in a recording contract with the French division of RCA. With the release 'Klaus Nomi' in 1981 and 'Simple Man' in 1982, it looked as if Nomi was on the verge of superstardom. Having established himself in Europe, he made a triumphant return to New York City. But Nomi's moment of glory proved to be his swansong. Within only a few months Nomi had succumbed to the ravages of AIDS. One of the first celebrities to be killed by this mysterious new disease, Nomi died a lonely death, largely abandoned by those who had seen him as a passport to their own success. Today, the otherworldliness of 'The Cold Song' and 'Dido's Lament' is like an ethereal voice calling from beyond the grave.  Written by George DarleySee less",
        "runtimeMinutes": "98"
    },
    "2005_4": {
        "plotSummary": "As Earth is invaded by alien tripod fighting machines, one family fights for survival in this sci-fi action film.",
        "runtimeMinutes": "116"
    },
    "2005_40": {
        "plotSummary": "As a widower tries to piece together his life in the wake of his wife's suicide, his daughter finds solace, at first, in her imaginary friend.",
        "runtimeMinutes": "101"
    },
    "2005_400": {
        "plotSummary": "A friendship develops when 12-year-old Annie is coerced to stay with her Grandpa Donald.",
        "runtimeMinutes": "102"
    },
    "2005_401": {
        "plotSummary": "High school senior Dorian begins a gay man's odyssey when he determines that he's gay and decides to come out. Chief among concerns is the reaction of his father, who has never liked him.",
        "runtimeMinutes": "88"
    },
    "2005_402": {
        "plotSummary": "<p>Among India's one billion people exists a passionate and (to Western minds) eccentric community of 13 million Yogis. They live in a world never seen on film. </p><p>Paula Fouce?s NAKED IN ASHES is a groundbreaking documentary; which ...See more<p>Among India's one billion people exists a passionate and (to Western minds) eccentric community of 13 million Yogis. They live in a world never seen on film. </p><p>Paula Fouce?s NAKED IN ASHES is a groundbreaking documentary; which offers an unprecedented look at the Eastern Yogi. These mystics leave everything material to embark on a spiritual quest. With honest simplicity;NAKED IN ASHES provides a magical glimpse into the world of these sages who find deep meaning in a life of chastity; austerity; and utter devotion.From covering themselves for warmth in the ashes of the dead; to pulling automobiles by their genitalia; the film's candid portraits of ascetics whose only quest is to experience the Divine captivates both the eye and mind. </P>  Written by AnonymousSee less",
        "runtimeMinutes": "103"
    },
    "2005_403": {
        "plotSummary": "The story of Canadian Lt. Gen. Romeo Dallaire, and his controversial command of the United Nations mission to Rwanda during the 1994 genocide.",
        "runtimeMinutes": "90"
    },
    "2005_404": {
        "plotSummary": "A retired New York City couple drive across country to reconnect with their reclusive son, joined by their two unmarried daughters.",
        "runtimeMinutes": "97"
    },
    "2005_405": {
        "plotSummary": "A documentarian funds an N.Y.C. doorman's East Asian mail-order bride in exchange for the right to film the experience.",
        "runtimeMinutes": "92"
    },
    "2005_406": {
        "plotSummary": "Tomokawa is a tough guy turned bored cop who spends much of his time sating lonely housewives and looking after retarded teen Sukemasa. One day while hanging out at a bar, he is approached by a 15-year-old enjo kosai named Yoko, offering a...See moreTomokawa is a tough guy turned bored cop who spends much of his time sating lonely housewives and looking after retarded teen Sukemasa. One day while hanging out at a bar, he is approached by a 15-year-old enjo kosai named Yoko, offering a round of illicit sex in exchange for cash. Though he demurs, their paths cross again and soon a relationship of sorts forms. Yoko, it turns out, is Sukemasa's sister; and both are the children of his old flame Yukie, a grasping, self-centered woman. Moreover, Yoko's grandfather is responsible for the massive tattoo sprawling across Tomokawa's back. Tomokawa soon takes both teens under his wing, protecting them from their heartless mother, and their lecherous stepfather. Soon, Yoko gets a similarly massive tattoo illustrating her bond with her policeman savior.  Written by ShoujyoSee less",
        "runtimeMinutes": "132"
    },
    "2005_407": {
        "plotSummary": "This is the first film of Theo Angelopoulos' trilogy. The story starts in 1919 with some greek refugees from Odessa arriving somewhere near Thessaloniki. Among these people are two small kids, Alexis and Eleni. Eleni is an orphan and she ...See moreThis is the first film of Theo Angelopoulos' trilogy. The story starts in 1919 with some greek refugees from Odessa arriving somewhere near Thessaloniki. Among these people are two small kids, Alexis and Eleni. Eleni is an orphan and she is also taken care by Alexis' family. The refugees build a small village somewhere near a river and we watch as the kids grow up and fall in love. But difficult times of dictatorship and war are coming...  Written by Chris Makrozahopoulos See less",
        "runtimeMinutes": "170"
    },
    "2005_408": {
        "plotSummary": "At the real life School of Rock a group of misfit kids get in touch with their inner rock star.",
        "runtimeMinutes": "93"
    },
    "2005_409": {
        "plotSummary": "A writer dying of AIDS searches for a cure and human interaction in the hospitals and sex clubs of Buenos Aires.",
        "runtimeMinutes": "95"
    },
    "2005_41": {
        "plotSummary": "Sparks fly when spirited Elizabeth Bennet meets single, rich, and proud Mr. Darcy. But Mr. Darcy reluctantly finds himself falling in love with a woman beneath his class. Can each overcome their own pride and prejudice?",
        "runtimeMinutes": "129"
    },
    "2005_410": {
        "plotSummary": "Following a rough chronology from 1884 to 1894, when Norwegian artist Edvard Munch began expressionism and established himself as northern Europe's most maligned and controversial artist, the film also flashes back to the death from ...See moreFollowing a rough chronology from 1884 to 1894, when Norwegian artist Edvard Munch began expressionism and established himself as northern Europe's most maligned and controversial artist, the film also flashes back to the death from consumption of his mother, when he was five, his sister's death, and his near death at 13 from pulmonary disease. The film finds enduring significance in Munch's brief affair with \"Mrs. Heiberg\" and his participation in the cafe society of anarchist Hans Jaeger in Christiania and later in Berlin with Strindberg. Through it all comes Munch's melancholy and his desire to render on canvas, cardboard, paper, stone, and wood his innermost feelings.  Written by See less",
        "runtimeMinutes": "210"
    },
    "2005_411": {
        "plotSummary": "An eclectic cast of characters intertwines and collides around themes of faith, religion and race in a small East Texas town. Screen Door Jesus tells the story of the church-going, but not exactly God-fearing, town's folk who wake up one ...See moreAn eclectic cast of characters intertwines and collides around themes of faith, religion and race in a small East Texas town. Screen Door Jesus tells the story of the church-going, but not exactly God-fearing, town's folk who wake up one morning to discover the image of Jesus on Old Mother Harper's screen door. With media and crowds gathering around the phenomenon, and Jesus staring everyone straight in the face, it's time for people to take sides.  Written by AnonymousSee less",
        "runtimeMinutes": "119"
    },
    "2005_412": {
        "plotSummary": "Sunny Malhotra (Vivek Oberoi) is a 28 year old writer who has carved a name for himself as a popular agony uncle, named Gyan Guru, writing for the Times of Hindustan. Sunny also managed to bag a prestigious screenplay writing project for ...See moreSunny Malhotra (Vivek Oberoi) is a 28 year old writer who has carved a name for himself as a popular agony uncle, named Gyan Guru, writing for the Times of Hindustan. Sunny also managed to bag a prestigious screenplay writing project for the most happening film director, Karan Johar. A bit of a cynic, he believes he is a self-made man and that whatever he has achieved in life is due to his own hard work and nobody else's. His cynicism is extended to his views about marriage to his fiance Jenny (Ayesha Takia) and to the festival of Diwali too. Just as Sunny is cynical about life, Michael Burnett (Boman Irani) is optimistic about it. 51 year old Michael is a simple minded man, almost childlike and has recently landed job as a pizza delivery boy at Mummy's Pizza. Michael has sort of an inclination to lose every job he has ever had in 2 days flat. This time, however, he vows to keep this one no matter what. On the eve of Diwali, Sunny has loads of stuff to do and very little time to do it. He has to meet his screenplay deadline, he has to get rid of Pandey (Saurabh Shukla) his irritatingly intrusive next door neighbor and he's got to avoid his editor's telephone calls who is livid that he's bunking work. But more importantly he needs to get Jenny out of the way because he has a date with Maya (Mahima Chaudhary), a South Indian superstar who he has been in love with since as long as he can remember. In this confusion, Sunny forgets that there is no food in his bachelor pad and orders a pizza that Michael is given the task of delivering. And what Michael delivers to Sunny is so much more than just a pizza. Sunny is home delivered life's simple lessons right to his doorstep.  Written by gavin@sunny_deol2009@yahoo.comSee less",
        "runtimeMinutes": "151"
    },
    "2005_413": {
        "plotSummary": "For no apparent reason, a mute young woman assaults a youth who delivers water on his bicycle, injuring him and ruining his bike. Surprisingly, she asks him to feed her fish while she is in custody. Her tiny apartment, he discovers, is a ...See moreFor no apparent reason, a mute young woman assaults a youth who delivers water on his bicycle, injuring him and ruining his bike. Surprisingly, she asks him to feed her fish while she is in custody. Her tiny apartment, he discovers, is a shrine to his favorite escape, the movies. He finds her diary - a screenplay of her life built around scenes from favorite films - and it sets off his imagination. Maybe they have more in common than a love of the movies.  Written by See less",
        "runtimeMinutes": "93"
    },
    "2005_414": {
        "plotSummary": "In Nazi-occupied France, a Jewish child is sent away from his family and conceals his religious affiliation from the anti-Semitic elderly man that takes care of him.",
        "runtimeMinutes": "90"
    },
    "2005_415": {
        "plotSummary": "A retired woman spends her days snooping everybody in her neighborhood, until she thinks she sees a former Secretary of Justice commit murder and becomes a police informant.",
        "runtimeMinutes": "97"
    },
    "2005_416": {
        "plotSummary": "Shiza is the nickname of a 15-year-old boy. Money, power, and women - he has none of these, yet, in his young life. But, he does have the illegal, underground circuit of bare-knuckle fist-fighting, where he is able to eke out a living by ...See moreShiza is the nickname of a 15-year-old boy. Money, power, and women - he has none of these, yet, in his young life. But, he does have the illegal, underground circuit of bare-knuckle fist-fighting, where he is able to eke out a living by scouting for fighters. When a man is accidentally killed in the ring, though, his life is changed forever. He decides that he should return the dead man's money to his widow and child. But, after he meets the woman, Shiza understands that he has real feelings of love for her. Now, he knows for whom he must earn money, no matter what the cost...  Written by AnonymousSee less",
        "runtimeMinutes": "86"
    },
    "2005_417": {
        "plotSummary": "A successful author, Liz, searches for her daughter, Rachel, in the Sinai Desert. There she meets a Bedouin storyteller who relays the unusual love story of a Western tourist and the son of a Bedouin Sheik named Najim. Their relationship ...See moreA successful author, Liz, searches for her daughter, Rachel, in the Sinai Desert. There she meets a Bedouin storyteller who relays the unusual love story of a Western tourist and the son of a Bedouin Sheik named Najim. Their relationship is torn apart when the American is exposed to a tribal ritual.See less",
        "runtimeMinutes": "86"
    },
    "2005_418": {
        "plotSummary": "A group of friends who take Halloween way too seriously kidnap Anna Nicole Smith's beloved pet Sugar-Pie. It's up to a bunch of drag queens dressed as Anna to bring Sugar-Pie back.",
        "runtimeMinutes": "92"
    },
    "2005_419": {
        "plotSummary": "In feudal India, a warrior (Khan) who renounces his role as the longitme enforcer to a local lord becomes the prey in a murderous hunt through the Himalayan mountains.",
        "runtimeMinutes": "86"
    },
    "2005_42": {
        "plotSummary": "Master explorer Dirk Pitt goes on the adventure of a lifetime of seeking out a lost Civil War battleship known as the \"Ship of Death\" in the deserts of West Africa while helping a WHO doctor being hounded by a ruthless dictator.",
        "runtimeMinutes": "124"
    },
    "2005_420": {
        "plotSummary": "Follows the choices made by three young women - one a drug dealer, one an addict, one a pregnant teen - in Jersey City.",
        "runtimeMinutes": "86"
    },
    "2005_421": {
        "plotSummary": "\"Assisted Living\" chronicles a day in the life of Todd, a janitor who \"Assisted Living\" is shot and staged in a real nursing home and gains",
        "runtimeMinutes": "78"
    },
    "2005_422": {
        "plotSummary": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
        "runtimeMinutes": "129"
    },
    "2005_423": {
        "plotSummary": "Five Indians living in London find themselves thrown together when two of them are implicated for a bomb blast. An Indian lawyer enters the scene to bail them out of their predicament.",
        "runtimeMinutes": "160"
    },
    "2005_424": {
        "plotSummary": "A rebellious young British bowls player teams with another older and more traditional player to take on the Australian bowls team.",
        "runtimeMinutes": "96"
    },
    "2005_425": {
        "plotSummary": "Shawn is the founder of the Mesa Frozen Entree Enthusiasts Club. He has inspired this group of fanatical collectors to attempt to host the world's first Frozen Entree Enthusiasts Convention. Shawn also sings for a local punk band that has ...See moreShawn is the founder of the Mesa Frozen Entree Enthusiasts Club. He has inspired this group of fanatical collectors to attempt to host the world's first Frozen Entree Enthusiasts Convention. Shawn also sings for a local punk band that has recently converted to Christian Rock as they find the Christian fans much easier to shock and impress. Milo Binder, a local Christian rock promoter and owner of an anti-abortion themed Christian cafe, assisted the band's conversion. As Shawn pursues the convention and Christian fame, Al (the bass player) pursues Shelly. Shelly is a mousy virgin who's infatuation with Shawn may be more than AL can overcome. NBT is a dark, edgy warts-and-all comedy that leaves nothing sacred.  Written by AnonymousSee less",
        "runtimeMinutes": "87"
    },
    "2005_426": {
        "plotSummary": "Through archival footage and dramatic readings of his personal writings, the life of Nazi Germany's Propaganda Minister, Josef Goebbels, is examined.",
        "runtimeMinutes": "108"
    },
    "2005_427": {
        "plotSummary": "A romance between a soldier and a country boy, wrapped around a Thai folk-tale involving a shaman with shape-shifting abilities.",
        "runtimeMinutes": "118"
    },
    "2005_428": {
        "plotSummary": "During the Cold War, Germany was divided into two states - East and West. This epic story tells about their dramatic connections.",
        "runtimeMinutes": "150"
    },
    "2005_429": {
        "plotSummary": "A comic portrait of a young woman's struggle with contemporary life in Los Angeles, as she juggles an acting career, friends and lovers.",
        "runtimeMinutes": "16"
    },
    "2005_43": {
        "plotSummary": "When a shy groom practices his wedding vows in the inadvertent presence of a deceased young woman, she rises from the grave assuming he has married her.",
        "runtimeMinutes": "77"
    },
    "2005_430": {
        "plotSummary": "A recently laid off factory worker kidnaps his former boss' friend's daughter, hoping to use the ransom money to pay for his sister's kidney transplant.",
        "runtimeMinutes": "129"
    },
    "2005_431": {
        "plotSummary": "Sweet and savvy talking golden retriever, Bailey (Jon Lovitz), is one doggone lucky pooch when his devoted owner, Constance Pennington (Jackie Burroughs), leaves him her entire billion-dollar fortune. Bailey is lucky, that is, until he ...See moreSweet and savvy talking golden retriever, Bailey (Jon Lovitz), is one doggone lucky pooch when his devoted owner, Constance Pennington (Jackie Burroughs), leaves him her entire billion-dollar fortune. Bailey is lucky, that is, until he becomes the target of an elaborately-designed dognap scheme hatched by Constance's nasty nephew Caspar (Tim Curry) and his money-hungry wife Dolores (Jennifer Tilly). The despicable duo's wicked plan is to ultimately gain custody of the canine so they can get their greedy paws on his inheritance. Unfortunately for them, there's a thing or two they don't know about Bailey. Not only does he have great street smarts, he has great pals too. Bailey's loyal guardian Theodore Maxwell (Dean Cain), kind-hearted animal advocate Marge Maggs (Laurie Holden), her daughter Samantha (Angela Vallee), and a clever border collie named Tessa (Melissa DiMarco) set out on a hilarious madcap adventure to free their four-legged friend and put the nasty dognappers out of business for good.  Written by Echo Bridge Home EntertainmentSee less",
        "runtimeMinutes": "90"
    },
    "2005_432": {
        "plotSummary": "",
        "runtimeMinutes": "86"
    },
    "2005_433": {
        "plotSummary": "Story of a tumultuous and complex relationship between a father (Mohan Agashe) and son (Ajay Devgan), set against the backdrop of a thriving kidnapping industry in the Hindi heartland of Bihar.",
        "runtimeMinutes": "173"
    },
    "2005_434": {
        "plotSummary": "The son of acclaimed cinematographer Haskell Wexler confronts his complex father by turning the camera on him. What results is a portrait of a difficult genius and a son's path out of the shadow of a famous father.",
        "runtimeMinutes": "95"
    },
    "2005_435": {
        "plotSummary": "Dash is the CEO of Roc-a-Fella records, home to hip-hop's biggest seller: Jay Z. The film tells the story of a beef between Dash and Z over a disconcertingly teenage looking party chick called Picasso.",
        "runtimeMinutes": "92"
    },
    "2005_436": {
        "plotSummary": "A celebrated painter receives a visit from a cardinal's assistant, who informs him that his mother could become a saint.",
        "runtimeMinutes": "105"
    },
    "2005_437": {
        "plotSummary": "An emotionally cold man leaves the safety of his Alpine home to seek a heart transplant and an estranged son.",
        "runtimeMinutes": "130"
    },
    "2005_438": {
        "plotSummary": "Robbie and Trey are gay, middle-class, suburban professionals. Life is good. Until the son of a fundamentalist preacher moves in next door.",
        "runtimeMinutes": "104"
    },
    "2005_439": {
        "plotSummary": "A look at the controversial author, philosopher and candidate for Slovenian presidency: Slavoj Zizek.",
        "runtimeMinutes": "71"
    },
    "2005_44": {
        "plotSummary": "Cousins Bo, Luke, and Daisy Duke, and their uncle Jesse, egg on the authorities of Hazzard County, Boss Hogg and Sheriff Coltrane.",
        "runtimeMinutes": "104"
    },
    "2005_440": {
        "plotSummary": "Margaret Cho returns to the concert stage with a \"killer\" one-woman show filmed live at the Warner Theatre in Washington D.C., Assassin features a fresh dose of Margaret's ground-breaking and controversial brand of humor.",
        "runtimeMinutes": "90"
    },
    "2005_441": {
        "plotSummary": "Despite facing the odds against cultural and language barriers, the pressure of representing a nation of 1.2 billion, as well as facing Shaquille O'Neal, the NBA's most dominant player, 7ft 6in Chinese basketball phenom Yao Ming succeeds ...See moreDespite facing the odds against cultural and language barriers, the pressure of representing a nation of 1.2 billion, as well as facing Shaquille O'Neal, the NBA's most dominant player, 7ft 6in Chinese basketball phenom Yao Ming succeeds in his first year in the NBA by finding friendship and support in his American translator, strength in the wisdom of his traditional Chinese values, and confidence in his own abilities. Through it all, Yao Ming became the most recognizable figure from China since Mao Tse Tung and a hero to millions around the globe.  Written by AnonymousSee less",
        "runtimeMinutes": "88"
    },
    "2005_442": {
        "plotSummary": "A jilted photographer goes on a mission to get back at her philandering model boyfriend and along the way discovers that not all love is created equal.",
        "runtimeMinutes": "91"
    },
    "2005_443": {
        "plotSummary": "Culture critic Jiminy Glick gets tied up in a murder case at the Toronto Film Festival.",
        "runtimeMinutes": "90"
    },
    "2005_444": {
        "plotSummary": "The story of one woman's personal battle for acceptance, but also a portrait of a political movement that has forever affected millions of lives in the Middle East.",
        "runtimeMinutes": "96"
    },
    "2005_445": {
        "plotSummary": "High school student Katie signs up for a trip to China, where she meets Lin, who has a facial deformity that discourages her from ever showing her face, but her friendship with Katie helps her start to see life in a new way.",
        "runtimeMinutes": "107"
    },
    "2005_446": {
        "plotSummary": "Former indie film \"guru\" John Pierson takes his family to Fiji for one year to run the world's most remote movie theater.",
        "runtimeMinutes": "110"
    },
    "2005_447": {
        "plotSummary": "A clothing designer tries to save her struggling boutique store by having a tumultuous weekend sale of her shop's inventory by playing on the addictions of shopping for the women of Beverly Hills.",
        "runtimeMinutes": "106"
    },
    "2005_448": {
        "plotSummary": "This is the story of Ami, a man who while unable to move any part of his body, still manages to move each and every one of us, as he teaches us a part of life's intimate dance.",
        "runtimeMinutes": "70"
    },
    "2005_449": {
        "plotSummary": "A woman stuck in a stale marriage struggles to raise her children and manage her secret drug habit. But when winter comes to her small town, her balancing act begins to come crashing down.",
        "runtimeMinutes": "104"
    },
    "2005_45": {
        "plotSummary": "Little Red Riding Hood, the Wolf, the Woodsman, and Granny all tell the police the events that led up to their encounter.",
        "runtimeMinutes": "80"
    },
    "2005_450": {
        "plotSummary": "Former Colt model and porn star Colton Ford left the skin flick business at 40 to return to a musical career along with his partner Blake Harper. This is is their story.",
        "runtimeMinutes": "85"
    },
    "2005_451": {
        "plotSummary": "Detective Raymond Pope is a detective of questionable morals, searching for his missing wife. His investigation leads him to the wealthy estate of the enigmatic Elizabeth Kane and her young maid Irina.",
        "runtimeMinutes": "107"
    },
    "2005_452": {
        "plotSummary": "A Drama revolving around 3 women's lives and how they are intertwined.",
        "runtimeMinutes": "107"
    },
    "2005_453": {
        "plotSummary": "Unable to tie the knot with his prozac captivated girlfriend, Cuban Filmmaker Sebastian Cortez, finds himself 30-years old and never in love. On his quest to finding...\"The One!\", Sebastian turns to friend/tour guide Daria who introduces ...See moreUnable to tie the knot with his prozac captivated girlfriend, Cuban Filmmaker Sebastian Cortez, finds himself 30-years old and never in love. On his quest to finding...\"The One!\", Sebastian turns to friend/tour guide Daria who introduces Sebastian to her sandbox of gay co-horts and the adventure of his life! From penis make overs, unlikely 3-ways to learning how to have the best climax, the unsophisticated but sexy Sebastian finds himself navigating through the uncharted waters of Hollywood, sexual politics and getting trapped between Mr. Big Time and...Toilet Man? Is this QUEER EYE FOR THE BI-GUY? Can a girl turn a straight man queer? Or is it just the endless margaritas talking? All these questions answered in this sardonic, hilarious and universal film about the pursuit of finding someone to permanently spoon with. A comedy for audiences of all persuasions regardless who is giving you that orgasm.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2005_454": {
        "plotSummary": "Ring legends such as The Fabulous Moolah and Gladys \"Kill 'Em\" Gillem Long provide candid insights into the history of women's professional wrestling.",
        "runtimeMinutes": "83"
    },
    "2005_455": {
        "plotSummary": "Welcome to the world of the pizza delivery driver! Join the ride with the rowdy gang from \"Bob's Pizza\" as they take us on all their crazy adventures around the neighborhood. Philosophize with SHELDON, honk your horn with FRIENDLY, drive ...See moreWelcome to the world of the pizza delivery driver! Join the ride with the rowdy gang from \"Bob's Pizza\" as they take us on all their crazy adventures around the neighborhood. Philosophize with SHELDON, honk your horn with FRIENDLY, drive your El Camino with MANG, run from dogs with RUPERT, scam a tip with TYLER, find the man of your dreams with Little DEBBIE, and get revenge on all the rude customers with PETER the Chinese food man! Meet the whole entertaining TOWN as this unconventional cast of characters unravels their personalities and paints for us a dead-on and WILDLY FUNNY portrait of pizza delivery.  Written by AnonymousSee less",
        "runtimeMinutes": "94"
    },
    "2005_456": {
        "plotSummary": "A Brazilian photocopier operator falls in love with a girl who lives in an opposite house and spends his evenings looking at her through his binoculars.",
        "runtimeMinutes": "123"
    },
    "2005_457": {
        "plotSummary": "If you are born disabled in Ghana, West Africa you are likely to be poisoned, or left to die by your family; and if you are not poisoned or left for dead, you're likely to be hidden away in a room; and if you're not hidden, you are ...See moreIf you are born disabled in Ghana, West Africa you are likely to be poisoned, or left to die by your family; and if you are not poisoned or left for dead, you're likely to be hidden away in a room; and if you're not hidden, you are destined to spend your lifetime begging on the streets. Of the twenty million people in Ghana, two million are disabled. This is the story of one disabled man whose mission-and purpose- is to change all that forever. In Emmanuel's Gift, filmmakers Lisa Lax and Nancy Stern have uncovered a story as compelling as it is important. Narrated by Oprah Winfrey, the film chronicles the life of Emmanuel Ofosu Yeboah, a young Ghanaian man born with a severely deformed right leg, who today, against incalculable odds, is opening minds, hearts and doors-and effecting social and political change throughout his country. While Emmanuel's message is vital: people with disabilities are valuable contributors to any society, his method is inspirational. Emmanuel begins his quest with a bicycle ride, over 600 kilometers, across Ghana with one leg-and continues to spread his vision with grit and resolve. Lisa Lax and Nancy Stern have been documenting Emmanuel's plight for over a year, having shot over 100 hours of powerful imagery. The film includes original footage shot in Ghana, California, Oregon and New York, as well as photographs and other acquired film/video of Emmanuel's early years. Through it all, they have created an intimate insight into the mind and heart of a visionary whose unforgettable journey transcends continents and cultures and becomes each of ours to share.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2005_458": {
        "plotSummary": "In the small, closed community of a provincial town, Magda tries to maintain a balance within a family facing many serious problems. The families apparently normal, bourgeois, every-day life will crack open, bringing to the surface hatred ...See moreIn the small, closed community of a provincial town, Magda tries to maintain a balance within a family facing many serious problems. The families apparently normal, bourgeois, every-day life will crack open, bringing to the surface hatred and passions of the kind that lie well-hidden in the mists of the nearby lake. An intense plot and a totally unexpected ending make up this film, which features characters who are vulnerable, innocent and ordinary, but who become ruthless and callous, worrying only about protecting their financial resources. The offences are disproportionately serious compared to the financial benefits they try to secure.  Written by Dr.DagglaSee less",
        "runtimeMinutes": "100"
    },
    "2005_459": {
        "plotSummary": "Annecy is no tourist destination for three working-class Algerian brothers and their father, in the months after their mother has died. Marc is deeply troubled: he tries to stiff drug dealers and then plots revenge. Christophe is released ...See moreAnnecy is no tourist destination for three working-class Algerian brothers and their father, in the months after their mother has died. Marc is deeply troubled: he tries to stiff drug dealers and then plots revenge. Christophe is released from jail, lands a job, and must overcome various temptations in order to keep it. Olivier, nearing 18, may be falling in love with Hicham, a young man who constantly practices capoeira on the shores of the lake. Both violence and fraternity are close to the surface of most interactions. How each brother emerges from his challenge comprises the film's drama. Is there any way in which these men can be a family?  Written by See less",
        "runtimeMinutes": "90"
    },
    "2005_46": {
        "plotSummary": "The story of James J. Braddock, a supposedly washed-up boxer who came back to become a champion and an inspiration in the 1930s.",
        "runtimeMinutes": "144"
    },
    "2005_460": {
        "plotSummary": "Hunky writer Markus returns home to find his boyfriend of four years naked with another man. Newly single, he begins waiting tables at a swinging Chelsea hotspot where the indelible supporting cast of co-workers offers conflicting ...See moreHunky writer Markus returns home to find his boyfriend of four years naked with another man. Newly single, he begins waiting tables at a swinging Chelsea hotspot where the indelible supporting cast of co-workers offers conflicting directions on the off-road map to love and lust in New York City. Peter insists on holding out for \"the one\", and Marilyn vows by her \"dating commandments.\" Meanwhile, lascivious Luke promises the film its title by delivering firecracker quips on the joys of his sexcapades. He believes that sleeping around is the best medicine for a broken heart. Despite disillusion, Markus falls for gorgeous model Tyler who doesn't \"do relationships\" because how can you promise to love somebody forever? Surprising twists, and unlikely advice await, but by the end of one unforgettable SLUTTY SUMMER, happily ever after may just be the answer.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2005_461": {
        "plotSummary": "A lesbian hires a male escort to her sister's wedding. She thinks of a scheme to get her ex-girlfriend back: he dates and dumps the ex.",
        "runtimeMinutes": "102"
    },
    "2005_462": {
        "plotSummary": "A man with a boring personality, job, life, and dumped by girlfriend, auditions at the community theater and gets the lead role as Cyrano despite no acting experience. It changes his life forever.",
        "runtimeMinutes": "106"
    },
    "2005_463": {
        "plotSummary": "Rusty (Hatosy) starts to pursue a path to a more meaningful life, thanks to his connection to Bob (Goldblum), the boyfriend of his mother, Mary (Lynch). His new take on life causes friction with his best friend, Dallas (Caan), and both men...See moreRusty (Hatosy) starts to pursue a path to a more meaningful life, thanks to his connection to Bob (Goldblum), the boyfriend of his mother, Mary (Lynch). His new take on life causes friction with his best friend, Dallas (Caan), and both men find their friendship pushed to its breaking point, causing them to make life-changing decisions.See less",
        "runtimeMinutes": "100"
    },
    "2005_464": {
        "plotSummary": "In 1864, due to frequent Apache raids from Mexico into the U.S., a Union officer decides to illegally cross the border and destroy the Apache, using a mixed army of Union troops, Confederate POWs, civilian mercenaries, and scouts.",
        "runtimeMinutes": "123"
    },
    "2005_465": {
        "plotSummary": "VOICES IN WARTIME is a feature-length documentary that sharply etches the experience of war through powerful images and the words of poets - unknown and world-famous. Soldiers, journalists, historians and experts on combat interviewed in ...See moreVOICES IN WARTIME is a feature-length documentary that sharply etches the experience of war through powerful images and the words of poets - unknown and world-famous. Soldiers, journalists, historians and experts on combat interviewed in VOICES IN WARTIME add diverse perspectives on war's effects on soldiers, civilians and society. In VOICES IN WARTIME, poets around the world, from the United States and Colombia, to Britain and Nigeria, to Iraq and India, share their views and experiences of war that extend beyond national borders and into the depth of the human soul. The film also brings to life how poetry and war have been intertwined since the beginning of recorded history - from ancient Babylonia and the fields of Troy - to the great conflicts of the 20th century and the current war in Iraq. The stirring words of poets of the past - Homer, Wilfred Owen, Siegfried Sassoon, Emily Dickinson, Langston Hughes, Walt Whitman and Shoda Shinoe from Hiroshima are combined with more recent voices: a Vietnam vet, poets in Baghdad, a poet whose family experienced the devastating war in Biafra. The poetry moves us to the emotion of war explained to us by soldiers, journalists and a doctor who have experienced the effects of combat first hand. The poetry illuminates the reality. And the documentary reality helps us to understand the poetry. Together they sear the experience, emotions and sacrifices of war into our hearts and minds. VOICES IN WARTIME gives the gut-wrenching experience of war a fresh perspective. It steps away to look at all wars - not just the conflicts currently in the news. The terrible beauty of the poetry is our guide, distilling the grim realities and divers emotions of war. History and literature have shown us that in times of war poets can lead us to greater truths and that the power of poetry can help us understand the trauma, violence and death caused by armed conflict. VOICES IN WARTIME uses the words of Wilfred Owen, considered by many to be the greatest poet of World War I, as a guide: \"Above all I am not concerned with Poetry. My subject is War, and the pity of War. The poetry is the pity...All a poet can do today is warn. That is why Poets must be truthful.\"  Written by Cinema Libre StudioSee less",
        "runtimeMinutes": "74"
    },
    "2005_466": {
        "plotSummary": "This feature documentary chronicles the last days of Dispatch, quite possibly the biggest band that never signed with a record label. In a time of upheaval in the music industry, their do-it-yourself style started a grassroots fan ...See moreThis feature documentary chronicles the last days of Dispatch, quite possibly the biggest band that never signed with a record label. In a time of upheaval in the music industry, their do-it-yourself style started a grassroots fan phenomenon that is changing the way indie bands (and record labels) do business. The band's final concert, \"The Last Dispatch\" drew 110,000 fans from every U.S. state and 20 foreign countries for one last free show in Boston in July of 2004.  Written by Sodium EntertainmentSee less",
        "runtimeMinutes": "81"
    },
    "2005_467": {
        "plotSummary": "Two teenage girls on a mission to find drugs at a rave get more than they bargained for. One is sexually assaulted and they are both tortured in horrific ways. The attackers seek refuge in the parents' of one of the victims' homes.",
        "runtimeMinutes": "74"
    },
    "2005_468": {
        "plotSummary": "A political thriller steeped in illegal oil trading, the Russian Mafia, and governmental cover-ups.",
        "runtimeMinutes": "107"
    },
    "2005_469": {
        "plotSummary": "A searing examination of the unrelenting Chechen conflict, observed through the prisms of a Russian military boys academy, a war-torn town and a children's refugee camp.",
        "runtimeMinutes": "106"
    },
    "2005_47": {
        "plotSummary": "Newlyweds are terrorized by demonic forces after moving into a large house that was the site of a grisly mass murder a year before.",
        "runtimeMinutes": "90"
    },
    "2005_470": {
        "plotSummary": "Filmmaker Christopher Browne documents the mission of a group of middle-aged bowlers as they attempt to revitalize the sport and get the television-watching public interested in it again.",
        "runtimeMinutes": "93"
    },
    "2005_471": {
        "plotSummary": "When a womanizer is accidentally struck dead by one of his many girlfriends, he is given a second chance - he is reincarnated as a WOMAN. This isn't a second chance, this is a punishment!",
        "runtimeMinutes": "136"
    },
    "2005_472": {
        "plotSummary": "The complex relationship between a wealthy French woman and her best friend a, gay black American, is thrown into turmoil when her estranged daughter comes to visit them with her new husband for the weekend in upstate New York. Through a ...See moreThe complex relationship between a wealthy French woman and her best friend a, gay black American, is thrown into turmoil when her estranged daughter comes to visit them with her new husband for the weekend in upstate New York. Through a series of drunken evenings and daytime squabbles it becomes apparent that no one involved is what they seem.  Written by ProducerSee less",
        "runtimeMinutes": "80"
    },
    "2005_473": {
        "plotSummary": "A young man who's been labeled mentally ill is left on his own after his mother's murder. Confused and alone, he's targeted by two different con artists out to make off with his inheritance.",
        "runtimeMinutes": "95"
    },
    "2005_474": {
        "plotSummary": "Lucille and Irja are retired residents of Sunset Hall, a Los Angeles home for the elderly. Residents of Sunset Hall are retired radicals; they have retired from work but not from protesting against injustice. Bitter Lucille considers ...See moreLucille and Irja are retired residents of Sunset Hall, a Los Angeles home for the elderly. Residents of Sunset Hall are retired radicals; they have retired from work but not from protesting against injustice. Bitter Lucille considers herself a realist. Wheelchair-bound Irja is sunny and optimistic. Lucille was raised a Jew but always aspired to assimilate. Irja wants to explore all sorts of new traditions. Through the lives of these women, Sunset Story shows the life at Sunset Hall: teachers, a dancer, an engineer, a social worker, and others, all living out their golden years in a unique environment.  Written by Ken Miller See less",
        "runtimeMinutes": "73"
    },
    "2005_475": {
        "plotSummary": "An ailing communist reflects on his childhood in Stalinist Yugoslavia.",
        "runtimeMinutes": "93"
    },
    "2005_476": {
        "plotSummary": "Only a few weeks after her husband's mysterious death, Maureen returns from a cruise with handsome Brit Oliver Vance in tow. Her son Scott is mortified. He still can't believe that his father - a world-class athlete - actually drowned. ...See moreOnly a few weeks after her husband's mysterious death, Maureen returns from a cruise with handsome Brit Oliver Vance in tow. Her son Scott is mortified. He still can't believe that his father - a world-class athlete - actually drowned. When Maureen and Oliver announce wedding-plans, Scott's world begins to fall apart. Oliver's attractive daughter Kelly shares Scott's distrust of the impending marriage - and proposes a theory of her own: is it possible that Maureen and Oliver have known each other longer than just a few weeks; and if so, could they have possibly killed Scott's father? The two start to investigate - and soon fall in love. But while they are united by a horrible suspicion, the investigation soon reveals some secrets that keep them apart. Scott has to realize that he can truly trust no one - not Oliver, not Maureen and definitely not Kelly.  Written by Karsten KastelanSee less",
        "runtimeMinutes": "95"
    },
    "2005_477": {
        "plotSummary": "A biography of powerful Hollywood agent and executive Lew Wasserman.",
        "runtimeMinutes": "110"
    },
    "2005_478": {
        "plotSummary": "Kicked out of his house because he's gay, Ethan Mao returns home to steal and ends up holding his family hostage on a fateful Thanksgiving Day.",
        "runtimeMinutes": "87"
    },
    "2005_479": {
        "plotSummary": "A beautiful Pakistani woman has to make choice between her true love or an arranged marriage by her family.",
        "runtimeMinutes": "92"
    },
    "2005_48": {
        "plotSummary": "Will and Jake Grimm are traveling con-artists who encounter a genuine fairy-tale curse which requires true courage instead of their usual bogus exorcisms.",
        "runtimeMinutes": "118"
    },
    "2005_480": {
        "plotSummary": "A tribute to graffiti art and the city where it all began. Blest, a 19-year-old graffiti writer, has just graduated from high school. With no ambition toward mainstream goals of work and family, he spends his time bombing the city with ...See moreA tribute to graffiti art and the city where it all began. Blest, a 19-year-old graffiti writer, has just graduated from high school. With no ambition toward mainstream goals of work and family, he spends his time bombing the city with graffiti messages until he and his crew become the most wanted bombers by the corrupt NYPD Vandal Squad. He even attracts major media and gallery attention for his tags. Also part of Blest's crew are Buk 50 and his younger brother Lune, whose arrest and beating by the NYPD causes the crew to wage a full-on graffiti war against the city. As they fight with their spray cans and their tags, Blest meets a political activist, Alexandra. Soon after, Blest's relationship with Buk 50 and the crew fragments as Blest ponders his position in life.  Written by David KwokSee less",
        "runtimeMinutes": "91"
    },
    "2005_481": {
        "plotSummary": "Byeong-gu believes that the world is on the verge of an alien invasion, and sets out to save the world.",
        "runtimeMinutes": "118"
    },
    "2005_482": {
        "plotSummary": "ONE BRIGHT SHINING MOMENT retraces George McGovern's bold presidential campaign of 1972 - a grassroots campaign that fought for peace and justice, and positioned ideas and people first. But what is remembered today as being the ultimate ...See moreONE BRIGHT SHINING MOMENT retraces George McGovern's bold presidential campaign of 1972 - a grassroots campaign that fought for peace and justice, and positioned ideas and people first. But what is remembered today as being the ultimate political defeat of the American Century may also have been its high watermark. The film poses this central question: what does the crushing electoral defeat of a man so well respected for his decency and intellect say about the electoral process, the American government, and more importantly, what does it say about the forces at work on the American people- then and now? Featuring interviews with the candidate himself, supporters and activists like Gore Vidal, Gloria Steinem, Warren Beatty, Howard Zinn, and music from Bob Dylan, Robbie Robertson, Donovan, and Elvis Costello.  Written by AnonymousSee less",
        "runtimeMinutes": "123"
    },
    "2005_483": {
        "plotSummary": "A gay teenager falls for an architect after moving to the city to find a summer job. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2005_484": {
        "plotSummary": "A transgender woman who survives prostituting herself in Paris, returns - with her two male lovers in tow - to her family home in the countryside to look after her dying mother.",
        "runtimeMinutes": "93"
    },
    "2005_485": {
        "plotSummary": "Two brothers, 23 and 16, who are both teen idols, come to terms with their dysfunctional family past and deep affection for each other.",
        "runtimeMinutes": "74"
    },
    "2005_486": {
        "plotSummary": "A stolen secret recipe ignites a war between two tough New York families who've been battling for years over who makes the better pizza pie.",
        "runtimeMinutes": "82"
    },
    "2005_487": {
        "plotSummary": "The absurd true story of the legal battle over the \"Million-Dollar Baseball.\" Barry Bonds' record setting 73rd home run ball sparks a melee in the stands at Pac Bell Park in San Francisco. One guy caught the ball, another guy ended up with...See moreThe absurd true story of the legal battle over the \"Million-Dollar Baseball.\" Barry Bonds' record setting 73rd home run ball sparks a melee in the stands at Pac Bell Park in San Francisco. One guy caught the ball, another guy ended up with it. Who is the rightful owner? The lawyers can't agree; the fans can't agree; even the wisened professors of property law can't agree. This is a story documenting the hilarious lengths to which someone will go for a baseball, and the few fans that will put their lives on hold for years, staking everything on one judge's decision.  Written by Dave CiaccioSee less",
        "runtimeMinutes": "90"
    },
    "2005_488": {
        "plotSummary": "A down-on-his-luck divorced father struggles to get his life and family back together before it's too late.",
        "runtimeMinutes": "84"
    },
    "2005_489": {
        "plotSummary": "Four actors compete for the role of Jesus - a black revolutionary, a bisexual hippie, a Jew, and a feminist. When all four are rejected, they hit the road on bad-ass motorcycles, bound for glory in New York City. But when a run-in with a ...See moreFour actors compete for the role of Jesus - a black revolutionary, a bisexual hippie, a Jew, and a feminist. When all four are rejected, they hit the road on bad-ass motorcycles, bound for glory in New York City. But when a run-in with a gang of Elvises ends in murder, they find themselves taken prisoner in a little town called Jackville - where folk don't take kindly to blasphemers. The Jesuses fall prey to an evil conspiracy that can only lead to the Apocalypse.  Written by Angie LouiseSee less",
        "runtimeMinutes": "96"
    },
    "2005_49": {
        "plotSummary": "Mere seconds before the Earth is to be demolished by an alien construction crew, journeyman Arthur Dent is swept off the planet by his friend Ford Prefect, a researcher penning a new edition of \"The Hitchhiker's Guide to the Galaxy.\"",
        "runtimeMinutes": "109"
    },
    "2005_490": {
        "plotSummary": "In small town Tennessee, a ne'er-do-well man (Knoxville) wrestling for control over his fading golf club is reunited with his estranged daughter, a 14-year-old musical prodigy.",
        "runtimeMinutes": "100"
    },
    "2005_491": {
        "plotSummary": "After the death of his mother, a man tries to discover a meaning to his life, to the universe and to rebuild a relationship with the only family he has left: his brother.",
        "runtimeMinutes": "105"
    },
    "2005_492": {
        "plotSummary": "A Martial Artist, afflicted with a disease that makes beautiful women want to kill him, goes on a suicide mission to find true love anyway.",
        "runtimeMinutes": "82"
    },
    "2005_493": {
        "plotSummary": "Published in Paris in 1954, The Story of O was an immediate bestseller and literary scandal: an elegantly written S&M fantasy that had all the hallmarks of being an autobiographical account by the pseudonymous Pauline Reage. In 1994 ...See morePublished in Paris in 1954, The Story of O was an immediate bestseller and literary scandal: an elegantly written S&M fantasy that had all the hallmarks of being an autobiographical account by the pseudonymous Pauline Reage. In 1994 Dominique Aury, a mild-mannered, dowdy editor for France's prestigious Gallimard press, revealed her authorship. Pola Rapaport explores Aury's inspiration, recreating the world of '50s literary Paris and setting it against dramatic sequences that bring the infamous book to life. The author and various French intellectuals expound on the thorny relationship between sexuality and power, submission and freedom, liberation and non-being. Even today, The Story of O mystifies in its power and confounds in its contradictions.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "80"
    },
    "2005_494": {
        "plotSummary": "Two real-life lesbian actresses meet by chance when they are cast as lovers in a local stage play, and end up actually falling in love.",
        "runtimeMinutes": "80"
    },
    "2005_495": {
        "plotSummary": "",
        "runtimeMinutes": "93"
    },
    "2005_496": {
        "plotSummary": "JOSEPH REX is a common businessman who lives life quietly, risk free and overly out of shape. When a rival business associate dares him to enter an amateur boxing contest, JOSEPH REX decides to change his life. With a help of a few friends...See moreJOSEPH REX is a common businessman who lives life quietly, risk free and overly out of shape. When a rival business associate dares him to enter an amateur boxing contest, JOSEPH REX decides to change his life. With a help of a few friends, FRANK, a heartbroken writer, and JAKE, a trainer who knows zero about boxing, the quest to change a man once and for all begins. Getting in shape has never been this ludicrous and heartwarming. This hilarious situational comedy leaves you hanging on the ropes with sweaty excitement, sexy adventures, and life lessons to tell your grandkids about.  Written by One More Round, LLCSee less",
        "runtimeMinutes": "90"
    },
    "2005_497": {
        "plotSummary": "An aging trainer and a young fighter, both in need of a second chance, team-up to overcome the demons of their past...and chase the dreams of their future.",
        "runtimeMinutes": "109"
    },
    "2005_498": {
        "plotSummary": "Inheriting her grandmother's remote island Inn causes Amanda to re-evaluate her life and decisions.",
        "runtimeMinutes": "124"
    },
    "2005_499": {
        "plotSummary": "A look at the life of President Park Chung-hee and the events leading up to his assassination.",
        "runtimeMinutes": "102"
    },
    "2005_5": {
        "plotSummary": "A greedy film producer assembles a team of moviemakers and sets out for the infamous Skull Island, where they find more than just cannibalistic natives.",
        "runtimeMinutes": "187"
    },
    "2005_50": {
        "plotSummary": "A young woman, Theresa, brings her boyfriend, Simon, home to meet her parents and surprise them with the news of their engagement. Another surprise: Simon is white.",
        "runtimeMinutes": "105"
    },
    "2005_500": {
        "plotSummary": "A documentary about the making of director Martin Scorsese's feature film adaptation of Edith Wharton's Pulitzer Prize-winning novel, The Age of Innocence. The documentary features a conversation between Scorsese and the star of the film, ...See moreA documentary about the making of director Martin Scorsese's feature film adaptation of Edith Wharton's Pulitzer Prize-winning novel, The Age of Innocence. The documentary features a conversation between Scorsese and the star of the film, Daniel Day Lewis, as well as rare behind-the-scenes footage.  Written by Laura DavisSee less",
        "runtimeMinutes": "30"
    },
    "2005_501": {
        "plotSummary": "Vittorio, a goldsmith looking for his perception of beauty, meets Sonia and manages to convince her to lose weight to an unhealthy degree.",
        "runtimeMinutes": "100"
    },
    "2005_502": {
        "plotSummary": "Over one night in New York City, lives of disparate strangers intersect by fate and circumstance.",
        "runtimeMinutes": "90"
    },
    "2005_503": {
        "plotSummary": "A teenage boy battling cancer discovers a way to change the lives of the ones he meets.",
        "runtimeMinutes": "88"
    },
    "2005_504": {
        "plotSummary": "A documentary on Johannesburg South African men who call themselves \"Swenkas\" and compete for cash and prizes in an event that's part fashion show, part choreography, and part moral code.",
        "runtimeMinutes": "72"
    },
    "2005_505": {
        "plotSummary": "A man confronts the trauma of past sexual abuse as a boy by a Catholic priest only to find his decision shatters his relationships with his family, community and faith.",
        "runtimeMinutes": "87"
    },
    "2005_506": {
        "plotSummary": "16 years of alcohol is about a skinhead named Frankie; his violent childhood, alcoholism and his love for Ska.",
        "runtimeMinutes": "102"
    },
    "2005_507": {
        "plotSummary": "In January, 2004, in Al-Falluja, Iraq, a documentary film crew follows an infantry squad of the 82nd Airborne, US Army. Cameras accompany the squad of seven on day and night patrols, as they watch their backs, kick down doors, search for ...See moreIn January, 2004, in Al-Falluja, Iraq, a documentary film crew follows an infantry squad of the 82nd Airborne, US Army. Cameras accompany the squad of seven on day and night patrols, as they watch their backs, kick down doors, search for weapons, interrogate women, detain a few people, and listen to the complaints of locals. At their barracks, a former Baathist retreat called Dreamland, the men talk: about why they enlisted, civilian prospects, feelings about the war and Iraqis, where they were when a comrade died a few weeks before. We see them wait for translators and try a few words of Arabic; we hear their frustrations. We watch them pressured to reenlist. Tensions mount in Falluja.  Written by See less",
        "runtimeMinutes": "78"
    },
    "2005_508": {
        "plotSummary": "Follows representatives of Nokia as they examine working conditions at a Chinese factory that manufacturers products for the company.",
        "runtimeMinutes": "79"
    },
    "2005_509": {
        "plotSummary": "Detailed account of the United States' removal of Haiti's democratically elected president, Aristide. Features Aristide, Sen. Maxine Waters, Noam Chomsky, Rep. Charles Rangel, more.",
        "runtimeMinutes": "84"
    },
    "2005_51": {
        "plotSummary": "A lonely landscape architect falls for the spirit of the beautiful woman who used to live in his new apartment.",
        "runtimeMinutes": "95"
    },
    "2005_510": {
        "plotSummary": "An insightful expose on the subculture of lesbian butches and their \"femme\" counterparts who tow the line between gender definitions. Filmed over five years in NYC, the featured \"Aggressives\" share their dreams, secrets and deepest fears.",
        "runtimeMinutes": "75"
    },
    "2005_511": {
        "plotSummary": "This film explores the theme of the biblical Magdalene - the prostitute who becomes a saint. This modern-day Magdalene story is about a very young and sinful girl who is suddenly confronted by the evil in her life when she receives the ...See moreThis film explores the theme of the biblical Magdalene - the prostitute who becomes a saint. This modern-day Magdalene story is about a very young and sinful girl who is suddenly confronted by the evil in her life when she receives the stigmata in her dreams.  Written by Michael LauzonSee less",
        "runtimeMinutes": "113"
    },
    "2005_512": {
        "plotSummary": "Documentary about how King Leopold II of Belgium acquired Congo as a colony and exploited it by reign of terror.",
        "runtimeMinutes": "84"
    },
    "2005_513": {
        "plotSummary": "McLibel is the story of two ordinary people who humiliated McDonald's in the biggest corporate PR disaster in history.",
        "runtimeMinutes": "85"
    },
    "2005_514": {
        "plotSummary": "Soledad is an artist who has with drawn from society by moving into the desert. She lives a life alone seemingly immersed in noticing and painting the beauty that shes sees. Somewhere before the start of the movie she met Hillary. Hillary ...See moreSoledad is an artist who has with drawn from society by moving into the desert. She lives a life alone seemingly immersed in noticing and painting the beauty that shes sees. Somewhere before the start of the movie she met Hillary. Hillary (unknown to Soledad) is a damaged woman. In the opening scenes the two of them are about to embark on a journey. To Soledad's thinking the journey is a simple car ride to Flagstaff where Hillary has arranged a gallery review for Soledad. When Soledad's car fails to start, Hilary suggests they hitch-hike. They do Hilary has a brother named Louise. Louis has a car that they can borrow. When the two ladies arrive in Phoenix, their journey like the plot itself begins to thicken. We, along with Soledad are then introduced to Louis. Louis' apartment is as messy as the clothes he wears. He has stores to tell. You will be compelled to watch as the rabbit hole Solidad finds her self within can only exit in a family's backyard. This is SOLITUDE.  Written by JKSTEWARTSee less",
        "runtimeMinutes": "99"
    },
    "2005_515": {
        "plotSummary": "In a story weaving the past and present together, Emile seeks redemption from the family he abandoned.",
        "runtimeMinutes": "92"
    },
    "2005_516": {
        "plotSummary": "Based on the life of Luang Pradit Pairoh (Sorn Silapabanleng) the most revered traditional Thai music master who lived during the reigns of Kings Rama V to VIII, the movie traces the life of Sorn, who picked up the ra-nad ek (Thai ...See moreBased on the life of Luang Pradit Pairoh (Sorn Silapabanleng) the most revered traditional Thai music master who lived during the reigns of Kings Rama V to VIII, the movie traces the life of Sorn, who picked up the ra-nad ek (Thai xylophone) mallets as a small child and played all his life. The backdrop to Sorn's life tale is the story of Thailand's classical music from its golden age during the reign of King Rama V to near extinction after the end of the absolute monarchy when the government banned it as uncivilised in the 1930s -- a time when Field Marshall Plaek Pibulsongkram tried to push the Kingdom into the modern era. The film shifts back and forth from the time when Sorn was a young man, playing in a xylophone duel with the intense Kun In, to the 1940s, when Thailand was under Japanese occupation and Sorn's playing would provide some inspiration to the oppressed citizenry of the time.  Written by Wise KwaiSee less",
        "runtimeMinutes": "103"
    },
    "2005_517": {
        "plotSummary": "A Mexican-American chases his dreams as he puts together a classic Mexican band to compete in a radio station sponsored contest, all while attempting to court a beautiful girl.",
        "runtimeMinutes": "108"
    },
    "2005_518": {
        "plotSummary": "Four friends marooned on a mysterious farm en route to a wedding are terrorized by various creatures and zombies.",
        "runtimeMinutes": "80"
    },
    "2005_519": {
        "plotSummary": "A romance blooms between Quattro (Beaumont) and Noza (Hernandez), two kids caught up in the illegal street car racing scene of Southern California.",
        "runtimeMinutes": "96"
    },
    "2005_52": {
        "plotSummary": "After Cheryl Frasier (Heather Burns) and Stan Fields (William Shatner) are kidnapped, Gracie Hart (Sandra Bullock) goes undercover in Las Vegas, Nevada to find them.",
        "runtimeMinutes": "115"
    },
    "2005_520": {
        "plotSummary": "This video shows how the foreign policy interests of American political elites-working in combination with Israeli public relations stratgies-influence US news reporting about the Middle East conflict. Combining American and British TV ...See moreThis video shows how the foreign policy interests of American political elites-working in combination with Israeli public relations stratgies-influence US news reporting about the Middle East conflict. Combining American and British TV news clips with observations of analysts, journalists and political activists, Peace, Propaganda & the Promised Land provides a brief historical overview, a striking media comparison, and an examination of factors that have distorted U.S. media coverage and, in turn, American public opinion.  Written by exerpted from Media Education FoundationSee less",
        "runtimeMinutes": "80"
    },
    "2005_521": {
        "plotSummary": "Giorgio Perlasca was an Italian cattle dealer who was sympathetic to the fascist cause until September 8, 1943. Perlasca was in Budapest, Hungary, on a business trip when he had the opportunity to see Jews were being treated.",
        "runtimeMinutes": "94"
    },
    "2005_522": {
        "plotSummary": "",
        "runtimeMinutes": "90"
    },
    "2005_523": {
        "plotSummary": "Set against the backdrop of the magical White Nights Festival in St. Petersburg, Sacred Stage features the best in Russian symphonic music, ballet and opera at Russia's premier theater--the Mariinsky, also known as the Kirov.",
        "runtimeMinutes": "61"
    },
    "2005_524": {
        "plotSummary": "The film follows Micheal Moore's controversial decision to speak at the Utah Valley State College, where a heated debate between protestors and supporters argue Moore's First Amendment freedom of speech rights.",
        "runtimeMinutes": "88"
    },
    "2005_525": {
        "plotSummary": "A black man is opposed to his sister's falling in love with a white man.",
        "runtimeMinutes": "97"
    },
    "2005_526": {
        "plotSummary": "In a decript apartment, a young man watches as his father and a friend shoot an amateur porn film. Issues of morality, reality TV and friendship are explored.",
        "runtimeMinutes": "98"
    },
    "2005_527": {
        "plotSummary": "When \"The One\" dies, Orpheum must find the \"Other One.\"",
        "runtimeMinutes": "97"
    },
    "2005_528": {
        "plotSummary": "When an unhappy young woman disappears, her worried sister desperately searches the internet for a clue to her missing sibling's whereabouts.",
        "runtimeMinutes": "89"
    },
    "2005_529": {
        "plotSummary": "The film follows fictional movie star Gray Evans through the disintegration of his marriage, his gradual mental breakdown, and his increasing obsession with a young film student who reminds Gray of his own life before becoming famous. A ...See moreThe film follows fictional movie star Gray Evans through the disintegration of his marriage, his gradual mental breakdown, and his increasing obsession with a young film student who reminds Gray of his own life before becoming famous. A dark psychological drama, this movie explores the pressures of fame and the difference between getting what you want and wanting what you get.See less",
        "runtimeMinutes": "111"
    },
    "2005_53": {
        "plotSummary": "Los Angeles citizens with vastly separate lives collide in interweaving stories of race, loss and redemption.",
        "runtimeMinutes": "112"
    },
    "2005_530": {
        "plotSummary": "Retiring director Chuck Steak wants to make his last film the biggest and most absurdly convoluted adult movie ever made. As a young documentary maker films this outrageously funny, quirky quest, everything that can possibly go wrong does.",
        "runtimeMinutes": "96"
    },
    "2005_531": {
        "plotSummary": "A desperate man ventures into a dangerous and sordid underworld of crime and pornography in search of his severed genitalia which is held for ransom by his disgruntled former girlfriend.",
        "runtimeMinutes": "78"
    },
    "2005_532": {
        "plotSummary": "The educated Fariba Tabrizi flies from Teheran to Germany expecting to have asylum, since she is persecuted in Iran due to her lesbian relationship with her beloved Shirin. However, her application is denied by the authorities and Fariba ...See moreThe educated Fariba Tabrizi flies from Teheran to Germany expecting to have asylum, since she is persecuted in Iran due to her lesbian relationship with her beloved Shirin. However, her application is denied by the authorities and Fariba has to return to her home country. When her recent acquaintance Siamak, who is grieving the death of his brother, commits suicide, Fariba assumes his identity and status of political refugee and is sent to a refugee camp in a German village. Fariba finds an illegal work in a cabbage factory and she has many difficulties for not having bath with the other male workers. She becomes close to her colleague Anne and they fall in love for each other. However, prejudice and her illegal condition jeopardize her exile in Germany.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
        "runtimeMinutes": "97"
    },
    "2005_533": {
        "plotSummary": "",
        "runtimeMinutes": "95"
    },
    "2005_534": {
        "plotSummary": "Stolen Childhoods is the first feature documentary on global child labor ever produced. The film features stories of child laborers around the world, told in their own words. Children are shown working in dumps, quarries, brick kilns. One ...See moreStolen Childhoods is the first feature documentary on global child labor ever produced. The film features stories of child laborers around the world, told in their own words. Children are shown working in dumps, quarries, brick kilns. One boy has been pressed into forced labor on a fishing platform in the Sea of Sumatra, a fifteen-year-old runaway describes being forced into prostitution on the streets of Mexico City, while a nine-year-old girl picks coffee in Kenya to help her family survive. The film places these children's stories in the broader context of the worldwide struggle against child labor. Stolen Childhoods provides an understanding of the causes of child labor, what it costs the global community, how it contributes to global insecurity and what it will take to eliminate it. The film shows best practice programs that remove children from work and put them in school, so that they have a chance to develop as children and also have a chance of making a reasonable living when they grow up. Stolen Childhoods challenges the viewer to help break the cycle of poverty for the 246 million children laboring at the bottom of the global economy.  Written by Galen FilmsSee less",
        "runtimeMinutes": "85"
    },
    "2005_535": {
        "plotSummary": "Six Anton Chekhov short stories set in modern day Cleveland during a three day rain storm.",
        "runtimeMinutes": "98"
    },
    "2005_536": {
        "plotSummary": "A recounting of the rescue of 50,000 Bulgarian Jews from the Holocaust by their friends and neighbors.",
        "runtimeMinutes": "83"
    },
    "2005_537": {
        "plotSummary": "A young woman fumbles with love and ethics as she navigates a career with one of corporate America's darlings...the pharmaceutical industry.",
        "runtimeMinutes": "90"
    },
    "2005_538": {
        "plotSummary": "A 15 year-old kleptomaniac with a mother fixation finds his way into the small town family of his dreams.",
        "runtimeMinutes": "95"
    },
    "2005_539": {
        "plotSummary": "",
        "runtimeMinutes": "100"
    },
    "2005_54": {
        "plotSummary": "To impress a foxy divorcee, ladies' man Nick offers to take her kids on an extended road trip, unaware of the torture he's in for.",
        "runtimeMinutes": "95"
    },
    "2005_540": {
        "plotSummary": "Echoes of Dostoyevsky. At the start, Christine Blanc is a temp, her boyfriend has gone. Near the story's end, she's been offered a steady job, she has a fiance, other men seem interested in her, she's passed her driving test, and, after ...See moreEchoes of Dostoyevsky. At the start, Christine Blanc is a temp, her boyfriend has gone. Near the story's end, she's been offered a steady job, she has a fiance, other men seem interested in her, she's passed her driving test, and, after she wins 1000 Euros in a scratch-off, her colleagues sing that she's a jolly good fellow (\"one of us\"). But something's askew: her gaze is too direct, her eyes open too widely; conversational gambits hit odd notes; she parrots others' words; she cooks too much food when she invites a supervisor to dinner. When the supervisor takes Christine on a spontaneous outing that disorients her, her oddities become something else. Can things ever be normal?  Written by See less",
        "runtimeMinutes": "98"
    },
    "2005_541": {
        "plotSummary": "During World War II, Switzerland severely limited refugees: \"Our boat is full.\" A train from Germany halts briefly in an isolated corner of Switzerland. Six people jump off seeking asylum: four Jews, a French child, and a German soldier. ...See moreDuring World War II, Switzerland severely limited refugees: \"Our boat is full.\" A train from Germany halts briefly in an isolated corner of Switzerland. Six people jump off seeking asylum: four Jews, a French child, and a German soldier. They seek temporary refuge with a couple who run a village inn. They pose as a family: the deserter as husband, Judith as his wife, an old man from Vienna as her father, his granddaughter and the French lad, whom they beg to keep silent, as their children. Judith's teenage brother poses as a soldier. The fabrication unravels through chance and the local constable's exact investigation. Whom will the Swiss allow to stay? Who gets deported?  Written by See less",
        "runtimeMinutes": "101"
    },
    "2005_542": {
        "plotSummary": "Ann Krsul and Leslie Sullivan want to be mothers - together. They complement one another perfectly.Together, they discover the process of creating a family-from selecting a sperm donor and determining who will carry the baby. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2005_543": {
        "plotSummary": "In the wake of the 9/11 tragedy a firestorm erupts when 1,100 Somali refugees relocate to predominately white Lewiston, Maine.",
        "runtimeMinutes": "76"
    },
    "2005_544": {
        "plotSummary": "A newly married couple is caught on camera during their honeymoon. When the wife commits suicide after the video is released on internet, the husband sets out to seek revenge.",
        "runtimeMinutes": "126"
    },
    "2005_545": {
        "plotSummary": "From the moment David Brower first witnessed the extraordinary beauty of the Yosemite Valley, his life was tied to the fight to preserve the American wilds for future generations. Not since John Muir had an American fought so hard, or been...See moreFrom the moment David Brower first witnessed the extraordinary beauty of the Yosemite Valley, his life was tied to the fight to preserve the American wilds for future generations. Not since John Muir had an American fought so hard, or been more successful, in protecting our natural heritage. His fiery dedication and activism helped inspire the modern day environmental movement. Explored is the beautiful, dramatic, and lyrical story of Brower and his colleagues' unrelenting campaigns--fought through lobbying, art, and hard hitting advertising-to-protect and establish some our most treasured national parks. At the center of the film are the themes that absorbed Brewer throughout his life: the threatened beauty of the American earth, the spiritual connection between humans and the great outdoors, and the moral obligation to preserve what is left of the world's natural wonders.  Written by Sujit R. VarmaSee less",
        "runtimeMinutes": "88"
    },
    "2005_546": {
        "plotSummary": "Moving between the political sphere and everyday life on the streets, this film offers a unique glimpse into the resilience of Iraqis as they struggle to sustain their lives and to fight off a sense of despair and defeat.",
        "runtimeMinutes": "88"
    },
    "2005_547": {
        "plotSummary": "The animated documentary Proteus explores the nineteenth century's engagement with the undersea world through science, technology, painting, poetry and myth. The central figure of the film is biologist and artist Ernst Haeckel, who found ...See moreThe animated documentary Proteus explores the nineteenth century's engagement with the undersea world through science, technology, painting, poetry and myth. The central figure of the film is biologist and artist Ernst Haeckel, who found in the depths of the sea an ecstatic and visionary fusion of science and art.See less",
        "runtimeMinutes": "97"
    },
    "2005_548": {
        "plotSummary": "Max is a lonely, recently orphaned young boy who is frequently bullied by his classmates. One night after accepting a dare, Max wanders into a mysterious mansion, where he meets the Great Zamboni, an eccentric magician.",
        "runtimeMinutes": "106"
    },
    "2005_549": {
        "plotSummary": "Small time crook Steve leaves jail and meets Sky, a naïeve girl who is also a prostitute. The beginning of a strange but wonderful relationship.",
        "runtimeMinutes": "97"
    },
    "2005_55": {
        "plotSummary": "A psychological study of operations desert shield and desert storm during the gulf war; through the eyes of a U.S marine sniper who struggles to cope with the possibility his girlfriend may be cheating on him back home.",
        "runtimeMinutes": "125"
    },
    "2005_550": {
        "plotSummary": "Follow four comedians as they tour the States.",
        "runtimeMinutes": "103"
    },
    "2005_551": {
        "plotSummary": "A beautiful but burnt out psychiatrist goes to the family's winter cottage for a weekend with her husband and sister, which is interrupted when a terrifying and unexpected guest arrives, a violent sex offender and patient of the doctor.",
        "runtimeMinutes": "80"
    },
    "2005_56": {
        "plotSummary": "A woman is kidnapped by a stranger on a routine flight. Threatened by the potential murder of her father, she is pulled into a plot to assist her captor in a political assassination.",
        "runtimeMinutes": "85"
    },
    "2005_57": {
        "plotSummary": "Disenchanted with the movie industry, Chili Palmer tries the music industry, meeting and romancing a widow of a music executive on the way.",
        "runtimeMinutes": "118"
    },
    "2005_58": {
        "plotSummary": "A hospice nurse working at a spooky New Orleans plantation home finds herself entangled in a mystery involving the house's dark past.",
        "runtimeMinutes": "104"
    },
    "2005_59": {
        "plotSummary": "A politically charged epic about the state of the oil industry in the hands of those personally involved in and affected by it.",
        "runtimeMinutes": "128"
    },
    "2005_6": {
        "plotSummary": "A group of animals who have spent all their life in a New York zoo end up in the jungles of Madagascar, and must adjust to living in the wild.",
        "runtimeMinutes": "86"
    },
    "2005_60": {
        "plotSummary": "An uptight, conservative businesswoman accompanies her boyfriend to his eccentric and outgoing family's annual Christmas celebration and finds that she's a fish out of water in their free-spirited way of life.",
        "runtimeMinutes": "103"
    },
    "2005_61": {
        "plotSummary": "When their adoptive mother is gunned down in a store robbery the 'four brothers' investigate the murder for themselves & look for the killers, but not all is what it seems.",
        "runtimeMinutes": "109"
    },
    "2005_62": {
        "plotSummary": "An architect's desire to speak with his wife from beyond the grave becomes an obsession with supernatural repercussions.",
        "runtimeMinutes": "101"
    },
    "2005_63": {
        "plotSummary": "An abandoned zebra grows up believing he is a racehorse, and, with the help of his barnyard friends and a teenage girl, sets out to achieve his dream of racing with thoroughbreds.",
        "runtimeMinutes": "102"
    },
    "2005_64": {
        "plotSummary": "Transporter Frank Martin, surfaces in Miami, Florida and is implicated in the kidnapping of the young son of a powerful USA official.",
        "runtimeMinutes": "87"
    },
    "2005_65": {
        "plotSummary": "Sarah Huttinger is a woman who learns that her family was the inspiration for the book and film \"The Graduate\" -- and that she just might be the offspring of the well-documented event.",
        "runtimeMinutes": "97"
    },
    "2005_66": {
        "plotSummary": "Set in an era where superheroes are commonly known and accepted, young William Stronghold, the son of the Commander and Jetstream, tries to find a balance between being a normal teenager and an extraordinary being.",
        "runtimeMinutes": "100"
    },
    "2005_67": {
        "plotSummary": "At a turning point in his life, a former tennis pro falls for an actress who happens to be dating his friend and soon-to-be brother-in-law.",
        "runtimeMinutes": "124"
    },
    "2005_68": {
        "plotSummary": "Strait-laced Rose breaks off relations with her party girl sister, Maggie, over an indiscretion involving Rose's boyfriend. The chilly atmosphere is broken with the arrival of Ella, the grandmother neither sister knew existed.",
        "runtimeMinutes": "130"
    },
    "2005_69": {
        "plotSummary": "A widower is determined to get to the bottom of a potentially explosive secret involving his wife's murder, big business, and corporate corruption.",
        "runtimeMinutes": "129"
    },
    "2005_7": {
        "plotSummary": "A bored married couple is surprised to learn that they are both assassins hired by competing agencies to kill each other.",
        "runtimeMinutes": "120"
    },
    "2005_70": {
        "plotSummary": "Deeply ensconced in a top-secret military program, three pilots struggle to bring an artificial intelligence program under control before it initiates the next world war.",
        "runtimeMinutes": "121"
    },
    "2005_71": {
        "plotSummary": "When a family is held hostage, former hostage negotiator Jeff Talley arrives at the scene. Talley's own family is kidnapped and Talley must decide which is more important: saving a family he doesn't even know or saving his own family.",
        "runtimeMinutes": "113"
    },
    "2005_72": {
        "plotSummary": "Controversy surrounds high school basketball coach Ken Carter after he benches his entire team for breaking their academic contract with him.",
        "runtimeMinutes": "136"
    },
    "2005_73": {
        "plotSummary": "A widowed Coast Guard Admiral and a widow handbag designer fall in love and marry, much to the dismay of her 10 and his 8 children.",
        "runtimeMinutes": "88"
    },
    "2005_74": {
        "plotSummary": "An arms dealer confronts the morality of his work as he is being chased by an INTERPOL Agent.",
        "runtimeMinutes": "122"
    },
    "2005_75": {
        "plotSummary": "A young boy is recruited by his imaginary friends Sharkboy and Lavagirl to help save their planet.",
        "runtimeMinutes": "93"
    },
    "2005_76": {
        "plotSummary": "Darius Stone, a new agent in the xXx program, is sent to Washington, D.C. to stop a coup attempt against the President of the United States.",
        "runtimeMinutes": "101"
    },
    "2005_77": {
        "plotSummary": "A group of teens are unwittingly stranded near a strange wax museum and soon must fight to survive and keep from becoming the next exhibit.",
        "runtimeMinutes": "113"
    },
    "2005_78": {
        "plotSummary": "A career driven professional from Manhattan is wooed by a young painter, who also happens to be the son of her psychoanalyst.",
        "runtimeMinutes": "105"
    },
    "2005_79": {
        "plotSummary": "A young man tries to deal with the childhood terror that has never stopped haunting him.",
        "runtimeMinutes": "89"
    },
    "2005_8": {
        "plotSummary": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.",
        "runtimeMinutes": "115"
    },
    "2005_80": {
        "plotSummary": "Two young brothers are drawn into an intergalactic adventure when their house is hurled through the depths of space by the magical board game they are playing.",
        "runtimeMinutes": "101"
    },
    "2005_81": {
        "plotSummary": "At the height of World War II, a tiny wood pigeon enlists in the elite Royal Homing Pigeon Service to serve Britain, as the fearsome General Von Talon (Tim Curry) and his deadly squadron of falcons patrol the English Channel. Is he a ...See moreAt the height of World War II, a tiny wood pigeon enlists in the elite Royal Homing Pigeon Service to serve Britain, as the fearsome General Von Talon (Tim Curry) and his deadly squadron of falcons patrol the English Channel. Is he a war-hero in the making?See less",
        "runtimeMinutes": "76"
    },
    "2005_82": {
        "plotSummary": "A mild-mannered man becomes a local hero through an act of violence, which sets off repercussions that will shake his family to its very core.",
        "runtimeMinutes": "96"
    },
    "2005_83": {
        "plotSummary": "Tim Avery, an aspiring cartoonist, finds himself in a predicament when his dog stumbles upon the mask of Loki. Then after conceiving an infant son \"born of the mask\", he discovers just how looney child raising can be.",
        "runtimeMinutes": "94"
    },
    "2005_84": {
        "plotSummary": "A thirty-something preschool teacher looks to the personals for a change of pace and a relationship, with hilarious results.",
        "runtimeMinutes": "98"
    },
    "2005_85": {
        "plotSummary": "Space Marines are sent to investigate strange events at a research facility on Mars but find themselves at the mercy of genetically enhanced killing machines.",
        "runtimeMinutes": "105"
    },
    "2005_86": {
        "plotSummary": "When two married business executives having an affair are blackmailed by a violent criminal, the two must turn the tables on him to save their families.",
        "runtimeMinutes": "108"
    },
    "2005_87": {
        "plotSummary": "A caving expedition goes horribly wrong, as the explorers become trapped and ultimately pursued by a strange breed of predators.",
        "runtimeMinutes": "99"
    },
    "2005_88": {
        "plotSummary": "Elektra the warrior survives a near-death experience, becomes an assassin-for-hire, and tries to protect her two latest targets, a single father and his young daughter, from a group of supernatural assassins.",
        "runtimeMinutes": "97"
    },
    "2005_89": {
        "plotSummary": "Family man Phil Weston, a lifelong victim of his father's competitive nature, takes on the coaching duties of a kids' soccer team, and soon finds that he's also taking on his father's dysfunctional way of relating.",
        "runtimeMinutes": "95"
    },
    "2005_9": {
        "plotSummary": "After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption.",
        "runtimeMinutes": "140"
    },
    "2005_90": {
        "plotSummary": "Broadcast journalist Edward R. Murrow looks to bring down Senator Joseph McCarthy.",
        "runtimeMinutes": "93"
    },
    "2005_91": {
        "plotSummary": "Aeon Flux is a mysterious assassin working for the Monicans, a group of rebels trying to overthrow the government. When she is sent on a mission to kill the Chairman, a whole new mystery is found.",
        "runtimeMinutes": "93"
    },
    "2005_92": {
        "plotSummary": "When Roo sets off on his own into the Hundred Acre Wood, he discovers a friendly and playful Heffalump named Lumpy.",
        "runtimeMinutes": "68"
    },
    "2005_93": {
        "plotSummary": "During a hometown memorial for his Kentucky-born father, a young man begins an unexpected romance with a too-good-to-be-true stewardess.",
        "runtimeMinutes": "123"
    },
    "2005_94": {
        "plotSummary": "While visiting his hometown during Christmas, a man comes face-to-face with his old high school crush whom he was best friends with -- a woman whose rejection of him turned him into a ferocious womanizer.",
        "runtimeMinutes": "96"
    },
    "2005_95": {
        "plotSummary": "A man enslaved by the mob since childhood and raised into behaving like a human attack dog escapes his captors and attempts to start a new life.",
        "runtimeMinutes": "103"
    },
    "2005_96": {
        "plotSummary": "A couple's seemingly solid marriage begins to crumble when the wife discovers that her husband intends to divorce her.",
        "runtimeMinutes": "116"
    },
    "2005_97": {
        "plotSummary": "Lindsay is stuck in the middle of her relationship with Ben and his passion for the Boston Red Sox.",
        "runtimeMinutes": "104"
    },
    "2005_98": {
        "plotSummary": "In 1959, Truman Capote learns of the murder of a Kansas family and decides to write a book about the case. While researching for his novel In Cold Blood, Capote forms a relationship with one of the killers, Perry Smith, who is on death row.",
        "runtimeMinutes": "114"
    },
    "2005_99": {
        "plotSummary": "As the extremely withdrawn Don Johnston is dumped by his latest woman, he receives an anonymous letter from a former lover informing him that he has a son who may be looking for him. A freelance sleuth neighbor moves Don to embark on a ...See moreAs the extremely withdrawn Don Johnston is dumped by his latest woman, he receives an anonymous letter from a former lover informing him that he has a son who may be looking for him. A freelance sleuth neighbor moves Don to embark on a cross-country search for his old flames in search of answers.See less",
        "runtimeMinutes": "106"
    }
}