{
    "2006_1": "Jack Sparrow races to recover the heart of Davy Jones to avoid enslaving his soul to Jones' service, as other friends and foes seek the heart for their own agenda as well.",
    "2006_10": "Into the world of the Emperor Penguins, who find their soul mates through song, a penguin is born who cannot sing. But he can tap dance something fierce!",
    "2006_100": "Before being sent to serve in Vietnam, two brothers and their girlfriends take one last road trip, but when they get into an accident, a terrifying experience will take them to a secluded house of horrors, with a chainsaw-wielding killer.",
    "2006_101": "A veteran high school teacher befriends a younger art teacher, who is having an affair with one of her fifteen-year-old students. However, her intentions with this new \"friend\" also go well beyond a platonic friendship.",
    "2006_102": "Filmmaker Davis Guggenheim follows Al Gore on the lecture circuit, as the former presidential candidate campaigns to raise public awareness of the dangers of global warming and calls for immediate action to curb its destructive effects on the environment.",
    "2006_103": "Two policemen see their personal and professional lives fall apart in the wake of the \"Black Dahlia\" Elizabeth Short murder investigation.",
    "2006_104": "Based on the events of the brutal Ugandan dictator Idi Amin's regime as seen by his personal physician during the 1970s.",
    "2006_105": "Two neighbors have it out after one of them decorates his house for the holidays so brightly that it can be seen from space.",
    "2006_106": "A drama that focuses on the period in Mary and Joseph's life where they journeyed to Bethlehem for the birth of Jesus.",
    "2006_107": "When a plane crash claims the lives of members of the Marshall University football team and some of its fans, the team's new coach and his surviving players try to keep the football program alive.",
    "2006_108": "Upon learning of a terminal illness, a shy woman decides to sell off all her possessions and live it up at a posh Central-European hotel.",
    "2006_109": "In 1966, Texas Western coach Don Haskins led the first all-black starting line-up for a college basketball team to the NCAA national championship.",
    "2006_11": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating...and learns a lesson about family himself.",
    "2006_110": "Professional assassin Chev Chelios learns his rival has injected him with a poison that will kill him if his heart rate drops.",
    "2006_111": "A comedian who hosts a news satire program decides to run for president, and a computerized voting machine malfunction gets him elected.",
    "2006_112": "A British investment broker inherits his uncle's chateau and vineyard in Provence, where he spent much of his childhood. He discovers a new laid-back lifestyle as he tries to renovate the estate to be sold.",
    "2006_113": "Teenagers at a juvenile detention center, under the leadership of their counselor, gain self-esteem by playing football together.",
    "2006_114": "Satirical comedy follows the machinations of Big Tobacco's chief spokesman, Nick Naylor, who spins on behalf of cigarettes while trying to remain a role model for his twelve-year-old son.",
    "2006_115": "An American journalism student in London scoops a big story, and begins an affair with an aristocrat as the incident unfurls.",
    "2006_116": "A sheriff investigating the disappearance of a young girl from a small island discovers there's a larger mystery to solve among the island's secretive, neo-pagan community. Read more: Synopsis",
    "2006_117": "Novelist Catherine Tramell is once again in trouble with the law, and Scotland Yard appoints psychiatrist Dr. Michael Glass to evaluate her. Though, like Detective Nick Curran before him, Glass is entranced by Tramell and lured into a seductive game.",
    "2006_118": "A high school slacker who's rejected by every school he applies to opts to create his own institution of higher learning, the South Harmon Institute of Technology, on a rundown piece of property near his hometown.",
    "2006_119": "A slacker competes with a repeat winner for the \"Employee of the Month\" title at work, in order to gain the affections of a new female employee.",
    "2006_12": "A smart but sensible new graduate lands a job as an assistant to Miranda Priestly, the demanding editor-in-chief of a high fashion magazine.",
    "2006_120": "Manhattanite Ashley is known to many as the luckiest woman around. After a chance encounter with a down-and-out young man, however, she realizes that she's swapped her fortune for his.",
    "2006_121": "Four young men who belong to a New England supernatural legacy are forced to battle a fifth power long thought to have died out. Meanwhile, jealousy and suspicion threaten to tear them apart.",
    "2006_122": "The story of Beatrix Potter, the author of the beloved and best-selling children's book, \"The Tale of Peter Rabbit\", and her struggle for love, happiness, and success.",
    "2006_123": "A look at the relationship between a young blind samurai (Kimura) and his wife, who will make a sacrifice in order to defend her husband's honor.",
    "2006_124": "An accidental discovery near a doctor's estate stirs up some painful memories eight years after his wife's hideous murder, and now, things are bound to take a turn for the unexpected. Does the good doctor know more than he's letting on?",
    "2006_125": "Mr A, a fearless thief, steals valuable artefacts and teams up with the girl he is attracted to but who cannot be trusted. Close on their heels are three police officers trying to apprehend them.",
    "2006_126": "After a run-in with the law, Haley Graham (Missy Peregrym) is forced to return to the world from which she fled some years ago. Enrolled in an elite gymnastics program run by the legendary Burt Vickerman (Jeff Bridges), Haley's rebellious ...See moreAfter a run-in with the law, Haley Graham (Missy Peregrym) is forced to return to the world from which she fled some years ago. Enrolled in an elite gymnastics program run by the legendary Burt Vickerman (Jeff Bridges), Haley's rebellious attitude gives way to something that just might be called team spirit.See less",
    "2006_127": "A beautiful hæmophage infected with a virus that gives her superhuman powers has to protect a boy in a futuristic world, who is thought to be carrying antigens that would destroy all hæmophages.",
    "2006_128": "When their computer hacker friend accidentally channels a mysterious wireless signal, a group of co-eds rally to stop a terrifying evil from taking over the world.",
    "2006_129": "Based on the true events of the only case in US History where a spirit caused the death of a man.",
    "2006_13": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
    "2006_130": "A porter and a top-model have to pretend to be a couple in order to salvage a CEO's marriage.",
    "2006_131": "An affair between the second in line to Britain's throne and the princess of the feuding Irish spells doom for the young lovers.",
    "2006_132": "Through a set of wacky circumstances, a young gold digger mistakenly woos a mild-mannered bartender, thinking he's a wealthy suitor.",
    "2006_133": "For a group of teens, the answer to the mysterious death of their old friend lies within the world of an online video game based on the true story of an ancient noblewoman known as the Blood Countess.",
    "2006_134": "A calamity at Dante and Randal's shops sends them looking for new horizons - but they ultimately settle at the fast food empire Mooby's.",
    "2006_135": "A British medical doctor fights a cholera epidemic in a small Chinese village, while being trapped at home in a loveless marriage to an unfaithful wife.",
    "2006_136": "In the Nazi-occupied Netherlands during World War II, a Jewish singer infiltrates the regional Gestapo headquarters for the Dutch resistance.",
    "2006_137": "A look at what goes on backstage during the last broadcast of America's most celebrated radio show, where singing cowboys Dusty and Lefty, a country music siren, and a host of others hold court.",
    "2006_138": "Dev, a former football player is married to Rhea, a successful fashion editor. Maya is a kindergarten teacher who is married to Rishi, an outgoing event planner. These couples' lives intersect and they each question their own marriage.",
    "2006_139": "A young guy short on luck enrolls in a class to build confidence to help win over the girl of his dreams, which becomes complicated when it turns out his teacher has the same agenda.",
    "2006_14": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.",
    "2006_140": "After the death of his uncle, the 14-year-old schoolboy Alex Rider is forced by the Special Operations Division of the UK's secret intelligence service, MI6, into a mission which will save millions of lives.",
    "2006_141": "The film covers through fiction real-life events like the occupation of Iraq, the execution of Daniel Pearl, the Hood event and the Abu Ghraib torture scandal.",
    "2006_142": "Secret agent OSS 117 foils Nazis, beds local beauties, and brings peace to the Middle East.",
    "2006_143": "Two teenage girls discover a mermaid in their beach club's swimming pool.",
    "2006_144": "During WWII, four North African men enlist in the French army to liberate that country from Nazi oppression, and to fight French discrimination.",
    "2006_145": "Against the backdrop of the Irish War of Independence, two brothers fight a guerrilla war against British forces.",
    "2006_146": "A sweet blind girl Zooni meets a flirty Rehan. She ignores her friends' warnings. It's her time to discover life. Is she making the right love choice?",
    "2006_147": "A group of diamond thieves on the run kidnap the wife of a recently discharged marine who goes on a chase through the South Carolinian wilderness to retrieve her.",
    "2006_148": "A group of unaccompanied minors bond while snowed in at the midwestern Hoover International Airport during the holiday season and ultimately create a makeshift holiday themselves.",
    "2006_149": "Young Katy claims a wild horse as her own -- an effort to prove to her father that she is capable of one day taking over the family ranch.",
    "2006_15": "Kazakh TV talking head Borat is dispatched to the United States to report on the greatest country in the world. With a documentary crew in tow, Borat becomes more interested in locating and marrying Pamela Anderson.",
    "2006_150": "On Christmas Eve, an escaped maniac returns to his childhood home, which is now a sorority house, and begins to murder the sorority sisters one by one.",
    "2006_151": "An ex-convict (Tyrese) gets tangled up with a gang after his car is hijacked with his son inside.",
    "2006_152": "As four friends prepare for life after high school, different challenges bring about turning points in each of their lives. The dramas unfold and resolve at their local rollerskating rink, Cascade.",
    "2006_153": "The story of the assassination of U.S. Senator Robert F. Kennedy, who was shot in the early morning hours of June 5, 1968 in the Ambassador Hotel in Los Angeles, California, and twenty-two people in the hotel, whose lives were never the same.",
    "2006_154": "Two brothers travel to Germany for Oktoberfest, only to stumble upon a secret, centuries-old competition described as a \"Fight Club\" with beer games.",
    "2006_155": "Vijay is recruited by a police officer to masquerade as his lookalike Don, the leader of an international gang of smugglers. Things go wrong when the officer is killed and Vijay is left to fend for himself.",
    "2006_156": "A young girl from South Los Angeles tries to make it to the National Spelling Bee.",
    "2006_157": "A group of delinquents are sent to clean the Blackwell Hotel. Little do they know reclusive psychopath Jacob Goodnight has holed away in the rotting hotel. When one of the teens is captured, those who remain - a group that includes the cop...See moreA group of delinquents are sent to clean the Blackwell Hotel. Little do they know reclusive psychopath Jacob Goodnight has holed away in the rotting hotel. When one of the teens is captured, those who remain - a group that includes the cop who put a bullet in Goodnight's head four years ago - band together to survive against the brutal killer.See less",
    "2006_158": "In turn-of-the-century Mexico, two very different women become a bank-robbing duo in an effort to combat a ruthless enforcer terrorizing their town.",
    "2006_159": "After she quits her lucrative job, Olivia finds herself unsure about her future and her relationships with her successful and wealthy friends.",
    "2006_16": "In his homeland of Alagaesia, a farm boy happens upon a dragon's egg -- a discovery that leads him on a predestined journey where he realizes he's the one person who can defend his home against an evil king.",
    "2006_160": "Krishna is forced by circumstances to use his superpowers and become the masked superhero Krrish, before getting drawn towards his lost legacy.",
    "2006_161": "Munna Bhai embarks on a journey with Mahatma Gandhi in order to fight against a corrupt property dealer.",
    "2006_162": "The adventures of the Lafayette Escadrille, young Americans who volunteered for the French military before the U.S. entered World War I, and became the country's first fighter pilots.",
    "2006_163": "A successful businessman's family life is shattered by an early onset of Alzheimer's. Read more: Synopsis",
    "2006_164": "A young woman arrives in Paris where she finds a job as a waitress in bar next on Avenue Montaigne that caters to the surrounding theaters and the wealthy inhabitants of the area. She will meet a pianist, a famous actress and a great art ...See moreA young woman arrives in Paris where she finds a job as a waitress in bar next on Avenue Montaigne that caters to the surrounding theaters and the wealthy inhabitants of the area. She will meet a pianist, a famous actress and a great art collector, and become acquainted with the \"luxurious\" world her grandmother has told her about since her childhood.See less",
    "2006_165": "Set against the backdrop of boxing at the Naval Academy, centers on a young man from the wrong side of the tracks whose dream of attending Annapolis becomes a reality.",
    "2006_166": "Through the neighborhoods of Paris, love is veiled, revealed, imitated, sucked dry, reinvented and awakened.",
    "2006_167": "Two wealthy sisters, both heiresses to their family's cosmetics fortune, are given a wake-up call when a scandal and ensuing investigation strip them of their wealth.",
    "2006_168": "A detective examines the mysterious death of George Reeves, the star of the television series Adventures of Superman.",
    "2006_169": "The new season of \"American Dreamz,\" the wildly popular television singing contest, has captured the country's attention, as the competition looks to be between a young Midwestern gal (Moore) and a showtunes-loving young man from Orange ...See moreThe new season of \"American Dreamz,\" the wildly popular television singing contest, has captured the country's attention, as the competition looks to be between a young Midwestern gal (Moore) and a showtunes-loving young man from Orange County (Golzari). Recently awakened President Staton (Quaid) even wants in on the craze, as he signs up for the potential explosive season finale.See less",
    "2006_17": "A workaholic architect finds a universal remote that allows him to fast-forward and rewind to different parts of his life. Complications arise when the remote starts to overrule his choices.",
    "2006_170": "A boy (Jake T. Austin) begins a grand journey to return Babe Ruth's baseball bat before the deciding game of the 1932 World Series comes to a close.",
    "2006_171": "As a modern-day scientist, Tommy is struggling with mortality, desperately searching for the medical breakthrough that will save the life of his cancer-stricken wife, Izzi.",
    "2006_172": "A politically-minded enforcer's misguided trust in his lieutenant leads him to suspect his wife of infidelity in this adaptation of Shakespeare's 'Othello'.",
    "2006_173": "Michael'd have a great job, still have his 4 best friends, and be in love with a beautiful girl at 30. He loves Jenna but his life seems predictable until he meets a college girl. It seems that everybody's having relationship problems.",
    "2006_174": "A slovenly cable repairman becomes a big city Health Inspector, and is tasked with uncovering the source of a food poisoning epidemic.",
    "2006_175": "A man entranced by his dreams and imagination is love-struck with a French woman and feels he can show her his world.",
    "2006_176": "The lives of two lovelorn spouses from separate marriages, a registered sex offender, and a disgraced ex-police officer intersect as they struggle to resist their vulnerabilities and temptations in suburban Massachusetts.",
    "2006_177": "The members of a drama troupe fall in trouble when they are framed for a murder. Things go worse when they find their actress committing suicide, which is somehow linked with the murder.",
    "2006_178": "A group of young backpackers' vacation turns sour when a bus accident leaves them marooned in a remote Brazilian rural area that holds an ominous secret.",
    "2006_179": "Catherine, refuses to believe that her business partner, the unlikeable François, has a best friend, so she challenges him to set up an introduction. Scrambling to find someone willing to pose as his best pal, François enlists the services...See moreCatherine, refuses to believe that her business partner, the unlikeable François, has a best friend, so she challenges him to set up an introduction. Scrambling to find someone willing to pose as his best pal, François enlists the services of a charming taxi driver to play the part.See less",
    "2006_18": "Two women troubled with guy-problems swap homes in each other's countries, where they each meet a local guy and fall in love.",
    "2006_180": "A black police detective must solve a strange case of a kidnapped boy and deal with a big racial protest.",
    "2006_181": "To become the greatest band of all time, two slacker, wannabe-rockers set out on a quest to steal a legendary guitar pick that gives its holders incredible guitar skills, from a maximum security Rock and Roll museum.",
    "2006_182": "In Biblical times, a girl disguises her Jewish origins when the Persian king comes looking for a new bride among his subjects.",
    "2006_183": "An unruly class of gifted and charming teenage boys are taught by two eccentric and innovative teachers, as their headmaster pushes for them all to get accepted into Oxford or Cambridge.",
    "2006_184": "During the first day of his new school year, a fifth grade boy squares off against a bully and winds up accepting a dare that could change the balance of power within the class.",
    "2006_185": "A small town is taken over by an alien plague, turning residents into zombies and all forms of mutant monsters.",
    "2006_186": "Two Canadian detectives, one from Ontario and the other from Quebec, must work together when a murdered victim is found on the Ontario Quebec border line.",
    "2006_187": "At a sexy, sizzling nightclub, pianist Percival lives life by the rules, while Rooster, the club's flashy lead performer, struts his stuff on the stage. But all changes when greed, fame and murder threaten to destroy them and the joint.",
    "2006_188": "Former superhero Jack is called back to work to transform an unlikely group of ragtag kids into superheroes at a private academy.",
    "2006_189": "Two people come to the end of a spear in order to realize that the divisions between them are not real.",
    "2006_19": "In a bid to keep their luxurious condo from their significant other, a couple's break-up proceeds to get uglier and nastier by the moment.",
    "2006_190": "A mix of Dave Chappelle's sketch comedy and musical interludes, inspired in part by the 1973 documentary Wattstax.",
    "2006_191": "Joanna Mills, a traveling business woman, begins having nightmares of a murder that occurred 15 years ago. Soon she is drawn to an old farmhouse, where the murder took place.",
    "2006_192": "In what would cause a fantastic media frenzy, Clifford Irving sells his bogus biography of Howard Hughes to a premiere publishing house in the early 1970s.",
    "2006_193": "A manager of an orphanage in India is sent to Copenhagen, Denmark, where he discovers a life-altering family secret.",
    "2006_194": "Kenya McQueen, an accountant finds love in the most unexpected place when she agrees to go on a blind date with Brian Kelly, a sexy and free-spirited landscaper.",
    "2006_195": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
    "2006_196": "Through the eyes of two state-of-the-art rovers, and with NASA scientists at your side, you'll see Mars in a way no one ever has before-direct from the surface of the amazing red planet.",
    "2006_197": "In the midst of his crumbling relationship, a radio show host begins speaking to his biggest fan, a young boy, via the telephone. But when questions about the boy's identity come up, the host's life is thrown into chaos.",
    "2006_198": "A losing coach with an underdog football team faces their giants of fear and failure on and off the field to surprising results.",
    "2006_199": "Based on the Robert Penn Warren novel. The life of populist Southerner Willie Stark, a political creature loosely based on Governor Huey Long of Louisiana.",
    "2006_2": "A murder inside the Louvre, and clues in Da Vinci paintings, lead to the discovery of a religious mystery protected by a secret society for two thousand years, which could shake the foundations of Christianity.",
    "2006_20": "Boog, a domesticated 900lb. Grizzly bear, finds himself stranded in the woods 3 days before Open Season. Forced to rely on Elliot, a fast-talking mule deer, the two form an unlikely friendship and must quickly rally other forest animals if...See moreBoog, a domesticated 900lb. Grizzly bear, finds himself stranded in the woods 3 days before Open Season. Forced to rely on Elliot, a fast-talking mule deer, the two form an unlikely friendship and must quickly rally other forest animals if they are to form a rag-tag army against the hunters.See less",
    "2006_200": "Painter Francisco Goya faces a scandal involving his muse, who is labeled a heretic by a monk.",
    "2006_201": "A low-ranking thug is entrusted by his crime boss to dispose of a gun that killed corrupt cops, but things get out of control when the gun ends up in wrong hands.",
    "2006_202": "After failing the audition to a prestigious music school because of the rude behavior of one of the testers, a girl takes revenge by gaining the trust of the same woman some years later and becoming indispensable for her.",
    "2006_203": "A magistrate investigates a corporate executive.",
    "2006_204": "A landscape architect's dealings with a young thief cause him to re-evaluate his life.",
    "2006_205": "The story of six young Indians who assist an English woman to film a documentary on the freedom fighters from their past, and the events that lead them to relive the long-forgotten saga of freedom.",
    "2006_206": "A young man (Lerman) moves from Montana to Florida with his family, where he's compelled to engage in a fight to protect a population of endangered owls.",
    "2006_207": "Set in colonial India against Gandhi's rise to power, it's the story of 8-year-old Chuyia, who is widowed and sent to a home to live in penitence; once there, Chuyia's feisty presence deeply affects the lives of the other residents.",
    "2006_208": "A tragicomic movie which focuses on two women and their daily struggle for survival during a summer in Berlin. Katrin, a jobless single mom, and Nike, a nurse, live in the same house and are best friends. Although always dating the wrong ...See moreA tragicomic movie which focuses on two women and their daily struggle for survival during a summer in Berlin. Katrin, a jobless single mom, and Nike, a nurse, live in the same house and are best friends. Although always dating the wrong men and still pursuing for happiness, they don't lose their humor and spend many nights together on Nike's balcony, drinking and chatting. However, Nike gets to know the trucker Ronald one day...  Written by fippi2000See less",
    "2006_209": "An undercover cop in a not-too-distant future becomes involved with a dangerous new drug and begins to lose his own identity as a result.",
    "2006_21": "A police detective, a bank robber, and a high-power broker enter high-stakes negotiations after the criminal's brilliant heist spirals into a hostage situation.",
    "2006_210": "The world's best fighters are invited to DOA, an invitational martial arts contest. There, four female rival fighters will have to work together to uncover the secret that the organizer of the tournament is trying to hide.",
    "2006_211": "Young Augusten Burroughs absorbs experiences that could make for a shocking memoir: the son of an alcoholic father and an unstable mother, he's handed off to his mother's therapist, Dr. Finch, and spends his adolescent years as a member of...See moreYoung Augusten Burroughs absorbs experiences that could make for a shocking memoir: the son of an alcoholic father and an unstable mother, he's handed off to his mother's therapist, Dr. Finch, and spends his adolescent years as a member of Finch's bizarre extended family.See less",
    "2006_212": "An edgy comedy about two frustrated plus-size women obsessed with their weight while struggling to find love and acceptance in a world full of \"hot bodied\" babes.",
    "2006_213": "Sworn enemies find themselves in each other's bodies, and use this to ruin each other's lives.",
    "2006_214": "After much drama, cheating, and trial separations, two men fight to save their respective relationships.",
    "2006_215": "A look at the glamorous life at an old-world Prague hotel.",
    "2006_216": "Life for a pair of veteran actors gets turned upside down after they meet a brash teenager.",
    "2006_217": "A Sicilian peasant begins the journey to the promised land and meets a beautiful Englishwoman. But neither is prepared for the harsh realities of Ellis Island. Can they make it through the golden door to the America of their dreams?",
    "2006_218": "A teenager meets a man in order to expose him under the suspicion that he abducts underage girls.",
    "2006_219": "The lives of a gifted athlete and his best friend change when they take a fateful trip to Los Angeles. The young hopefuls must use every skill at their command to topple the reigning street ball champions from their thrones.",
    "2006_22": "On New Year's Eve, the luxury ocean liner Poseidon capsizes after being swamped by a rogue wave. The survivors are left to fight for their lives as they attempt to escape the sinking ship.",
    "2006_220": "Haunted by a horrible past, a Ukrainian young woman calculatedly insinuates herself into the life of a rich Italian family.",
    "2006_221": "In Paris, six people all look for love, despite typically having their romantic aspirations dashed at every turn.",
    "2006_222": "This hilarious mockumentary film follows the numerous misadventures of a porta-john worker through both his personal and professional life, including an oddly glamorous excursion to the Pumper and Cleaner Expo in Nashville, TN.",
    "2006_223": "A thirty-five-year-old video game tester has to move in with his grandma and her two old lady roommates.",
    "2006_224": "A fictionalized account of the last year of Beethoven's life.",
    "2006_225": "Taj Mahal Badalandabad leaves Coolidge College behind for the halls of Camford University in England, where he looks to continue his education, and teach an uptight student how to make the most out of her academic career.",
    "2006_226": "A twelve-year-old piano prodigy who suffocates from his parent's big dreams for him decides to make his escape--and with the aid of his grandfather--chase his own dreams instead.",
    "2006_227": "After four men on a fishing trip discover a dead body in the water, they choose to delay reporting it and continue fishing.",
    "2006_228": "A tough-minded drama about two friends in South Central Los Angeles and the violence that comes between them.",
    "2006_229": "Lilaram sells lottery tickets and one customer has hit the jackpot but dies of shock upon finding out that he has won. Now, Lilaram wants all the money, and so does everyone around him.",
    "2006_23": "After a ferry is bombed in New Orleans, an A.T.F. agent joins a unique investigation using experimental surveillance technology to find the bomber, but soon finds himself becoming obsessed with one of the victims.",
    "2006_230": "Three actors learn that their respective performances in the film \"Home for Purim,\" a drama set in the mid-1940s American South, are generating award-season buzz.",
    "2006_231": "While in post-war Berlin to cover the Potsdam Conference, an American military journalist is drawn into a murder investigation which involves his former mistress and his driver.",
    "2006_232": "A drama about terrorism in Apartheid-era South Africa, revolving around a policeman and a young man who carries out solo attacks against the regime.",
    "2006_233": "A group of New Yorkers caught up in their romantic-sexual milieu converge at an underground salon infamous for its blend of art, music, politics, and carnality.",
    "2006_234": "During a team-building retreat in the mountains a group of sales representatives are hunted down one by one.",
    "2006_235": "A thrilling story spanning 48 hours of five individuals linked by hate and fear but brought together by fate to finally recognize each other.",
    "2006_236": "A mockumentary that follows three couples as they battle it out to win the coveted title of 'Most Original Wedding of the Year'.",
    "2006_237": "An inner-city junior high school teacher with a drug habit forms an unlikely friendship with one of his students after she discovers his secret.",
    "2006_238": "When a career criminal's plan for revenge is thwarted by unlikely circumstances, he puts his intended victim's son in his place by putting him in prison...and then joining him.",
    "2006_239": "Ayaan tricks a model into marrying him, when she leaves her diary in his family's garage, allowing him to follow her around.",
    "2006_24": "The story of an uptown rat that gets flushed down the toilet from his penthouse apartment, ending in the sewers of London, where he has to learn a whole new and different way of life.",
    "2006_240": "A 13-year-old boy uses his upcoming bar mitzvah to reconcile the strained relationship between his father and grandfather.",
    "2006_241": "A wealthy Havana club owner and his family are torn apart by the violent sociopolitical upheaval brought about by the transition from the dictatorial regime of Batista to the Marxist revolution led by Fidel Castro in 1950s Cuba.",
    "2006_242": "As an actress begins to adopt the persona of her character in a film, her world becomes nightmarish and surreal.",
    "2006_243": "Director Michael Winterbottom (Northam) attempts to shoot the adaptation of Laurence Sterne's essentially unfilmable novel, \"The Life and Opinions of Tristram Shandy, Gentleman.\"",
    "2006_244": "A teenage loner pushes his way into the underworld of a high school crime ring to investigate the disappearance of his ex-girlfriend.",
    "2006_245": "A debt-ridden young man attempts suicide, but is rescued only to find that his luck is finally turning.",
    "2006_246": "Ricky, Julian and Bubbles come up with a scheme to steal large amounts of untraceable coins.",
    "2006_247": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2006_248": "A Japanese father travels to China's Yunnan province in the place of his ailing son to film a folk-opera singer.",
    "2006_249": "In the eighteenth century, a vampire escapes from the freak show, in which she once participated, and teams up with a group of vampire slayers to kill the man who raped her mother.",
    "2006_25": "Cindy finds out the house she lives in is haunted by a little boy and goes on a quest to find out who killed him and why. Also, Alien \"Tr-iPods\" are invading the world and she has to uncover the secret in order to stop them.",
    "2006_250": "Based on the rise and fall of socialite Edie Sedgwick, concentrating on her relationships with Andy Warhol and a folk singer.",
    "2006_251": "On a Caribbean cruise, Jenny is marooned on a beach with her rock and roll idol. Deliriously in love with the idea of time alone with him, she manages to hide the fact that they're a stone's throw away from their resort. Read more: Synopsis",
    "2006_252": "In Australia's Northern Territory, a man tells us a story of his people and his land. It's about an older man, Minygululu, who has three wives and realizes that his younger brother Dayindi may try to steal away the youngest wife.",
    "2006_253": "A romantic comedy about our amazing capacity to rebound and fall in love at any age. Lois, Harry, Marilyn ,Sandy and Jack live in an \"Active Adult\" community in Boynton Beach, Florida. Their lives intersect when they meet at a local ...See moreA romantic comedy about our amazing capacity to rebound and fall in love at any age. Lois, Harry, Marilyn ,Sandy and Jack live in an \"Active Adult\" community in Boynton Beach, Florida. Their lives intersect when they meet at a local Bereavement Club where they go to find emotional support after the loss of a loved one. For anyone who thinks that new love and romance ends long before retirement, they're in for a reality check. No one sees themselves as becoming old, and the residents of Boynton Beach aren't about to start. But sometimes we all need a little reminder that life is worth living and sharing.  Written by AnonymousSee less",
    "2006_254": "Five men wake up in a locked-down warehouse with no memory of who they are. They are forced to figure out who is good and who is bad to stay alive. Read more: Synopsis",
    "2006_255": "Starting from childhood attempts at illustration, the protagonist pursues his true obsession to art school. But as he learns how the art world really works, he finds that he must adapt his vision to the reality that confronts him.",
    "2006_256": "Three female tourists have their eyes opened while visiting the poverty-stricken and dangerous world of 1980s Haiti.",
    "2006_257": "A boy is left alone in a Jewish neighborhood in the year of 1970, where both world cup and dictatorship happen in Brazil.",
    "2006_258": "A French adaptation of the second (and much less well-known) version of D.H. Lawrence's erotic tale.",
    "2006_259": "An in-depth look at The New York Times' long-time crossword puzzle editor Will Shortz and his loyal fan base.",
    "2006_26": "A fisherman, a smuggler, and a syndicate of businessmen match wits over the possession of a priceless diamond.",
    "2006_260": "Lucas and Clementine live peacefully in their isolated country house, but one night they wake up to strange noise... they're not alone... and a group of hooded assailants begin to terrorize them throughout the night.",
    "2006_261": "An IT company hires an actor to serve as the company's president in order to help the business get sold to a cranky Icelander.",
    "2006_262": "A historical epic set in 18th-century Kazakhstan, where a young man is destined to unite the country's three warring tribes.",
    "2006_263": "Four raucous Samoans are banned from their best friend's wedding. To get in, they have to prove themselves as mature individuals by getting and keeping girlfriends.",
    "2006_264": "This down-and-dirty musical set in the world of working-class New York tells the story of a husband's journey into infidelity and redemption when he must choose between his seductive mistress and his beleaguered wife.",
    "2006_265": "Ralph witnesses the disintegration of his parents' marriage through adultery and alcohol during the last gasp of the British Empire in Swaziland in 1969. Ralph finds his new step-mother is the only one who understands his inner turmoil.",
    "2006_266": "A tale of friendship between two men, one Jewish and the other Arab, as the country of Israel is being created. Read more: Synopsis",
    "2006_267": "While researching his novel \"In Cold Blood\", Truman Capote develops a close relationship with convicted murderers Dick Hickock and Perry Smith.",
    "2006_268": "In the late 1980s, a low level gangster named Jackie DiNorscio defends himself in court in what became the longest criminal trial in American judicial history.",
    "2006_269": "A newlywed bride becomes infatuated with another woman who questions her sexual orientation, promoting a stir among the bride's family and friends.",
    "2006_27": "Jigsaw abducts a doctor in order to keep himself alive while he watches his new apprentice put an unlucky citizen named Jeff through a brutal test.",
    "2006_270": "An adopted woman returns to her home country and the family home that she never knew and must face the mystery that lies there.",
    "2006_271": "On summer holiday in Provance, Frederic meets Hugo and develops a powerful bond that threatens his family.",
    "2006_272": "As Magdalena's 15th birthday approaches, her simple, blissful life is complicated by the discovery that she's pregnant. Kicked out of her house, she finds a new family with her great-granduncle and gay cousin.",
    "2006_273": "Based on the true story, two homicide detectives track Martha Beck and Raymond Martinez Fernandez, a murderous pair known as the \"Lonely Hearts Killers\" who lured their victims through the personals.",
    "2006_274": "A town in Fengjie county is gradually being demolished and flooded to make way for the Three Gorges Dam. A man and woman visit the town to locate their estranged spouses, and become witness to the societal changes.",
    "2006_275": "Mexican beauty Camilla Lopez (Salma Hayek) hopes to rise above her station by marrying a wealthy American. That is complicated by meeting Arturo Bandini (Colin Farrell), a first-generation Italian hoping to land a writing career and a ...See moreMexican beauty Camilla Lopez (Salma Hayek) hopes to rise above her station by marrying a wealthy American. That is complicated by meeting Arturo Bandini (Colin Farrell), a first-generation Italian hoping to land a writing career and a blue-eyed blonde on his arm.See less",
    "2006_276": "Un premier de l'an, alors qu'une tempête souffle sur Montreal, de nombreux parents et amis sont reunis dans un salon funeraire à l'occasion des funerailles du septuagenaire Jos. Malgre la tristesse de l'evenement, un climat de fête ...See moreUn premier de l'an, alors qu'une tempête souffle sur Montreal, de nombreux parents et amis sont reunis dans un salon funeraire à l'occasion des funerailles du septuagenaire Jos. Malgre la tristesse de l'evenement, un climat de fête s'installe lentement parmi les gens reunis autour de Jeanne, la fille du defunt, et Blanche, son epouse dont il etait separe depuis vingt ans. Au fil de la journee, à travers les reminiscences des uns et des autres, Jeanne va apprendre d'etonnants secrets sur le passe de ses parents.---------------- On a New Year's Day, while a storm blows on Montreal, numerous relatives and friends are gathered in a funeral home on the occasion of the burial of the septuagenarian Jos. In spite of the sadness of the event, a festive climate settles down slowly among the people gathered around Jeanne, the girl of the deceased, and Blanche, his wife from whom he was separated for twenty years. In the course of the day, through the recollections of some and others, Jeanne is going to learn surprising secrets regarding the past of her parents.See less",
    "2006_277": "Turning her back on her wealthy, established family, Diane Arbus falls in love with Lionel Sweeney, an enigmatic mentor who introduces Arbus to the marginalized people who help her become one of the most revered photographers of the twentieth century.",
    "2006_278": "A prequel to the critically-acclaimed series featuring Jerri Blank, a 46-year-old ex-junkie ex-con who returns to high school in a bid to restart her life.",
    "2006_279": "An ensemble piece examining the health risks involved in the fast food industry and its environmental and social consequences as well.",
    "2006_28": "Based on the 1980s TV action/drama, this update focuses on vice detectives Crockett and Tubbs as their respective personal and professional lives become dangerously intertwined.",
    "2006_280": "A film shot over during a two-night performance by Neil Young at Nashville's Ryman Auditorium.",
    "2006_281": "Just as his childhood sweetheart Natalia returns, his infertile brother Antonio asks Jorge to impregnate Paula, Antonio's imprisoned girlfriend.",
    "2006_282": "A poet falls in love with an art student who gravitates to his bohemian lifestyle -- and his love of heroin. Hooked as much on one another as they are on the drug, their relationship alternates between states of oblivion, self-destruction, and despair.",
    "2006_283": "A dirty bomb goes off in Los Angeles, jamming freeways and spreading a toxic cloud.",
    "2006_284": "A group of guys who sang together in a college a cappella group reunite 15 years later to perform at a friend's wedding and discover how their lives have progressed -- and in some cases regressed -- since their college heyday.",
    "2006_285": "The movie is a coming-of-age drama about a boy growing up in Astoria, New York during the 1980s. As his friends end up dead, on drugs, or in prison. He comes to believe he has been saved from their fates by various so-called saints.",
    "2006_286": "Set in 2002, an abandoned 5-year-old boy living in a rundown orphanage in a small Russian village is adopted by an Italian family.",
    "2006_287": "As election time nears, current Triad chairman Lok (Yam) faces competition from his godsons. At the same time, Jimmy (Koo) looks to increase his business relations with mainland China.",
    "2006_288": "In 2054, Paris is a labyrinth where all movement is monitored and recorded. Casting a shadow over everything is the city's largest company, Avalon, which insinuates itself into every aspect of contemporary life to sell its primary export, ...See moreIn 2054, Paris is a labyrinth where all movement is monitored and recorded. Casting a shadow over everything is the city's largest company, Avalon, which insinuates itself into every aspect of contemporary life to sell its primary export, youth and beauty. In this world of stark contrasts and rigid laws, the populace is kept in line and accounted for.See less",
    "2006_289": "Anna has just left Paul who, annihilated by the separation, moves back with his father in Paris. His younger brother Jonathan, a casual student, still lives in his father's apartment and spends most of his time womanizing and fooling ...See moreAnna has just left Paul who, annihilated by the separation, moves back with his father in Paris. His younger brother Jonathan, a casual student, still lives in his father's apartment and spends most of his time womanizing and fooling around. But what this apparent lightness conceals is a deep wound. Jonathan, in fact, has never been able to overcome the death of his beloved sister. Meanwhile Paul sinks into depression...  Written by Guy BellingerSee less",
    "2006_29": "Bumbling Inspector Clouseau must solve the murder of a famous soccer coach and find out who stole the infamous Pink Panther diamond.",
    "2006_290": "The life of Bettie Page, a 1950s pin-up model and one of the first sex icons in America, who became the target of a Senate investigation because of her risque bondage photos.",
    "2006_291": "In 1920, Inge, a German national, travels from Norway to rural Minnesota for her arranged marriage to Olaf, a Norwegian farmer; bureaucracy and prejudice cause major complications.",
    "2006_292": "A documentary that investigates the birth and death of the electric car, as well as the role of renewable energy and sustainable living in the future.",
    "2006_293": "Set in 1985, working-class student Brian Jackson (McAvoy) navigates his first year at Bristol University.",
    "2006_294": "A group of five college kids are forced to match wits with unwelcoming residents when they fly to a \"deserted\" island for a party weekend.",
    "2006_295": "Follows a love triangle between Agastya, Suhaan and Piya.",
    "2006_296": "In Helsinki, a lonely night watchman is caught up in a series of misadventures with a femme fatale and a crooked businessman.",
    "2006_297": "Both an homage to and a re-imagining of the original 1968 film, this update follows a group of survivors trapped in a farmhouse battling a siege of undead zombies....in 3D!",
    "2006_298": "Part drama, part documentary, The Road to Guantánamo focuses on the Tipton Three, a trio of British Muslims who were held in Guantanamo Bay for two years until they were released without charge.",
    "2006_299": "Jose Maria and his sister Mercedes are archaeologists who have been given a grant to study the story of Our Lady of Guadalupe, whom Juan Diego, an ordinary man living near the hill of Tepeyac, witnessed in December 1531.",
    "2006_3": "Manny, Sid, and Diego discover that the ice age is coming to an end, and join everybody for a journey to higher ground. On the trip, they discover that Manny, in fact, is not the last of the woolly mammoths.",
    "2006_30": "Number one NASCAR driver Ricky Bobby stays atop the heap thanks to a pact with his best friend and teammate, Cal Naughton, Jr. But when a French Formula One driver, makes his way up the ladder, Ricky Bobby's talent and devotion are put to the test.",
    "2006_300": "Is American foreign policy dominated by the idea of military supremacy? Has the military become too important in American life? Jarecki's shrewd and intelligent polemic would seem to give an affirmative answer to each of these questions.",
    "2006_301": "A documentary on the life of John Lennon, with a focus on the time in his life when he transformed from a musician into an antiwar activist.",
    "2006_302": "An actor (Freeman) prepping for an upcoming role meets a quirky grocery clerk (Vega), and the pair hit the road to show one another their respective worlds.",
    "2006_303": "A documentary on the legendary singer-songwriter, with performances by those musicians he has influenced.",
    "2006_304": "Juliette, 15 ans, est la fille unique d'un eminent juge de la Cour Superieure du Quebec. Élevee dans un milieu bourgeois, elle a beneficie d'une education sans failles dans les meilleures ecoles. Son père se retrouve au centre de ...See moreJuliette, 15 ans, est la fille unique d'un eminent juge de la Cour Superieure du Quebec. Élevee dans un milieu bourgeois, elle a beneficie d'une education sans failles dans les meilleures ecoles. Son père se retrouve au centre de l'attention mediatique lorsqu'il est invite à presider un des procès les plus importants des dix dernières annees : celui de Real Lamontagne, criminel notoire, redoute et redoutable. Romeo, 17 ans, a lui aussi une famille celèbre : il est le fils de Real Lamontagne. Son père est accuse d'avoir commis des crimes d'une monstruosite indescriptible: il est incrimine pour avoir cause la mort d'un enfant. Cependant, le magnetisme que degage Romeo n'est pas passe inaperçu de Juliette. Malgre le fait qu'ils viennent de mondes diametralement opposes, les deux jeunes gens s'eprennent l'un de l'autre. Les nombreux obstacles les empêcheront-ils de vivre leur amour et de rester unis en liberte? Romeo et Juliette est une grande histoire d'amour. Les pôles opposes de l'amour et de la haine se retrouvent dans un contexte de rivalite et d'incompatibilite sociale.See less",
    "2006_305": "A dowdy university instructor Isa is an inattentive husband to his younger, TV-business wife Bahar. Self-absorbed and selfish, Isa only communicates in the most rudimentary way, while she, similarly, detaches into crying jags and juvenile behavior.",
    "2006_306": "A drama focused on the friendship between a high-functioning autistic woman and a man who is traumatized after a fatal car accident.",
    "2006_307": "J.P. Dutta's adaption of the Urdu novel \"Umrao Jan Ada\" by Mirza Haadi Ruswa (1905).",
    "2006_308": "A 9-year-old girl weathers big changes in her household as her parents become radical political activists in 1970-71 Paris.",
    "2006_309": "Joshua Steed returns to Missouri a wealthy man with a beautiful wife; however, the past has a way of catching up. Soon Joshua is tangled in a web of rumors, deception and betrayal that threatens to tear his family apart. Back in Kirtland, ...See moreJoshua Steed returns to Missouri a wealthy man with a beautiful wife; however, the past has a way of catching up. Soon Joshua is tangled in a web of rumors, deception and betrayal that threatens to tear his family apart. Back in Kirtland, financial trouble riddles the foundations of the fledgling Church causing a division, and questioning of the Prophet Joseph Smith's divine calling. Has he lost his prophetic gift? Hundreds of Saints immigrate to Missouri, where Governor Boggs raises an army - with Joshua at its head - to address the \"Mormon Problem.\" When the militia receives orders to attack the Mormon settlement, only Joshua can save his family from the gathering mob.  Written by Excel Entertainment GroupSee less",
    "2006_31": "Two Port Authority police officers become trapped under the rubble of the World Trade Center.",
    "2006_310": "Two competitive friends, fueled by literary aspirations and youthful exuberance, endure the pangs of love, depression and burgeoning careers. Read more: Synopsis",
    "2006_311": "A coming of age story about a shy teenage boy trying to escape from the influence of his domineering mother. His world changes when he begins to work for a retired actress. Read more: Synopsis",
    "2006_312": "A friendship is formed between an ex-gangster, and two groups of hitmen - those who want to protect him and those who were sent to kill him.",
    "2006_313": "A woman is taken along with her mother in 1910 to a far-away desert by her husband, and after his passing, is forced to spend the next 59 years of her life hopelessly trying to escape it.",
    "2006_314": "A top Hollywood talent agent finds his cushy existence threatened when he discovers that his wife is cheating on him and that his journal has been swiped by a reporter out to bring him down.",
    "2006_315": "Aditya an engineer, travels to Canada for training. There he meets Jia a beautiful woman from an influential family. Fate keeps pushing the pair together, and even though both are already betrothed to others, Adi and Jia fall in love.",
    "2006_316": "Jackie works as a CCTV operator. Each day she watches over a small part of the world, protecting the people living their lives under her gaze. One day a man appears on her monitor, a man she thought she would never see again, a man she ...See moreJackie works as a CCTV operator. Each day she watches over a small part of the world, protecting the people living their lives under her gaze. One day a man appears on her monitor, a man she thought she would never see again, a man she never wanted to see again. Now she has no choice, she is compelled to confront him.See less",
    "2006_317": "A chance encounter with a stranger changes the life of a college gymnast.",
    "2006_318": "As he adjusts to being a husband and father, Ariel Perelman meditates on the ways in which he is similar -- and so very different -- from his own dad.",
    "2006_319": "Bamako. Mele is a bar singer, her husband Chaka is out of work and the couple is on the verge of breaking up... In the courtyard of the house they share with other families, a trial court has been set up. African civil society spokesmen ...See moreBamako. Mele is a bar singer, her husband Chaka is out of work and the couple is on the verge of breaking up... In the courtyard of the house they share with other families, a trial court has been set up. African civil society spokesmen have taken proceedings against the World Bank and the IMF whom they blame for Africa's woes... Amidst the pleas and the testimonies, life goes on in the courtyard. Chaka does not seem to be concerned by this novel Africa's desire to fight for its rights...  Written by AnonymousSee less",
    "2006_32": "A teenager becomes a major competitor in the world of drift racing after moving in with his father in Tokyo to avoid a jail sentence in America.",
    "2006_320": "Chronicles the dramatic true journey of a struggling man turned homeless, who inadvertently becomes a spiritual messenger and bestselling author.",
    "2006_321": "A documentary on kids who attend a summer camp hoping to become the next Billy Graham.",
    "2006_322": "When a man and woman flirt with each other at a wedding reception, the sexual tension seems spontaneous. As they break from the party to a hotel room, the flirtation turns into a night filled with passion and remorse.",
    "2006_323": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
    "2006_324": "The clues to a young woman's death come together as the lives of seemingly unrelated people begin to intersect.",
    "2006_325": "An adaptation of James Redfield's novel about the search for a sacred manuscript in the Peruvian rain forest.",
    "2006_326": "To improve its relations with Muslim countries, the United States government sends comedian Albert Brooks to south Asia to write a report on what makes followers of Islam laugh.",
    "2006_327": "Years after the assassination of President George W. Bush in Chicago, an investigative documentary examines that as-yet-unsolved crime.",
    "2006_328": "Set in the present-day San Fernando Valley, the project revolves around a delusional man who believes he's a cowboy and the relationship that he starts with a rebellious young woman.",
    "2006_329": "A look at the life and work of the renown architect.",
    "2006_33": "Thirty years after the ring of the first bell, Rocky Balboa comes out of retirement and dons his gloves for his final fight against the reigning heavyweight champ Mason 'The Line' Dixon.",
    "2006_330": "A woman and her daughter struggle to make their way through the aftermath of the Bosnian War.",
    "2006_331": "A groom (Ed Burns) and his four attendants wrestle with issues related to friendship and maturity a week before the big day.",
    "2006_332": "An account of underground resistance fighters in Nazi-occupied France.",
    "2006_333": "A man takes over a dead man's task without realizing the horror it entails.",
    "2006_334": "The goalkeeper of a little-known soccer team is kidnapped by a Argentinean government squad and sent to a detention center. After months of torture, he plots his escape with three other young men.",
    "2006_335": "Four gay high school friends make a pact to lose their virginity before they go to college.",
    "2006_336": "A troubled man, recently discharged from the Navy, goes to Corpus Christi, Texas, in search of the father he's never met.",
    "2006_337": "A documentary about the disastrous 1968 round-the-world yacht race.",
    "2006_338": "Watch lead star, Suresh Gopi packs a double punch in this out-and-out crime thriller also starring Vimala Raman and Padmapriya Janakiraman. Read more: Synopsis",
    "2006_339": "In 1964, to explore the adage \"Give me a child until he is seven and I will give you the man,\" World in Action filmed seven-year-olds. Every seven years, Michael Apted visits them. At 49, 12 agree to talk about family, work, their hopes, ...See moreIn 1964, to explore the adage \"Give me a child until he is seven and I will give you the man,\" World in Action filmed seven-year-olds. Every seven years, Michael Apted visits them. At 49, 12 agree to talk about family, work, their hopes, and the series. We also see footage from previous interviews. Some marriages seem stronger; some have ended. Being a parent or a grandparent dominates life's pleasures. Simon has found responsibility; John's charity work flourishes. Neil remains in politics, against all odds. Jackie leads the critique of a more deliberately-present Apted and the series' intrusiveness. None enjoy participating; all are reflective; several surpass expectations.  Written by See less",
    "2006_34": "A trio of black female soul singers cross over to the pop charts in the early 1960s, facing their own personal struggles along the way.",
    "2006_340": "Patrons locked inside a bar are forced to fight monsters.",
    "2006_341": "A young carpenter is mistaken for a Catholic priest and sustains the misunderstanding to seduce a girl.",
    "2006_342": "Priscilla Chase is a woman who has never had an orgasm.",
    "2006_343": "A recently engaged woman's life is thrown into turmoil after confessing to her fiance that she once experimented with bestiality.",
    "2006_344": "Instead of adhering to the norms of their South Central neighborhood, a group of skater boys opt to bus into Hollywood and Beverly Hills, where they attract local rich girls - and plenty of trouble with the police, jealous boyfriends, and ...See moreInstead of adhering to the norms of their South Central neighborhood, a group of skater boys opt to bus into Hollywood and Beverly Hills, where they attract local rich girls - and plenty of trouble with the police, jealous boyfriends, and nervous parents.  Written by AnonymousSee less",
    "2006_345": "At 40, Miriam radiates serene beauty and tranquility, a confidence and self-assurance as vast as the sea close to her summer home. There are no taboos in the polished, urbane life she shares with her partner Andre and their 15-year-old son...See moreAt 40, Miriam radiates serene beauty and tranquility, a confidence and self-assurance as vast as the sea close to her summer home. There are no taboos in the polished, urbane life she shares with her partner Andre and their 15-year-old son Nils; there is understanding and tolerance. If Nils invites his 12-year-old girlfriend Livia to spend the holidays with them, fine. But when the brazenly sensual Livia begins flirting with an older man, Bill, Miriam feels it is her responsibility to stop the questionable relationship. But as she does so, it is she herself who falls for the shy and charmingly insecure Bill. Miriam forges ahead, seducing him, seeing him secretly. But it is Livia that Bill loves, not Miriam. And suddenly the vast horizons of her life vanish in a fog of jealousy and rejection - emotions that prove to be far less controllable than she thought...  Written by Bavaria Film InternationalSee less",
    "2006_346": "Sherry tries to integrate again into society and become a good mother.",
    "2006_347": "A portrait of Austrian artist Gustav Klimt, whose lavish, sexual paintings came to symbolize the art nouveau style of the late nineteenth and early twentieth century.",
    "2006_348": "A television actress encounters a variety of eccentric characters after embarking on a journey to discover why her lover abruptly left her.",
    "2006_349": "Eleven-year-old David Wiseman is mad about cricket but no good at it. He has the entire kit but none of the skill. So when a Jamaican family moves in next door and builds a cricket net in the back garden, David is in seventh heaven.",
    "2006_35": "Wilbur the pig is scared of the end of the season, because he knows that come that time, he will end up on the dinner table. He hatches a plan with Charlotte, a spider that lives in his pen, to ensure that this will never happen.",
    "2006_350": "Because of the actions of her irresponsible parents, a young girl is left alone on a decrepit country estate and survives inside her fantastic imagination.",
    "2006_351": "A local talk show host organizes an alcoholic professor and a pensioner known for playing Santa Claus to decide whether there was ever a revolution in their town Vaslui.",
    "2006_352": "When an assassin is diagnosed with terminal cancer, she decides to carry out one final killing, assisted by her lover and stepson, Mikey.",
    "2006_353": "Three soldiers struggle to readjust to life at home after returning home from a lengthy tour in Iraq.",
    "2006_354": "The true story of a man who posed as director Stanley Kubrick during the production of Kubrick's last film, Eyes Wide Shut, despite knowing very little about his work and looking nothing like him.",
    "2006_355": "Private Joe Bauers, the definition of \"average American\", is selected by the Pentagon to be the guinea pig for a top-secret hibernation program. Forgotten, he awakes five centuries in the future. He discovers a society so incredibly dumbed...See morePrivate Joe Bauers, the definition of \"average American\", is selected by the Pentagon to be the guinea pig for a top-secret hibernation program. Forgotten, he awakes five centuries in the future. He discovers a society so incredibly dumbed down that he's easily the most intelligent person alive.See less",
    "2006_356": "A Catholic Priest and an English teacher get stranded in a school in Kigali during the 1994 Rwandan genocide.",
    "2006_357": "The story is set in 1890s Siam. Siang (Dan Chupong) is a young Muay Thai warrior and rocketry expert who steals back water buffalo taken from poor Isan farmers by unscrupulous cattle raiders. He is searching for a man with a tattoo who ...See moreThe story is set in 1890s Siam. Siang (Dan Chupong) is a young Muay Thai warrior and rocketry expert who steals back water buffalo taken from poor Isan farmers by unscrupulous cattle raiders. He is searching for a man with a tattoo who killed his parents.  Written by AnonymousSee less",
    "2006_358": "An unemployed slacker inspires his softball teammates to improve their game so they won't get kicked out of the local league.",
    "2006_359": "Dennis Buckstead has the hardest calling in his church. Not only has he been asked to coach a group of non-basketball players in his church but the bishop has demanded that he lead the team to the Basketball Championship. Word from the top...See moreDennis Buckstead has the hardest calling in his church. Not only has he been asked to coach a group of non-basketball players in his church but the bishop has demanded that he lead the team to the Basketball Championship. Word from the top is that this is the last season of church ball and Bishop Linderman isn't about to have his team lose for the 20th year in a row in the last season of church ball history! What was supposed to strengthen the body, invigorate the mind and cultivate brotherly love seems to bring out the worst in these church-going ball players. Dennis must find a way to bring his team together and build unity along the way to win the championship or go down in church ball history as the worst team that ever played.  Written by HaleStorm EntertainmentSee less",
    "2006_36": "Jon and Garfield visit the United Kingdom, where a case of mistaken cat identity finds Garfield ruling over a castle. His reign is soon jeopardized by the nefarious Lord Dargis, who has designs on the estate.",
    "2006_360": "Ethan Jenkins (Michael W. Smith) and Jake Sanders (introducing Jeff Obafemi Carr) are both passionate pastors who worship the same God from the same book--but that's where the similarity ends. White and well-to-do Ethan is comfortable in ...See moreEthan Jenkins (Michael W. Smith) and Jake Sanders (introducing Jeff Obafemi Carr) are both passionate pastors who worship the same God from the same book--but that's where the similarity ends. White and well-to-do Ethan is comfortable in his music ministry at the media-savvy suburban mega-church, The Rock; Jake is a street smart African-American who ministers to the gang members, teen mothers, and drug addicts of the urban Second Chance. When they are suddenly thrown together in a tough neighborhood and forced to work side by side, Ethan discovers there is no boundary between the streets and the sanctuary. But can the faith these two men share overcome the prejudices that divide them to give themselves and a struggling urban church a second chance?  Written by Tracey ZemitisSee less",
    "2006_361": "Romeo & Juliet: Sealed With a Kiss is a fully animated feature fantasy about two star crossed seals from warring families that fall in love against their parents' wishes. When Juliet's father gives her hand in marriage to the monstrous ...See moreRomeo & Juliet: Sealed With a Kiss is a fully animated feature fantasy about two star crossed seals from warring families that fall in love against their parents' wishes. When Juliet's father gives her hand in marriage to the monstrous elephant seal Prince, Juliet must fake her death in order to be reunited with Romeo. But the plan goes afoul and it's a desperate race to the end. With the help of their friends Friar Lawrence and Kissy, the kissing fish, the day is saved and the young lovers are reunited. Romeo & Juliet: Sealed With a Kiss is the ageless tale of love and prejudice set in an undersea world. A film that can be enjoyed by the whole family.  Written by Phil NibbelinkSee less",
    "2006_362": "Desperate to evade an angry pimp, a London prostitute and a young girl flee by train to Brighton after an appointment with a powerful client goes violently wrong.",
    "2006_363": "A documentary Roosevelt Roughriders, a girls' high-school basketball team in Seattle, and one player's fight to regain her eligibility to play.",
    "2006_364": "A daughter of the powerful Duke must show her courage and inventiveness to be with the man she loves.",
    "2006_365": "Struggle of Women in a country that excludes them from entering the stadiums.",
    "2006_366": "Daniel Johnston, manic-depressive genius singer/songwriter/artist is revealed in this portrait of madness, creativity and love.",
    "2006_367": "A family's Passover gets screwy after the patriarch unknowingly ingests a hit of Ecstasy.",
    "2006_368": "A pair of estranged twins driven apart by the death of their parents find reconciliation and redemption after following radically different paths in life.",
    "2006_369": "A widowed man's life turns upside down when he embarks on a journey to find a dying man's long lost love.",
    "2006_37": "Three teens discover that their neighbor's house is really a living, breathing, scary monster.",
    "2006_370": "Bruno Dumont follows up the controversial Twentynine Palms with this tale of a group of young soldiers who go off to war and experience some life-changing events. Flandres won the Grand Prix Prize at the 2006 Cannes Film Festival.",
    "2006_371": "A small, poor village leaning over high rocky mountains, facing the immense sea, flanked by olive yards. Villagers are simple and diligent people who struggle to cope with a harsh nature. They earn their living, on a daily survival basis, ...See moreA small, poor village leaning over high rocky mountains, facing the immense sea, flanked by olive yards. Villagers are simple and diligent people who struggle to cope with a harsh nature. They earn their living, on a daily survival basis, out of the earth and of a few animals they feed. Just like the animals and trees around them, they have the knowledge of their temporary existence, hence a sober resignation prevails. They live according to the rhythm of the earth, air and water, day and night and seasons. The daily time is divided into five parts by the sound of the call to prayer. Every day, all human events are lived through within these five time slices. In child raising, grownups go on with the practice they have experienced by their parents. They expose their love awkwardly and consider beating a favorable method. Fathers always prefer one of their sons. Mothers command their daughters ruthlessly. Ömer, Yakup and Yildiz, three children of about 12,13 years old, just between childhood and youth, are the prominent characters in this movie of five times. Ömer, the son of the imam, wishes hopelessly for the death of his father. When he understands that wishful thinking does not have any concrete results, he begins to search for childish ways to kill his father. He shares his guilty thoughts with his friend Yakup. Children study in the village school consisting of only one classroom. Families show their gratitude to the young woman teacher by giving her presents -the bread they cook themselves, the milk of their own sheep. Yakup is in love with his teacher. He hides his guilty feelings even from his best friend Ömer. When some day he sees his father spying the teacher, he dreams, like Yakup, of killing his father. Yildiz both studies and tries to manage the household works imposed by her own mother. She tries to be a mother for her baby brother. On the other hand, she learns with irritation about the secrets of the relationship between men and women. Five times elapse. Children, oscillating between rage and guilt, grow up slowly. Ömer gives up killing his father. Stuck between love and hate, he cries desperately.  Written by omayra73@yahoo.comSee less",
    "2006_372": "Following the unexpected death of her father, a deaf teenager moves in with her godparents, where she discovers the cruel behaviour of their daughter may be indicative of a dark secret within the family.",
    "2006_373": "The History of American Punk Rock 1980-1986",
    "2006_374": "In Morocco to assist with the creation of a food charity, a Dutchman is abducted by a terrorist.",
    "2006_375": "Kirby Dick's expose about the American movie ratings board.",
    "2006_376": "A man, taken and locked up for 14 years without any sane reason, is suddenly released, and has 4 days to figure out why this was done to him.",
    "2006_377": "It was love at first sight for unemployed Ashish Khanna and Rani Bhalla at a cold drink stall. When Rani introduces Ashish to her businessman dad, Tau, and mom, they unanimously frown upon this alliance, until Ashish promises to get a job,...See moreIt was love at first sight for unemployed Ashish Khanna and Rani Bhalla at a cold drink stall. When Rani introduces Ashish to her businessman dad, Tau, and mom, they unanimously frown upon this alliance, until Ashish promises to get a job, save enough money, buy a flat, etc.. Ashish does get a small job with Izzat Papads, and then also starts selling steroids out of the back of a van. He gets noticed by a Ad-firm owner, and gets hired. Soon he has all the luxuries that he had always dreamed of. When the Bhallas come to know about this, they decide to welcome him as their son-law, and a lavish engagement party takes place. It is then Ashish finds out that he has cancer, and he begins to create misunderstandings between him and Rani. He tries becoming an alcoholic, but that is considered normal with the Bhalla family; he confesses to Rani that he has loved Sania, a model with ad-agency, which is welcomed by Rani as being truthful and honest. But when Rani notices that he has put up Sania's photos all over his apartment, it is then that she breaks off the engagement. Ashish knows that Sania will not marry him, as she is a flirt. But when he is assigned to go to Malaysia with Sania, that is where he finds out that Sania is not quite a flirt, but wants to marry him. She even introduces him to her brother, Anna, who instantly approves of the match. Now Anna inducts Ashish into the family business - which is extortion, and a stunned Ashish is trained to be use guns and defend himself. When the time comes for marriage, Ashish confesses that he has cancer. An angered Anna summons Dr. Rustom, who in turn gives a clean health chit, and confirms that Ashish had overhead a conversation about another patient and had misunderstood. A hapless Ashish, fresh out of lies, must now resign himself to getting married to Sania - or else be hunted down and killed by Anna and his gang.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2006_378": "A small time pimp is in hot water after his book of escorts is stolen.",
    "2006_379": "Documentary about Father Oliver O'Grady, a Catholic priest who was relocated to various parishes around the United States during the 1970s in an attempt by the Catholic Church to cover up his rape of dozens of children.",
    "2006_38": "An FBI agent reprises his disguise as a corpulent old lady and takes a job as a nanny in a crime suspect's house.",
    "2006_380": "Steve Harvey, one of the Original Kings of Comedy, leaves his blue material at home in this stand-up performance in front of church-folk at the Phillips Arena in Atlanta, Georgia.",
    "2006_381": "A group of college students are duped by a charming pathological liar",
    "2006_382": "Follows two New York city couples -- one heterosexual and one gay who explore the peaks and the valleys of their respective relationships.",
    "2006_383": "38 years after their last encounter, Henri Husson thinks he sees Severine in a concert. He follows her and sadistically takes out a slow and painful revenge.",
    "2006_384": "Two old pals reunite for a camping trip in Oregon's Cascade Mountains. Read more: Synopsis",
    "2006_385": "Sandy and Phil, both Overseas Workers in Dubai, are busy preparing for their wedding. Upon reaching her home, Sandy learns from her mother, Daisy, what happened to her friend, Helen. A short time after Helen's father died, Helen proceeded ...See moreSandy and Phil, both Overseas Workers in Dubai, are busy preparing for their wedding. Upon reaching her home, Sandy learns from her mother, Daisy, what happened to her friend, Helen. A short time after Helen's father died, Helen proceeded with her wedding. A few weeks after the wedding, Helen's husband dies in a plane crash. As Helen goes to the crash site, she dies in a bus accident. A few weeks later, Helen's mother suddenly disappears inside her house. Their bodies have never been recovered. Sandy proceeds with her own wedding. During the ceremony, she suffers from nosebleed and starts seeing glimpses of a ghostly flower girl. It turns out that she is not the only one who saw it. Maja, a psychic and the daughter of her husband's cousin, also saw the flower girl. Hours later, Sandy and Phil learn that the van carrying some of the secondary sponsors met an accident. When they get to the site, the bodies of the victims could not be found. Instead, they see a bridal cord. Sandy's relatives and friends disappear one by one. Things become more mysterious when Sandy receives their respective wedding photos. The people who died are headless in the photos. They realize that all the headless people in the photos are bound to die. Joya tells Sandy that she is cursed by the \"sukob.\" Sandy is shocked - no one in her family has died recently, nor has anyone gotten married. In searching for the truth, Sandy unearths a dark family secret. Now, Sandy has to find a way to end the curse before it takes away all the people she holds dear.  Written by AnonymousSee less",
    "2006_386": "A cabbie (Patekar) and businessman (Abraham) both in need of big money partake in a two-hour adventure together.",
    "2006_387": "A mismatched couple discovers that whatever can go wrong will go wrong during a family visit in this warm comedy.",
    "2006_388": "Two gangbangers-turned-cops try and cover up a scandal within the LAPD.",
    "2006_389": "A bourgeois life in France at the onset of World War II, as the rich and their poor servants meet up at a French chateau.",
    "2006_39": "Tragedy strikes a married couple on vacation in the Moroccan desert, touching off an interlocking story involving four different families.",
    "2006_390": "A massage therapist looking to overcome her addictions and reconnect with her son, whose father is an anthropologist in South America studying the Yanomani people, moves in with a wealthy ex-client in New Jersey.",
    "2006_391": "Set against the backdrop of a decaying Midwestern town, a murder becomes the focal point of three people who work in a doll factory.",
    "2006_392": "An epileptic girl suffers a breakdown during her first year at university, then decides to seek help from a priest in battling the troubles associated with her strict upbringing.",
    "2006_393": "Called up for service in Iraq, several members of the National Guard were given digital video cameras. This film, edited from their footage, provides a perspective on a complex and troubled conflict.",
    "2006_394": "The continued Westward journey of settlers Missie and Willie Lahaye. Their roots now firmly planted as they set up homestead in the far West, Missie begins to realize her passion for teaching as Willie cares for the couple's young daughter...See moreThe continued Westward journey of settlers Missie and Willie Lahaye. Their roots now firmly planted as they set up homestead in the far West, Missie begins to realize her passion for teaching as Willie cares for the couple's young daughter Kathy while expanding the family ranch with a little help from sons Jeff and Matthew. When the frontier railroad comes to town, the pleasure of a long-promised visit from Missie's father Clark is suddenly offset by the tragic death of young Kathy. As the untimely demise of their beloved daughter begins to drive an emotional wedge between Missie and Willie, the devastated father unexpectedly accepts an offer made by the powerful Samuel Doros to assume the role of town sheriff. Their faith shaken and their once close-knit bond suddenly torn asunder, Missie and Willie desperately attempt to bring their crumbling family back together as son Jeff faces a series of dangers while hopelessly falling for Doros' beautiful daughter Colette.  Written by AnonymousSee less",
    "2006_395": "A fading country music star (Keith) returns to his hometown, where he reunites with his childhood sweetheart and also meets his 16-year-old daughter for the first time.",
    "2006_396": "The film concerns the theme of self-imposed limitation and continues Matthew Barney's interest in religious rite, this time focusing on Shinto.",
    "2006_397": "A fortune-teller's teasing rumination sends Edmond Burke lurching into New York City's hellish underworld.",
    "2006_398": "India's underworld is ruled by Don Tony Fernandez and his brother Tiny. Tony decides that he has had enough, goes to confess in a Church, kills one of his men, and then gets himself killed via a car bomb. What the Indian authorities do not...See moreIndia's underworld is ruled by Don Tony Fernandez and his brother Tiny. Tony decides that he has had enough, goes to confess in a Church, kills one of his men, and then gets himself killed via a car bomb. What the Indian authorities do not know is that Tony is alive and well, living in style in Bangkok, Thailand, along with Tiny. Then on a flight to Bangkok, a man named Dholakia, fearing that the plane is going crash, confesses to a priest that he is Tony, which is overheard by two sisters, Preeti and Piya Malhotra, who are headed to Bangkok to do a song and dance show. Tony kills the priest, and the police arrest the Malhotra sisters, and if found guilty, both will hang. But Tony is not taking any chances, he asks Tiny to ensure that the two sisters are killed. But hilarious chaos reigns when two former Bollywood stunt artistes, Pyare, and Mohan, intervene to save the Malhotra sisters. The only problem is that Pyare is blind, and Mohan is deaf. And Tony is quite sure that he is going to get away with killing them all.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2006_399": "Stories from modern day Iraq as told by Iraqis living in a time of war, occupation and ethnic tension.",
    "2006_4": "After earning 00 status and a licence to kill, Secret Agent James Bond sets out on his first mission as 007. Bond must defeat a private banker funding terrorists in a high-stakes game of poker at Casino Royale, Montenegro.",
    "2006_40": "Jean-Baptiste Grenouille, born with a superior olfactory sense, creates the world's finest perfume. His work, however, takes a dark turn as he searches for the ultimate scent.",
    "2006_400": "An in-depth look at the world of coffee and global trade.",
    "2006_401": "Two reporters investigate a series of UFO sightings and discover a supernatural connection.",
    "2006_402": "Seven geniuses, with IQs over 200, are plucked from their lives on Christmas Eve to try to solve the world's problems in one night.",
    "2006_403": "Mr. Lãzãrescu, a dying old man, is shuttled from hospital to hospital by a loyal paramedic as doctors refuse to operate and no one can agree on a diagnosis.",
    "2006_404": "The rise and fall of the N.Y. Cosmos. The soccer team that brought Pele to America; against the backdrop of N.Y. City in the 70's.",
    "2006_405": "A portrayal of the lives of the last great Inuit shaman, Avva, and his beautiful and headstrong daughter, Apak. Based on the journals of 1920s Danish ethnographer Knud Rasmussen.",
    "2006_406": "Tamara, an unattractive girl, who is picked on by her peers returns after her death as a sexy seductress to exact revenge.",
    "2006_407": "Filmmakers use hidden cameras to capture the various suicide attempts at the Golden Gate Bridge - the world's most popular suicide destination. Interviews with the victims' loved ones describe their lives and mental health.",
    "2006_408": "A documentary on the 30th anniversary of Britain's best-known music festival.",
    "2006_409": "On Friday the 13th, different people meet on Grand Cayman - a US money launderer and his daughter, a lawyer, a young fisherman in love with a rich man's daughter, other high school students, a crime gang etc.",
    "2006_41": "In a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.",
    "2006_410": "Josh Sagers drives cross-country on a mission to deliver his father's birthday gift - a giant purple LazyBoy.",
    "2006_411": "A portrait of the construction workers involved in building the second deck of Mexico City's Periferico freeway.",
    "2006_412": "A live performance shot by audience members at a 2004 Beastie Boys concert at Madison Square Garden.",
    "2006_413": "Failing to make it on his own, twenty-seven-year-old Jim moves back in with his parents and deals with crippling family obligations.",
    "2006_414": "A butler working in a foreign embassy in London falls under suspicion when his wife accidentally falls to her death, the only witness being an impressionable young boy.",
    "2006_415": "The Great New Wonderful weaves five stories against the backdrop of an anxious and uncertain post-9-11 New York City.",
    "2006_416": "A documentary on American political campaign marketing tactics and their consequences.",
    "2006_417": "A thirty-something southern woman searches for love, despite the burdens she carries with her.",
    "2006_418": "Two students, Gerardo and Jonas, are in love. However, Jonas becomes obsessed with another boy, which leads to Gerardo moving into arms of Sergio. Read more: Synopsis",
    "2006_419": "In the 1980s, ruthless Colombian cocaine barons invaded Miami with a brand of violence unseen in this country since Prohibition-era Chicago - and it put the city on the map. \"Cocaine Cowboys\" is the true story of how Miami became the drug,...See moreIn the 1980s, ruthless Colombian cocaine barons invaded Miami with a brand of violence unseen in this country since Prohibition-era Chicago - and it put the city on the map. \"Cocaine Cowboys\" is the true story of how Miami became the drug, murder and cash capital of the United States, told by the people who made it all happen.  Written by rakonturSee less",
    "2006_42": "A best man (Wilson) stays on as a houseguest with the newlyweds, much to the couple's annoyance.",
    "2006_420": "A moving true story about volunteers protecting antelope against poachers in the severe mountains of Tibet.",
    "2006_421": "",
    "2006_422": "Paris, 1830. Valentin loses himself in alcohol, gambling and women. He does not believe in life and especially not in love. His uncle Van Buck believes only in the virtues of money and trade. Everything separates them until the day when ...See moreParis, 1830. Valentin loses himself in alcohol, gambling and women. He does not believe in life and especially not in love. His uncle Van Buck believes only in the virtues of money and trade. Everything separates them until the day when Van Buck, to improve his public image, wants to make Valentin marry the young and impoverished Baroness Cecile. Valentin, who has absolutely no desire to get married, bets that he can easily seduce her in 24 hours and thus prove that she, like all the others, is not worth loving... But Cecile, who believes in true love, will prove much more difficult to woo than envisaged and Valentin will have to use all possible stratagems to try and win his bet. The game of cat and mouse starts... But who is the cat?  Written by LindseySee less",
    "2006_423": "A mysterious black-clad gunfighter wanders a mystical Western landscape encountering multiple bizarre characters.",
    "2006_424": "A young gay man tries to balance his career as a personal assistant while searching for love.",
    "2006_425": "Featuring never-before-seen footage, this documentary delivers a startling new look at the Peoples Temple, headed by preacher Jim Jones who, in 1978, led more than 900 members to Guyana, where he orchestrated a mass suicide via tainted punch.",
    "2006_426": "A tragicomedy focused on the relationship between the owner of a beauty clinic and a transgender woman.",
    "2006_427": "A former street tough returns to his Philadelphia home after a stint in the military. Back on his home turf, he once again finds himself tangling with the mob boss who was instrumental in his going off to be a soldier.",
    "2006_428": "A Korean immigrant falls in love with her best friend while navigating her way through the challenges of living in a new country.",
    "2006_429": "A young girl's relationship with her imaginary friends resonates throughout her town in the Australian Outback.",
    "2006_43": "A thirty-something is still living with his parents until they hire an interventionist to help him graduate out of the house. That's when the fun begins.",
    "2006_430": "Interviews with scientists and authors, animated bits, and a storyline involving a deaf photographer are used in this docudrama to illustrate the link between quantum mechanics, neurobiology, human consciousness and day-to-day reality.",
    "2006_431": "A man who runs an alibi service for adulterous husbands gets into a jam with a new client. In trying to remedy the situation, he must rely on an alluring woman who gets his heart racing.",
    "2006_432": "In March of 1990, two thieves dressed as Boston police officers gained entrance to the Isabella Stewart Gardner museum in Boston Massachusetts and successfully executed the largest art heist in modern history. Among the thirteen priceless ...See moreIn March of 1990, two thieves dressed as Boston police officers gained entrance to the Isabella Stewart Gardner museum in Boston Massachusetts and successfully executed the largest art heist in modern history. Among the thirteen priceless works stolen was Vermeer's \"The Concert\" one of only 35 of the masters surviving works. Not a single one of the works has been recovered. STOLEN is a full exploration of the Gardner theft, and the fascinating, disparate characters involved: from the 19th century Grand dame Isabella Gardner to a private detective obsessed with finding the art to a terrorist organization with a penchant for stealing Vermeers.  Written by AnonymousSee less",
    "2006_433": "The true story of Doug Bruce who woke up on Coney Island with total amnesia. This documentary follows him as he rediscovers himself and the world around him.",
    "2006_434": "Based on real events, Paul Bernardo and his wife, Karla Homolka, kidnap, sexually abuse, and murder three young girls.",
    "2006_435": "Combining real and fictional events, this movie centers around the historic 1986 World Series, and a day in the life of a playwright who skips opening night to watch the momentous game.",
    "2006_436": "A story of one couple falling in and out of love.",
    "2006_437": "Alan is a musician who leaves a busted-up band for New York, and a new musical voyage. He tries to stay focused and fends off all manner of distractions, including the attraction to his good friend's girlfriend.",
    "2006_438": "Autobiographical comedy about a recovering sex addict, about his obsession with prostitutes, and how that affected his relationships and his life altogether.",
    "2006_439": "Bilike has never seen a ping-pong ball before. He and his family live without electricity and running water in a solitary tent home among the vast steppe grasslands. The magnificent landscape here has changed little since the days of ...See moreBilike has never seen a ping-pong ball before. He and his family live without electricity and running water in a solitary tent home among the vast steppe grasslands. The magnificent landscape here has changed little since the days of Genghis Kahn. But life in the middle of nowhere can be exciting for a young boy. The smallest of details become big events for curious Bilike and his best friends Erguotou and Dawa. The mystery of the small white ball floating in the creek leads to questions about the world around them, as well as innocent mischief. Bilike's grandmother says the ball is a glowing pearl from heaven. But the boys are sceptical after waiting all night outdoors for the ball to light up. Since nobody has an idea about the odd white object, they trek to the faraway monastery to consult the wise lamas. But even the grasslands' most knowledgeable inhabitants are stumped. While watching the new TV-set Dawa's father has won, the boys learn about pingpong. They are excited to hear that their object is the 'national ball of China'. Not realizing how far Beijing actually is, the determined young boys set off to return the ball to the Chinese capital...  Written by AnonymousSee less",
    "2006_44": "After the death of Princess Diana, Queen Elizabeth II struggles with her reaction to a sequence of events nobody could have predicted.",
    "2006_440": "After his twin brother is accidentally killed by vengeful bullies, a 12-year old boy and his friends face the harsh realities of death, teenage hormones, and family dysfunction. Read more: Synopsis",
    "2006_441": "This feature-length documentary focuses on the efforts by troops in the U.S. military during the Vietnam War to oppose the war effort by peaceful demonstration and subversion. It speaks mainly to veterans, but serves as a ready reminder to...See moreThis feature-length documentary focuses on the efforts by troops in the U.S. military during the Vietnam War to oppose the war effort by peaceful demonstration and subversion. It speaks mainly to veterans, but serves as a ready reminder to civilians that soldiers may oppose war as stridently as any civilian, and at greater personal peril.  Written by Steve Fenwick (scf@w0x0f.com)See less",
    "2006_442": "An editor offers Reese (actress/bartender) $100,000 for her recently dead mom's letters from her novelist dad. She heads home from NYC to get them. Her dad lives in the garage while two strangers live in the house.",
    "2006_443": "Sabeltann is a pirate looking for a big treasure. Aboard Sabeltanns big ship, Den Sorte Dame, they are preparing for a long and dangerous journey.",
    "2006_444": "A day in the life of a Parisian housewife/prostitute, interspersed with musings on the Vietnam War and other contemporary issues.",
    "2006_445": "The epic tale of a maverick Midwestern farmer. Castigated as a pariah in his community, Farmer John bravely transforms his farm amidst a failing economy, vicious rumors, and arson. He succeeds in creating a bastion of free expression and a...See moreThe epic tale of a maverick Midwestern farmer. Castigated as a pariah in his community, Farmer John bravely transforms his farm amidst a failing economy, vicious rumors, and arson. He succeeds in creating a bastion of free expression and a revolutionary form of agriculture in rural America.  Written by AnonymousSee less",
    "2006_446": "",
    "2006_447": "A rebellious girl hooks up with an escort agency, where her stepfather is a client.",
    "2006_448": "\"Being Cyrus\" is a dark, comedic venture by the debutante director Homi Adajania that spins around the Sethnas - a Parsi family.",
    "2006_449": "From director, Katharina Otto-Bernstein, a provocative and moving documentary on the life and work of Robert Wilson, one of the most visionary and controversial theater artists of our time. The film delivers a surprisingly candid look at ...See moreFrom director, Katharina Otto-Bernstein, a provocative and moving documentary on the life and work of Robert Wilson, one of the most visionary and controversial theater artists of our time. The film delivers a surprisingly candid look at Robert Wilson, who drops his characteristic reticence and speaks with unprecedented candor about his personal life. Nothing is left in the shadows, as he discusses his troubled and lonely childhood as the son of the Mayor of Waco, Texas, his early learning disabilities, his work with disabled children using therapy as a tool for artistic expression, his departure from Texas at the time of his coming out and his fascination with the downtown New York avant-garde scene of the late 60's. What emerges is a life full of impressions, colors and rhythms, making it all the more poignant how Wilson's early hardships ultimately shaped his ground-breaking aesthetic vision. More than a biography, the film becomes an exhilarating exploration of the transformative power of creativity itself and the inspirational tale of a shy, stuttering boy who grew up to become a fearless artist with a profoundly original perspective to share with the world.See less",
    "2006_45": "As the Mayan kingdom faces its decline, a young man is taken on a perilous journey to a world ruled by fear and oppression.",
    "2006_450": "The Wongs struggle to cope with life, love, and family dysfunction in the suburbs of New York.",
    "2006_451": "A young girl flees her hometown and arrives in the Australian Alps, where new experiences help her learn the differences between sex and love.",
    "2006_452": "In Denmark, during the 6th century, Danish king Hrothgar and his warriors kill a troll whose son, Grendel, vows revenge.",
    "2006_453": "Two men, an assassin and his victim is a small time crook and a question lies between the men is WHO IS ANTHONY?",
    "2006_454": "A documentary that explores the connection between income tax collection and the erosion of civil liberties in America. Read more: Synopsis",
    "2006_455": "An elusive serial killer known as the Zodiac terrorizes the San Francisco Bay in the late 1960s, while detectives aim to stop him before he claims more victims. Based on a true story.",
    "2006_456": "A retelling of the events leading up to the crucifixion of Jesus Christ, based on the idea that he was a black man whose death was a racially motivated hate crime.",
    "2006_457": "Documentary filmmaker Doug Block had every reason to believe his parents' 54-year marriage was a good one. But when his mother dies unexpectedly and his father swiftly marries his former secretary, he discovers two parents who are far more...See moreDocumentary filmmaker Doug Block had every reason to believe his parents' 54-year marriage was a good one. But when his mother dies unexpectedly and his father swiftly marries his former secretary, he discovers two parents who are far more complex and troubled than he ever imagined. 51 Birch Street is a riveting personal documentary that explores a universal human question: how much about your parents do you really want to know?  Written by AnonymousSee less",
    "2006_458": "A love story between two savants with Asperger's syndrome, a kind of autism, whose conditions sabotage their budding relationship.",
    "2006_459": "In the 1970s a music promoter plucks Siamese twins from obscurity and grooms them into a freakish rock'n'roll act. A dark tale of sex, strangeness and rock music.",
    "2006_46": "Brutal cold forces two Antarctic explorers to leave their team of sled dogs behind as they fend for their survival.",
    "2006_460": "After the Indian Government ordered troops into the Soni Darbar in Amritsar, angering Sikhs worldwide, leading to the assassination of Prime Minister Indira Gandhi during 1984, followed by violence against the Sikhs, and instructions to ...See moreAfter the Indian Government ordered troops into the Soni Darbar in Amritsar, angering Sikhs worldwide, leading to the assassination of Prime Minister Indira Gandhi during 1984, followed by violence against the Sikhs, and instructions to Police to hunt down and apprehend all suspected terrorists. Karnail Singh was one such suspect, who claims that he has had no hand in any terrorism activity, but is nevertheless pursued by the Police, leaving his widowed mom, Kartar, and sister, Parsan, to fend for themselves by running a Dhaba and being subjected to harassment at the hands of Inspector Ujagar Singh, while the village Mukhiya wants Parsan to get married to a much older Narang Singh. Parsan's problems are resolved when Indian Army Captain Nihal Singh intervenes, and marries her, even though her mom, beaten senseless by the Police, passes away on the day of the marriage. Months later, Nihal must re-locate to Siachen, leaving behind a pregnant Parsan. Once in Siachen, he gets news that Parsan has been attacked and is hospitalized. Since Siachen is isolated due to a heavy snowstorm, he can only return home after several days, and is told that Parsan has passed away, and his new-born daughter has been abducted by his neighbors, Sukhwant Kaur, and Mandeep Singh. Nihal's attempts to locate the couple are all in vain, and things get worse when the Station House Officer is transferred and the new incumbent, his arch-enemy, Ujagar, refuses to locate his daughter. Nihal confronts Ujagar, arguments and fisticuffs ensue, resulting in Ujagar's death. Nihal is arrested, stripped off of his uniform, tried in Court, found guilty, and sentenced to 20 years in jail - and may never be reunited with his daughter.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2006_461": "Two rebellious teens, on the run from a desert survival camp, steal the car of two naive Mormon missionaries. They end up in New Harmony, the town that's been anxiously awaiting their Mormon missionaries.",
    "2006_462": " Read more: Synopsis",
    "2006_463": "Flying back to his home country, an American man is informed that his mother and sister have been kidnapped and will be killed if he doesn't comply with certain demands.",
    "2006_464": "Rebellious and outgoing Smadar can't stand types like Mirit. Mirit, introverted and frightened, keeps away from the likes of Smadar. But the two are thrown together as they are assigned to a patrol in Jerusalem as part of their compulsory ...See moreRebellious and outgoing Smadar can't stand types like Mirit. Mirit, introverted and frightened, keeps away from the likes of Smadar. But the two are thrown together as they are assigned to a patrol in Jerusalem as part of their compulsory military service. Their job is to stop Palestinian passersby, to ask for their identity cards, and to write down their details on special forms. You don't move from this place, don't sit down, don't smoke, don't eat, don't talk on your cell phones, says their commander, leaving them alone on the street with their patrol forms. What will they do now? This is the story of two 18-year-old girls who are busy with their own worlds--falling in love, break-ups, and the volatile relationship between the two--in an attempt to ignore the political reality in a city that slowly makes its way into their lives. As women, this film is our own way of soul searching, about our army service and the occupation  Written by Vidi Bilu and Dalia HagerSee less",
    "2006_465": "Tina (Eugene Domingo) and Lea (Pokwang) are best friends who are also avid fans of Vilma Santos. They were inseparable until Lea decides to leave the country and go to Korea. They promise that someday they will really become one big happy ...See moreTina (Eugene Domingo) and Lea (Pokwang) are best friends who are also avid fans of Vilma Santos. They were inseparable until Lea decides to leave the country and go to Korea. They promise that someday they will really become one big happy family when their children get married. Years after, by virtue of an old vow, Lucky Girl (Sandara Park) and Lucky Boy (Joseph Bitangcol) are forced to be together by their mothers. Problem is, they hate each other's guts. But, just when they're falling for each other, love plays a trick on the meddling moms which threatens to bring the young lovers apart.  Written by AnonymousSee less",
    "2006_466": "VAJRA SKY OVER TIBET, a documentary feature, is a cinematic pilgrimage to some of the most revered venues and festivals still surviving in Tibet. This poignant journey bears witness to the indomitable faith of its endangered Buddhist ...See moreVAJRA SKY OVER TIBET, a documentary feature, is a cinematic pilgrimage to some of the most revered venues and festivals still surviving in Tibet. This poignant journey bears witness to the indomitable faith of its endangered Buddhist community and the imminent threat to its very survival. The vastness of the Tibetan sky, reflecting snowy mountains, rushing rivers, and turquoise lakes, leads the journey west. Tibetans respond to the denial of the human right to practice one's religion without interference with a defiant devotion. As interviews were not appropriate because of likely retribution, VAJRA SKY employs the evocative voices of Tenzin Choegyal and Dadon, both Tibetans in exile. Many of Tibet's most legendary musicians and singers are featured in the compelling soundtrack.  Written by John BushSee less",
    "2006_467": "With the help of a hot, slightly older new acquaintence (Noseworthy), the closeted son (Newton) of a conservative U.S. Senator (Lerner) puts a shocking spin on his dad's re-election campaign.",
    "2006_468": "A troubled young man struggling to right himself after the premature death of his father.",
    "2006_469": "A commitment-phobe agrees to marry his girlfriend, setting in motion a series of hilarious mishaps that has him questioning what he got himself into.",
    "2006_47": "An American official realizes that his young son may literally be the Devil incarnate.",
    "2006_470": "The rise and inevitable fall of an amoral but naive young woman whose insouciant eroticism inspires lust and violence in those around her.",
    "2006_471": "A night in the life of a former Pakistani rock star who now sells coffee from his push cart on the streets of Manhattan.",
    "2006_472": "This intimate film reveals the legendary man with the white saran wrapped pants, undersized leather vests, and Dutch-boy haircut who is the iconic Peter Berlin.",
    "2006_473": "The story of three girlfriends who go back to Kalamazoo, Michigan for their 10 year high school reunion.",
    "2006_474": "Renowned cult film director John Waters narrates this quirky exploration of the Salton Sea, the massive Southern California lake that was created by accident a century ago, became a popular desert resort and has since developed into a ...See moreRenowned cult film director John Waters narrates this quirky exploration of the Salton Sea, the massive Southern California lake that was created by accident a century ago, became a popular desert resort and has since developed into a refuge for a community of oddballs.  Written by AnonymousSee less",
    "2006_475": "Marian (Bea Alonzo) and Manuel (John Lloyd Cruz) have been best friends since childhood. Manuel wants to profess his deeper feelings for Marian, but it looks like she is in love with Lance (Sam Milby), a famous musician. Manny is ...See moreMarian (Bea Alonzo) and Manuel (John Lloyd Cruz) have been best friends since childhood. Manuel wants to profess his deeper feelings for Marian, but it looks like she is in love with Lance (Sam Milby), a famous musician. Manny is disheartened but, hindered by their long friendship, he cannot express his true feelings. \"Close to You\" is a Filipino romantic comedy film from Star Cinema.See less",
    "2006_476": "Internationally known director Carla Garapedian follows the rock band System of a Down as they tour Europe and the US pointing out the horrors of modern genocide that began in Armenia in 1915 up though Darfur today.",
    "2006_477": "Dr. Henry Jekyll experiments with scientific means of revealing the hidden, dark side of man and releases a murderer from within himself.",
    "2006_478": "Claire lives with her wealthy adopted parents in a luxurious and isolated house in the woods. She discovers a wounded and bleeding boy her age in her family's garden shed. The boy is a young drug courier from Afghanistan; shot and wounded ...See moreClaire lives with her wealthy adopted parents in a luxurious and isolated house in the woods. She discovers a wounded and bleeding boy her age in her family's garden shed. The boy is a young drug courier from Afghanistan; shot and wounded after serving his purpose as human packing material. Claire decides to keep the boy a secret. He slowly recovers under her care; and they fall in love. When the drug dealers return and Claire's family is due to move back to the city; they decide to flee; though Claire finds it difficult to outrun her past as an abandoned child.  Written by anonymousSee less",
    "2006_479": "Thirteen-year-old Ernest Chin lives and works at a sleazy hourly-rate motel on a strip of desolate suburban bi-way. Misunderstood by his family and blindly careening into puberty, Ernest befriends Sam Kim, a self-destructive yet ...See moreThirteen-year-old Ernest Chin lives and works at a sleazy hourly-rate motel on a strip of desolate suburban bi-way. Misunderstood by his family and blindly careening into puberty, Ernest befriends Sam Kim, a self-destructive yet charismatic Korean man who has checked in. Sam teaches the fatherless boy all the rites of manhood.  Written by anonymousSee less",
    "2006_48": "A student's premonition of a deadly roller coaster ride saves her life and a lucky few, but not from Death itself, which seeks out those who escaped their fate.",
    "2006_480": "Twenty male inmates in a Kentucky prison form an unlikely Shakespearean acting troupe.",
    "2006_481": "Set in Kumba in South West Cameroon Sisters in Law follows Adultery, Rape and Abuse cases led by a Female Judge.",
    "2006_482": "\"Be with me\" consists of three stories of love vs. solitude : 1)An aging, lonesome shopkeeper doesn't believe in life any more since his wife died. But he is saved from desperation by reading an autobiographical book and meeting its author...See more\"Be with me\" consists of three stories of love vs. solitude : 1)An aging, lonesome shopkeeper doesn't believe in life any more since his wife died. But he is saved from desperation by reading an autobiographical book and meeting its author, a deaf and blind lady of his own age. 2)Fatty, a security guard in his fifties, lives for two things : good food and love for a pretty executive living in his block of flats. But, if it is easy to satisfy his first need winning the heart of the distant belle is a horse of another color. 3)Two teenage schoolgirls get to know each other on the Internet. Soon they fall in love.  Written by Guy BellingerSee less",
    "2006_483": "In this bittersweet comedy, four adult siblings gather at their dying mother's house in North Carolina for what they expect to be a quick, last goodbye. Instead, they find themselves trapped-- together -- for two weeks.",
    "2006_484": "From a portrait of the Dalai lama as a spiritual and temporal leader, to an unprecedented revelation of the mystical inner world of monastic and an unflinching depiction of the moving response to a death in the community, the film takes ...See moreFrom a portrait of the Dalai lama as a spiritual and temporal leader, to an unprecedented revelation of the mystical inner world of monastic and an unflinching depiction of the moving response to a death in the community, the film takes the viewer on a journey deep into the heart of an ancient Buddhist way of life and brings you face to face with the unbroken continuity of Tibet's unique culture.  Written by David LascellesSee less",
    "2006_485": "Raised to deal in cold blooded death, the teenage assassin girl Azumi must defeat three evil warlords while also battling her own heart.",
    "2006_486": "An adolescent groupie zeroes in on her Blondie-like idol after the singer chances to cross her orbit on a publicity tour. Gradually their lives intertwine as, with near-operatic intensity, the film delves into the emotional dependency on ...See moreAn adolescent groupie zeroes in on her Blondie-like idol after the singer chances to cross her orbit on a publicity tour. Gradually their lives intertwine as, with near-operatic intensity, the film delves into the emotional dependency on both sides of celebrity culture.  Written by Tribeca Film FestivalSee less",
    "2006_487": "A Delhi based retired middle class man tries half-heartedly to get his land back from a swindling property dealer with the help of his sons and their friends.",
    "2006_488": "A documentary that argues that many pieces of Catholic religious art have for hundreds of years contained embedded (subliminal) images that have promoted sex, violence, and the degradation of the Church.",
    "2006_489": "A young boy falls in love with a handsome policeman who is investigating his family's criminal activities.",
    "2006_49": "When the farmer's away, all the animals play, and sing, and dance. Eventually, though, someone has to step in and run things, a responsibility that ends up going to Otis, a carefree cow.",
    "2006_490": "After Marc dumps him, Kyle unites with Gwen and Tiffani to land sexually confused art model Troy by pretending to be straight. However, Marc wants Troy, too, and members from a notorious \"ex-gay\" group are slipping for the both of them.",
    "2006_491": " Read more: Synopsis",
    "2006_492": "Paper Dolls is a documentary film by award winning filmmaker Tomer Heymann about a group of transvestite Filipinos who emigrate to Israel to take care of elderly religious Jewish men. On their one day off per week, they perform as drag ...See morePaper Dolls is a documentary film by award winning filmmaker Tomer Heymann about a group of transvestite Filipinos who emigrate to Israel to take care of elderly religious Jewish men. On their one day off per week, they perform as drag performers in a group called the Paper Dolls. On the political level, it explores the perils of global immigration. In this case, after the second Intifada, the Israeli government unofficially opened its doors to illegal workers to replace the Palestinians who were no longer allowed in the country. As tensions with the Palestinians eased, the government changed its policy and began to forcibly deport these foreign guest workers with dramatic consequences for our characters. On the human level, the film is about people who are rejected by their own families for being gay/transvestite and who emigrate and end up with jobs taking care of other people's parents who have been rejected by their own children because they are old, difficult, etc. They work grueling hours to send money back to the Philippines to support the families that have rejected them. As unbelievable as it may seem, these very different people (old religious Jews and transvestites from the Philippines) form very deep, quasi familial bonds.  Written by AnonymousSee less",
    "2006_493": "Five sassy, tap dancing women aged 84 - 96. Meet the \"Silver Belles\".",
    "2006_494": " Read more: Synopsis",
    "2006_495": "After an accident in a small Maryland fishing town, 11-year-old Emma begins to question the nature of the adults around her.",
    "2006_496": "Seemingly disparate portraits of people -- among them a single mother, a high school principal, and an ace student -- Distinctly American -- all affected by the proliferation of guns in American society.",
    "2006_497": "Documentary by Oscar winner Laura Poitras about the war in Iraq.",
    "2006_498": "A neglected daughter becomes a possessive mother in an emotional journey into the heart and mind of a woman who loved too much.",
    "2006_499": "Swashbuckling adventures of young army recruit Fanfan la Tulipe during the reign of King Louis XV in 18th Century France.",
    "2006_5": "A newly recruited night security guard at the Museum of Natural History discovers that an ancient curse causes the animals and exhibits on display to come to life and wreak havoc.",
    "2006_50": "A lonely doctor, who once occupied an unusual lakeside house, begins exchanging love letters with its former resident, a frustrated architect. They must try to unravel the mystery behind their extraordinary romance before it's too late.",
    "2006_500": "One winter night, Pilar runs away from home. With her, she takes only a few belongings and her son, Juan. Antonio soon sets out to look for her. He says Pilar is his sunshine, and what's more, \"She gave him her eyes\"...",
    "2006_501": "Standing Still is the story of a popular yet drunken actor who reconnects with a group of his college friends for a wedding several years after graduation.",
    "2006_502": "Heinz Bütler interviews Henri Cartier-Bresson (1908-2004) late in life. Cartier-Bresson pulls out photographs, comments briefly, and holds them up to Bütler's camera. A few others share observations, including Isabelle Huppert, Arthur ...See moreHeinz Bütler interviews Henri Cartier-Bresson (1908-2004) late in life. Cartier-Bresson pulls out photographs, comments briefly, and holds them up to Bütler's camera. A few others share observations, including Isabelle Huppert, Arthur Miller, and Josef Koudelka. Cartier-Bresson talks about his travels, including Mexico in the 1930s, imprisonment during World War II, being with Gandhi moments before his assassination, and returning to sketching late in life. He shows us examples. He talks about becoming and being a photographer, about composition, and about some of his secrets to capture the moment.  Written by See less",
    "2006_503": "A troubadour returns home to scratch out a living in Mexico after years of trying to get ahead in San Francisco.",
    "2006_504": "Dark fairy-tale about a demonic doctor who abducts a beautiful opera singer with designs on transforming her into a mechanical nightingale.",
    "2006_505": "Seven-year-old Jeremiah is pulled from his foster home and thrown into a troubled life on the road with his teenage mother, Sarah.",
    "2006_506": "After their most recent loss, a soccer team discovers its goalie is gay and casts him out. He retaliates by bringing back an all-gay team for a game to prove who's better.",
    "2006_507": "At night, a world comes to life in the shadows of streetlamps, in the stalls of public restrooms, in the apartments of the well-to-do. This is a world most guys only dream about. But the world of the hustler is very real, and you will ...See moreAt night, a world comes to life in the shadows of streetlamps, in the stalls of public restrooms, in the apartments of the well-to-do. This is a world most guys only dream about. But the world of the hustler is very real, and you will experience it yourself in these short films where hustlers fall in love, service their clients, and keep their secrets at all costs.  Written by http://www.dvdempire.com/1249848/boys-briefs-4-movie.htmlSee less",
    "2006_508": "Metropolitan Museum of Art curator Henry Geldzahler reflects on the 1960s pop art scene in New York. Read more: Synopsis",
    "2006_509": "Some poor people in the Southern coasts of Iran do not have any place to live, and thus, they reside on an old, abandoned ship in the sea. Captain Nemat, their chief, tries to persuade the ship-owner and the official authorities not to get...See moreSome poor people in the Southern coasts of Iran do not have any place to live, and thus, they reside on an old, abandoned ship in the sea. Captain Nemat, their chief, tries to persuade the ship-owner and the official authorities not to get the ship back. On the other hand, he is selling the iron parts of the ship piece by piece. 'Iron Island' is the story of those whose ignorance makes them simply trust those who are always ready to abuse their trust.  Written by IMVBox.comSee less",
    "2006_51": "Tyler Gage receives the opportunity of a lifetime after vandalizing a performing arts school, gaining him the chance to earn a scholarship and dance with an up and coming dancer, Nora.",
    "2006_510": "A documentary on a 13-year-old Japanese girl abducted by North Korean spies.",
    "2006_511": "A chronicle of legendary Native American poet/activist John Trudell's travels, spoken word performances and politics.",
    "2006_512": "\"Through the Fire\" chronicles the journey of Coney Island basketball star, Sebastian Telfair, from famed Lincoln High School straight to the NBA.",
    "2006_513": "A documentary on the expletive's origin, why it offends some people so deeply, and what can be gained from its use.",
    "2006_514": "A documentary on the personal and political life of Pulitzer Prize-winning playwright, Tony Kushner. The film begins in 2001, when Kushner was mounting the production of his play \"Homebody/Kabul\" and runs through 2004, as he worked on John...See moreA documentary on the personal and political life of Pulitzer Prize-winning playwright, Tony Kushner. The film begins in 2001, when Kushner was mounting the production of his play \"Homebody/Kabul\" and runs through 2004, as he worked on John Kerry's presidential campaign, got married to Mark Harris, worked with Maurice Sendak, and opened the Broadway musical \"Caroline, or Change.\"See less",
    "2006_515": "Pedro and Rui kiss after a first-anniversary dinner; Pedro drives home, dying en route in a crash. Another pair of lovers, Odete and Alberto, split over her desire to have a child. Pedro lived in Odete's building. She attends the wake, ...See morePedro and Rui kiss after a first-anniversary dinner; Pedro drives home, dying en route in a crash. Another pair of lovers, Odete and Alberto, split over her desire to have a child. Pedro lived in Odete's building. She attends the wake, stealing a ring, a last gift from Rui, from Pedro's finger. She behaves hysterically at the graveside, and later, wearing Pedro's ring, she insists she's carrying Pedro's child. Rui grieves as well, drinking too much and seeing Pedro's apparition. Odete's obsession intrudes on Rui, whose grief makes him vulnerable to her hysteria. Can this end well?  Written by See less",
    "2006_516": "An aging, disillusioned alcoholic (Nolte) gets a younger friend (Morgan) and wants him to pose as his son at a school reunion. Read more: Synopsis",
    "2006_517": "Irene is on tour with her one-woman-show \"Sale Affaire\" in the north of France. When she runs into Dries, who carries giants in fairs, it's the beginning of a love story that bears an uncanny resemblance to the show performed by Irene on ...See moreIrene is on tour with her one-woman-show \"Sale Affaire\" in the north of France. When she runs into Dries, who carries giants in fairs, it's the beginning of a love story that bears an uncanny resemblance to the show performed by Irene on stage.  Written by argentronicSee less",
    "2006_518": "An examination of Islam, violence, and the fate of the non-Muslim world. Read more: Synopsis",
    "2006_519": "Three of the most popular and controversial Civil War stories by legendary writer Ambrose Bierce are presented in this acclaimed feature collection.",
    "2006_52": "Picking up directly from the previous movie, vampire warrior Selene and the half werewolf Michael hunt for clues to reveal the history of their races and the war between them.",
    "2006_520": "Traitors, killers and lovers collide in London. Read more: Synopsis",
    "2006_521": "Fact based story about the political battle that was waged against the Mafia in Sicily during the late 1980's and early 1990's. Chazz Palminteri plays Giovanni Falcone, a crusading prosecutor who tried to use money trails as a way to ...See moreFact based story about the political battle that was waged against the Mafia in Sicily during the late 1980's and early 1990's. Chazz Palminteri plays Giovanni Falcone, a crusading prosecutor who tried to use money trails as a way to attack the mobsters. He is aided by a former mobster (F. Murray Abraham) who volunteers to turn state's evidence after his sons are killed by a renegade mob chief. With the mobster's help, the prosecutor was able to obtain over 300 convictions.  Written by John Sacksteder See less",
    "2006_522": "A documentary that investigates the 'new' New York City that then-Mayor Rudy Giuliani claimed he helped create.",
    "2006_523": "A man suffering from Lou Gehrig's disease deals with the woman falling for him and a brother who becomes obsessed with finding a cure.",
    "2006_524": "The story of lives inextricably linked to the Yang Ban Xi, the propaganda spectacles which replaced traditional opera during the Cultural Revolution in China.",
    "2006_525": "Paris 2002. Yellow cats appears on the walls. Chris Marker is looking for these mysterious cats and captures with his camera the political and international events of these last two years (war in Iraq...).",
    "2006_526": "A guitar playing car thief meets an autistic savant piano player, and together they transform a group of reluctant halfway house convicts into The Killer Diller Blues Band.",
    "2006_527": "Meat merchant Oleg, prostitute Marina, and piano tuner \"simply Volodya\" drop into an all-night bar in Moscow, where they are served by a narcoleptic bartender (three plus one is four) while each regales the others with made-up biographies....See moreMeat merchant Oleg, prostitute Marina, and piano tuner \"simply Volodya\" drop into an all-night bar in Moscow, where they are served by a narcoleptic bartender (three plus one is four) while each regales the others with made-up biographies. Oleg claims to work in President Putin's administration, supplying him with bottled water and his wife with liquor; Marina passes herself off as a marketing executive; and Volodya, the infamous lead singer of the rock group Leningrad, as a geneticist who clones twins (two times two makes four, again) in a laboratory that has been engaged in these experiments since the days of Stalin. After they separate, these fantasy realities, especially Volodya's, begin to dominate their everyday lives.See less",
    "2006_528": "London is a drug laden adventure that centers on a party in a New York loft where a young man is trying to win back his ex-girlfriend.",
    "2006_529": "It's a beautiful day today. We'll go for a walk and see some of the city.",
    "2006_53": "Santa, aka Scott Calvin, is faced with double-duty: how to keep his new family happy, and how to stop Jack Frost from taking over Christmas.",
    "2006_530": "State of Fear dramatizes the human and societal costs a democracy faces when it embarks on a war against terror, a war potentially without end, all too easily exploited by unscrupulous leaders seeking personal political gain. Read more: Synopsis",
    "2006_531": "The filmmaker's subjects are patriotic young Americans - ordinary men and women who heeded the call for military service in Iraq - as they experience recruitment and training, combat, homecoming, and the struggle to reintegrate with ...See moreThe filmmaker's subjects are patriotic young Americans - ordinary men and women who heeded the call for military service in Iraq - as they experience recruitment and training, combat, homecoming, and the struggle to reintegrate with families and communities. The terrible conflict in Iraq is a prelude for the even more challenging battles fought by the soldiers returning home - with personal demons, an uncomprehending public, and an indifferent government. As these battles take shape, each soldier becomes a new kind of hero, bearing witness and giving support to other veterans, and learning to fearlessly wield the most powerful weapon of all - the truth.  Written by Focus FeaturesSee less",
    "2006_532": "A man emerges from the slums of Rio to lead the nonviolent cultural movement known as Afro-reggae.",
    "2006_533": "After inadvertently killing his girlfriend, a man (Asano) flees Macau for Thailand in an attempt to cope with his guilt, and avoid possible arrest. But the relocation doesn't prevent his problems from following him, as his new friends ...See moreAfter inadvertently killing his girlfriend, a man (Asano) flees Macau for Thailand in an attempt to cope with his guilt, and avoid possible arrest. But the relocation doesn't prevent his problems from following him, as his new friends could be potential enemies.See less",
    "2006_534": "A documentary that examines the psychopathology behind suicide bombers - which ultimately reveals what makes them tick!",
    "2006_535": "Reeling from his dismissal from a reality show, a deranged runner-up holds a group of co-eds hostage on the set of his own fictitious show, where losers suffer a deadly fate.",
    "2006_536": "A narcoleptic transvestite who yearns to become a transsexual dreams up elaborate musical numbers in which she's the star.",
    "2006_537": "The story of Scotty Pelk, a socially inept video store clerk who gets fired from his job and becomes a sensation as an online film critic.",
    "2006_538": "Ever Again examines the sweeping resurgence of antisemitism in 21st century Europe and its connection to global terrorism.",
    "2006_539": "Alex is throwing a wedding shower for April. What's revealed at this wacky party, though, is that the two women have a history that goes beyond mere friendship.",
    "2006_54": "After a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other.",
    "2006_540": "Cristina's life is thrown into turmoil when she is suddenly escorted from her strict Catholic school in Buenos Aires and told that she is really Sofía Lombardi, the daughter of activists who disappeared in the '70s. Questioning everything ...See moreCristina's life is thrown into turmoil when she is suddenly escorted from her strict Catholic school in Buenos Aires and told that she is really Sofía Lombardi, the daughter of activists who disappeared in the '70s. Questioning everything she once thought true, Cristina embarks on a journey to find her true identity. Meeting others like herself, the young girl soon discovers the real-life horrors of Argentina's relatively recent past and the nightmare that claimed tens of thousands of lives during the country's \"dirty war.\"  Written by Koch Lorber FilmsSee less",
    "2006_541": "This bitingly funny comedy follows a prickly, profanity-prone man seeking to preserve his dream; it dishes up bites of wisdom along the way, ultimately serving both a hilarious trip and a charming slice of New York history.",
    "2006_542": "How does artist Matthew Barney use 45,000 pounds of petroleum jelly, a factory whaling vessel and traditional Japanese rituals to create his latest art project? Barney plowed the waters off the coast of Nagasaki to film his massive ...See moreHow does artist Matthew Barney use 45,000 pounds of petroleum jelly, a factory whaling vessel and traditional Japanese rituals to create his latest art project? Barney plowed the waters off the coast of Nagasaki to film his massive endeavor, Drawing Restraint 9. The documentary Matthew Barney: No Restraint journeys to Japan with Barney and his collaborator Bjork, as the visual artist creates a \"narrative sculpture\" telling a fantastical love story of two characters that transform from land mammals into whales.  Written by AnonymousSee less",
    "2006_543": "A soldier recounts his relationship with a famous political prisoner attempting to overthrow their country's authoritarian government.",
    "2006_544": "",
    "2006_545": "Daniel, a young and arrogant Londoner, is bored to death in his life. His jewish grandmother asks him to go through Europe in order to find his grandfather's grave. Not only will Daniel find his long lost grandfather's trace, but he also ...See moreDaniel, a young and arrogant Londoner, is bored to death in his life. His jewish grandmother asks him to go through Europe in order to find his grandfather's grave. Not only will Daniel find his long lost grandfather's trace, but he also will understand his deep-rooted jewish culture...  Written by anonymousSee less",
    "2006_546": "'The Devil's Miner' tells the story of 14-year-old Basilio who worships the devil for protection while working in a Bolivian silver mine to support his family.",
    "2006_547": "An architect engages in conflict with an activist who lives in a dangerous complex the architect designed.",
    "2006_548": "In this documentary, veteran filmmaker Harry Moses exposes the controversy in the world of high priced artwork. He paints a vivid picture of how art is bought and sold in America. Read more: Synopsis",
    "2006_549": "A young man with a terminal illness makes an unconventional request on local television.",
    "2006_55": "Ten-year-old Arthur, in a bid to save his grandfather's house from being demolished, goes looking for some much-fabled hidden treasure in the land of the Minimoys, tiny people living in harmony with nature.",
    "2006_550": "A couple with an empty life make up a story about the new maid, in order to satisfy their own sexual obsessions.",
    "2006_551": "A new band trying to find their audience as they tour through Europe. Kiefer Sutherland stops at nothing in his effort to try and make this happen.",
    "2006_552": "With a successful career, two adoring children and having married his high school sweetheart - Andrew Austin had everything. But a cancer diagnosis and past secrets quickly turn their lives upside down.",
    "2006_553": "Jean-Pierre is a hit man in Paris. He wants to stop; an incentive is reconnecting to Michelle, a childhood friend. He's ready to commit himself to her, but she has her own secrets: she sells bomb components to thugs. He hears rumors of a ...See moreJean-Pierre is a hit man in Paris. He wants to stop; an incentive is reconnecting to Michelle, a childhood friend. He's ready to commit himself to her, but she has her own secrets: she sells bomb components to thugs. He hears rumors of a missing briefcase, which he finds in Michelle's flat. He asks no questions, and soon both of them are in trouble with Jean-Pierre's ex-employer and with her bomb buyers. Two other characters complicate the maneuvering: Jean-Pierre's best friend, who's always losing money on the ponies, and the ex-employer's new contract killer, a seemingly fragile woman. Is there any way that Jean-Pierre can protect Michelle and escape with his life?  Written by See less",
    "2006_554": "The dramatic story of one of the great art scandals of modern times - O. Winston Link's photographs and the feeding frenzy that these extraordinary images have left behind.",
    "2006_555": "A three-paneled look at the worldwide A.I.D.S. crisis. Three tragic stories taking place in South Africa, China, and Montreal.",
    "2006_556": "Two college friends get together and reminisce on the woman they both fell in love with at different times in their past, and are thus propelled to find her.",
    "2006_557": "A disaffected soldier returns to his hometown to get even with the thugs who brutalized his mentally-challenged brother years ago.",
    "2006_558": "Dr. Charlie Keegan had a thriving medical practice in New York City until he was busted for insurance fraud. In order to keep his license, he must serve six months working at a elder care facility in upstate NY. While he is there, he ...See moreDr. Charlie Keegan had a thriving medical practice in New York City until he was busted for insurance fraud. In order to keep his license, he must serve six months working at a elder care facility in upstate NY. While he is there, he starts to connect to the residents and staff, and regains a passion for patient care. But, his boss is now the one defrauding insurance companies and residents. Will Charlie choose his career or his patients' welfare when his six months are up? Complicating matters is Nurse Jill (Emmanuelle Chriqui), who is passionate about the facility and always demands the best from Charlie.  Written by beetlejumpSee less",
    "2006_559": "In a distant future, a cult forms around the Manson Family, when Charles Manson is mistaken for the messiah. Meanwhile, in 1969, Manson convinces his followers to murder Sharon Tate.",
    "2006_56": "A wannabe dad mistakes a vertically challenged criminal on the lam as his newly adopted son.",
    "2006_560": "Charlie Conrad is ready for college, but the sudden death of his mother and his long-absent father leave him saddled with the adult responsibility of raising his 9-year-old brother.",
    "2006_561": "White Rainbow is the story of four remarkable women and their struggle to overcome the stigma and brutal reality of widowhood in modern Indian society. In the story, the protagonist Priya, is an educated, affluent young woman who is ...See moreWhite Rainbow is the story of four remarkable women and their struggle to overcome the stigma and brutal reality of widowhood in modern Indian society. In the story, the protagonist Priya, is an educated, affluent young woman who is tragically widowed. Despondent, alone and desperate, she seeks unlikely solace in Vrindavan, the \"city of widows.\" Priya meets the streetwise Roop who has spent 30 years making her own way in this temple town with its dirty secrets. She encounters gentle Mala tragically disfigured by her mother-in-law and young Deepti, forced into servitude and an underground sex trade run by the Panda priest. Together, this disparate group forms a deep bond and begin to see the power of their own conviction to take charge of their own fate. But, their journey is not without adversity and tragedy from a system dominated by men who prosper from the exploitation of India's most disenfranchised citizens. In the end, Priya comes to realize that, \"Her destiny was to change their fate!\"  Written by Hannah Kirby - Executive ProducerSee less",
    "2006_562": "Eva Mozes Kor, who survived Josef Mengele's cruel twin experiments in the Auschwitz concentration camp, shocks other Holocaust survivors when she decides to forgive the perpetrators as a way of self-healing.",
    "2006_563": "A look at the role of the Buckeye State in the 2004 Presidential Election.",
    "2006_564": "During an outing Dr. Suraj Rihan, who is married to Shivani, is summoned by DCP Gazala Qadri who wants to question him about the sudden death of his girlfriend/singing diva, Kriya Sengupta. Through flashbacks Suraj attempts to clarify how ...See moreDuring an outing Dr. Suraj Rihan, who is married to Shivani, is summoned by DCP Gazala Qadri who wants to question him about the sudden death of his girlfriend/singing diva, Kriya Sengupta. Through flashbacks Suraj attempts to clarify how he got involved with Kriya and her family, and how his involvement led to her sudden and questionable death.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2006_565": "A womanizer is falsely diagnosed with AIDS by a jealous lover and falls in love with a woman equally suicidal as he.",
    "2006_566": "Caught cheating and banned for ten years, Bobby Dukes, paintball's first superstar, returns to reclaim his title and erase the memory of his tainted past.",
    "2006_567": "This is the story of Nat Banks, an 8th generation Virginian gentleman farmer living in the past, who loses his family farm, Greenwood, to a pair of land speculators from Washington, D.C. When the predatory couple manipulates a \"legal\" real...See moreThis is the story of Nat Banks, an 8th generation Virginian gentleman farmer living in the past, who loses his family farm, Greenwood, to a pair of land speculators from Washington, D.C. When the predatory couple manipulates a \"legal\" real estate transaction that turns into a hostile possession of the manor house, he temporarily loses his mind, leaving his family but not the farm. Instead he hides out in a cave on Goose Creek, waging guerilla warfare against expansionism and the destruction of historic property with the help of his family, friends, and neighbors...  Written by AnonymousSee less",
    "2006_568": "A wedding invite from an estranged sibiling inspires a grandmother to assemble her family and embark on a roadtrip in a broken down caravan.",
    "2006_569": "A famed Hollywood director is nearing death and reevaluating his life. What troubles him most is the son he abandoned. As he is shown a film of his son's painful life, he is offered the opportunity of a lifetime: to set things right.",
    "2006_57": "An adolescent lion is accidentally shipped from the New York Zoo to Africa. Now running free, his zoo pals must put aside their differences to help bring him back.",
    "2006_570": "An irate father throws his son's basketball out the window. Follow it to a new girlfriend. A spoiled brat speeds off in her boyfriend's car. Follow it to a bad idea. The good girl is saving up for a plane ticket.Follow her as hope takes ...See moreAn irate father throws his son's basketball out the window. Follow it to a new girlfriend. A spoiled brat speeds off in her boyfriend's car. Follow it to a bad idea. The good girl is saving up for a plane ticket.Follow her as hope takes off. Fall to Grace, a debut film by Mari Marchbanks, has a taut script with an epic heart. Kristofer, a Russian-Georgian emigrant, is trying to make his way in a new country, a new school and onto the varsity team. Living under the weight of his father's anger and economic hardship, Kristofer keeps himself afloat with a basketball and a flirtatious spirit. But when Sarah flirts back, Kristofer begins to realize he may have come on to the wrong girl. Sarah has her hands full trying to keep her random drug use within the range of an excusable cry for attention, but it's quickly becoming a real problem. Like so many troubles, a stack of money would go a long way toward making things better, but the only available cash lies in a shoebox at the bottom of Jessie's closet and Jessie's Dad is a cop. As these individual stories intersect and collide, heartache ignites into remarkable hope. Fall to Grace reminds us of the invisible threads connecting us to one another, creating a net to catch us when we fall.  Written by Mari MarchbanksSee less",
    "2006_571": "An ex-con returns to his Florida hometown after three years and becomes involved with the wife of his best friend, the local Sheriff.",
    "2006_572": "In this provocative teen comedy, Luke, a young man insecure about his masculinity discovers he's a Zerophiliac, with the ability to change sex at will. Join Luke as he journeys into the extraordinary world of Zerophilia where so many crazy...See moreIn this provocative teen comedy, Luke, a young man insecure about his masculinity discovers he's a Zerophiliac, with the ability to change sex at will. Join Luke as he journeys into the extraordinary world of Zerophilia where so many crazy questions arise, only one question matters: \"Whom do you love?\"  Written by AnonymousSee less",
    "2006_573": "A documentary on thirty years of alternative NYC rock 'n roll.",
    "2006_574": "A handful of immigrants make a bittersweet pilgrimage back to the land of their birth in this comedy drama. Ten people who have little in common beyond the fact they were all originally from Puerto Rico and now live in New York discover ...See moreA handful of immigrants make a bittersweet pilgrimage back to the land of their birth in this comedy drama. Ten people who have little in common beyond the fact they were all originally from Puerto Rico and now live in New York discover they've won a contest giving them each a free, all-expenses paid vacation -- in Puerto Rico. While some are eager to visit the place they once called home, others are nervous about what they will find and wary about confronting the people and things they left behind. The travelers include Carlotta, who has become a successful businesswoman and philanthropist; Daisy and Baldo, who would like to return to Puerto Rico when they retire, but aren't sure they want to be so far from their daughter, who loves New York City; Chris, who has thoroughly assimilated into Anglo culture (including an Anglo wife) and isn't sure he wants to see Puerto Rico again; Rodolfo, who still pines for the love he left behind; young and attractive Sara; and Matilde and Clotilde, two elderly sisters who have been all but forgotten by their family.  Written by AnonymousSee less",
    "2006_575": "Ozren is a small boy of Croatian descent who lives in Vienna with his mother, Silvija in the mid-1980s. As a single parent she emigrated to Vienna from the former Yugoslavia in the hope of a better life. Like any child, he very much looks ...See moreOzren is a small boy of Croatian descent who lives in Vienna with his mother, Silvija in the mid-1980s. As a single parent she emigrated to Vienna from the former Yugoslavia in the hope of a better life. Like any child, he very much looks up to his mother. She is a waitress and when she goes out to work at night, his aunt, Ljiljana comes to take care of him. Then we see him back in elementary school, where he is called as whore's boy. Although he does not understand the meaning of the swear word, he is intrigued by it: his mother works as a waitress, right?  Written by CinemanSee less",
    "2006_576": "After a lion kills the village leader, the expected rains fail to arrive, so a group of warriors are sent to hunt the lion down and kill it in hopes that the rains will come at last.",
    "2006_577": "loudQUIETloud is the story of this unforseen plot twist. A deeply compelling portrait of four band members and their difficult, tense, and ultimately triumphant return.",
    "2006_578": "EMMY and British Grierson Award nominated documentary in which former CIA agent and terrorism expert Robert Baer tracks the history of suicide bombers.",
    "2006_579": "A lifelong bachelor confronts his intimacy issues when he sublets his apartment to a fetching biologist. His heartsick fish and his wise best buddy are on hand to provide perspective.",
    "2006_58": "A family determined to get their young daughter into the finals of a beauty pageant take a cross-country trip in their VW bus.",
    "2006_580": "Saint of 9/11 presents the turbulent, restless, spiritual and remarkable journey of Father Mychal Judge. Compassionate champion of the needy and forgotten, a beloved Fire Department Chaplain, rousing Irish-American balladeer and iconoclast...See moreSaint of 9/11 presents the turbulent, restless, spiritual and remarkable journey of Father Mychal Judge. Compassionate champion of the needy and forgotten, a beloved Fire Department Chaplain, rousing Irish-American balladeer and iconoclast, Father wrestled with his own private demons while touching others in powerful and miraculous ways. Mychal Judge knew the pain of loss and suffering. He struggled with alcoholism and was an outspoken AA advocate. Father Judge was a gay man who loved his priestly work. Saint of 9/11 portrays Mychal's life as a spiritual adventure and an honest embrace of life, where alcoholism and sexuality were acknowledged. Saint of 9/11 is the story of a life's journey interrupted. Inspired by his life, the documentary embraces Mychal's full humanity.  Written by Equality ForumSee less",
    "2006_581": "Against the anxieties and fears of post-9/11 America, an Arab cab driver picks up a troubled professional woman with unexpected results.",
    "2006_582": "Mendy is a young Brookyln Hasid who leaves the strict rules of his insular and repressive community to join his childhood friend, Yankel, who is living securlary in Manhattan. Mendy's struggle to integrate his faith and traditions with the...See moreMendy is a young Brookyln Hasid who leaves the strict rules of his insular and repressive community to join his childhood friend, Yankel, who is living securlary in Manhattan. Mendy's struggle to integrate his faith and traditions with the modern world are influenced by his growing friendship with Bianca, Yankel's free spirited Brazilian roommate.  Written by AnonymousSee less",
    "2006_583": "A tragic-comic tale with surrealistic tendencies about a lost 23-year-old who is haunted by her disappointed 13-year-old self.",
    "2006_584": "Beyond Honor is a heart-stopping, emotionally resonant portrayal of gender roles and the dynamics of power in a claustrophobic immigrant family living in Southern California.",
    "2006_585": "A young woman who lives in a desert trailer park must choose between caring for her hapless father and sick friend or fulfilling her own destiny. Read more: Synopsis",
    "2006_586": "Randy commits a crime that would normally get him probation and a hefty fine, but in the \"three-strikes\" world of justice, he finds himself locked up for 25 years. His cellmate Jake is a congenial yet remorseless lifer who casually informs...See moreRandy commits a crime that would normally get him probation and a hefty fine, but in the \"three-strikes\" world of justice, he finds himself locked up for 25 years. His cellmate Jake is a congenial yet remorseless lifer who casually informs Randy that he slit his wife's throat because she slept with another man just three months after they exchanged vows. Jake recognizes Randy's fear and offers him advice on how to make it in prison. But it soon becomes clear that Jake has much more than mentoring in mind as he takes Randy under his wing. \"Jailbait\" sets a darkly cerebral tone, juxtaposing brutality with the unattainable ideal of intimacy in the harshest of psychological environments. For these two men so yearning to be anything but who they are and where they are, power is the goal, and it's never clear who truly holds it right up to the last unsettling moment.  Written by Kindred Media GroupSee less",
    "2006_587": "A pizza deliveryman develops a bond with a girl nearly half his age.",
    "2006_588": "Returning to her hometown of Vancouver on the news that her Caucasian father is on his deathbed, Rebecca learns from him before he dies that her aboriginal mother, Rita, did not abandon them twenty-five years ago because Rita did not love ...See moreReturning to her hometown of Vancouver on the news that her Caucasian father is on his deathbed, Rebecca learns from him before he dies that her aboriginal mother, Rita, did not abandon them twenty-five years ago because Rita did not love Rebecca as he had always told her, but rather he forced Rita to leave. As such, Rebecca goes on a search for Rita through Vancouver's notorious downtown eastside, where over the years many aboriginal women, marginalized in society, have been found dead, most under the mysterious but suspicious circumstance of being alone in their single room occupancy (SRO) hotel with excessively high blood alcohol levels. Many of these women were officially classified as missing before their dead bodies discovered. Although she comes across a few leads, Rebecca believes the strongest lead in finding her mother is through a man named Norman, who claims to have seen the woman in the photograph, who he refers to as Shadie, sometime recently. Rebecca will learn how much Norman truly knows about her mother, as well as about the dead and missing women.  Written by HuggoSee less",
    "2006_589": "A young artist (Peter Paige), desperate to replace the relationship he had with his recently relocated godson, is targeted by a neighborhood mom (Kathy Najimy) as a potential threat to the community.",
    "2006_59": "A woman, Rose, goes in search for her adopted daughter within the confines of a strange, desolate town called Silent Hill.",
    "2006_590": "A gothic '50s high-school comedy about a love-triangle that goes terribly bad, as two young, murdered teens return to their prom to get revenge.",
    "2006_591": "An adventurous coming-of-age story that follows young rebellious Sherry through Europe as she loses her illusions, virginity and lip ring. Read more: Synopsis",
    "2006_592": "An overworked, middle-aged Texas woman embezzles from her employer and abandons her family to seek out a mysterious room that has been appearing to her in visions during seizure-like attacks.",
    "2006_593": "A documentary about the exploitation of the Congo by King Leopold II of Belgium.",
    "2006_594": "A drug pusher grows increasingly desperate after a botched deal leaves him with a large debt to a ruthless drug lord.",
    "2006_595": "Growing up is mystifying, but Billy discovers all he has to be is himself",
    "2006_596": "This documentary follows the 2002 mayoral campaign in Newark, New Jersey in which a City Councilman, Cory Booker, attempted to unseat longtime mayor Sharpe James.",
    "2006_597": "President Alberto Fujimori risked everything to win Peru's war on terror, but in doing so became an international fugitive, wanted for corruption, kidnapping and murder. Read more: Synopsis",
    "2006_598": "The L.A. dog walking scene provides a colorful backdrop for the story of Ellie Moore, damaged goods on the run from her latest abusive boyfriend and on the verge of transformation. She's helped along in that process by Betsy Wright, a ...See moreThe L.A. dog walking scene provides a colorful backdrop for the story of Ellie Moore, damaged goods on the run from her latest abusive boyfriend and on the verge of transformation. She's helped along in that process by Betsy Wright, a misanthropic dog-walker in need of help with her business and struggling with her own dark past. The odd relationship between the cranky dog-walker and her unstable new apprentice proves the catalyst for the emotional journey Ellie must undertake. In Betsy, she finds a dark mirror of herself - a lonely, angry, complex woman whose own troubled past proves disturbingly close to her own. And in the dogs, she finds lost pieces of herself as she fumbles with the leash to her own life - struggling to hold on as it pulls her toward a brighter future before her past catches up with her.  Written by AnonymousSee less",
    "2006_599": "This film follows a Jewish artist and her family.",
    "2006_6": "A hot-shot race-car named Lightning McQueen gets waylaid in Radiator Springs, where he finds the true meaning of friendship and family.",
    "2006_60": "The tumultuous early history of the Central Intelligence Agency is viewed through the prism of one man's life.",
    "2006_600": "A high school baseball coach (Krumholtz) and a down-on-his-luck private investigator (Burns) form a bond as they scour New York City for the coach's wife, who's run away with a second-rate rock star. As in Burns' previous films, the city ...See moreA high school baseball coach (Krumholtz) and a down-on-his-luck private investigator (Burns) form a bond as they scour New York City for the coach's wife, who's run away with a second-rate rock star. As in Burns' previous films, the city itself becomes a character as the two men confront their fear of change and the familiar habit of loneliness.  Written by AnonymousSee less",
    "2006_601": "A documentary on a 60-year-old New Mexico matchmaker who finds Mexican wives for American men for a fee.",
    "2006_602": "Todd's life spins out of control when an unexpected friendship with a gay man causes everyone in his life to start believing he's gay. Do they know something he doesn't?",
    "2006_603": "A mild-mannered gay dentist and a hedonist womanizer rekindle their unlikely friendship when the latter's terminal cancer drives them back together after a decade apart.",
    "2006_604": "Multi-narrative adaptation of Richard v. Krafft-Ebing's notorious medico-forensic study of sexual perversity.",
    "2006_605": "Peter, a married psychotherapist, and Suzanne, a professional dominatrix, have been engaged in an affair of sensual dominance and submission in an S&M dungeon where they must abide by the rules. Now, those rules are about to be broken when...See morePeter, a married psychotherapist, and Suzanne, a professional dominatrix, have been engaged in an affair of sensual dominance and submission in an S&M dungeon where they must abide by the rules. Now, those rules are about to be broken when they agree to see each other on the outside. As Peter becomes increasingly obsessed with the troubled Suzanne, they embark on a sordid psychosexual journey into their tortured pasts through their most carnal desires.See less",
    "2006_606": "A gay detective tries to solve the murder of a college student.",
    "2006_607": "Blossoms of Fire is a dazzling, whirling dance of a film that celebrates the extraordinary lives of the Isthmus Zapotecs of southern Oaxaca, Mexico, whose strong work ethic and fierce independent streak rooted in their culture, have ...See moreBlossoms of Fire is a dazzling, whirling dance of a film that celebrates the extraordinary lives of the Isthmus Zapotecs of southern Oaxaca, Mexico, whose strong work ethic and fierce independent streak rooted in their culture, have resulted not only in powerful women but also in the region's progressive politics and their unusual tolerance of alternative gender roles.  Written by Maureen GoslingSee less",
    "2006_608": "Marc, a traveling entertainer, is on his way home for Christmas when his van brakes in the middle of a jerkwater town with some strange inhabitants.",
    "2006_609": "The hilarious intimacy of two comedians locked in a car together for hundreds of miles. Together, they each struggle with Ray's obsessions, phobias and insecurities in this unscripted exploration of newfound fame.",
    "2006_61": "Berated all his life by those around him, a monk follows his dream and dons a mask to moonlight as a Luchador (Mexican wrestler).",
    "2006_610": "Apathy, technology, paranoia, disease and medication. Meet Arin. Arin is a shy videographer who finds it too much to handle to go out and meet girls, so he sets up an account on meester.net. The flood of responses never comes, save for one...See moreApathy, technology, paranoia, disease and medication. Meet Arin. Arin is a shy videographer who finds it too much to handle to go out and meet girls, so he sets up an account on meester.net. The flood of responses never comes, save for one email from Susan, a struggling artist who finds her job as a waitress stifling her creativity. Susan is also on the shy side and is seeking an alternative to the classic dating situation. When Arin and Susan finally meet, that alternative dating situation comes to life as the two refuse to communicate verbally with each other, wanting to avoid bullshit small talk. Instead, when they do need to communicate to each other, they pass a pen and pad back and forth.  Written by Eric Campos - Film ThreatSee less",
    "2006_611": "A former convict and drug abuser (Bernstein) meets a dog trainer who wants him to help out in her work as part of his rehabilitation. Story told by the dog.",
    "2006_612": "This drama focuses on three very different siblings, all searching for happiness. Hans-Jörg is a sex addicted librarian, who is interested in young students. Werner is a successful politician with a dysfunctional family. Agnes, a ...See moreThis drama focuses on three very different siblings, all searching for happiness. Hans-Jörg is a sex addicted librarian, who is interested in young students. Werner is a successful politician with a dysfunctional family. Agnes, a transsexual, works as a table dancer in a nightclub. The three brothers just have one thing in common: their longing for a happy life...  Written by fippi2000See less",
    "2006_613": "Through interviews with Arabs and Israelis, this documentary explores the legacy of Palestinian-American intellectual Edward Said.",
    "2006_614": "A film about jazz pianist Herbie Hancock.",
    "2006_615": "Seven days, 45 finalists, one World Champion. Shot on location in Las Vegas, Nevada, Rank takes us from the ranch to the arena for the struggle of the three highest-ranking bull riders competing for the title of PBR World Champion. The ...See moreSeven days, 45 finalists, one World Champion. Shot on location in Las Vegas, Nevada, Rank takes us from the ranch to the arena for the struggle of the three highest-ranking bull riders competing for the title of PBR World Champion. The three contenders: Justin McBride, a third generation bull rider; Mike Lee, 21 year-old born-again Christian and 34 year-old Brazilian Adriano Moraes, already a two-time PBR World Champion, who has been riding since the age of 18 and is now in the twilight of his bull riding career. This documentary brings the reality of this hazardous sport into focus for the first time. From preparations to ride through severe injuries and finally, victory for one: a gold belt buckle and a check for one million dollars.  Written by IFCSee less",
    "2006_616": "Poses questions to a large and varied group of people regarding their own perception of the divine. The peculiar microcosm, a surprising sociological container, is the backdrop where these inquiries take place: the set of The Passion of the Christ.",
    "2006_617": "As Macedonia faces its difficult transition, a boy escapes into a world of his own creation.",
    "2006_618": "A documentary on the extremes to which workers will go to earn a living.",
    "2006_619": "Larry Sparks is an angry Republican. Frustrated by the antics of his own political party, he vents his rage in emails, chat rooms and web logs. After being warned by federal agents to cease his activities, Larry decides to quit his job, ...See moreLarry Sparks is an angry Republican. Frustrated by the antics of his own political party, he vents his rage in emails, chat rooms and web logs. After being warned by federal agents to cease his activities, Larry decides to quit his job, sell his house and launch an all-out campaign against the right-wing political establishment. However a lack of funds soon forces Larry to redirect his energy into a more modest venture: a satirical community play called \"George Bush Goes to Heaven\".  Written by Hermosa Beach FilmworksSee less",
    "2006_62": "A 3-D digital exploration of the ocean's depths and its creatures.",
    "2006_620": "In an abandoned tenement, an African-American militant writer and a Jewish novelist develop a friendship while struggling to complete their novels, but inner tension rises between the two.",
    "2006_621": "Seventeen-year old Robbie Zirpollo has a problem. As the film opens, his mother is driving him to his new summer job. We learn that Robbie has grown up in Oceanside, California, but now he and his mother have moved to Colorado for a fresh ...See moreSeventeen-year old Robbie Zirpollo has a problem. As the film opens, his mother is driving him to his new summer job. We learn that Robbie has grown up in Oceanside, California, but now he and his mother have moved to Colorado for a fresh start, as his father has taken the family's savings and his secretary to Mexico. Robbie's mom has, through an uncle, gotten him a summer job at Water World on the grounds crew. The adventure begins when Robbie meets Alex and gets moved to Aokee's Surf & Snack shack to work. Alex convinces Robbie to enter the park's \"Employee Olympics\" to bring the Surfer King trophy to it's rightful place among the concessions crew. Tiffany, the park owner's daughter, has other ideas for Robbie.  Written by Bernard MurraySee less",
    "2006_622": "After living on the tough streets of LA for a while, India hopes that every gay basher will meet his destiny. In this case Destiny is a black, 6 foot, high heel wearing, gun toting, drag queen with an attitude and a soft place in her heart...See moreAfter living on the tough streets of LA for a while, India hopes that every gay basher will meet his destiny. In this case Destiny is a black, 6 foot, high heel wearing, gun toting, drag queen with an attitude and a soft place in her heart for homeless gay boys.  Written by Havan_IronOak@bigfoot.comSee less",
    "2006_623": "A man, crippled in a climbing accident, returns to his cabin in the woods as part of his rehabilitation, but he wasn't prepared for the immanent onslaught.",
    "2006_624": "This documentary compiles a series of Noam Chomsky's interviews and lectures that address the events of 9/11.",
    "2006_625": "25-year-old Alex Borden is handsome, charming, and intelligent. In fact, he may be too smart for his own good as his life is swiftly becoming a living hell. Alex's nightmare begins when he meets Harry, a mysterious artist and chess-master....See more25-year-old Alex Borden is handsome, charming, and intelligent. In fact, he may be too smart for his own good as his life is swiftly becoming a living hell. Alex's nightmare begins when he meets Harry, a mysterious artist and chess-master. Alex becomes alarmed when his intellect mysteriously begins to grow, and so do the horrors that invade his nightmares, and soon his waking hours. Long-suppressed memories surface and Alex must face the terrors of his violent past, a vanished older brother, a father who abandoned both his sons, and a mother who was viciously murdered. The visions intensify and he begins to experience intense headaches that ultimately cause him to blackout. But it is only the beginning of Alex's calamity. Friends and neighbors are disappearing, and people are whispering rumors of a serial killer. Menaced from all sides by the forces of evil, Alex must overcome his past and contain his own deadly urges so he can hopefully discover what demons, both real and imagined, are stalking him.  Written by Joseph B. MauceriSee less",
    "2006_626": "Like many Palestinian families, the Amers live surrounded by the infamous West Bank Wall where their daily lives are dominated by electrified fences, locks and a constant swarm of armed soldiers. Through director Carolina Rivas' sensitive ...See moreLike many Palestinian families, the Amers live surrounded by the infamous West Bank Wall where their daily lives are dominated by electrified fences, locks and a constant swarm of armed soldiers. Through director Carolina Rivas' sensitive lens, we discover the private world of all eight members of the family. As their dramas unfold, we catch a glimpse of their constant struggles and the small, endearing details that sustain them, including olive trees, two small donkeys and their many friendships. Constructed with a combination of verite scenes and re-enactments, this poignant and richly crafted film offers its audience a much needed opportunity to reflect on the effects of racial segregation, the meaning of borders and the absurdity of war.  Written by Alex WilliamsSee less",
    "2006_627": "A 3000km journey up the Danube river to the heart of Europe.",
    "2006_628": "The story of the war the international community waged against civil war stricken Sierra Leone.",
    "2006_629": "After a failed romance, Matt dates a string of women and falls for his mate?s girlfriend in his quest to understand the opposite sex.",
    "2006_63": "A high school swim champion with a troubled past enrolls in the U.S. Coast Guard's \"A\" School, where legendary rescue swimmer Ben Randall teaches him some hard lessons about loss, love, and self-sacrifice.",
    "2006_630": "When the Vice President's plane goes down near a remote Pacific island, he is kidnapped by rebel forces and held for ransom. It is up to his female Secret Service agent and a press secretary to infiltrate the camp and save him.",
    "2006_631": "Following a passion for country music, Ralph leaves his father's sheep farm in a remote Australian town, armed with a guitar and a plane ticket to Nashville, Tennessee. He hopes to hitchhike to Sydney Airport where his take-off into a ...See moreFollowing a passion for country music, Ralph leaves his father's sheep farm in a remote Australian town, armed with a guitar and a plane ticket to Nashville, Tennessee. He hopes to hitchhike to Sydney Airport where his take-off into a successful country/western singing career will hopefully begin. However, fate and his naivety find him hitchhiking with a psychotic drug thief named Boyd, and Boyd's mesmerising girlfriend, Patsy.  Written by zzzorfSee less",
    "2006_632": "Royce, a straight-laced accountant and Damien, a playboy real-estate agent are cousins and housemates at the crossroads of their lives. Royce is looking for true love and commitment, while Damien is avoiding it. Things become even more ...See moreRoyce, a straight-laced accountant and Damien, a playboy real-estate agent are cousins and housemates at the crossroads of their lives. Royce is looking for true love and commitment, while Damien is avoiding it. Things become even more complicated with the arrival of their new and mysterious roommate, Toni, who is in the middle of everything. ISSUES is the anti-romantic relationship comedy about the complications and contradictions of everyday life. Raw, candidly humorous, and emotionally honest.  Written by Van ElderSee less",
    "2006_633": "A sex-starved man's tireless quest to bed a bevy of beautiful women while held up in bed with a broken pelvis. Just because he's bedridden doesn't mean this unfortunate male specimen should have to go without sex, and as he his pulls out ...See moreA sex-starved man's tireless quest to bed a bevy of beautiful women while held up in bed with a broken pelvis. Just because he's bedridden doesn't mean this unfortunate male specimen should have to go without sex, and as he his pulls out all the stops to attract the attentions of an alluring policewoman currently investigating the disappearance of his fiancee, he's about to find out just how long a man can go without sex before he self-destructs.See less",
    "2006_634": "A young photographer, Tariq, must choose between his love and his duty of this aristocratic family. He can either run away with his lover, an orphan from the lower class, or go through with his arranged marriage to the daughter of a judge.",
    "2006_635": "While searching for a \"cure all\" serum, Dr. Kanopolus is being pressured for results by the pharmaceutical company funding the project. With time running out, his desperation decisions will unleash a terrifying monster on a killing spree.",
    "2006_636": "The family man accountant Grant travels to Las Vegas and meets the lascivious \"Lolita\" Marissa in a casino. While in the motel with Marissa, her violent ex-boyfriend Joey surprises them on the bed, hits Grant on the head, but he kills Joey...See moreThe family man accountant Grant travels to Las Vegas and meets the lascivious \"Lolita\" Marissa in a casino. While in the motel with Marissa, her violent ex-boyfriend Joey surprises them on the bed, hits Grant on the head, but he kills Joey. Grant brings Joey's body to bury in the desert Zyzzyx Road, but after digging a grave, he finds that the body is missing in the trunk of his car. Grant chases Joey with a shovel in the desert, and when he finds the man hidden in a abandoned mine, Joey discloses a secret about Marissa.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2006_64": "A monster emerges from Seoul's Han River and begins attacking people. One victim's loving family does what it can to rescue her from its clutches.",
    "2006_65": "In turn-of-the-century Vienna, a magician uses his abilities to secure the love of a woman far above his social standing.",
    "2006_66": "Bob Munro and his dysfunctional family rent an RV for a road trip to the Colorado Rockies, where they ultimately have to contend with a bizarre community of campers.",
    "2006_67": "A man tries to live a normal life despite the fact that he sometimes turns into a sheepdog. Read more: Synopsis",
    "2006_68": "Spoof of romantic comedies which focuses on a man, his crush, his parents, and her father.",
    "2006_69": "After her death, a mother returns to her home town in order to fix the situations she couldn't resolve during her life.",
    "2006_7": "The human government develops a cure for mutations, and Jean Gray becomes a darker uncontrollable persona called the Phoenix who allies with Magneto, causing escalation into an all-out battle for the X-Men.",
    "2006_70": "Chris Pontius, Johnny Knoxville, Steve-O, Bam Margera, and the whole crew return to the screen to raise the stakes higher than ever before. Read more: Synopsis",
    "2006_71": "In the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.",
    "2006_72": "A security specialist is forced into robbing the bank that he's protecting, as a bid to pay off his family's ransom.",
    "2006_73": "Three backpackers head to a Slovak city that promises to meet their hedonistic expectations, with no idea of the hell that awaits them.",
    "2006_74": "A Secret Service agent is framed as the mole in an assassination attempt on the President. He must clear his name and foil another assassination attempt while on the run from a Secret Service Protective Intelligence Division agent.",
    "2006_75": "During China's Tang dynasty the emperor has taken the princess of a neighboring province as wife. She has borne him two sons and raised his eldest. Now his control over his dominion is complete, including the royal family itself.",
    "2006_76": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives.",
    "2006_77": "A real-time account of the events on United Flight 93, one of the planes hijacked on September 11th, 2001 that crashed near Shanksville, Pennsylvania when passengers foiled the terrorist plot.",
    "2006_78": "Apartment building superintendent Cleveland Heep rescues what he thinks is a young woman from the pool he maintains. When he discovers that she is actually a character from a bedtime story who is trying to make the journey back to her home...See moreApartment building superintendent Cleveland Heep rescues what he thinks is a young woman from the pool he maintains. When he discovers that she is actually a character from a bedtime story who is trying to make the journey back to her home, he works with his tenants to protect his new friend from the creatures that are determined to keep her in our world.See less",
    "2006_79": "Three interwoven stories about a terrible curse. A young woman encounters a malevolent supernatural force while searching for her missing sister in Tokyo; a mean high school prank goes horribly wrong; a woman with a deadly secret moves ...See moreThree interwoven stories about a terrible curse. A young woman encounters a malevolent supernatural force while searching for her missing sister in Tokyo; a mean high school prank goes horribly wrong; a woman with a deadly secret moves into a Chicago apartment building.See less",
    "2006_8": "IMF agent Ethan Hunt comes into conflict with a dangerous and sadistic arms dealer who threatens his life and his fiancee in response.",
    "2006_80": "In 2027, in a chaotic world in which women have become somehow infertile, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea.",
    "2006_81": "A family falls victim to a group of mutated cannibals in a desert far away from civilization.",
    "2006_82": "The Man in the Yellow Hat is an oddball museum employee who looks after his pet monkey, an inquisitive and wonderful creature whose enthusiasm often gets the best of him.",
    "2006_83": "Three ex-girlfriends of a serial cheater set up their former lover to fall for the new girl in town so they can watch him get his heart broken.",
    "2006_84": "The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.",
    "2006_85": "A biography of Chinese Martial Arts Master Huo Yuanjia, who is the founder and spiritual guru of the Jin Wu Sports Federation.",
    "2006_86": "During a babysitting gig, a high-school student is harassed by an increasingly threatening prank caller.",
    "2006_87": "The real story of a dance teacher who believed in the talent of a group of problem kids.",
    "2006_88": "The life stories of the six men who raised the flag at the Battle of Iwo Jima, a turning point in World War II.",
    "2006_89": "An aging alcoholic cop is assigned the task of escorting a witness from police custody to a courthouse 16 blocks away. There are, however, chaotic forces at work that prevent them from making it in one piece.",
    "2006_9": "Superman returns to Earth after spending five years in space examining his homeworld Krypton. But he finds things have changed while he was gone, and he must once again prove himself important to the world.",
    "2006_90": "A trio of guys try and make up for missed opportunities in childhood by forming a three-player baseball team to compete against standard children's Little League squads.",
    "2006_91": "While planning her family reunion, a pistol-packing grandma must contend with the other dramas on her plate, including the runaway who has been placed under her care, and her love-troubled nieces.",
    "2006_92": "An FBI agent takes on a plane full of deadly venomous snakes, deliberately released to kill a witness being flown from Honolulu to Los Angeles to testify against a mob boss.",
    "2006_93": "When a regular guy dumps a superhero for her neediness, she uses her powers to make his life a living hell.",
    "2006_94": "The retelling of France's iconic but ill-fated queen, Marie Antoinette. From her betrothal and marriage to Louis XVI at 15 to her reign as queen at 19 and to the end of her reign as queen, and ultimately the fall of Versailles.",
    "2006_95": "Based on the story of Vince Papale, a 30-year-old bartender from South Philadelphia who overcame long odds to play for the NFL's Philadelphia Eagles in 1976.",
    "2006_96": "When her brother decides to ditch for a couple weeks, Viola heads over to his elite boarding school, disguised as him, and proceeds to fall for his school's star soccer player, and soon learns she's not the only one with romantic troubles.",
    "2006_97": "A case of mistaken identity lands Slevin into the middle of a war being plotted by two of the city's most rival crime bosses. Under constant surveillance by Detective Brikowski and assassin Goodkat, he must get them before they get him.",
    "2006_98": "After Lucas Nickle (Zach Tyler) floods an ant colony with his watergun, he's magically shrunken down to insect size and sentenced to hard labor in the ruins.",
    "2006_99": "I.R.S. auditor Harold Crick suddenly finds himself the subject of narration only he can hear: narration that begins to affect his entire life, from his work, to his love-interest, to his death."
}