{
    "2007_1": "Captain Barbossa, Will Turner and Elizabeth Swann must sail off the edge of the map, navigate treachery and betrayal, find Jack Sparrow, and make their final alliances for one last decisive battle.",
    "2007_10": "King Leonidas of Sparta and a force of 300 men fight the Persians at Thermopylae in 480 B.C.",
    "2007_100": "Brings to life some of the most bizarre, ferocious and fascinating creatures to ever inhabit the ocean. Combines animation with recreations in a prehistoric adventure. A journey to the bottom of the ancient oceans dramatizes awe-inspiring ...See moreBrings to life some of the most bizarre, ferocious and fascinating creatures to ever inhabit the ocean. Combines animation with recreations in a prehistoric adventure. A journey to the bottom of the ancient oceans dramatizes awe-inspiring creatures.  Written by Andrew KurmanSee less",
    "2007_101": "A Christmastime drama centered around the Whitfield family's first holiday together in four years.",
    "2007_102": "A well-respected businessman is sometimes controlled by his murder and mayhem-loving alter ego.",
    "2007_103": "A college graduate goes to work as a nanny for a rich New York family. Ensconced in their home, she has to juggle their dysfunction, a new romance, and the spoiled brat in her charge.",
    "2007_104": "Chaos ensues when a man tries to expose a dark secret regarding a recently deceased patriarch of a dysfunctional British family.",
    "2007_105": "A young teacher inspires her class of at-risk students to learn tolerance, apply themselves and pursue education beyond high school.",
    "2007_106": "China, 1860s: Having his army slaughtered, General Qingyun joins 2 bandit leaders in raids on rebels and in blood oath. They form a Qing loyal army with eyes on rebel held Suzhou and Nanjing.",
    "2007_107": "Down-and-out former professional ping-pong phenom, Randy Daytona, is sucked into a maelstrom when FBI Agent Ernie Rodriguez recruits him for a secret mission. Randy is determined to bounce back and win, and to smoke out his father's killer...See moreDown-and-out former professional ping-pong phenom, Randy Daytona, is sucked into a maelstrom when FBI Agent Ernie Rodriguez recruits him for a secret mission. Randy is determined to bounce back and win, and to smoke out his father's killer -- arch-fiend Feng.See less",
    "2007_108": "FBI upstart Eric O'Neill enters into a power game with his boss, Robert Hanssen, an agent who was put on trial for selling secrets to the Soviet Union.",
    "2007_109": "An FBI Agent seeks vengeance on a mysterious assassin known as \"Rogue\" who murdered his partner.",
    "2007_11": "Jason Bourne dodges a ruthless C.I.A. official and his Agents from a new assassination program while searching for the origins of his life as a trained killer.",
    "2007_110": "As a Washington, D.C. psychiatrist unearths the origin of an alien epidemic, she also discovers her son might be the only way it can be stopped.",
    "2007_111": "In the 1970s, Om, an aspiring actor, is murdered, but is immediately reincarnated into the present day. He attempts to discover the mystery of his demise and find Shanti, the love of his previous life.",
    "2007_112": "An alliance of evil-doers, led by Frieda, looks to take over Fairy Tale Land. But when Ella realizes her stepmother is out to ruin her storybook existence, she takes a dramatic turn and blossoms into the leader of the resistance effort.",
    "2007_113": "A group of National Guard trainees find themselves battling against a vicious group of mutants on their last day of training in the desert.",
    "2007_114": "A biographical portrait of a pre-fame Jane Austen and her romance with a young Irishman.",
    "2007_115": "A documentary comparing the highly profitable American health care industry to other nations, and HMO horror stories including shotgun deaths.",
    "2007_116": "Three American college students studying abroad are lured to a Slovakian hostel, and discover the grim reality behind it.",
    "2007_117": "A married couple becomes stranded at an isolated motel and finds hidden video cameras in their room. They soon realize that unless they escape, they'll be the next victims of a snuff film.",
    "2007_118": "A year after their father's funeral, three brothers travel across India by train in an attempt to bond with each other.",
    "2007_119": "A team of international astronauts are sent on a dangerous mission to reignite the dying Sun with a nuclear fission bomb in 2057.",
    "2007_12": "John McClane and a young hacker join forces to take down master cyber-terrorist Thomas Gabriel in Washington D.C.",
    "2007_120": "Two Boston area detectives investigate a little girl's kidnapping, which ultimately turns into a crisis both professionally and personally.",
    "2007_121": "Taken aback by his mother's wedding announcement, a young man returns home in an effort to stop her from marrying his old high school gym teacher, a man who made middle school hell for generations of students.",
    "2007_122": "Five years after jilting his pregnant fiancee on their wedding day, out-of-shape Dennis decides to run a marathon to win her back.",
    "2007_123": "A wealthy young man undergoing heart transplant surgery discovers that the surgical team intend to murder him.",
    "2007_124": "On the day that a serial killer that he helped put away is supposed to be executed, a noted forensic psychologist and college professor receives a call informing him that he has 88 minutes left to live.",
    "2007_125": "Johnny and a couple pals kidnap Jake's 15-year-old brother, Zach, then assigns his buddy Frankie to be Zach's minder. They develop a brotherly friendship. Zach parties with his captors as things begin to spin out of control.",
    "2007_126": "The idealist William Wilberforce (Ioan Gruffudd) maneuvers his way through Parliament, endeavoring to end the British transatlantic slave trade.",
    "2007_127": "A boy's life is turned upside down when he learns that he is the last of a group of immortal warriors who have dedicated their lives to fighting the forces of the dark.",
    "2007_128": "A mechanic falls in love with his attorney.",
    "2007_129": "Florentino, rejected by the beautiful Fermina at a young age, devotes much of his adult life to carnal affairs as a desperate attempt to heal his broken heart.",
    "2007_13": "In a parallel universe, young Lyra Belacqua journeys to the far North to save her best friend and other kidnapped children from terrible experiments by a mysterious organization.",
    "2007_130": "A Viking boy is left behind after his clan battles a Native American tribe. Raised within the tribe, he ultimately becomes their savior in a fight against the Norsemen.",
    "2007_131": "Teen detective Nancy Drew accompanies her father on a business trip to Los Angeles, where she happens upon clues to a murder mystery involving a movie star.",
    "2007_132": "A drama based on the true story of Melvin B. Tolson, a professor at Wiley College Texas. In 1935, he inspired students to form the school's first debate team, which went on to challenge Harvard in the national championship.",
    "2007_133": "A retired military investigator works with a police detective to uncover the truth behind his son's disappearance following his return from a tour of duty in Iraq.",
    "2007_134": "The music of The Beatles and the Vietnam War form the backdrop for the romance between an upper-class American girl and a poor Liverpudlian artist.",
    "2007_135": "Two siblings begin to develop special talents after they find a mysterious box of toys. Soon the kids, their parents, and even their teacher are drawn into a strange new world and find a task ahead of them that is far more important than ...See moreTwo siblings begin to develop special talents after they find a mysterious box of toys. Soon the kids, their parents, and even their teacher are drawn into a strange new world and find a task ahead of them that is far more important than any of them could imagine!See less",
    "2007_136": "A man named Mr. Smith delivers a woman's baby during a shootout, and is then called upon to protect the newborn from the army of gunmen.",
    "2007_137": "When a terrorist bombing in North Africa kills 19 incl. an American, an Egyptian chemical engineer flying from South Africa to his wife in USA, is arrested upon arriving USA. He disappears. His wife asks senator for help.",
    "2007_138": "A teenager is left invisible to the living after an attack.",
    "2007_139": "The story recounts the early life of Genghis Khan who was a slave before going on to conquer half the world in 1206.",
    "2007_14": "Three musical chipmunks are discovered by an aspiring songwriter who wants to use their amazing singing abilities to become famous.",
    "2007_140": "During their first year of high school, four best girlfriends face off against the domineering student body President, who wants to split them up into different social cliques.",
    "2007_141": "Quentin Tarantino and Robert Rodriguez's homage to exploitation double features in the '60s and '70s with two back-to-back cult films that include previews of coming attractions between them.",
    "2007_142": "A serial killer pins his crimes on two college students who gave him a ride.",
    "2007_143": "As the Roman empire crumbles, young Romulus Augustus flees the city and embarks on a perilous voyage to Britain to track down a legion of supporters.",
    "2007_144": "When two brothers organize the robbery of their parents' jewelry store the job goes horribly wrong, triggering a series of events that sends them, their father and one brother's wife hurtling towards a shattering climax.",
    "2007_145": "A troubled young woman is sent to live with her grandmother for the summer, while hiding a secret that could potentially tear her family apart.",
    "2007_146": "A villager, Gurukant Desai, arrives in Bombay 1958, and rises from its streets to become the GURU, the biggest tycoon in Indian history.",
    "2007_147": "A 'Love Guru' assists other males, woos a widowed single mother, but becomes embroiled in controversies.",
    "2007_148": "A precocious and outspoken Iranian girl grows up during the Islamic Revolution.",
    "2007_149": "The tale of two brothers with serious financial woes. When a third party proposes they turn to crime, things go badly and the two become enemies.",
    "2007_15": "A young maiden in a land called Andalasia, who is prepared to be wed, is sent away to New York City by an evil Queen, where she falls in love with a lawyer.",
    "2007_150": "A young widower returns to his hometown to search for answers to his wife's murder, which may be linked to the ghost of a deceased ventriloquist.",
    "2007_151": "A man who lost his family in the September 11 attack on New York City runs into his old college roommate. Rekindling the friendship is the one thing that appears able to help the man recover from his grief.",
    "2007_152": "Jenna is a pregnant, unhappily married waitress in the deep south. She meets a newcomer to her town and falls into an unlikely relationship as a last attempt at happiness.",
    "2007_153": "A rag-tag team of Reno cops are called in to save the day after a terrorist attack disrupts a national police convention in Miami Beach during spring break. Based on the Comedy Central series. Read more: Synopsis",
    "2007_154": "A young lonely woman takes a soul-searching journey across America to resolve her questions about love while encountering a series of offbeat characters along the way.",
    "2007_155": "An eight-year-old boy is thought to be a lazy trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school.",
    "2007_156": "Kabir Khan is the coach of the Indian Women's National Hockey Team and his dream is to make his all girls team emerge victorious against all odds.",
    "2007_157": "A modern romantic tale about a young aristocratic heiress born under a curse that can only be broken when she finds true love with \"one who will accept her as one of their own.\"",
    "2007_158": "A modern-day musical about a busker and an immigrant and their eventful week in Dublin, as they write, rehearse and record songs that tell their love story.",
    "2007_159": "Singer Dewey Cox overcomes adversity to become a musical legend.",
    "2007_16": "Danny Ocean rounds up the boys for a third heist after casino owner Willy Bank double-crosses one of the original eleven, Reuben Tishkoff.",
    "2007_160": "American-born Gogol, the son of Indian immigrants, wants to fit in among his fellow New Yorkers, despite his family's unwillingness to let go of their traditional ways.",
    "2007_161": "A drama exploring the romantic past and emotional present of Ann Lord (Vanessa Redgrave) and her daughters, Constance Haverford (Natasha Richardson) and Nina Mars (Toni Collette). As Ann lays dying, she remembers, and is moved to convey to...See moreA drama exploring the romantic past and emotional present of Ann Lord (Vanessa Redgrave) and her daughters, Constance Haverford (Natasha Richardson) and Nina Mars (Toni Collette). As Ann lays dying, she remembers, and is moved to convey to her daughters, the defining moments in her life fifty years ago, when she was a young woman. Harris Arden (Patrick Wilson) is the man Ann loves in the 1950s and never forgets.See less",
    "2007_162": "The true story of Elle editor Jean-Dominique Bauby who suffers a stroke and has to live with an almost totally paralyzed body; only his left eye isn't paralyzed.",
    "2007_163": "Marion and Jack try to rekindle their relationship with a visit to Paris, home of Marion's parents -- and several of her ex-boyfriends.",
    "2007_164": "An NRI and his wife decide to stay in his ancestral home, paying no heed to the warnings about ghosts. Soon, inexplicable occurrences cause him to call a psychiatrist to help solve the mystery.",
    "2007_165": "Mariane Pearl embarks on a frantic search to locate her journalist husband, Daniel, when he goes missing in Pakistan.",
    "2007_166": "The story of the Operation Bernhard, the largest counterfeiting operation in history, carried out by Germany during WWII.",
    "2007_167": "Two souls arrive in a small town, one on vacation, the other to meet a lover. They spend the most magical dream-like days of their lives in that town... with each other.",
    "2007_168": "Seeking to offer his son the satisfying summer camp experience that eluded him as a child, the operator of a neighborhood daycare center opens his own camp, only to face financial hardship and stiff competition from a rival camp.",
    "2007_169": "A Turkish man travels to Istanbul to find the daughter of his father's former girlfriend.",
    "2007_17": "The Fantastic Four learn that they aren't the only super-powered beings in the universe when they square off against the powerful Silver Surfer and the planet-eating Galactus.",
    "2007_170": "A sleazy writer has a chance to redeem himself when he goes to stay with his grandmother and befriends the neighbors.",
    "2007_171": "Rexxx, Hollywood's top canine star, gets lost and is adopted into a shabby firehouse. He teams up with a young kid to get the station back on its feet.",
    "2007_172": "Nick Hume is a mild-mannered executive with a perfect life, until one gruesome night he witnesses something that changes him forever. Transformed by grief, Hume eventually comes to the disturbing conclusion that no length is too great when...See moreNick Hume is a mild-mannered executive with a perfect life, until one gruesome night he witnesses something that changes him forever. Transformed by grief, Hume eventually comes to the disturbing conclusion that no length is too great when protecting his family.See less",
    "2007_173": "A 15-year-old boy unearths a shocking family secret.",
    "2007_174": "The fate of the world is threatened by seemingly monstrous entities known as Angels. NERV is an organisation set up to counter this threat and it is up to young pilots to protect Earth but exactly what are the real motives behind NERV?",
    "2007_175": "A woman struggles to accept the death of her fiance and the secrets he kept from her as she rebuilds her life.",
    "2007_176": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
    "2007_177": "A news team is sent to Burundi to capture and bring home a legendary 25-foot crocodile. Their difficult task turns potentially deadly when a warlord targets them for death.",
    "2007_178": "A man takes his thoroughly-British daughter to his home country, India. There, he arranges her marriage to someone she considers a fool. The daughter attempts to outwit them, but the groom quietly and patiently hatches his own plan.",
    "2007_179": "Ace car racer RV and his wife have the world at their feet. But he has an accident and his world is turned upside down. Can he reclaim his lost glory?",
    "2007_18": "Barry B. Benson, a bee just graduated from college, is disillusioned at his lone career choice: making honey. On a special trip outside the hive, Barry's life is saved by Vanessa, a florist in New York City. As their relationship blossoms,...See moreBarry B. Benson, a bee just graduated from college, is disillusioned at his lone career choice: making honey. On a special trip outside the hive, Barry's life is saved by Vanessa, a florist in New York City. As their relationship blossoms, he discovers humans actually eat honey, and subsequently decides to sue them.See less",
    "2007_180": "Robert Ford, who's idolized Jesse James since childhood, tries hard to join the reforming gang of the Missouri outlaw, but gradually becomes resentful of the bandit leader.",
    "2007_181": "In southern France, a Franco-Arabic shipyard worker along with his partner's daughter pursues his dream of opening a restaurant.",
    "2007_182": "An examination of the Soviet slaughter of thousands of Polish officers and citizens in the Katyn forest in 1940.",
    "2007_183": "In 1997 Rio de Janeiro, Captain Nascimento has to find a substitute for his position while trying to take down drug dealers and criminals before the Pope visits.",
    "2007_184": "A band comprised of members of the Egyptian police force head to Israel to play at the inaugural ceremony of an Arab arts center, only to find themselves lost in the wrong town.",
    "2007_185": "Self-proclaimed stuntman Rod Kimble is preparing for the jump of his life - to clear fifteen buses to raise money for his abusive stepfather Frank's life-saving heart operation.",
    "2007_186": "A romantic comedy centered on the daily lives of five Lebanese women living in Beirut.",
    "2007_187": "Three bachelors who are compulsive womanizers find their lives turned upside down when a baby is left at their doorstep. The trio suspect each other of being the father.",
    "2007_188": "A modern retelling of Snow White set against students in their freshman year of college in the greek system.",
    "2007_189": "A comedy that spoofs inspirational sports movies, this movie is about an out-of-luck coach who drives a rag-tag bunch of college misfits towards the football championship.",
    "2007_19": "An outcast New York City cop is charged with bringing down Harlem drug lord Frank Lucas, whose real life inspired this partly biographical film.",
    "2007_190": "A married man who daydreams about being with other women finds his will and morals tested after he's visited by the ex-mistress of his old friend.",
    "2007_191": "A man named Farmer sets out to rescue his kidnapped wife and avenge the death of his son, two acts committed by the Krugs, a race of animal-warriors who are controlled by the evil Gallian.",
    "2007_192": "Two brothers come of age in a small Italian town in the '60s and '70s.",
    "2007_193": "Six couples in love must face different problems caused by love itself. Do they resolve their issues and face life anew, or do they succumb under pressure ?",
    "2007_194": "A chef with a mysterious past spends the day with a waitress who needs a friend.",
    "2007_195": "A crazy love story full of lies, deceits and a complicated quadrangle where each one has to think quickly and dance around each other's emotions.",
    "2007_196": "Ruminations on the life of Bob Dylan, where six characters embody a different aspect of the musician's life and work.",
    "2007_197": "A guy proposes to his girlfriend, who drops dead. His BFF tries to get him to date other women but he only talks about his dead big love. At a diner he proposes to a cute waitress just to get his BFF off his back. She says yes.",
    "2007_198": "A delusional young man strikes up an unconventional relationship with a doll he finds on the Internet.",
    "2007_199": "A look at Genghis Khan's life, from his birth to conquests in Asia.",
    "2007_2": "With their warning about Lord Voldemort's return scoffed at, Harry and Dumbledore are targeted by the Wizard authorities as an authoritarian bureaucrat slowly seizes power at Hogwarts.",
    "2007_20": "After an attempted assassination on Ambassador Han, Lee and Carter head to Paris to protect a French woman with knowledge of the Triads' secret leaders.",
    "2007_200": "A NASA astronaut, forced to retire years earlier so he could save his family farm, has never given up his dream of space travel and looks to build his own rocket, despite the government's threats to stop him.",
    "2007_201": "Four lazy slacker conmen buddies who are jobless, homeless and broke learn about the secret of a hidden treasure from a dying thief and later embark on a race against time to find the mobster's buried treasure and claim it while being ...See moreFour lazy slacker conmen buddies who are jobless, homeless and broke learn about the secret of a hidden treasure from a dying thief and later embark on a race against time to find the mobster's buried treasure and claim it while being pursued by a determined police inspector who is hellbent to get the treasure all by himself.See less",
    "2007_202": "A man and a woman awaken to find themselves trapped in a cellar. As their kidnapper drives them mad, the truth about their horrific abduction is revealed.",
    "2007_203": "A God-fearing bluesman takes to a wild young woman who, as a victim of childhood sexual abuse, looks everywhere for love, never quite finding it.",
    "2007_204": "Imprisoned for debt, playwright Molière is rescued by an aristocrat who needs his help in order to seduce a young marquise.",
    "2007_205": "A sister and brother face the realities of familial responsibility as they begin to care for their ailing father.",
    "2007_206": "Maggie, a 60-year-old widow, desperately needs some money to pay for a medical treatment for her ill grandson, Olly. After one attempt at trying to find a job, she finds herself roaming the streets of London Soho. Her eye is caught by a ...See moreMaggie, a 60-year-old widow, desperately needs some money to pay for a medical treatment for her ill grandson, Olly. After one attempt at trying to find a job, she finds herself roaming the streets of London Soho. Her eye is caught by a small poster in the window of a shop called \"Sexy World\" which reads: \"Hostess wanted\". Too desperate and lost to realize what she does she enters. Micky, the owner, is embarrassed at first, but intrigued by Maggie, he decides to have fun and offers her the job. Her colleague, Luisa, shows her how to give a hand-job through hole in a wall (glory hole) and after the first hesitation, she quickly develops good skills. She uses Irina Palm as her stage name. However, she keeps her work secret from friends and family, which leads to uncomfortable situations. She, who applies herself in order to keep her job, fascinates Mickey.See less",
    "2007_207": "An amnesiac wakes up in a hotel room next to a dead FBI agent and $250,000. Is the sexy lady in the lobby his wife? Is he a spy or a cleaner?",
    "2007_208": "A woman assists her friend in arranging an illegal abortion in 1980s Romania.",
    "2007_209": "A young woman who was missing reappears, but she claims to be someone else entirely.",
    "2007_21": "A group of suburban biker wannabes looking for adventure hit the open road, but get more than they bargained for when they encounter a New Mexico gang called the Del Fuegos.",
    "2007_210": "A mother falls for a younger man while her daughter falls in love for the first time. Mother Nature messes with their fates.",
    "2007_211": "A small town girl lands in big bad Mumbai to earn an honest living but faces a confrontation she would've never dreamt of in her wildest dreams.",
    "2007_212": "A science-fiction writer, recently widowed, considers whether to adopt a hyper-imaginative 6-year-old abandoned and socially rejected boy who says he's really from Mars.",
    "2007_213": "An account of the gangster Mahindra Dolas and his gang, which terrorized Mumbai City, and a massive war between Mumbai Police and gangs during 16 November 1991.",
    "2007_214": "A man coping with the institutionalization of his wife because of Alzheimer's disease faces an epiphany when she transfers her affections to another man, Aubrey, a wheelchair-bound mute who also is a patient at the nursing home.",
    "2007_215": "An egotistical 64-year-old chef and confirmed bachelor falls for a woman 30 years his junior.",
    "2007_216": "Three bumbling Army reservists bound for Iraq are accidentally dropped at Mexican village besieged by hostile forces.",
    "2007_217": "As the kingdom of Devigarh comes apart at the seams, an aging bodyguard attempts to protect the Royal Family, as well as keep its darkest secrets from ever coming to light.",
    "2007_218": "Jack Conrad is awaiting the death penalty in a corrupt Central American prison. He is \"purchased\" by a wealthy television producer and taken to a desolate island where he must fight to the death against nine other condemned killers from ...See moreJack Conrad is awaiting the death penalty in a corrupt Central American prison. He is \"purchased\" by a wealthy television producer and taken to a desolate island where he must fight to the death against nine other condemned killers from all corners of the world, with freedom going to the sole survivor.See less",
    "2007_219": "A recent widow invites her husband's troubled best friend to live with her and her two children. As he gradually turns his life around, he helps the family cope and confront their loss.",
    "2007_22": "Faced with an unplanned pregnancy, an offbeat young woman makes an unusual decision regarding her unborn child.",
    "2007_220": "A black comedy centered around a TV weather girl and the two very different men who pursue her.",
    "2007_221": "A hotshot poker player tries to win a tournament in Vegas, but is fighting a losing battle with his personal problems.",
    "2007_222": "A journalist investigates a series of murders near American-owned factories on the border of Juarez and El Paso.",
    "2007_223": "A gorgeous young automobile fanatic--and front to the hottest unsigned band on the West coast--finds herself caught up in illegal drag-racing competitions organized by exotic car fanatics.",
    "2007_224": "A young boy becomes friends with a gang of skinheads. Friends soon become like family, and relationships will be pushed to the very limit.",
    "2007_225": "A profile of Ian Curtis, the enigmatic singer of Joy Division whose personal, professional, and romantic troubles led him to commit suicide at the age of 23.",
    "2007_226": "An unhinged war veteran holes up with a lonely woman in a spooky Oklahoma motel room. The line between reality and delusion is blurred as they discover a bug infestation.",
    "2007_227": "A cop investigates whether the man convicted of murdering his daughter is really guilty.",
    "2007_228": "The story of a married silkworm merchant-turned-smuggler in 19th century France traveling to Japan for his town's supply of silkworms after a disease wipes out their African supply. During his stay in Japan, he becomes obsessed with the ...See moreThe story of a married silkworm merchant-turned-smuggler in 19th century France traveling to Japan for his town's supply of silkworms after a disease wipes out their African supply. During his stay in Japan, he becomes obsessed with the concubine of a local baron.See less",
    "2007_229": "The life story of Hector Lavoe who started the salsa movement in 1975 and brought it to the United States.",
    "2007_23": "Mr. Bean wins a trip to Cannes where he unwittingly separates a young boy from his father and must help the two reunite. On the way he discovers France, bicycling, and true love.",
    "2007_230": "When Newcastle United soccer star Santiago Muñez (Kuno Becker) is offered a spot with Real Madrid, he accepts, but the move - accompanied by big money and fame - tests his ties and loyalties to family, friends, and business acquaintances.",
    "2007_231": "A businesswoman is pursued by a psychopath after being locked in a parking garage on Christmas Eve.",
    "2007_232": "A young journalist, a seasoned cameraman and a discredited war correspondent embark on an unauthorized mission to find the No.1 war criminal in Bosnia. However, their extremely dangerous target decides to come after them.",
    "2007_233": "Twelve jurors must decide the fate of a Chechen adolescent charged with murdering his stepfather.",
    "2007_234": "Three unique diamonds. Two teams of thieves. One big heist that spins out into a battle for the ultimate eternal prize: Cash.",
    "2007_235": "Jaidev and Kavita Bhasin live a middle-classed lifestyle in Southall, England, along with their son, Sunny. During the mid-80s Jaidev was a huge fan of the all-Asian Southall Football Club, and their team was very successful so much so ...See moreJaidev and Kavita Bhasin live a middle-classed lifestyle in Southall, England, along with their son, Sunny. During the mid-80s Jaidev was a huge fan of the all-Asian Southall Football Club, and their team was very successful so much so that it generated hatred from opposing mainstream Caucasian teams, who attacked Jaidev and the team's star player, Tony Singh. This spelled the end of the team, and the ground was then rented out for weddings and birthday parties. Jaidev wanted Sunny to play for Southall, but Sunny believed himself to be British and joined the Aston Football Club. When the time came for selection, Sunny, often referred to as 'Paki', was sidelined. Embittered, he joined the Southall Club, and he, and the Captain Shaan Ali Khan, as well as Coach Tony Singh, steered the team to many victories including a place in the semi-finals. Just before Southall team was to play against Gatwick, they get the news that Sunny has flip-flopped again - this time he has switched to another more prestigious Club in exchange for a fancy sports car, a 4 bedroom mansion, a handsome signing amount, and an equally generous weekly allowance - leaving Southall to turn it's ground over to the Chair of the City Council who wants to demolish it, and build a shopping mall and theme park in it's place.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2007_236": "A U.S. fighter pilot's epic struggle of survival after being shot down on a mission over Laos during the Vietnam War.",
    "2007_237": "Six Californians start a club to discuss the works of Jane Austen, only to find their relationships -- both old and new -- begin to resemble 21st century versions of her novels.",
    "2007_238": "This film is about a hyper-vigilant employee of the department of public safety who, while training his young female replacement, has to track down a missing girl who he is convinced is connected to a paroled sex offender he is investigating.",
    "2007_239": "The determined Jim Ellis starts a swim team for troubled teens at the Philadelphia Department of Recreation. Read more: Synopsis",
    "2007_24": "When motorcycle rider Johnny Blaze sells his soul to the Devil to save his father's life, he is transformed into the Ghost Rider, the Devil's own bounty hunter, and is sent to hunt down sinners.",
    "2007_240": "In a retelling of the Arabasta Episodes. The Straw Hat Pirates are helping Vivi save her kingdom from being destroyed by a set up war. Which all began when the first drought occurred 3 years ago. All thanks to the secret organization call ...See moreIn a retelling of the Arabasta Episodes. The Straw Hat Pirates are helping Vivi save her kingdom from being destroyed by a set up war. Which all began when the first drought occurred 3 years ago. All thanks to the secret organization call Baroque Works. Lead by Mr. 0 who's identity was unknown until Vivi revealed it to the StrawHat Pirates. And they all agreed to eliminate this criminal group in order to restore peace to the desert kingdom. But it's going to be a rough battle against Mr. 0, the Officer Agents, Millions Agents, and Billions Agents.  Written by J LeGaultSee less",
    "2007_241": "A well-off and sophisticated couple struggles to stay together after the husband loses his job.",
    "2007_242": "Two former thieves reunite to rob the biggest thief they know -- Moctesuma Valdez, a TV infomercial guru who's made millions selling worthless health products to poor Latino immigrants. When none of their affiliates want to go undercover ...See moreTwo former thieves reunite to rob the biggest thief they know -- Moctesuma Valdez, a TV infomercial guru who's made millions selling worthless health products to poor Latino immigrants. When none of their affiliates want to go undercover as day laborers to pull off the heist, the two men turn to the real thing for help.See less",
    "2007_243": "In 1960s London, an elderly janitor convinces a glass-ceiling constrained executive to help him steal a handful of diamonds from their employer, the London Diamond Corporation.",
    "2007_244": "Dia's dance teacher is dying. She returns to the town where she learnt to live and dance and most importantly to save the endangered Ajanta theatre.",
    "2007_245": "As the Americans run Japan they also reserve the right to fly aeroplanes with nuclear weapons on board over the skies of the country. The Japanese mountains are often referred to as the Alps and it is here that a secretive US military ...See moreAs the Americans run Japan they also reserve the right to fly aeroplanes with nuclear weapons on board over the skies of the country. The Japanese mountains are often referred to as the Alps and it is here that a secretive US military aircraft with weapons of mass destruction crashes. The race is on for a group of journalists to climb the mountains and reach it. Yet, they are not the only ones aiming at securing the site for their own purposes.  Written by aghaemiSee less",
    "2007_246": "A young man from the South Bronx dreams of making it as a rapper, until a run-in with local thugs forces him to hide in Puerto Rico with the father he never knew.",
    "2007_247": "Goodbye Bafana is the true story of a white South African racist whose life was profoundly altered by the black prisoner he guarded for twenty years. The prisoner's name was Nelson Mandela.",
    "2007_248": "Six different stories, about nine people, each with different issues and problems, all occurring within one place: the METRO.",
    "2007_249": "A teenage werewolf is torn between honoring her family's secret and her love for a man.",
    "2007_25": "For fun-loving party animal Ben Stone, the last thing he ever expected was for his one-night stand to show up on his doorstep eight weeks later to tell him she's pregnant with his child.",
    "2007_250": "A hot-headed inspector takes on a small but powerful Vietnamese-Chinese gang, after a series of crimes and murder attempts committed and putting an undercover cop and his girlfriend in great danger.",
    "2007_251": "A young girl turns to a department store Santa in the hopes that he will help find a new husband for her divorced mother.",
    "2007_252": "A meditation on love and its various incarnations, set within a community of friends in Oregon. and is described as an exploration of the magical, mysterious and sometimes painful incarnations of love.",
    "2007_253": "When a rap mogul from Atlanta tries to join a conservative country club in the Carolinas he runs into fierce opposition from the board President- but it's nothing that he and his entourage can't handle. Read more: Synopsis",
    "2007_254": "A father and his son attempt to bring in an assassin to the authorities, but his dangerous associates have other plans.",
    "2007_255": "An action epic that explores the origins of Master Shake, Frylock, and Meatwad, better known as the Aqua Teen Hunger Force, who somehow become pitted in a battle over an immortal piece of exercise equipment.",
    "2007_256": "Chris is a once promising high school athlete whose life is turned upside down following a tragic accident. As he tries to maintain a normal life, he takes a job as a janitor at a bank, where he ultimately finds himself caught up in a planned heist.",
    "2007_257": "Sinister things begin happening to kidnappers who are holding a young boy for ransom in a remote cabin.",
    "2007_258": "A slacker is forced to work for his father-in-law after his pregnant wife steps away from her high-paying job.",
    "2007_259": "Antoine moves home to help his mom drive the mobile grocery, when his dad's hospitalized. He brings Claire along, hoping she'll become more than a friend. He drives around Provence's countryside, selling mainly to old people.",
    "2007_26": "Pleasantly plump teenager Tracy Turnblad teaches 1962 Baltimore a thing or two about integration after landing a spot on a local TV dance show.",
    "2007_260": "A group of friends are stalked and murdered whilst looking for psilocybin mushrooms in the Irish woods.",
    "2007_261": "An experiment in genetic engineering turns harmless sheep into bloodthirsty killers that terrorize a sprawling New Zealand farm.",
    "2007_262": "On his sprawling country estate, an aging writer matches wits with the struggling actor who has stolen his wife's heart.",
    "2007_263": "A popular novelist researches unlikely sources to find characters for her next bestseller.",
    "2007_264": "The story of Washington D.C. radio personality Ralph \"Petey\" Greene, an ex-con who became a popular talk show host and community activist in the 1960s.",
    "2007_265": "A young breakdancer hits his head during a talent show and slips into a coma for twenty years. Waking up in 2006, he looks to revive his and his team's career with the help of his girlfriend and his parents. Read more: Synopsis",
    "2007_266": "An American journalist on assignment in the Australian outback encounters a man-eating crocodile while trapped on a rapidly flooding mud island.",
    "2007_267": "A teenage skateboarder's life begins to fray after he is involved in the accidental death of a security guard.",
    "2007_268": "A man who serves in the war between the forces of Light and Dark comes into possession of a device that can restore life to Moscow, which was nearly destroyed by an apocalyptic event.",
    "2007_269": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.",
    "2007_27": "The warrior Beowulf must fight and defeat the monster Grendel, who is terrorizing Denmark, and later, Grendel's Mother, who begins killing out of revenge.",
    "2007_270": "An adopted woman returns to her home country and the family home that she never knew and must face the mystery that lies there.",
    "2007_271": "A teenager faces an uphill battle when she fights to give women the opportunity to play competitive soccer.",
    "2007_272": "A young Bangladeshi woman, Nazneen, arrives in 1980s London, leaving behind her beloved sister and home, for an arranged marriage and a new life. Trapped within the four walls of her flat in East London, and in a loveless marriage with the...See moreA young Bangladeshi woman, Nazneen, arrives in 1980s London, leaving behind her beloved sister and home, for an arranged marriage and a new life. Trapped within the four walls of her flat in East London, and in a loveless marriage with the middle aged Chanu, she fears her soul is quietly dying. Her sister Hasina, meanwhile, through letters to Nazneen, tells of her carefree life back in Bangladesh, stumbling from one adventure to the next. Nazneen struggles to accept her lifestyle, and keeps her head down in spite of life's blows, but she soon discovers that life cannot be avoided - and is forced to confront it the day that the hotheaded young Karim comes knocking at her door.  Written by Sony Pictures ClassicsSee less",
    "2007_273": "Max leads a good life with Alice and their son Theo; that is until Alice is threatened with death while waiting for a heart transplant. Max promises Theo that he will save Alice, but to keep his word he must find a heart, and fast. Since ...See moreMax leads a good life with Alice and their son Theo; that is until Alice is threatened with death while waiting for a heart transplant. Max promises Theo that he will save Alice, but to keep his word he must find a heart, and fast. Since time is running out and he must find a solution, Max decides to reconnect with his troubled past. His decision will change his life in ways he could never have imagined.  Written by Benoit GuichardSee less",
    "2007_274": "While drying out on the West Coast, an alcoholic hitman befriends a tart-tongued woman who might just come in handy when it's time for him to return to Buffalo and settle some old scores.",
    "2007_275": "An anthology of ten short films dealing with diverse subjects such as infidelity, companionship, lust and a spectrum of human emotions.",
    "2007_276": "A deceased billionaire leaves his spoiled adult grandson a series of odd tasks to perform in order to receive \"the ultimate gift,\" with the resentful grandson having no idea what that might be.",
    "2007_277": "Jean-Marc Leblanc (Labrèche), a desperate civil servant, escapes reality as we all know it, to imagine himself as the hero in imaginary adventures.",
    "2007_278": "A 12 year old boy and his mother become the targets of two warring werewolf packs, each with different intentions and motives.",
    "2007_279": "A chance encounter with a stranger changes the life of a college gymnast.",
    "2007_28": "Two straight, single Brooklyn firefighters pretend to be a gay couple in order to receive domestic partner benefits.",
    "2007_280": "Up-and-coming sports reporter rescues a homeless man (\"Champ\") only to discover that he is, in fact, a boxing legend believed to have passed away. What begins as an opportunity to resurrect Champ's story and escape the shadow of his ...See moreUp-and-coming sports reporter rescues a homeless man (\"Champ\") only to discover that he is, in fact, a boxing legend believed to have passed away. What begins as an opportunity to resurrect Champ's story and escape the shadow of his father's success becomes a personal journey as the ambitious reporter reexamines his own life and his relationship with his family.See less",
    "2007_281": "Part three of the \"Three Mothers\" trilogy which takes place in Rome and has to do with Mater Lachrymarum (The Third Mother).",
    "2007_282": "When the thugs who killed his father come looking for him, a young Latino man and his mother flee from their home.",
    "2007_283": "It's the true story of a Punjabi woman named Kiranjit Ahluwalia who leaves India to marry a London-based guy, only to be badly abused. She ends up in prison for murdering her abusive husband.",
    "2007_284": "Paris, 1984: A group of friends contend with the first outbreak of the AIDS epidemic.",
    "2007_285": "Ismael and Julie enter a playful yet emotionally laced threesome with Alice. When tragedy strikes, these young Parisians are forced to deal with the fragility of life and love.",
    "2007_286": "When Gabriel and Emilie meet by chance, he offers her a ride, and they spend the evening talking, laughing and getting along famously. At the end of the night, Emilie declines Gabriel's offer of \"a kiss without consequences\". Emilie ...See moreWhen Gabriel and Emilie meet by chance, he offers her a ride, and they spend the evening talking, laughing and getting along famously. At the end of the night, Emilie declines Gabriel's offer of \"a kiss without consequences\". Emilie admonishes him that the kiss could have unexpected consequences, and tells him a story, unfolding in flashbacks, about the impossibility of indulging your desires without affecting someone else's life.  Written by Music Box FilmsSee less",
    "2007_287": "Margot and her son Claude decide to visit her sister Pauline after she announces that she is marrying less-than-impressive Malcolm. In short order, the storm the sisters create leaves behind a mess of thrashed relationships and exposed family secrets.",
    "2007_288": "A reporter wakes up in a morgue and finds herself a member of the undead, before vowing revenge against the sect which put her there.",
    "2007_289": "As he navigates through porn sites without the knowledge of his wife, Germain comes across a video of his only daughter announcing her impending live performance. The political advisor of Quebec, who previously believed their loved ...See moreAs he navigates through porn sites without the knowledge of his wife, Germain comes across a video of his only daughter announcing her impending live performance. The political advisor of Quebec, who previously believed their loved Nathalie immersed in law school in Montreal, went illico in the city to prevent the irreparable. But the girl is not found, and Germain does for her investigation only vague clues found in the site, as well as secrets torn from the junkie girlfriend of his daughter, which puts him on the trail of a boyfriend. The latter, at the head of a cyber-XXX empire, was quick to break into the identity of Germain, and prevent Nathalie, who, shortly after a tragic incident, agrees to go home with his father. A few days later, a police detective arrives for questioning ...  Written by Oliver L. MartelSee less",
    "2007_29": "M.I.T. professor John Koestler links a mysterious list of numbers from a time capsule to past and future disasters and sets out to prevent the ultimate catastrophe.",
    "2007_290": "The story of a son's conflicting memories of his dying father.",
    "2007_291": "As an alternative to getting bullied at school, an autistic teenager retreats into the world of online role-playing games.",
    "2007_292": "The story of an intersexual fifteen-year-old. She lives with her parents, who have to cope with the challenges of her medical condition.",
    "2007_293": "A nameless gunfighter arrives in a town ripped apart by rival gangs and, though courted by both to join, chooses his own path.",
    "2007_294": "A man, who has been married for 27 years, falls in love with his 18-year-old daughter's friend.",
    "2007_295": "A love story wrapped in a mystery. Set in World War II Europe, a professor is changed by a cataclysmic event and explores the mysteries of life.",
    "2007_296": "A drama based on an ancient Chinese proverb that breaks life down into four emotional cornerstones: happiness, pleasure, sorrow and love. A businessman bets his life on a horse race; a gangster sees the future; a pop star falls prey to a ...See moreA drama based on an ancient Chinese proverb that breaks life down into four emotional cornerstones: happiness, pleasure, sorrow and love. A businessman bets his life on a horse race; a gangster sees the future; a pop star falls prey to a crime boss; a doctor must save the love of his life.See less",
    "2007_297": "Best buddies Acerola and Laranjinha, about to turn 18, discover things about their missing fathers' pasts which will shatter their solid friendship, in the middle of a war between rival drug gangs from Rio's favelas.",
    "2007_298": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2007_299": "Set in Inner Mongolia, a physical setback causes a young woman to choose a suitor who can take care of her, as well as her disabled husband.",
    "2007_3": "A strange black entity from another world bonds with Peter Parker and causes inner turmoil as he contends with new villains, temptations, and revenge.",
    "2007_30": "Two terminally ill men escape from a cancer ward and head off on a road trip with a wish list of to-dos before they die.",
    "2007_300": "Life in the suburbs as a father of two has worn down Jonas. When a victim of a car crash mistakes him for her boyfriend Sebastian, things take a very dramatic turn as the line between truth and deception is erased.",
    "2007_301": "A young beautiful but stressed out children's writer seeks out a holiday in the country but becomes the lead character in a supernatural mystery she must solve to save her life",
    "2007_302": "After a painful breakup, Ben develops insomnia. To kill time, he starts working the late night shift at the local supermarket, where his artistic imagination runs wild.",
    "2007_303": "It tells the story of Romulus, his beautiful wife, Christina, and their struggle in the face of great adversity to bring up their son, Raimond. It is a story of impossible love that ultimately celebrates the unbreakable bond between father and son.",
    "2007_304": "A blade runner must pursue and terminate four replicants who stole a ship in space, and have returned to Earth to find their creator.",
    "2007_305": "The crew members of NASA's Apollo missions tell their story in their own words.",
    "2007_306": "A rookie cop teams up with a former detective with a supernatural gift to hunt down a serial killer.",
    "2007_307": "Hallam's talent for spying on people reveals his darkest fears-and his most peculiar desires. Driven to expose the true cause of his mother's death, he instead finds himself searching the rooftops of the city for love.",
    "2007_308": "The shy son of an aging comedienne tries to find a balance between his demanding home life, his new girlfriend, and his mother's second chance at fame.",
    "2007_309": "The account of troubled relationship between Mahatma Gandhi and his eldest son.",
    "2007_31": "God contacts Congressman Evan Baxter and tells him to build an ark in preparation for a great flood.",
    "2007_310": "A family suffers from a major communication breakdown during their struggle to get through their hardships.",
    "2007_311": "Since college (art), Nora hasn't had luck with men. Now in her 30s, she works in a NYC hotel going nowhere. But then she meets a Frenchman.",
    "2007_312": "Despite of cricket fever, there are two people in India who dislike it's influence over their lives. The first is Dr. Satyajit Chavan, who will not permit anyone in his home nor the hospital to view nor hear anything related to it; and the...See moreDespite of cricket fever, there are two people in India who dislike it's influence over their lives. The first is Dr. Satyajit Chavan, who will not permit anyone in his home nor the hospital to view nor hear anything related to it; and the second is Kashmira, who is recently married to Sarabjeet Singh, and hates cricket as her husband is obsessed with it and has even neglected to be attentive leave alone take her for a honeymoon. Then there is Hemandra Patel, located in England for over 10 years, works as an airport Janitor, but has told everyone he is a Customs Officer, is awaiting word on his becoming a Citizen, but his fate rests with Immigration Officer, Cook, who hates all Patels, including Sardar Vallabhai Patel. Watch how the world cup influences them, and the shock that awaits Hemandra when he finds that his daughter is secretly seeing an English-African male by the name of Silver.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2007_313": "Daredevil mountain climbers on their attempt to break yet another speed climbing record.",
    "2007_314": "Two narratives -- the life cycle of a mother walrus and her calf, and the life of a polar bear and her cubs -- are used to illustrate the harsh realities of existence in the Arctic. Read more: Synopsis",
    "2007_315": "You, the Living is a film about humankind, its greatness and its baseness, joy and sorrow, its self-confidence and anxiety, its desire to love and be loved.",
    "2007_316": "Secrets, rumors and betrayals surround the upcoming marriage between a young dissolute man and virtuous woman of the French aristocracy.",
    "2007_317": "A district attorney is involved in a 24-hour showdown with a gang leader and is, at the same time, being manipulated by an attractive assistant district attorney and a cryptic stranger.",
    "2007_318": "The lives of two families change forever after a fatal tragedy takes place on Reservation Road.",
    "2007_319": "A drama focused on a life-changing moment in 67-year-old train engineer Odd Horten's existence: the evening of his retirement.",
    "2007_32": "Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.",
    "2007_320": "At South Beach University, a beautiful sorority president takes in a group of unconventional freshman girls seeking acceptance into her house.",
    "2007_321": "An investigation of sharks' importance to ecosystems and humankind's mass destruction of shark species worldwide.",
    "2007_322": "In 1969, two substance-abusing, unemployed actors retreat to the countryside for a holiday that proves disastrous.",
    "2007_323": "A film about the investigations following the 1993 serial Bombay bomb blasts, told through the different stories of the people involved --police, conspirators, victims, middlemen.",
    "2007_324": "A secretary's life changes in unexpected ways after her dog dies.",
    "2007_325": "A film about the cultural evolution of the Sydney beach side suburb of Maroubra and the social struggle faced by its youth - the notorious surf gang known as the Bra Boys.",
    "2007_326": "Through readings of historical account by actors and the testimony of survivors, the events of the Nanjing Massacre are recounted.",
    "2007_327": "A young professional woman (Simpson) unwittingly becomes the pawn of two business executives in their bid to oust the head of a mega-conglomerate. Read more: Synopsis",
    "2007_328": "Adriana, 13, is kidnapped in Mexico City by Russian sex traffickers. Her criminal 17 y.o. brother starts looking for her. Across the border in Texas, he gets help from a cop.",
    "2007_329": "After falling out with his editor, a fading political journalist is forced to interview America's most popular soap actress.",
    "2007_33": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.",
    "2007_330": "A comprehensive look at the Bush Administration's conduct of the Iraq war and its occupation of the country.",
    "2007_331": "A dramatization of the shocking Barbara Daly Baekeland murder case, which happened in a posh London flat on Friday 17 November 1972. The bloody crime caused a stir on both sides of the Atlantic and remains one of the most memorable American Tragedies...",
    "2007_332": "Innocent lives hang on the whim of an elusive psychopathic murderer whose strange riddles and impossible timelines force three people into a mission to end the game before one or all of them die. Read more: Synopsis",
    "2007_333": "GRIFFIN AND PHOENIX is a poignantly funny love story about two people who face a seemingly insurmountable obstacle that may stand between them and a last chance at love.",
    "2007_334": "A look at modern-day life in China's capital centered on a menage-a-quatre involving a young woman, her boss, her husband and her boss's wife.",
    "2007_335": "A little boy and his baby-sitter inhabit the same imaginary world: through their adventures they are followed by a strange red balloon.",
    "2007_336": "The true story of suburban housewife Gertrude Baniszewski, who kept a teenage girl locked in the basement of her Indiana home during the 1960s.",
    "2007_337": "The tale of two socially-awkward misfits and the strange ways they try to find love: through revenge on high-school bullies, burgers, and video games.",
    "2007_338": "A rich industrialist pops it just before the IPO of his company - the family must now conceal his death till all the shares are sold.",
    "2007_339": "The true story of Graeme Obree, the Champion cyclist who built his bicycle from old bits of washing machines who won his championship only to have his title stripped from him and his mental health problems which he has suffered since.",
    "2007_34": "Lewis is a brilliant inventor who meets mysterious stranger named Wilbur Robinson, whisking Lewis away in a time machine and together they team up to track down Bowler Hat Guy in a showdown that ends with an unexpected twist of fate.",
    "2007_340": "A guy's life is turned around by an email, which includes the names of everyone he's had sex with and ever will have sex with. His situation gets worse when he encounters a femme fatale (Ryder) who targets men guilty of sex crime.",
    "2007_341": "At the end of the Civil War, a colonel hunts down a man with whom he has a grudge.",
    "2007_342": "As the front man of the Clash from 1977, Joe Strummer changed people's lives forever. Four years after his death, his influence reaches out around the world, more strongly now than ever before.",
    "2007_343": "In an unnamed Latin American country that closely resembles Mexico, the government fights a rural insurgency with torture, assault, rape, and murder. Soldiers descend on a town, cutting off the rebels from their cache of ammunition hidden ...See moreIn an unnamed Latin American country that closely resembles Mexico, the government fights a rural insurgency with torture, assault, rape, and murder. Soldiers descend on a town, cutting off the rebels from their cache of ammunition hidden in a field. A family of grandfather, son, and grandson are among the rebels in the hills. The grandfather, with his violin over his shoulder, tries to pass the checkpoint, ostensibly to tend his corn crop. The commanding officer lets him pass but insists on a daily music lesson. Can the old man ferry out the ammunition in his violin case under the soldiers' nose?  Written by See less",
    "2007_344": "One summer, four orphans boys who have grown to be the closest of friends find themselves competing for the attention of the same family.",
    "2007_345": "Japan, 2077: A female agent named Vexille is dispatched to Tokyo to investigate whether Japanese are developing robotic technology, which has been banned by the U.N. due to its potential threat to humankind. Read more: Synopsis",
    "2007_346": "Kent Stock disrupts his life to become coach of the Norway High School baseball team and try to lead them to victory.",
    "2007_347": "Documentary on the 2006 Mexican presidential elections.",
    "2007_348": "A documentary on Jacques Vergès, the controversial lawyer and former Free French Forces guerrilla who has defending unpopular figures such as Nazi war criminal Klaus Barbie and Holocaust denier Roger Garaudy.",
    "2007_349": "Upon hearing his wife was killed in the Iraq war, a father takes his two daughters on a road trip.",
    "2007_35": "A mild-mannered guy, who is married to a monstrous woman, meets the woman of his dreams, and schemes to find a way to be with her.",
    "2007_350": "A love story set during a tense encounter between a wagon train of settlers and a renegade Mormon group.",
    "2007_351": "In this animated adaptation of the Bible story Moses hears the voice of God from a burning bush, which inspires him to confront Egypt's pharaoh and demand freedom for the Israelite slaves. The pharaoh agrees after a series of horrific ...See moreIn this animated adaptation of the Bible story Moses hears the voice of God from a burning bush, which inspires him to confront Egypt's pharaoh and demand freedom for the Israelite slaves. The pharaoh agrees after a series of horrific plagues, and Moses leads the Israelites through the parted Red Sea into the harsh freedom of the desert. There he ascends Mount Sinai and returns with the Ten Commandments.  Written by AnonymousSee less",
    "2007_352": "An unstable dad who after getting out of a mental institution tries to convince his daughter that there's Spanish gold buried somewhere under suburbia.",
    "2007_353": "A pair of well-meaning, but socially inept brothers try to find their perfect mates in order to provide their dying father with a grandchild.",
    "2007_354": "The movie follows a group of young friends in the city of Tel Aviv and is as much a love song to the city as it is an exploration of the claim that people in Tel Aviv are isolated from the rest of the country and the turmoil it's going ...See moreThe movie follows a group of young friends in the city of Tel Aviv and is as much a love song to the city as it is an exploration of the claim that people in Tel Aviv are isolated from the rest of the country and the turmoil it's going through. The movie looks at young people's lives in Tel Aviv through the POVs of gays and straights, Jews and Arabs, men and women. It all begins when Noam, a young Israeli soldier, serves in the reserve forces and meets at a check point a Palestinian young man called Ashraf. Following an incident during which Noam misplaces his ID card at the check point, Ashraf shows up on the doorstep of the apartment that Noam shares with a gay man and a straight woman. How will the meeting affect all of their lives?  Written by A.M.See less",
    "2007_355": "Geneviève Saint-Louis, a bachelor and neurotic careerist, refuses any form of engagement. Her aunt Aline, a former cabaret singer, arrives at her home with the ulterior aim of avoiding placement in a reception center.",
    "2007_356": "The vampire myth is given a stylish 1960s treatment, where a human cop partners with a vampire cop to stop a vamp bent on creating a war between the two \"separate but equal\" races.",
    "2007_357": "Yella is estranged from her possessive and violent husband; but he can't quite bring himself to give her up. When their fraught interaction finally comes to dramatic conclusion, Yella's life takes an odd shift.",
    "2007_358": "A look at the state of the global environment including visionary and practical solutions for restoring the planet's ecosystems. Read more: Synopsis",
    "2007_359": "In Majorca, in 1823, a French general, Armand de Montriveau, overhears a cloistered nun singing in a chapel; he insists on speaking to her. She is Antoinette, for five years he has searched for her. Flash back to their meeting in Paris, he...See moreIn Majorca, in 1823, a French general, Armand de Montriveau, overhears a cloistered nun singing in a chapel; he insists on speaking to her. She is Antoinette, for five years he has searched for her. Flash back to their meeting in Paris, he recently returned from Africa, she married and part of the highest society. She flirts with him, and soon he's captivated. His behavior is possessive, insistent. Then, it is her turn to become obsessed. Letters, balls, scandal, a kidnapping, and an ultimatum bring her to the cloister and him to melancholy. Whose steel proved sharper? Is it tragic or grotesque?  Written by See less",
    "2007_36": "A young widow discovers that her late husband has left her 10 messages intended to help ease her pain and start a new life.",
    "2007_360": "Akiz's movie focuses on the restless life of Uschi Obermaier, the icon of the 1968 movement in Germany and groupie. At the age of 16, Uschi is bored by her job in a photo lab, but soon becomes the \"it girl\" of Munich's club scene. When she...See moreAkiz's movie focuses on the restless life of Uschi Obermaier, the icon of the 1968 movement in Germany and groupie. At the age of 16, Uschi is bored by her job in a photo lab, but soon becomes the \"it girl\" of Munich's club scene. When she gets to know Rainer Langhans, they move to Berlin and live in \"Kommune 1\", the first politically-motivated commune in Germany. While the other occupants claim she isn't political enough, Uschi just wants to have fun, works as fashion model and leads international music stars in temptation...  Written by fippi2000See less",
    "2007_361": "When a machine that allows therapists to enter their patients' dreams is stolen, all Hell breaks loose. Only a young female therapist, Paprika, can stop it.",
    "2007_362": "They finish each other's sentences, dance like Fred and Ginger, and share the same downtown loft--the perfect couple? Not exactly. Gray and Sam, are a sister and brother so compatible and inseparable that people actually assume they are ...See moreThey finish each other's sentences, dance like Fred and Ginger, and share the same downtown loft--the perfect couple? Not exactly. Gray and Sam, are a sister and brother so compatible and inseparable that people actually assume they are dating. Mortified, they both agree they must branch out and start searching for love. He'll look for a guy for her and she'll look for a gal for him.See less",
    "2007_363": "Meduzot (the Hebrew word for Jellyfish) tells the story of three very different Israeli women living in Tel Aviv whose intersecting stories weave an unlikely portrait of modern Israeli life. Batya, a catering waitress, takes in a young ...See moreMeduzot (the Hebrew word for Jellyfish) tells the story of three very different Israeli women living in Tel Aviv whose intersecting stories weave an unlikely portrait of modern Israeli life. Batya, a catering waitress, takes in a young child apparently abandoned at a local beach. Batya is one of the servers at the wedding reception of Keren, a young bride who breaks her leg in trying to escape from a locked toilet stall, which ruins her chance at a romantic honeymoon in the Caribbean. One of the guests is Joy, a Philippine chore woman attending the event with her employer, and who doesn't speak any Hebrew (she communicates mainly in English), and who is guilt-ridden after having left her young son behind in the Philippines.  Written by AnonymousSee less",
    "2007_364": "An ambitious graduate student convinces a writer that her thesis can resurrect his career.",
    "2007_365": "An unknown creature terrorizes an archeological dig in the middle of a desolate New Mexico town.",
    "2007_366": "A 17-year-old girl has mysterious encounters with paranormal activity in the small town of Pine Valley.",
    "2007_367": "In a Mennonite community in Mexico, a father's faith is tested when he falls in love with a new woman.",
    "2007_368": "A quiet but disturbed young man puts the life of a woman he's obsessed with under a virtual microscope when he installs hidden cameras throughout her house.",
    "2007_369": "A blind young man (Pine) thinks he finds love with an Indian woman (Jay), though their relationship is fraught with cultural differences.",
    "2007_37": "The infamous story of Benjamin Barker, aka Sweeney Todd, who sets up a barber shop in London which is the basis for a sinister partnership with his fellow tenant, Mrs. Lovett.",
    "2007_370": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
    "2007_371": "Die-hard gamers compete to break world records on classic arcade games.",
    "2007_372": "Ten stories, each inspired by one of the ten commandments.",
    "2007_373": "The devastating reconstruction of the rape and murder of a 15-year-old Iraqi girl by American soldiers in Samarra in 2006.",
    "2007_374": "Looking for answers to life's big questions, a stuttering boy joins his high school debate team.",
    "2007_375": "A young British woman struggling with the direction of her life spends Christmas watching over a retirement home filled with demanding residents.",
    "2007_376": "The arrival of a newborn girl causes the gradual disintegration of the Cairn family; particularly for 9-year-old Joshua (Kogan), an eccentric boy whose proper upbringing and refined tastes both take a sinister turn.",
    "2007_377": "After his entire department is outsourced, an American novelty products salesman (Hamilton) heads to India to train his replacement.",
    "2007_378": "Three children and their father move from Los Angeles, California to Edmonton, Alberta. When they go shopping at West Edmonton Mall, they find counterfeit cash, inadvertently help catch crooks, and make a discovery about Santa.",
    "2007_379": "A psychologist discovers troubling links between Nazism and modern-day big business.",
    "2007_38": "A behind-the-scenes look at the annual Penguin World Surfing Championship, and its newest participant, up-and-comer Cody Maverick.",
    "2007_380": "A twenty-nine year-old slacker who lives with his mom realizes his sweet set-up is threatened when she hears wedding bells with her self-help guru beau.",
    "2007_381": "When an American woman begins a dangerous relationship with an attractive immigrant worker, in order to save her marriage, she finds her true self.",
    "2007_382": "A weekend of camping in the mountains becomes an excursion into hell for a young couple, who become pawns in a grotesque plot hatched by deranged locals.",
    "2007_383": "After Moishe's death, family and friends sit Shiva in Mexico City. During seven days, secrets will be disclosed.",
    "2007_384": "An offbeat drama focused on a homeless youth, a pop music siren and a member of the paparazzi.",
    "2007_385": "Thirteen years after the end of the Vietnam War, a family who was tragically affected by the war are forced to emigrate to America. Read more: Synopsis",
    "2007_386": "After meeting at a local pool over their summer break, a love triangle forms between three adolescent girls, which proves difficult to sustain as they each desire the love of another.",
    "2007_387": "A down-and-out writer, sells his soul to the Devil in exchange for fame and fortune.",
    "2007_388": "An escort who caters to Washington, D.C.'s society ladies becomes involved in a murder case.",
    "2007_389": "A drama steeped in Portugal's Fado music culture.",
    "2007_39": "An NFL quarterback living the bachelor lifestyle discovers that he has an 8-year-old daughter from a previous relationship.",
    "2007_390": "A Mexican boy smuggles himself to Brooklyn to meet his long-lost father - only to have his identity stolen upon arrival by an impostor who seeks to steal the fathers' fortune.",
    "2007_391": "A hastily married couple quickly devolve into a life of affairs, meddling parents, and therapy. Read more: Synopsis",
    "2007_392": "A divorced mother of two boys reaching adulthood decides to sell their house, find love and get on with her life away from her husband and sons; a decision that will lead to an escalating fraternal dispute.",
    "2007_393": "A beautiful woman, Sandra, seduces a wealthy businessman, Miles Rennburg. Little does he realise that she has been sent to kill him at the behest of her boyfriend/crime partner, Lester. Controlling all this is Sue, Lester's wife.",
    "2007_394": "1950. Rural Alabama. Cotton harvest. It's a make-or-break weekend for the Honeydripper Lounge and its owner, piano player Tyrone \"Pine Top\" Purvis. Deep in debt to the liquor man, the chicken man, and the landlord, Tyrone is desperate to ...See more1950. Rural Alabama. Cotton harvest. It's a make-or-break weekend for the Honeydripper Lounge and its owner, piano player Tyrone \"Pine Top\" Purvis. Deep in debt to the liquor man, the chicken man, and the landlord, Tyrone is desperate to lure the young cotton pickers and local Army base recruits into his juke joint, away from Touissant's, the rival joint across the way. His plan to hire a guitar legend go awry and Tyrone is forced to take drastic action in a final scheme to save the club.  Written by AnonymousSee less",
    "2007_395": "A former pop star who now writes commercial jingles for a living, experiences a mid-life crisis.",
    "2007_396": "A young kid is forced to live out the lies he told to become popular.",
    "2007_397": "How do you reconcile a commitment to non-violence when faced with violence? Why do the poor often seem happier than the rich? Must a society lose its traditions in order to move into the future? These are some of the questions posed to His...See moreHow do you reconcile a commitment to non-violence when faced with violence? Why do the poor often seem happier than the rich? Must a society lose its traditions in order to move into the future? These are some of the questions posed to His Holiness the Dalai Lama by filmmaker and explorer Rick Ray. Ray examines some of the fundamental questions of our time by weaving together observations from his own journeys throughout India and the Middle East, and the wisdom of an extraordinary spiritual leader. This is his story, as told and filmed by Rick Ray during a private visit to his monastery in Dharamsala, India over the course of several months. Also included is rare historical footage as well as footage supplied by individuals who at great personal risk, filmed with hidden cameras within Tibet. Part biography, part philosophy, part adventure and part politics, \"10 Questions for The Dalai Lama\" conveys more than history and more than answers - it opens a window into the heart of an inspiring man. If you had only one hour, what would you ask?  Written by monterey media/Rick Ray FilmsSee less",
    "2007_398": "A brief look into Romani culture and Rom (Gypsies) from around the globe as five famous Romani groups tour the USA. The film visits their families at home in Spain, India, Macedonia and Romania.",
    "2007_399": "An elderly woman takes a train trip to visit her grandson at his army camp inside Chechnya.",
    "2007_4": "Reluctantly designated as the heir to the land of Far, Far Away, Shrek hatches a plan to install the rebellious Artie as the new king while Princess Fiona tries to fend off a coup d'etat by the jilted Prince Charming.",
    "2007_40": "Survivors of the Raccoon City catastrophe travel across the Nevada desert, hoping to make it to Alaska. Alice joins the caravan and their fight against the evil Umbrella Corp.",
    "2007_400": "Brooklyn, 1985. With the mob world as a backdrop, three life-long friends struggle with questions of love, loss and loyalty.",
    "2007_401": "A film set in a strange afterlife way station that has been reserved for people who have committed suicide.",
    "2007_402": "Gambler Jake Green enters into a game with potentially deadly consequences.",
    "2007_403": "Most people don't think about singing when they think about revolutions. But song was the weapon of choice when, between 1986 and 1991, Estonians sought to free themselves from decades of Soviet occupation. During those years, hundreds of ...See moreMost people don't think about singing when they think about revolutions. But song was the weapon of choice when, between 1986 and 1991, Estonians sought to free themselves from decades of Soviet occupation. During those years, hundreds of thousands gathered in public to sing forbidden patriotic songs and to rally for independence. \"The young people, without any political party, and without any politicians, just came together ... not only tens of thousands but hundreds of thousands ... to gather and to sing and to give this nation a new spirit,\" remarks Mart Laar, a Singing Revolution leader featured in the film and the first post-Soviet Prime Minister of Estonia. \"This was the idea of the Singing Revolution.\" James Tusty and Maureen Castle Tusty's \"The Singing Revolution\" tells the moving story of how the Estonian people peacefully regained their freedom--and helped topple an empire along the way.  Written by Maureen TustySee less",
    "2007_404": "Space radiation turns the dead into Zombies. Zomcon fights zombies and finds ways to pacify and use them. On pre-teen Timmy's (Kesun Loder's) 1950s suburban street, they all have a zombie doing menial chores. Timmy's zombie becomes his pet...See moreSpace radiation turns the dead into Zombies. Zomcon fights zombies and finds ways to pacify and use them. On pre-teen Timmy's (Kesun Loder's) 1950s suburban street, they all have a zombie doing menial chores. Timmy's zombie becomes his pet and friend, and is named Fido (Sir Billy Connolly).See less",
    "2007_405": "A single father decides to break his dying wife's last wish to not box again in order to save his young son from certain death.",
    "2007_406": "Set in the Watts area of Los Angeles, a slaughterhouse worker must suspend his emotions to continue working at a job he finds repugnant, and then he finds he has little sensitivity for the family he works so hard to support.",
    "2007_407": "A DEA agent provides former Marine Tim Kearney with a way out of his prison sentence: impersonate Bobby Z, a recently deceased drug dealer, in a hostage switch with a crime lord.",
    "2007_408": "When a good-natured factory supervisor living in Milan with his Northern wife returns to his native Sicily, a decades' old oath forces him to fulfill a nightmarish obligation.",
    "2007_409": "In seeking her own redemption from the man of whom she is most afraid, ten-year-old Cadi Forbes discovers a secret sin haunting her community of Welsh immigrants in 1850s Appalachia.",
    "2007_41": "A washed up singer is given a couple days to compose a chart-topping hit for an aspiring teen sensation. Though he's never written a decent lyric in his life, he sparks with an offbeat younger woman with a flair for words.",
    "2007_410": "A psychic's ominous reading sends a man into a tailspin.",
    "2007_411": "During a three-day heat wave just before a huge 4th of July celebration, an action star stricken with amnesia meets up with a porn star who is developing her own reality TV project, and a policeman who holds the key to a vast conspiracy.",
    "2007_412": "A Zen priest in San Francisco and cookbook author use Zen Buddhism and cooking to relate to everyday life.",
    "2007_413": "Six blind Tibetan teenagers climb the Lhakpa-Ri peak of Mount Everest, led by seven-summit blind mountain-climber Erik Weihenmayer. Read more: Synopsis",
    "2007_414": "The bizarre true story of Linda Riss and Burt Pugach.",
    "2007_415": "The story of a blind dervish Bab'Aziz and his spirited granddaughter, Ishtar, together they wander the desert in search of a great reunion of dervishes that takes place just once every thirty years.",
    "2007_416": "Photographer Edward Burtynsky travels the world observing changes in landscapes due to industrial work and manufacturing.",
    "2007_417": "Collective screening of the Academy Award nominated short films from the Live Action category for 2006.",
    "2007_418": "Steep traces the legacy of extreme skiing from its early pioneers to the daredevils of today.",
    "2007_419": "An exploration of the intersection between religion and homosexuality in the U.S. and how the religious right has used its interpretation of the Bible to stigmatize the gay community.",
    "2007_42": "In 2002, two rival Olympic ice skaters were stripped of their gold medals and permanently banned from men's single competition. Presently, however, they've found a loophole that will allow them to qualify as a pairs team.",
    "2007_420": "To investigate bizarre insurance claims that transpired in either accidents, death or both, a former cop and an insurance investigator travel throughout the country to look at the cases up close. Read more: Synopsis",
    "2007_421": "A painter living in exile returns home where his family endured generations of racial violence. There he begins to fantasize the people around him as a series of portraits in order to bury the pain and find something beautiful to feel.",
    "2007_422": "An improvisational take on the high school experience, told from the educators' point-of-view.",
    "2007_423": "Four boys from Sudan embark on a journey to America after years of wandering Sub-Saharan Africa in search of safety.",
    "2007_424": "Two teens from L.A. make their way to Utah to hide with distant Mormon relatives from their troubled pasts. An earthquake opens up a time rift, drawing them and their pursuers into an ancient mesoamerican war. Read more: Synopsis",
    "2007_425": "Two college students share a ride home for the holidays, but when they break down on a deserted stretch of road, they are preyed upon by the ghosts of people who have died there.",
    "2007_426": "Returned home to his long-estranged mother upon a request from her deathbed, a man raised by his parents in an orphanage has to confront the childhood memories that have long haunted him.",
    "2007_427": "A successful male escort describes in a series of confessions his tangled romantic relationships with his two roommates and an older, enigmatic male client.",
    "2007_428": "The story of a TV pilot as it goes through the Network TV process of casting, production and finally airing.",
    "2007_429": "A look at the work and surprising success of a four-year-old girl whose paintings have been compared to the likes of Picasso and has raked in hundreds of thousands of dollars.",
    "2007_43": "Despite Jigsaw's death, and in order to save the lives of two of his colleagues, Lieutenant Rigg is forced to take part in a new game, which promises to test him to the limit.",
    "2007_430": "A priest arrives in a tiny fishing village the week before Christmas to shut down a dying parish...and becomes entangled in the lives of the town's eccentric characters while learning the power of forgiveness and redemption.",
    "2007_431": "The romantic comedy follows a misogynistic children's book author who is forced to work closely with a female illustrator instead of his long-time collaborator and only friend.",
    "2007_432": "Mamo, an old and legendary Kurdish musician living in Iran, plans to give one final concert in Iraqi Kurdistan. After seven months of trying to get a permit and rounding up his ten sons, he sets out for the long and troublesome journey in ...See moreMamo, an old and legendary Kurdish musician living in Iran, plans to give one final concert in Iraqi Kurdistan. After seven months of trying to get a permit and rounding up his ten sons, he sets out for the long and troublesome journey in a derelict bus, denying a recurring vision of his own death at half moon. Halfway the party halts at a small village to pick up female singer Hesho, which will only add to the difficulty of the undertaking, as it is forbidden for Iranian women to sing in public, let alone in the company of men. But Mamo is determined to carry through, if not for the gullible antics of the bus driver.  Written by Swie Tio See less",
    "2007_433": "An investigation of the massacre of 24 men, women and children in Haditha, Iraq allegedly shot by 4 U.S. Marines in retaliation for the death of a U.S. Marine killed by a roadside bomb. The movie follows the story of the Marines of Kilo ...See moreAn investigation of the massacre of 24 men, women and children in Haditha, Iraq allegedly shot by 4 U.S. Marines in retaliation for the death of a U.S. Marine killed by a roadside bomb. The movie follows the story of the Marines of Kilo Company, an Iraqi family, and the insurgents who plant the roadside bomb.See less",
    "2007_434": "A day laborer is badly beaten, and a young man nurses him back to health.",
    "2007_435": "A wealthy woman and her live-in housekeeper must adjust their entrenched routine and relationship when Buenos Aires is plunged into economic crisis.,",
    "2007_436": "Clara's mother is on her death bed as she tells her daughter that she regrets they are not closer. This revelation causes Clara to pursue a closer relationship with her own daughter, Bianca.",
    "2007_437": "",
    "2007_438": "Documents the violent lives of gang leaders in Haiti's worst slum, focusing on two brothers loyal to then-President Aristide.",
    "2007_439": "The life and times of Albert Pierrepoint - Britain's most prolific hangman.",
    "2007_44": "A preteen's life turns upside down when he befriends the new girl in school and they imagine a whole new fantasy world to escape reality.",
    "2007_440": "In a conservative small town, a young man's wish to coach high school basketball are tweaked by a school board decision that makes him the new coach of the girls' team.",
    "2007_441": "When a group of tourists in a New Orleans haunted swamp tour find themselves stranded in the wilderness, their evening of fun and spooks turns into a horrific nightmare.",
    "2007_442": "A Man Named Pearl tells the inspiring story of self-taught topiary artist Pearl Fryar. It offers a message that speaks to respect for both self and others, and shows what one person can achieve when he allows himself to share the full ...See moreA Man Named Pearl tells the inspiring story of self-taught topiary artist Pearl Fryar. It offers a message that speaks to respect for both self and others, and shows what one person can achieve when he allows himself to share the full expression of his humanity.  Written by AnonymousSee less",
    "2007_443": "A documentary on the Austrian-Jewish architectural engineer who became a Nazi hunter after surviving the Holocaust.",
    "2007_444": "Milarepa is a tale of greed and vengeance - demons, magic, murder and redemption. It is the story of the man who became Tibet's greatest mystic.",
    "2007_445": "An examination of the commercialization of Christmas in America while following Reverend Billy and the Church of Stop Shopping Gospel Choir on a cross-country mission to save Christmas from the Shopocalypse (the end of humankind from ...See moreAn examination of the commercialization of Christmas in America while following Reverend Billy and the Church of Stop Shopping Gospel Choir on a cross-country mission to save Christmas from the Shopocalypse (the end of humankind from consumerism, over-consumption and the fires of eternal debt.) The film also delves into issues such as the role sweatshops play in America's mass consumerism and Big-Box Culture. From the humble beginnings of preaching at his portable pulpit on New York City subways, to having a congregation of thousands - Bill Talen (aka Rev. Billy) has become the leader of not just a church, but a national movement.  Written by Warrior Poets ReleasingSee less",
    "2007_446": "About a man who has trouble with his job, trouble with women, and uses food to deal with it all.",
    "2007_447": "Alice, married for the last 20 years to a taxi driver, works in a beauty parlour, has three children, the eldest of whom is doing his military service, and a mother who works as a maid in her house. None of the three siblings pay much ...See moreAlice, married for the last 20 years to a taxi driver, works in a beauty parlour, has three children, the eldest of whom is doing his military service, and a mother who works as a maid in her house. None of the three siblings pay much attention to their mother, and they treat their grandmother with lack of respect. Alice's life in the female working world contrasts strongly with the powerful masculine presence in her home. Although she's a good girl, the chance to betray uncovers other betrayals she didn't know existed.  Written by anonymousSee less",
    "2007_448": "Two interlaced stories unfold over the course of the same long, hot day in the once lush and now decadent resort town of Acapulco. The first involves the beautiful and cool Fernanda, who is forced to deal with the sudden emergence of her ...See moreTwo interlaced stories unfold over the course of the same long, hot day in the once lush and now decadent resort town of Acapulco. The first involves the beautiful and cool Fernanda, who is forced to deal with the sudden emergence of her ex-lover, Chino. Her boyfriend, Gonzalo, must now compete with the intense sexual tension Fernanda and Chino share. The second story concerns Jamie, an office worker with hidden indiscretions, attempting suicide in a beachfront hotel-until a precocious and equally dishonest teenage girl disrupts his plan. They will all converge in a stark and harrowing portrayal of moral ambiguity.  Written by IFC FilmsSee less",
    "2007_449": "A ten-years-later continuation of Hal Hartley's \"Henry Fool\", where Fay Grim (Posey) is coerced by a CIA agent (Goldblum) to try and locate notebooks that belonged to her fugitive ex-husband (Ryan). Published in them is information that ...See moreA ten-years-later continuation of Hal Hartley's \"Henry Fool\", where Fay Grim (Posey) is coerced by a CIA agent (Goldblum) to try and locate notebooks that belonged to her fugitive ex-husband (Ryan). Published in them is information that could compromises the security of the U.S., causing Fay to first head to Paris to fetch them ...See less",
    "2007_45": "In a countryside town bordering on a magical land, a young man makes a promise to his beloved that he'll retrieve a fallen star by venturing into the magical realm.",
    "2007_450": "The true story of Richard Pimentel, a brilliant public speaker with a troubled past, who returns from Vietnam severely hearing -impaired and finds a new purpose in his landmark efforts on the behalf of Americans with disabilities.",
    "2007_451": "A portrayal of the singular experience shared by people of her generation -- those living Cuba's utopian dream during the golden era of the revolution. It is also a lament for the end of that dream, which began to fizzle after the fall of the Berlin Wall.",
    "2007_452": "A wannabe Hollywood player sets out to Americanize an Indian girl from the Himalayas.",
    "2007_453": "Internationally acclaimed novelist Paul Auster (\"New York Trilogy\", \"The Book of Illusions\", \"Man in the Dark\") explores the art of writing in the darkly comical THE INNER LIFE OF MARTIN FROST. Having completed his fourth novel, Martin ...See moreInternationally acclaimed novelist Paul Auster (\"New York Trilogy\", \"The Book of Illusions\", \"Man in the Dark\") explores the art of writing in the darkly comical THE INNER LIFE OF MARTIN FROST. Having completed his fourth novel, Martin Frost accepts the invitation of friends to spend a few weeks in their vacant country house. On his first morning there, he awakes to find the beautiful and mysterious Claire Martin lying next to him. Intrigued by her presence, Martin finds himself compelled to write a new story. But as he progresses, he realises that his and Claire's fate are bound up in the tale he is telling. Employing the wit and intelligence of his literary work, and featuring excellent performances by David Thewlis (THE BOY IN THE STRIPED PYJAMAS), IrÃ¨ne Jacob (THREE COLOURS: RED) and Michael Imperioli (THE SOPRANOS), Auster's third film is both an intriguing mystery and a fascinating portrait of an artist and his muse.  Written by AnonymousSee less",
    "2007_454": "After a young actress unknowingly eats her roommate's marijuana cupcakes, her day becomes a series of misadventures. Read more: Synopsis",
    "2007_455": "A look at the career of consumer advocate Ralph Nader. Read more: Synopsis",
    "2007_456": "In the City of Angels, a young Iowan girl (Frederick) fresh off the bus falls in love with a promising actor (Kirk).",
    "2007_457": "Shotgun Stories tracks a feud that erupts between two sets of half brothers following the death of their father. Set against the cotton fields and back roads of Southeast Arkansas, these brothers discover the lengths to which each will go ...See moreShotgun Stories tracks a feud that erupts between two sets of half brothers following the death of their father. Set against the cotton fields and back roads of Southeast Arkansas, these brothers discover the lengths to which each will go to protect their family.  Written by Jeff NicholsSee less",
    "2007_458": "In Cambodia, Holly, a 12 year old Vietnamese girl, encounters Patrick, an American stolen artifacts dealer. The story follows their strong connection and her unrelenting efforts to escape her fate.",
    "2007_459": "In February, 1945, Primo Levi (1919-1987) and other Auschwitz survivors set off for home. The journey took more then eight months. Sixty years later, a film crew retraces Levi's steps. Levi's words, mainly from \"The Truce\" (1963), tell us ...See moreIn February, 1945, Primo Levi (1919-1987) and other Auschwitz survivors set off for home. The journey took more then eight months. Sixty years later, a film crew retraces Levi's steps. Levi's words, mainly from \"The Truce\" (1963), tell us what he experienced. In turn, we see Poland's hollow post-war factories, nationalism in the Ukraine, Soviet-style Communism in Belarus, the abandoned town of Prypiat (Chernobyl), poverty and emigration from Moldavia, Italian factories in Romania, and on across Hungary and Slovakia to Munich where Levi's rage found no listeners. Then home to Turin. An aged Mario Rigoni Stern remembers his friend. What has changed? Some issues of the war remain unsettled.  Written by See less",
    "2007_46": "A man who specialises in debunking paranormal occurrences checks into the fabled room 1408 in the Dolphin Hotel. Soon after settling in, he confronts genuine terror.",
    "2007_460": "Vanaja, the 15 year old daughter of a financially troubled fisherman goes to work in the local landlady's house in hopes of learning Kuchipudi dance. She does well, but when the Landlady's son returns from the US, what begins as innocent ...See moreVanaja, the 15 year old daughter of a financially troubled fisherman goes to work in the local landlady's house in hopes of learning Kuchipudi dance. She does well, but when the Landlady's son returns from the US, what begins as innocent sexual chemistry turns ugly, ending in a rape - a rape of a minor. Set in rural South India, a place where social barriers are built stronger than ancient fort walls, the film explores the chasm that divides classes as a young girl struggles to come of age.  Written by AnonymousSee less",
    "2007_461": "A man wakes up deep inside a cave. Suffering amnesia, he has no recollection of how he came to be here or of what happened to the man whose body he finds beside him. Tailed by a mysterious creature, he must continue through this strange ...See moreA man wakes up deep inside a cave. Suffering amnesia, he has no recollection of how he came to be here or of what happened to the man whose body he finds beside him. Tailed by a mysterious creature, he must continue through this strange and fantastic world. Enclosed, Tolbiac has no other option to reach the surface than to use REZO ZERO, secret observing cells in this cemetery-like abandoned mine. He embarks upon this journey guided by the roots of a plant, leading the way and the main subject of attention of the REZO.  Written by Magent ReleasingSee less",
    "2007_462": "A filmmaker holds a series of boundary-pushing auditions for his project about female pleasure.",
    "2007_463": "Going behind the curtain to capture the most controversial, passionate, risky and high-profile Broadway season in decades.",
    "2007_464": "\"My Brother\" is an inner city story of two impoverished boys, Isaiah and James. James is developmentally disabled. Their mother, L'Tisha, finds herself in a tragic situation. Dying of tuberculosis, she desperately tries to get her two boys...See more\"My Brother\" is an inner city story of two impoverished boys, Isaiah and James. James is developmentally disabled. Their mother, L'Tisha, finds herself in a tragic situation. Dying of tuberculosis, she desperately tries to get her two boys, eight and eleven at the time, adopted together. Finding that only Isaiah can be adopted. L'Tisha makes the only choice she feels she can make; creating an unbreakable bond of love between the boys, and hoping that bond will get them through life. Her prayers are answered as the boys overcome impossible odds on their way to adulthood, staying as close as ever as young men dealing with life's obstacles.  Written by LowkeyelvSee less",
    "2007_465": "King Henry II of England comes to terms with his affection for his close friend and confidant Thomas Becket, who finds his true honor by observing God's divine will rather than the King's.",
    "2007_466": "In the ironically named city of Paradise, a loser teams up with his cult-leading uncle to steal a peculiar bounty of riches from their local amusement park. The recently arrived Taliban have a similar focus, but a far more sinister intent.",
    "2007_467": "Yu Hong leaves her home village and starts university in Beijing, where she develops a consuming and compulsive relationship with another student. The student riots from 1989 then ensue and take a toll on their lives.",
    "2007_468": "A beauty-shop owner finds romance as she struggles to save her business.",
    "2007_469": "A lawyer inherits an interest in a mysterious secret society following his father's death. He is then courted by members of the shady organization and uncovers the sinister secrets and deceit that exists at the heart of the organization.",
    "2007_47": "Thirteen-year-old fledgling writer Briony Tallis irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.",
    "2007_470": "Three children living in a displacement camp in northern Uganda compete in their country's national music and dance festival.",
    "2007_471": "A young actor from Texas tries to make it in New York while struggling in his relationship with a beautiful singer/songwriter. Read more: Synopsis",
    "2007_472": "A documentary that exposes the genocide raging in Darfur, Sudan as seen through the eyes of a former U.S. marine who returns home to make the story public.",
    "2007_474": "A troubled actor, a television show runner, and an acclaimed videogame designer find their lives intertwining in mysterious and unsettling ways.",
    "2007_475": "When an aristocratic woman known only as \"Madame de . . .\" sells a pair of earrings given to her by her husband in order to pay some debts, she sets off a chain reaction of financial and carnal consequences that can end only in despair.",
    "2007_476": "Luke Wilson plays a good-hearted ex-con who gets a job in a retirement hotel. Three elderly residents help him win back his girlfriend as he lends them a hand in fighting hotel corruption.",
    "2007_477": "An examination of corruption and class warfare in Brazil as told through the stories of a wealthy businessman, a plastic surgeon who assists kidnapping victims and a politician whose income relies on a frog farm.",
    "2007_478": "A portrait of a 58-year-old man battling his inner demons on the search for self-discovery.",
    "2007_479": "Star-crossed lovers, David and Layla - Romeo and Juliet in New York with a twist!. Inspired by a true story, a spicy romantic comedy...via Iraq & Jerusalem.",
    "2007_48": "Warring Alien and Predator races descend on a rural Colorado town, where unsuspecting residents must band together for any chance of survival.",
    "2007_480": "An up-close-and-personal portrait of the fashion icon, Karl Lagerfeld.",
    "2007_481": "A chronicle of the former president's tour recent for his book \"Palestine: Peace Not Apartheid.\"",
    "2007_482": "An examination of the genocide in Sudan's western region of Darfur.",
    "2007_483": "Gambling addiction bring the stories of three otherwise unconnected people together as it destroys each of their lives.",
    "2007_484": "ARRANGED centers on the friendship between an Orthodox Jewish woman and a Muslim woman who meet as first-year teachers at a public school in Brooklyn. Over the course of the year they learn they share much in common - not least of which is...See moreARRANGED centers on the friendship between an Orthodox Jewish woman and a Muslim woman who meet as first-year teachers at a public school in Brooklyn. Over the course of the year they learn they share much in common - not least of which is that they are both going through the process of arranged marriages.  Written by Stefan SchaeferSee less",
    "2007_485": "A recently-singled New York writer finds herself in two surprising and complicated relationships.",
    "2007_486": "Two tapes, two Parisian mob killers, one corrupt policeman, an opera fan, a teenage thief, and the coolest philosopher ever filmed all twist their way through an intricate and stylish French-language thriller.",
    "2007_487": "In this visual essay style documentary, intimate audio of journalist Michael Azerrad's interviews with Kurt Cobain is played over more recently photographed footage of Cobain's Washington state homes and haunts.",
    "2007_488": "King Corn is a feature documentary about two friends, one acre of corn, and the subsidized crop that drives our fast-food nation. In King Corn, Ian Cheney and Curt Ellis, best friends from college on the east coast, move to the heartland ...See moreKing Corn is a feature documentary about two friends, one acre of corn, and the subsidized crop that drives our fast-food nation. In King Corn, Ian Cheney and Curt Ellis, best friends from college on the east coast, move to the heartland to learn where their food comes from. With the help of friendly neighbors, genetically modified seeds, and powerful herbicides, they plant and grow a bumper crop of America's most-productive, most-subsidized grain on one acre of Iowa soil. But when they try to follow their pile of corn into the food system, what they find raises troubling questions about how we eat-and how we farm  Written by King CornSee less",
    "2007_489": "Isidor's Tortilla Heaven is the best restaurant in the world, but has few customers and makes little money in a small town. During Mass one Sunday he is blessed with a miracle: the face of Jesus appears on one of his tortillas.",
    "2007_49": "A newly wed man who believes he's just gotten hitched to the perfect woman encounters another lady on his honeymoon.",
    "2007_490": "The true-life story of a Harlem's notorious Nicky Barnes, a junkie turned multimillionaire drug-lord, MR. UNTOUCHABLE takes its audience deep inside the heroin industry of the 1970s. The most powerful black drug kingpin in New York City ...See moreThe true-life story of a Harlem's notorious Nicky Barnes, a junkie turned multimillionaire drug-lord, MR. UNTOUCHABLE takes its audience deep inside the heroin industry of the 1970s. The most powerful black drug kingpin in New York City history, Barnes came from humble beginnings to make himself and his comrades rich beyond their wildest dreams, ultimately reaching national infamy in 1977 when the New York Times put him on the front cover of their magazine with the headline \"Mr. Untouchable\". Soon after, it all came crumbling down, and facing a life sentence without parole, Barnes started naming names. With the first hand testimony from \"the black Godfather\" himself, this documentary tells an epic story of business, excess, greed and revenge.  Written by Magnolia FilmsSee less",
    "2007_491": "After a tragic accident at sea, Eben Cole loses his family, friends and stature in his island fishing community. He returns to the island an outcast but determined to win back the way of life he fought so hard to protect. Set against the ...See moreAfter a tragic accident at sea, Eben Cole loses his family, friends and stature in his island fishing community. He returns to the island an outcast but determined to win back the way of life he fought so hard to protect. Set against the stunning backdrop of the Maine coast, Islander captures the grit and integrity of this hard working community and celebrates man's unerring need for redemption.  Written by Renee TsaoSee less",
    "2007_492": "A returning missionary (Javen Tanner) anxious to reunite with his long time sweetheart-fiance (Joey Jalalian), awakens from a near fatal accident with the new priority of saving his wayward mother.",
    "2007_493": "Angry and depressed over losing his job, Terry Allen begins to suspect his new, Middle Eastern neighbor is at the center of a terrorist conspiracy. Obsessed about revealing the man's true identity, he takes matters into his own hands.",
    "2007_494": "Documentaire qui soulève des questions sur notre consommation de medicaments. Les Quebecois prennent-ils trop de medicaments? Pourquoi est-ce si facile de se procurer des medicaments, notamment pour le mal de vivre? Jusqu'à quel point ...See moreDocumentaire qui soulève des questions sur notre consommation de medicaments. Les Quebecois prennent-ils trop de medicaments? Pourquoi est-ce si facile de se procurer des medicaments, notamment pour le mal de vivre? Jusqu'à quel point l'industrie pharmaceutique influe-t-elle sur le travail des medecins? On y apprend notamment que le Quebecois prend en moyenne 750 pilules par annee. C'est sans compter les produits achetes à la pharmacie sans ordonnance.See less",
    "2007_495": "A pill-popping mom has her drug-abusing teen son abducted into a private intervention facility that means well.",
    "2007_496": "In the Camargue, France, a young boy bonds with a white haired horse that escaped from ranchers.",
    "2007_497": "Sent to evaluate the environmental impact of oil drilling in the Arctic, James Hoffman clashes with the drilling crew's chief, who wants to get the job done.",
    "2007_498": "In a corrupt, greed-fueled world, a powerful alchemist leads a messianic character and seven materialistic figures to the Holy Mountain, where they hope to achieve enlightenment.",
    "2007_499": "The lives of three lonely strangers intersect while commuting on New York's 1 and 9 subway lines.",
    "2007_5": "An ancient struggle between two Cybertronian races, the heroic Autobots and the evil Decepticons, comes to Earth, with a clue to the ultimate power held by a teenager.",
    "2007_50": "A drama based on a Texas congressman Charlie Wilson's covert dealings in Afghanistan, where his efforts to assist rebels in their war with the Soviets have some unforeseen and long-reaching effects.",
    "2007_500": "Interviews, archival footage and home movies are used to illustrate a social history of folk artist and activist Pete Seeger.",
    "2007_501": "A disenfranchised office worker becomes a hero after saving a girl's life.",
    "2007_502": "Jake Singer is at loose ends in New York City, and neck deep in psychoanalysis with the outrageous Dr. Morales, when he meets the enigmatic and beautiful widow Allegra Marshall.",
    "2007_503": "A burglar betraying other criminals, prepares for a big heist with a trusted friend that might be as untrustworthy as he.",
    "2007_504": "It's time to rock and roll - air guitar style. AIR GUITAR NATION is the feature documentary about the year that air guitar swept America - from New York to Los Angeles and then all the way to northern Finland. AIR GUITAR NATION chronicles ...See moreIt's time to rock and roll - air guitar style. AIR GUITAR NATION is the feature documentary about the year that air guitar swept America - from New York to Los Angeles and then all the way to northern Finland. AIR GUITAR NATION chronicles the birth of the US Air Guitar Championships and the personal journeys of those talented contestants who are vying to become the first World Air Guitar Champion from the United States. Every August, the Air Guitar World Championships bring thousands of fans all the way to Oulu, Finland to see the world's best air guitarists battle it out for 60 seconds of mock stardom. For years, the USA was missing in action. Enter the first official US Air Guitar Championships. What starts as a friendly contest above a New York strip club becomes a battle of naked ambition played out on the national and, ultimately, the world stage. Full of triumph and disappointment, patriotic spirit and political tension - and of course invisible guitars - this tension filled competition quickly turns very real as the contest becomes even more fierce as the contestants work hard to win the title of World Air Guitar Champion. AIR GUITAR NATION captures the explosion of competitive air guitar through the eyes of former world champions, fans and media, and through the personal rivalries of those trying to attain the title of \"The best Air Guitarist in the world.\"  Written by AnonymousSee less",
    "2007_505": "An examination of the nature of modern suburbia.",
    "2007_506": "With its loud acting style, exuberant sets and stunning shots in pastel colours, this Thai cult film is as much a parody as an homage to the Western and the romantic tearjerker.",
    "2007_507": "A young girl discovers she can communicate with dolphins.",
    "2007_508": "A look at the life of an Enumclaw, Washington man who died as a result of an unusual encounter with a horse. Read more: Synopsis",
    "2007_509": "The next great psycho horror slasher has given a documentary crew exclusive access to his life as he plans his reign of terror over the sleepy town of Glen Echo.See moreThe next great psycho horror slasher has given a documentary crew exclusive access to his life as he plans his reign of terror over the sleepy town of Glen Echo.  Written by press releaseSee less",
    "2007_51": "A teen living under house arrest becomes convinced his neighbor is a serial killer.",
    "2007_510": "A story about a tight-knit group of friends, who try to maintain their small-town way of life in the face of enormous changes in 1970s Long Island. Read more: Synopsis",
    "2007_511": "Story about director Apichatpong Weerasethakul's parents who were both doctors, and director's memories about growing up in the hospital environment.",
    "2007_512": "A story of amour fou. Walt is madly in love/lust with a young illegal Mexican immigrant. However, the object of his unrequited affection doesn't even speak any English and finds Walt really strange and undesirable.See moreA story of amour fou. Walt is madly in love/lust with a young illegal Mexican immigrant. However, the object of his unrequited affection doesn't even speak any English and finds Walt really strange and undesirable.  Written by Cristian Redferne See less",
    "2007_513": "On Christmas Eve, Francesca sets out for Rotterdam in order to find her little sister, who has run off with her musician boyfriend. On the way, she picks up Gerlinde, a heartbroken older woman at the end of her rope.",
    "2007_514": "When Hurricane Katrina ravaged America's Gulf Coast, it laid bare an uncomfortable reality-America is not only far from the world's wealthiest nation; it is crumbling beneath a staggering burden of individual and government debt. Maxed Out...See moreWhen Hurricane Katrina ravaged America's Gulf Coast, it laid bare an uncomfortable reality-America is not only far from the world's wealthiest nation; it is crumbling beneath a staggering burden of individual and government debt. Maxed Out takes us on a journey deep inside the American debt-style, where everything seems okay as long as the minimum monthly payment arrives on time. Sure, most of us may have that sinking feeling that something isn't quite right, but we're told not to worry. After all, there's always more credit! Maxed Out shows how the modern financial industry really works, explains the true definition of \"preferred customer\" and tells us why the poor are getting poorer and the rich getting richer. By turns hilarious and profoundly disturbing, Maxed Out paints a picture of a national nightmare which is all too real for most of us.  Written by James ScurlockSee less",
    "2007_515": "The star player of Icelands top football team causes a stir when he admits to being gay to his team mates and then goes on a journey to discover himself (with the help of the local press). He soon finds himself on the bench for most of his...See moreThe star player of Icelands top football team causes a stir when he admits to being gay to his team mates and then goes on a journey to discover himself (with the help of the local press). He soon finds himself on the bench for most of his teams matches and decides to call it quits and join a small amateur team made up of men like himself - gay guys trying to play football in a straight world of Icelandic fishing culture machoism.  Written by mosfilmSee less",
    "2007_516": "Citizens of a small town, under the influence of a man in the midst of a mid-life crisis, come together to make an adult film.",
    "2007_517": "Bruce Lee's shocking death left legions of stunned fans and a legacy of 12 minutes from his unfinished Game Of Death. Undeterred, studio executives launched a search for his replacement chronicled here through the eyes of five aspiring ...See moreBruce Lee's shocking death left legions of stunned fans and a legacy of 12 minutes from his unfinished Game Of Death. Undeterred, studio executives launched a search for his replacement chronicled here through the eyes of five aspiring thespians who find out what the real game is.See less",
    "2007_518": "A dramatization of Mark Chapman's plan to murder John Lennon. Read more: Synopsis",
    "2007_519": "\"I'm not black, I'm not white, not foreign, just different in the mind. Different brains, that's all,\" explains 15-year-old Billy in Jennifer Venditti's provocative coming of age film. Billy's intuitive commentary and intimate verite ...See more\"I'm not black, I'm not white, not foreign, just different in the mind. Different brains, that's all,\" explains 15-year-old Billy in Jennifer Venditti's provocative coming of age film. Billy's intuitive commentary and intimate verite footage reveal a unique attitude as he responds to a painful childhood, first time love, and his experience as an outsider in small town Maine. By turns humorous and disturbing, this portrait challenges the viewer to understand a triumphant teen on his own terms.  Written by billythekid@jv8inc.comSee less",
    "2007_52": "Feature-length version of the documentary TV series Planet Earth, following the migration paths of four animal families.",
    "2007_520": "Pierrot escapes his boring society and travels from Paris to the Mediterranean Sea with Marianne, a girl chased by hit-men from Algeria. They lead an unorthodox life, always on the run.",
    "2007_521": "Youssef, a blind university professor, is suddenly diagnosed with a fatal disease and must undergo treatment in France. Back home, will he find the life he had before?",
    "2007_522": "Amu is the story of an Indian American woman who returns to India. The film takes a dark turn as Kaju learns that a horrifying genocide that took place twenty years ago turns out to hold the key to her mysterious origins.",
    "2007_523": "In his first public interview in more than a decade, pop culture icon of the 1970s and 80s, Werner Erhard breaks his long silence about his ideas, his life and his controversial program \"est\"that became \"the thing\" to do among celebrities ...See moreIn his first public interview in more than a decade, pop culture icon of the 1970s and 80s, Werner Erhard breaks his long silence about his ideas, his life and his controversial program \"est\"that became \"the thing\" to do among celebrities and middle America and fueled today's multi-billion dollar personal growth industry. With exclusive and rare footage, you'll step inside controversial est seminars, hear provocative interviews with participants, family members, and experts. Viewers will be very surprised to learn how Erhard's transformational ideas are still in the mainstream today-in our language, advertising campaigns and in personal growth seminars yet few people know its origin.  Written by Robyn SymonSee less",
    "2007_524": "FAKERS is a sharp, fast moving tale of blackmail and forgery set in the upper echelons of the international art society. Set in present day London and 1911 Italy.",
    "2007_525": "The tale of a son and his father separately plotting to escape the desolation of their lives in the lurid underworld of Brazil's sex industry.",
    "2007_526": "The life and work of Alice Neel (1900-1984), American portrait painter. Part of the narration is chronological, part consists of interviews with friends, other artists, scholars, and family members, particularly two sons, Richard and ...See moreThe life and work of Alice Neel (1900-1984), American portrait painter. Part of the narration is chronological, part consists of interviews with friends, other artists, scholars, and family members, particularly two sons, Richard and Hartley, who are none too sanguine about their childhood and their mother's Bohemian life, and the filmmaker himself, a grandson whose querulous voice is heard from time to time. The film also includes footage of Neel, later in life, painting, talking, appearing on television, and giving lectures. Throughout, we see her paintings, bold, frank, and direct. After years of poverty and obscurity, fame comes as she nears 70.  Written by See less",
    "2007_527": "The story of an American journalist, a CIA operative, and an Iraqi photographer against the backdrop of the bloody war in Iraq.",
    "2007_528": "Documentary about red-beret-ed Jimmy Mirikitani, a feisty painter working and living on the street, near the World Trade Center, when 9/11 devastates the neighborhood. A nearby film editor, Linda Hattendorf, persuades elderly Jimmy to move...See moreDocumentary about red-beret-ed Jimmy Mirikitani, a feisty painter working and living on the street, near the World Trade Center, when 9/11 devastates the neighborhood. A nearby film editor, Linda Hattendorf, persuades elderly Jimmy to move in with her, while seeking a permanent home for him. The young woman delves into the California-born, Japan-raised artist's unique life which developed his resilient personality, and fuels his 2 main subjects: cats and internment camps. The editor films Jimmy's remarkable journey back into his incredible past.  Written by David StevensSee less",
    "2007_529": "Chad, 2006. After a forty-year civil war, the radio announces the government has just amnestied the war criminals. Outraged by the news, Gumar Abatcha orders his grandson Atim, a sixteen-year-old youth, to trace the man who killed his ...See moreChad, 2006. After a forty-year civil war, the radio announces the government has just amnestied the war criminals. Outraged by the news, Gumar Abatcha orders his grandson Atim, a sixteen-year-old youth, to trace the man who killed his father and to execute him. Atim obeys him and, armed with his father's own gun, he goes in search of Nassara, the man who made him an orphan. It does not take long before he finds him. Nassara, who now goes straight, is married, goes to the mosque and owns a small bakery. After some hesitation Atim offers him his services as an apprentice. He is hired then it will be easy for him to gun down the murderer of his father. At least, that is what he thinks...  Written by Guy BellingerSee less",
    "2007_53": "A lonely boy discovers a mysterious egg that hatches a sea creature of Scottish legend.",
    "2007_530": "The Hip Hop Project is the dynamic and inspirational story of a group of New York City teenagers who transform their life stories into powerful works of art, using hip hop as a vehicle for self-development and personal discovery. The film ...See moreThe Hip Hop Project is the dynamic and inspirational story of a group of New York City teenagers who transform their life stories into powerful works of art, using hip hop as a vehicle for self-development and personal discovery. The film traces the evolution of this award-winning outreach program developed by Kazi, a formerly homeless teenager turned youth mentor. After four years of collaboration, the group produced a powerful and thought-provoking album that provides a revealing look at their lives. In contrast to all the negative attention focused on hip hop and rap music, this is a story of hope, healing and the realization of dreams.  Written by AnonymousSee less",
    "2007_531": "A good ol' boy (McKinnon) gets into trouble with some mobsters, and then must seek assistance from his estranged, identical twin gay brother. Read more: Synopsis",
    "2007_532": "Fifteen years ago, a group of men's lives were forever changed by a strange occurrence. Now, the same group of men will spend a night together ... in terror.",
    "2007_533": "2 boys defend Treasure Town. Yakuza try to take over and clear it for new development.",
    "2007_534": "Having suffered as a boy under a brutal Communist-era coach, champion Hungarian gymnast Miklos moves to Canada years later in search of a new start - only to find himself unwittingly perpetuating the very same cycle of abuse among his own ...See moreHaving suffered as a boy under a brutal Communist-era coach, champion Hungarian gymnast Miklos moves to Canada years later in search of a new start - only to find himself unwittingly perpetuating the very same cycle of abuse among his own pupils.  Written by AnonymousSee less",
    "2007_535": "Law intern Rick aims for the top. He tells his boss he'll do anything - incl. drive the cute wild niece Miami to LA. Back well prepared for bar exam 3 days later?",
    "2007_536": "Best pals Rodel, Billy, and Maribel live in Colma. After graduating from high school the trio is having too much fun doing nothing or crashing college parties. But newfound revelations and romances force them to assess what to hold onto.",
    "2007_537": "A woman's schizophrenia affects her relationships with her husband and son. Read more: Synopsis",
    "2007_538": "The battle to keep Yiddish Theater alive into the 21st century continues.",
    "2007_539": "On an island across the sea lies a village full of romance, wonder and mystery; a timeless place where people carry strong beliefs that can fulfill the heart's deepest desires. A beautiful woman, led to believe she has powerful ties to the...See moreOn an island across the sea lies a village full of romance, wonder and mystery; a timeless place where people carry strong beliefs that can fulfill the heart's deepest desires. A beautiful woman, led to believe she has powerful ties to the sea, defies everyone to prove them wrong, in a world where man and nature connect in improbable ways, where myths are real and truth is imaginary. \"Sea of Dreams\" is a classical narrative that creates a fascinating world that celebrates the miracles of falling in love, following your heart and finding your destiny.  Written by Success FilmsSee less",
    "2007_54": "A gun-for-hire known only as Agent 47 hired by a group known only as 'The Organization' is ensnared in a political conspiracy, which finds him pursued by both Interpol and the Russian military as he treks across Russia and Eastern Europe.",
    "2007_540": "If, in 1940, you had a lobotomized aunt, an institutionalized father, a racist mother, and were the only gay kid on the block, what do you think the odds would be that you'd end up a Tony winner, a staple of television, and a generational ...See moreIf, in 1940, you had a lobotomized aunt, an institutionalized father, a racist mother, and were the only gay kid on the block, what do you think the odds would be that you'd end up a Tony winner, a staple of television, and a generational icon? Enter \"The Life Of Reilly\". The cliche goes that truth is stranger than fiction. In this case, it is also funnier and more heartbreaking. Charles Nelson Reilly, famous for his game show innuendos and \"X Files\" guest appearances, takes us through his bizarre, star-studded, tragic, hilarious, and ultimately amazing life with a potent blend of tenderness and quick one-liners. \"The Life Of Reilly\" is an adaptation of Mr. Reilly's acclaimed one-man show and was photographed for the screen during Mr. Reilly's final two performances of his play in North Hollywood, California.  Written by jlmSee less",
    "2007_541": "The curiously named, Moondance Alexander is a spirited teen living with her eccentric mother. She is faced with another uneventful summer until she discovers a lost pinto pony named Checkers who has jumped out of his paddock. Although ...See moreThe curiously named, Moondance Alexander is a spirited teen living with her eccentric mother. She is faced with another uneventful summer until she discovers a lost pinto pony named Checkers who has jumped out of his paddock. Although Moondance returns the horse to his rightful owner, the gruff and mysterious Dante Longpre, she is convinced that Checkers is a champion jumper in disguise and is determined to help him realize his full potential. Moondance manages to talk Dante into training her and Checkers for the Bow Valley Classic and despite the criticism of her peers; discovers that perseverance, loyalty and individuality can land you in the winner's circle.  Written by anonymousSee less",
    "2007_542": "Set in the frozen steppes of Mongolia, a young nomad confronted with his destiny after animals fall victim to a plague which threatens to eradicate nomadism.",
    "2007_543": "A filmmaker returns to Normandy thirty years after a working on a movie based on a local homicide and tries to find the actors who worked on the project. Read more: Synopsis",
    "2007_544": "A comedy centered on a handyman (Arkin) and his lifelong competition with his neighbor (Pendleton.)",
    "2007_545": "A young woman is kidnapped and sold to a villager in the mountains.",
    "2007_546": "A 19-year-old girl prepares to become a suicide bomber in Times Square. She speaks with a nondescript American accent, and it's impossible to pinpoint her ethnicity. We never learn why she made her decision -- she has made it already. We ...See moreA 19-year-old girl prepares to become a suicide bomber in Times Square. She speaks with a nondescript American accent, and it's impossible to pinpoint her ethnicity. We never learn why she made her decision -- she has made it already. We don't know whom she represents, what she believes in - we only know she believes it absolutely.  Written by FaceFilmSee less",
    "2007_547": "Sometimes we fight with fists and sometimes we kill with words.",
    "2007_548": "",
    "2007_549": "An in-depth look at the animal rights movement and the FBI's recent declaration calling them the number one domestic terrorist threat to the United States.",
    "2007_55": "Fred Claus, Santa's bitter older brother, is forced to move to the North Pole to help Santa and the elves prepare for Christmas in exchange for cash.",
    "2007_550": "High School grad and all American gal, Anna, finds her purpose and herself after she hooks up with the radical feminists in The Itty Bitty Titty Committee.",
    "2007_551": "Grace is a Chinese American who longs to be a part of New York's high society. At a socialite event, she is mistaken for a Hong Kong heiress and meets her Prince Charming. Nothing is as it seems absorbing drama. What will happen to this ...See moreGrace is a Chinese American who longs to be a part of New York's high society. At a socialite event, she is mistaken for a Hong Kong heiress and meets her Prince Charming. Nothing is as it seems absorbing drama. What will happen to this Cinderella when the clock strikes midnight?See less",
    "2007_552": "A successful artist looks back with loving memories on the summer of his defining year, 1974. A talented but troubled 18-year-old aspiring artist befriends a brilliant elderly alcoholic painter who has turned his back on not only art but ...See moreA successful artist looks back with loving memories on the summer of his defining year, 1974. A talented but troubled 18-year-old aspiring artist befriends a brilliant elderly alcoholic painter who has turned his back on not only art but life. The two form what appears to be at first a tenuous relationship. The kid wants to learn all the secrets the master has locked away inside his head and heart. Time has not been kind to the old master. His life appears pointless to him until the kid rekindles his interest in his work and ultimately gives him the will to live. Together, they give one another a priceless gift. The kid learns to see the world through the master's eyes. And the master learns to see life through the eyes of innocence again. This story is based on a real life experience.  Written by George GalloSee less",
    "2007_553": "The Assistant to a world-famous film director must hide her boss' scandalous lifestyle from reporters.",
    "2007_554": "The story of two Italian immigrant radicals who were executed in 1927 offers insights into present-day issues of civil liberties and the rights of immigrants.",
    "2007_555": "Forever is a film about the power and vitality of art and a place where love and death go hand in hand and beauty lives on: the Père-Lachaise cemetery in Paris.",
    "2007_556": "When Henry Perkins accidentally trades his briefcase with a man, he finds a million dollars inside. However, the cash draws in Mr. Big, who wants to reclaim his money.",
    "2007_557": "A small group of French students are studying Mao, trying to find out their position in the world and how to change the world to a Maoistic community using terrorism.See moreA small group of French students are studying Mao, trying to find out their position in the world and how to change the world to a Maoistic community using terrorism.  Written by Stephan Eichenberg See less",
    "2007_558": "My Bollywood Bride tells the story of Alex, a copy-writer dreaming of being an adventure novelist someday, who meets and romances Indian beauty Reena, while she is vacationing in California. Torn by her blossoming feelings for Alex and her...See moreMy Bollywood Bride tells the story of Alex, a copy-writer dreaming of being an adventure novelist someday, who meets and romances Indian beauty Reena, while she is vacationing in California. Torn by her blossoming feelings for Alex and her Indian family values and obligations, Reena returns home without saying goodbye. Alex, distraught by the turn of events, decides to follow her to Mumbai and win her back. The trouble is, Alex couldn't be more out of his element on the sub-continent, not helped by the fact Reena has kept something very important about her from him (Reena is the top Bollywood film star - the Julia Roberts of India)! However, with the help of a rambunctious rickshaw driver and some of Reenas friends, Alex just might have a chance at winning her heart. A parallel love story centers on Bobby, an up-and-coming Bollywood star, who has forgotten his roots and started to believe his own press. As a close friend of Reena, he tries to help her by taking Alex under his wing. However, his life is thrown into turmoil when he runs into his childhood sweetheart Alisha, whom he once left behind after a dance competition in order to win a role in Bollywood.  Written by BKSee less",
    "2007_559": "This documentary follows ex-spy Alexander Litvinenko from his forced exile from Russia, to his death from poisoning in November of 2006.",
    "2007_56": "When the world is threatened by an ancient evil, the four adolescent turtles must reunite and overcome their faults in order to stand against it.",
    "2007_560": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.",
    "2007_561": "Relationship between father and son on a background of Maoist regime in China in the mid-20th century. The father, a painter by profession, interned in a labor camp for \"re-education\" and loses his ability to paint. he teaches his son to ...See moreRelationship between father and son on a background of Maoist regime in China in the mid-20th century. The father, a painter by profession, interned in a labor camp for \"re-education\" and loses his ability to paint. he teaches his son to draw, but does so obsessively. The convoluted relationship between father and son that spread over the period of childhood, adolescence and maturity of the son are being resolved in a surprising and sensitive way.  Written by B-T. HorowitzSee less",
    "2007_562": "Aging screenwriter Felix Bonhoeffer has lived his life in two states of existence: in reality and his own interior world. While working on a murder mystery script, and unaware that his brain is on the verge of implosion, Felix is baffled ...See moreAging screenwriter Felix Bonhoeffer has lived his life in two states of existence: in reality and his own interior world. While working on a murder mystery script, and unaware that his brain is on the verge of implosion, Felix is baffled when his characters start to appear in his life, and vice versa.See less",
    "2007_563": "This visually stunning directorial debut is set in a place lost in time in northern Argentina. Alvaro is a gay man who is an outsider. He works for the violent El Turo, a captain of the water bus which links isolated communities. But El ...See moreThis visually stunning directorial debut is set in a place lost in time in northern Argentina. Alvaro is a gay man who is an outsider. He works for the violent El Turo, a captain of the water bus which links isolated communities. But El Turo is threatened by Alvaro's sexuality and starts harassing him.  Written by AnonymousSee less",
    "2007_564": "\"Gringo Wedding\" is a romantic comedy set in modern times where technology has improved communications beyond our dreams, giving us cell phones, pagers, faxes, e-mails and much more. In spite of this, a lot of people are finding it harder ...See more\"Gringo Wedding\" is a romantic comedy set in modern times where technology has improved communications beyond our dreams, giving us cell phones, pagers, faxes, e-mails and much more. In spite of this, a lot of people are finding it harder and harder to meet the right person to connect to; someone to share their life with. This story deals with two such people living thousands of miles away, in two different continents, in two different cultures. They come together as destiny takes them on a joyful and eventful journey. \"Gringo Wedding\" is full of laughter and at the same time it is a thought-provoking story where we witness and discover the common values of love, friendship and follow their desire to be with someone who cares. Rebecca Gonzalez is a management executive with a financial institution in Bogotá, Colombia. She is very attractive, sexy, highly educated, and self-motivated young woman in her late twenties. Matt Goldman is in his mid thirties; a handsome, hardworking account executive with an advertising/production agency based in Miami, Florida. Though he is well liked by all his colleagues and friends, he feels that something is missing from his life. In this movie full of laughter, twists and turns, Rebecca meets her match in the form of Matt. Against all odds they tie the knot. Their friends call it \"Gringo Wedding\".  Written by Tas SaliniSee less",
    "2007_565": "A hip hop horror anthology of three tales of terror told by the Hound of Hell that revolve around the residents of an inner-city neighborhood whose actions determine where they will go in the afterlife. Read more: Synopsis",
    "2007_566": "Pregnant forensic psychologist Lydie Crane is hired to learn the truth behind the case of 16-year-old Stephanie Daley, who is accused of concealing her pregnancy and murdering her infant. Read more: Synopsis",
    "2007_567": "Musical Review of gay experiences as told through song, stage choreography and full male nudity. Read more: Synopsis",
    "2007_568": "In Barbara Albert's FALLING, five independent women are reunited for the funeral of a beloved teacher. As the five women reconnect, a day of sober mourning turns into a night of sybaritic celebration. From the director of FREE RADICALS!",
    "2007_569": "A graphic documentary on both sides of the abortion debate.",
    "2007_57": "A marksman living in exile is coaxed back into action after learning of a plot to kill the President. After being double crossed for the attempt and on the run, he sets out for the real killer and the truth.",
    "2007_570": "An American soldier is unable to cope with the realities of daily life after he returns from his tour of duty in Iraq. Read more: Synopsis",
    "2007_571": "Hannah is a recent college graduate interning at a Chicago production company. She is crushing on two writers at work, Matt and Paul, who share an office and keep her entertained. Will a relationship with one of them disrupt the delicate ...See moreHannah is a recent college graduate interning at a Chicago production company. She is crushing on two writers at work, Matt and Paul, who share an office and keep her entertained. Will a relationship with one of them disrupt the delicate balance of their friendship?  Written by Joe SwanbergSee less",
    "2007_572": "Karma, a young Tibetan woman from New York City comes to Dharamsala, the exile headquarters of the Dalai Lama in India, in search of her roots. She is making a documentary film about former political prisoners who have escaped Tibet. One ...See moreKarma, a young Tibetan woman from New York City comes to Dharamsala, the exile headquarters of the Dalai Lama in India, in search of her roots. She is making a documentary film about former political prisoners who have escaped Tibet. One of her interviewees is Dhondup, who has recently fled to India. He reveals to her that his dying mother had made him promise to deliver an old charm box to an exile Tibetan named Loga, and appeals to her for help in locating the man. Their enquiries reveal that Loga, a former CIA-trained resistance fighter, has been missing for the past fifteen years and is presumed to be dead. But is he really dead? As they set out to unravel the mysterious circumstances of his disappearance, Karma finds herself unwittingly attracted to Dhondup even as she is sucked into the vortex of his search, which takes them through the world of the exile Tibetan community in India and becomes a journey of self-discovery.  Written by Tenzing SonamSee less",
    "2007_573": "Late-night radio host Dale Sweeney's usual line up of odd-ball, conspiracy-obsessed callers is interrupted by a panicked phone call in an indecipherable language. When FBI agents arrive investigating the call, Dale enlists his friends help...See moreLate-night radio host Dale Sweeney's usual line up of odd-ball, conspiracy-obsessed callers is interrupted by a panicked phone call in an indecipherable language. When FBI agents arrive investigating the call, Dale enlists his friends help to uncover what he hopes is the amazing identity of this first time caller.  Written by AnonymousSee less",
    "2007_574": "In the eyes of his classmates, Francis Larson is nothing more than an overweight social outcast. After being sent to prison when he's forced to confess to the murder, everyone including his classmates are led to believe that Francis ...See moreIn the eyes of his classmates, Francis Larson is nothing more than an overweight social outcast. After being sent to prison when he's forced to confess to the murder, everyone including his classmates are led to believe that Francis commits suicide. However, it's only a cover for his physical transformation to Frank Delano. Aided by his rich eccentric Uncle Bobby, they meticulously plan Frank's return to Arnolds Park to bring the real killer to justice. During Frank's physical transformation Bobby also hires a young beauty Susan Campbell who has close ties to Jackie Newmar the one who has the answers that could help clear Francis' name. The People's Movie presents Arnolds Park. An online movie collaboration from people in all fifty states and around the world. This mystery romance is a thrill ride of lies, secret confessions, justice, revenge, betrayal and love.  Written by AnonymousSee less",
    "2007_575": "This off-beat drama about man's search for meaning amidst the ache of despair chronicles Finn, an introspective English teacher entering a mid-life crisis impelled by a recent tragedy, as he sets afoot selling encyclopedias to the town ...See moreThis off-beat drama about man's search for meaning amidst the ache of despair chronicles Finn, an introspective English teacher entering a mid-life crisis impelled by a recent tragedy, as he sets afoot selling encyclopedias to the town locals.  Written by Aaron J. WiederspahnSee less",
    "2007_576": "Zombified chickens attempt to kill the fast-food workers that cook them in a restaurant built on an ancient burial ground.",
    "2007_577": "A deadly collision between a train and car lead to an unlikely bond between the train engineer and a young boy who escapes the carnage.",
    "2007_578": "When a man answers an advertisement to train as a record producer, he's excited by the prospect of signing undiscovered musicians, only to discover his new job isn't all it's cracked up to be. Read more: Synopsis",
    "2007_579": "Two students from the Czech Film Academy commission a leading advertising agency to organize a huge campaign for the opening of a new supermarket named Czech Dream. The supermarket however does not exist and is not meant to. The ...See moreTwo students from the Czech Film Academy commission a leading advertising agency to organize a huge campaign for the opening of a new supermarket named Czech Dream. The supermarket however does not exist and is not meant to. The advertising campaign includes radio and television ads, posters, flyers with photos of fake Czech Dream products, a promotional song, an internet site, and ads in newspapers and magazines. Will people believe in it and show up for the grand opening?  Written by AnonymousSee less",
    "2007_58": "A law firm brings in its \"fixer\" to remedy the situation after a lawyer has a breakdown while representing a chemical company that he knows is guilty in a multibillion-dollar class action suit.",
    "2007_580": "Saving the world, one bottle of soap at a time.",
    "2007_581": "The history of Hollywood's handling of the Nazis and its later depiction of the Holocaust they perpetrated.",
    "2007_582": "A Ronald Reagan-obsessed serial killer targets a bunch of hippies who are heading to a weekend-long concert.",
    "2007_583": "MEETING RESISTANCE is a verite-style non-fiction feature-length film set in the streets, alleyways and ubiquitous teashops of the Adamiyah neighborhood of Baghdad. It enters the physical and psychological heart of the \"Insurgency\" against ...See moreMEETING RESISTANCE is a verite-style non-fiction feature-length film set in the streets, alleyways and ubiquitous teashops of the Adamiyah neighborhood of Baghdad. It enters the physical and psychological heart of the \"Insurgency\" against the American-led occupation. Photojournalists/directors Steve Connors and Molly Bingham spent ten-months among the insurgents there to create this exclusive, unique, and at once horrifying, compelling and insightful film about their lives, motivation, and goals.  Written by AnonymousSee less",
    "2007_584": "A British documentary about US Army defector James Dresnok currently living in North Korea after having defected during the 60s.",
    "2007_585": "In six hour long episodes, acclaimed filmmaker, Jennifer Fox, maps the world of female life and sexuality today -- from the dramatic turns in her own life to the stories of women around the globe that shed light on the universal issues all...See moreIn six hour long episodes, acclaimed filmmaker, Jennifer Fox, maps the world of female life and sexuality today -- from the dramatic turns in her own life to the stories of women around the globe that shed light on the universal issues all women face. Employing a groundbreaking camera technique, called \"passing the camera\", this powerful series creates a new type of documentary language and storytelling that mirrors the special way women communicate.  Written by AnonymousSee less",
    "2007_586": "A modern-day prodigal son story with a twist. It follows Patrick, a magazine writer, who seems to have the \"perfect life,\" until one day, there is a knock at the door. On the other side stands a secret that brings him face to face with the...See moreA modern-day prodigal son story with a twist. It follows Patrick, a magazine writer, who seems to have the \"perfect life,\" until one day, there is a knock at the door. On the other side stands a secret that brings him face to face with the traditional southern family he hasn't seen in over 10 years.See less",
    "2007_587": "Fiona, Julien and their two clone-like children live a life appropriate to the robots they have become, in a style-less, cheerless suburb somewhere in the flatlands of French-speaking Europe. Even the simple act of buttering and eating a ...See moreFiona, Julien and their two clone-like children live a life appropriate to the robots they have become, in a style-less, cheerless suburb somewhere in the flatlands of French-speaking Europe. Even the simple act of buttering and eating a roll takes on the appearance of an assembly line. When Fiona, who manages a fast-food restaurant, accidentally locks herself in the restaurant's walk-in freezer overnight, her family doesn't even miss her. She realizes how pointless her life has become and runs away; to seek happiness, put her life right again and perhaps to visit the icebergs with which she begins an obsession. On a bus trip to nowhere, she becomes friendly with an older lady, Fernande, who offers Fiona a place to stay and diversion in her seaside community. There, Fiona becomes attracted to Rene, who owns a small sailboat, and has been a deaf-mute since a fire in which his parents died. In time, the pair embark on a sailing voyage, unknowingly pursued by the persistent Julien, who has managed to track Fiona down. When the men squabble and fall overboard, Fiona sets sail for the polar regions with a vengeance, ultimately tearing the bottom out of the boat on - you guessed it - an iceberg! Miraculously, the three castaways are all fished out of the ocean by Lucy, an Inuit girl who operates a commercial fishing boat. The final resolution of the love triangle caps the farcical nature of this unusual film.  Written by Joe JurcaSee less",
    "2007_588": "Ryan, a good-natured slacker, is tempted into a money laundering scheme while working for a lottery magazine. A capitalistic comedy that asks the question - when is \"enough\" enough?",
    "2007_589": "A lyrical telling of the coming of age of a 13-year-old boy who learns to cope with his newfound sexuality and his unrequited love for the cool kid in school.",
    "2007_59": "The life of a top chef changes when she becomes the guardian of her young niece.",
    "2007_590": "With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically.",
    "2007_591": "STEAL A PENCIL FOR ME is a compelling documentary feature film by Academy Award® nominee Michèle Ohayon about the power of love and the ability of humankind to rise above unimaginable suffering. 1943: Holland is under total Nazi occupation...See moreSTEAL A PENCIL FOR ME is a compelling documentary feature film by Academy Award® nominee Michèle Ohayon about the power of love and the ability of humankind to rise above unimaginable suffering. 1943: Holland is under total Nazi occupation. In Amsterdam, Jack, an unassuming accountant, first meets Ina at a birthday party - a 20-year-old beauty from a wealthy diamond manufacturing family who instantly steals his heart. But Jack's pursuit of love will be complicated; he is poor and married to Manja, a flirtatious and mercurial spouse. When the Jews are being deported, the husband, the wife and the lover find themselves at the same concentration camp; actually living in the same barracks. When Jack's wife objects to the \"girlfriend\" in spite of their unhappy marriage, Jack and Ina resort to writing secret love letters, which sustain them throughout the horrible circumstances of the war. Jack: \"I'm a very special Holocaust survivor. I was in the camps with my wife and my girlfriend; and believe me, it wasn't easy.\"  Written by AnonymousSee less",
    "2007_592": "When Tom comes home on Valentine's Day to a \"Dear John\" Letter from his girlfriend, he spends the rest of the night talking to his four best friends about woman, sex & love until five women show up and the battle of the sexes begins.",
    "2007_593": "Chacun Sa Nuit explores the carnal inter-dependencies among a host of characters who live in a town in provincial France. At the center of it all is Pierre (Arthur Dupont), a conceited and vain bisexual musician in his late teens who acts ...See moreChacun Sa Nuit explores the carnal inter-dependencies among a host of characters who live in a town in provincial France. At the center of it all is Pierre (Arthur Dupont), a conceited and vain bisexual musician in his late teens who acts as a magnet, to varying degrees, for a whole array of characters - from his sister, Lucie (Lizzie Brochere), with whom he has a heated incestuous relationship, to a city councilor with whom he participates in gay orgies. When Pierre turns up dead, Lucie investigates the reasons for his demise and charts the network of sadomasochistic relationships that crisscross the town.See less",
    "2007_594": "A man who has struggled personally has conflicts with his upwardly mobile lawyer brother and well to-do fiancee and is reluctantly to be the best man at their wedding.",
    "2007_595": "Claudio Caballero decides to gamble $500,000 dollars in a desperate attempt to raise the cash necessary to bring the world's biggest band (U2) to Mexico.",
    "2007_596": "This film documents the train-wreck production and sudden shutdown of American Cannibal, the reality TV show produced by the promoter behind the Paris Hilton sex tape.",
    "2007_597": "The lies, betrayal, and desires of nine different groups of people are revealed as they live out their secret lives in the sight of the security cameras that capture our every movement.",
    "2007_598": "Jamie is 21. She's from Atlanta. She's come to Brooklyn to visit her friend Samantha, but she can't find her. Jamie meets a stranger named Charlie on the subway and spends 24 hours hanging out with him.",
    "2007_599": "A Gainesville Florida auto upholsterer (Giamatti) attempts to subvert his mundane life by training a wild, red-tailed hawk. Read more: Synopsis",
    "2007_6": "A rat who can cook makes an unusual alliance with a young kitchen worker at a famous restaurant.",
    "2007_60": "An attorney intending on climbing the career ladder toward success finds an unlikely opponent in a manipulative criminal he is trying to prosecute.",
    "2007_600": "A college co-ed is brutally raped and struggles alone to rebuild her life.",
    "2007_601": "\"El Inmigrante\" is a documentary film that examines the Mexican and American border crisis by telling the story of Eusebio de Haro a young Mexican migrant who was shot and killed during one of his journeys north. The film presents a ...See more\"El Inmigrante\" is a documentary film that examines the Mexican and American border crisis by telling the story of Eusebio de Haro a young Mexican migrant who was shot and killed during one of his journeys north. The film presents a distinct humanitarian focus in which story and character take precedent over policy and empiricism. Towards this end \"El Inmigrante\" examines the perspectives of a diverse cast of players in this border narrative. A cast which includes the de Haro family, the community of Brackettville, Texas-where Eusebio was shot, members of vigilante border militias in Arizona, the horseback border patrol in El Paso, and migrants en route to an uncertain future in the United States.  Written by John EckenrdoeSee less",
    "2007_602": "Questions of race, poverty, politics and religion hurdle towards each other in DESERT BAYOU, the story of 600 Hurricane Katrina evacuees who find themselves evacuated and deplaned from New Orleans and deposited into an isolated military ...See moreQuestions of race, poverty, politics and religion hurdle towards each other in DESERT BAYOU, the story of 600 Hurricane Katrina evacuees who find themselves evacuated and deplaned from New Orleans and deposited into an isolated military installation in Utah. The lives of evacuees are undone; response from government officials, the military, local citizens and a Jewish rabbi astonish.  Written by Cinema Libre StudioSee less",
    "2007_603": "Julie, a successful magazine columnist, opens Pandora's Box and seeks out the anonymous sperm donor who fathered her young son. Read more: Synopsis",
    "2007_604": "Two British Chinese gay men decides to re-examine their lives following a death of their friend. Mel sleeps around whilst rejecting the love of Todd and Ash decides to cross dress to find his knight in shining armour.",
    "2007_605": "A contemporary retelling of Shakespeare's \"Macbeth\" set in the ganglands of Melbourne.",
    "2007_606": "Jessica Yu's documentary explores the relationship between human life and Euripidean dramatic structure by weaving together the stories of four men: German terrorist, a bank robber, an \"ex-gay\" evangelist, and a martial arts student.",
    "2007_607": "Lackluster criminals look to pull a job in the Granite State.",
    "2007_608": "In order to get funds, a young woman living in the Northeast of Brazil decides to raffle her own body.",
    "2007_609": "Budget cuts force two rival ambulance companies and their misfit medics to go head-to-head to save their patients, their jobs and their beer money, all in the name of emergency medicine. Read more: Synopsis",
    "2007_61": "A spoof on previous years' epic movies (The Da Vinci Code, The Chronicles of Narnia: The Lion, the Witch and the Wardrobe + 20 more), TV series, music videos and celebs. 4 orphans are on an epic adventure.",
    "2007_610": "Through six profiles of current and past meth users we examine the crystal meth epidemic and its connection to rising HIV infection rates.",
    "2007_611": "During the 1800s, paroled Brazilian bandit Cobra Verde is sent to West Africa with a few troops to man an old Portuguese fort and to convince the local African ruler to resume the slave trade with Brazil.",
    "2007_612": "The sweatshop conditions and the growing importance of China as an exporting country on a global scale are followed through by the life of a young seventeen-year-old worker in a Chinese jeans' factory.",
    "2007_613": "Following a tip, Manabu Yazaki loses his last money betting on the older \"banba\" horse \"Unryu\" (jockied by Makie, a legendary jockey's daughter) in a draft-horse race held in his childhood home of Obihiro on the island of Hokkaido. That ...See moreFollowing a tip, Manabu Yazaki loses his last money betting on the older \"banba\" horse \"Unryu\" (jockied by Makie, a legendary jockey's daughter) in a draft-horse race held in his childhood home of Obihiro on the island of Hokkaido. That evening he seeks out his older brother Takeo, a trainer who owns a stable. Takeo is cool to his brother's return since Manabu cut off contact with Takeo and his mother 13 years earlier, after completing a degree at a Tokyo university, founding a successful company, and getting married. After finding out that Manabu's company is going bankrupt, his marriage has ended and he is hiding from his partner and creditors, Takeo offers to let his brother stay if he earns his keep as a stable hand. However, he resists letting him see their mother, who is in a nursing home. Manabu makes real friends among the stable boys, and begins to bring Unryu back into peak racing form. He also takes an interest in restoring Makie's confidence, for after winning early races as a novice she is now in a losing streak.  Written by Brian GreenhalghSee less",
    "2007_614": "Chronological exploits of Iwao Enokizu, a murderous thief on the run.",
    "2007_615": "The city of Leningrad and the blockade during the Second World War. No words. No music. Only sounds and black and white images of a dying city.",
    "2007_616": "Marion Cloete, a university-trained therapist, along with her husband and two daughters, fearlessly walked away from a privileged life in a wealthy Johannesburg suburb to establish Boikarabelo (formerly Botshabelo), an extraordinary ...See moreMarion Cloete, a university-trained therapist, along with her husband and two daughters, fearlessly walked away from a privileged life in a wealthy Johannesburg suburb to establish Boikarabelo (formerly Botshabelo), an extraordinary village and school that provide shelter, food, and education to more than 550 South African children.  Written by AnonymousSee less",
    "2007_617": "East of Havana is a blunt, unflinching close-up on the lives of three young rappers compelled to address their generation's future from the confines of a Cuban ghetto. Soandry, Magyori, and Mikki are the defacto leaders of Cuba's ...See moreEast of Havana is a blunt, unflinching close-up on the lives of three young rappers compelled to address their generation's future from the confines of a Cuban ghetto. Soandry, Magyori, and Mikki are the defacto leaders of Cuba's rebellious underground hip hop movement. Possessing the undeniable talent and charisma of pop icons, these fearless performers push self-expression to its sharpest, riskiest, and most triumphant point.  Written by AnonymousSee less",
    "2007_618": "After years of being home schooled by hippie parents, Emerson is enrolled at his local high school. The intelligent and androgynous youth confounds his classmates and captures the attention of his English teacher. The teacher-student ...See moreAfter years of being home schooled by hippie parents, Emerson is enrolled at his local high school. The intelligent and androgynous youth confounds his classmates and captures the attention of his English teacher. The teacher-student relationship leads to problems for everyone involved.  Written by AnonymousSee less",
    "2007_619": "",
    "2007_62": "A team of U.S. government agents are sent to investigate the bombing of an American facility in the Middle East.",
    "2007_620": "A gay theater-obsessed Texan high school senior has his heart set on Broadway stardom with an eye out for love. With the help of his 300-pound best girl friend, he embarks on a winning journey of self discovery.",
    "2007_621": "The popular reaction to a German museum exhibit detailing the war crimes and atrocities committed by Nazi Germany's regular armed forces is explored.",
    "2007_622": "A horny college freshman feigns being gay to be near the beautiful co-ed of his desires.",
    "2007_623": "A gang member, suffering from severe memory loss, searches for his brother's murderer. He secretly enlists the aid of the investigating Detective, while other members of his gang are mysteriously and sadistically murdered.",
    "2007_624": "During a Midwestern winter, two working-class brothers must cope with their recently incarcerated father.",
    "2007_625": "Famous pianist Zetterström returns home to his native Denmark, to give a concert, just to find out that the choices he has made in his life have affected his love life greatly.",
    "2007_626": "The social anxiety of a morbidly shy Ecuadorian dishwasher working in a Queens diner provides the psychological engine that powers this blend of drama and magical realism.",
    "2007_627": "A documentary on the relationship between curator Sam Wagstaff, photographer Robert Mapplethorpe, and musician/poet Patti Smith.",
    "2007_628": "A feisty young woman returns to Glasgow to run her deceased father's curry house.",
    "2007_629": "Hitchcockian film noir/thriller set in the exclusive resort community of The Hamptons. Trophy husband Davis Meyers meets local investigator Linus. Davis Meyers' ill-fated attempt to produce an heir leads to infidelity, murder and tragic ...See moreHitchcockian film noir/thriller set in the exclusive resort community of The Hamptons. Trophy husband Davis Meyers meets local investigator Linus. Davis Meyers' ill-fated attempt to produce an heir leads to infidelity, murder and tragic consequences. Classic film noir in the style of the '40s and '50s.  Written by Robert NewmanSee less",
    "2007_63": "Biopic of the iconic French singer Édith Piaf. Raised by her grandmother in a brothel, she was discovered while singing on a street corner at the age of 19. Despite her success, Piaf's life was filled with tragedy.",
    "2007_630": "A documentary about the Crispus Attucks Tigers, the first all-black high school basketball team to win a US state championship.",
    "2007_631": "A pair of slackers get in way over their heads when they try to dump the body of a dead girlfriend in the basement of a drive-in movie theater where a satanic cult performs ritual sacrifices.",
    "2007_632": "Young fantasy and science fiction aficionado Gavin Gore and his friends stumble onto some huge footprints in the woods. A local cop, reporter, and a renowned Sasquatch authority investigate, while two of Gavin's dim-witted neighbors hatch ...See moreYoung fantasy and science fiction aficionado Gavin Gore and his friends stumble onto some huge footprints in the woods. A local cop, reporter, and a renowned Sasquatch authority investigate, while two of Gavin's dim-witted neighbors hatch a scheme to profit from the situation.See less",
    "2007_633": "A nearly illiterate woman becomes one of the founders of Poland's Solidarity union.",
    "2007_634": "Based on the Aramoana Massacre that occurred on 13 November and 14 November 1990. Resident David Gray, an unemployed gun collector, went on a rampage in which 13 people were shot dead, before Gray himself was shot by police.",
    "2007_635": "Three quirky families seeking to buy their next home collide when trying to purchase the same property. The bidding war tests the limits of their marriages and the resolve of their agents.",
    "2007_636": "A Mexican national, Jesus Feliciano, returning to California from Iraq where he had soldiered in exchange for grant of US citizenship, suffers trauma related to his battle experience and imagines his family life threatened.",
    "2007_637": "From his childhood in Valparaiso to his death during the Pinochet military coup on September 11, 1973, the life and works of Chilean president Salvador Allende.",
    "2007_638": "With a poetic nod to Fellini, Leonardo Ricagni uses the carnival atmosphere to transport the viewer to a magical place where realism and surrealism live side by side in Uruguay - and what a wonderful place to be.",
    "2007_639": "A tale based on the life of the inventor of the original \"Iron Man\".",
    "2007_64": "In the late 1960s/early 1970s, a San Francisco cartoonist becomes an amateur detective obsessed with tracking down the Zodiac Killer, an unidentified individual who terrorizes Northern California with a killing spree.",
    "2007_640": "It is May 1520 in the vast Aztec Empire one year after the Spanish Conqueror Hernán Cortes' arrival in Mexico. \"The Other Conquest\" opens with the infamous massacre of the Aztecs at the Great Temple of Tenochtitlan [what is now called ...See moreIt is May 1520 in the vast Aztec Empire one year after the Spanish Conqueror Hernán Cortes' arrival in Mexico. \"The Other Conquest\" opens with the infamous massacre of the Aztecs at the Great Temple of Tenochtitlan [what is now called Mexico City]. The sacred grounds are covered with the countless bodies of priests and nobility slaughtered by the Spanish Armies under Cortes' command. The lone Aztec survivor of the massacre is a young Indian scribe named Topiltzin [Damián Delgado]. Topiltzin, who is the illegitimate son of the Aztec Emperor Moctezuma, survives the onslaught by burying himself under a stack of bodies. As if awakening from a dream, the young man rises from among the dead to find his mother murdered, the Spanish in power and the dawn of a new era in his native land. A New World with new leaders, language, customs... and God. Representing the New Order is the Spanish Friar Diego [Jose Carlos Rodríguez]. His mission is to convert the \"savage\" natives into civilised Christians; to replace their human sacrifices and feathered deities with public Christenings and fealty to the Blessed Virgin Mary. With Topiltzin, Friar Diego faces his most difficult spiritual and personal challenge, for when Topiltzin is captured by Spanish troops and presented to Cortes [Iñaki Aierra], the Spanish Conqueror places Topiltzin's conversion under Friar Diego's care. Old world confronts the New as Topiltzin struggles to preserve his own beliefs, whilst Friar Diego attempts to impose his own. Moreover, all the while, the question remains: Who is converting whom?  Written by Dennis Davidson Associates (DDA)See less",
    "2007_641": "Quebec Bill Bohomme is a hardy schemer and dreamer, who, desperate to raise money to preserve his endangered herd through the rapidly approaching winter, resorts to whiskey-smuggling, a traditional family occupation. Quebec Bill takes his ...See moreQuebec Bill Bohomme is a hardy schemer and dreamer, who, desperate to raise money to preserve his endangered herd through the rapidly approaching winter, resorts to whiskey-smuggling, a traditional family occupation. Quebec Bill takes his son, Wild Bill, on the journey. Also Henry Coville, an inscrutable whiskey smuggler, and Rat Kinneson, Quebec Bill's perpetually disconsolate ex-con hired man. Together, they cross the border into vast reaches of Canadian wilderness for an unforgettable four days \"full of terror, full of wonder.\"  Written by Jay CravenSee less",
    "2007_642": "A lyrical documentary about the experience of casting actresses for a dramatic film. Read more: Synopsis",
    "2007_643": "While most sports films celebrate the quest for a championship, \"Quantum Hoops\" follows a team that is searching for a single win. The documentary chronicles the final week of the 2006 Caltech basketball season. The team is currently in ...See moreWhile most sports films celebrate the quest for a championship, \"Quantum Hoops\" follows a team that is searching for a single win. The documentary chronicles the final week of the 2006 Caltech basketball season. The team is currently in the midst of a 21 year losing streak - over 240 consecutive conference losses. Caltech is annually considered one of the top 5 academic institutions in the world yet its athletic department always takes a back seat to the achievements of its world renowned faculty, Nobel prize winners, and advancements in the world of science and technology. The film \"Real Genius\" was a not-so-subtle take on Caltech life. To the casual fan, the team might sound like a bad joke. There are more valedictorians on the team than players with high school basketball experience. In fact, the 5 seniors did not play high school basketball, yet all five are major contributors to the team. They are roundly mocked by opposing fans as \"nerds playing basketball\" (the few fans that decide its even worth it to show up). However, this season would mark an amazing turnaround from just two years ago when the team would lose by an average margin of over 60 points per game. Against remarkable odds and adversity, the players and coaches dedication, discipline, heart, and yes, SKILL would make for one of the most exciting seasons in school history. The final home game of the year would give the 5 seniors one last shot at that elusive win and an entry into the history books of college athletics.  Written by Rick GreenwaldSee less",
    "2007_644": "The Camden 28 explores how and why 28 individuals intentionally placed themselves at risk of arrest and imprisonment while protesting the war in Vietnam. Featuring a treasure of archival materials and current interviews with former FBI ...See moreThe Camden 28 explores how and why 28 individuals intentionally placed themselves at risk of arrest and imprisonment while protesting the war in Vietnam. Featuring a treasure of archival materials and current interviews with former FBI agents involved in the case and scholars such as Howard Zinn, The Camden 28 is a story about a potent form of dissent that has special relevance to our current political climate.  Written by Pedro AfonsoSee less",
    "2007_645": "A teenage boy longs to win the attention of his emotionally distant father.",
    "2007_646": "A mockumentary that illuminates penguin survival and mating rituals, as well as one bird's search for love while on a seventy-mile trek with his hedonistic buddies.",
    "2007_647": "A unique documentary about troops' experiences in Iraq and Afghanistan, based on writings by soldiers, Marines, and air men. Some writings were published in the New Yorker in summer 2006. A larger assortment was published as a book by ...See moreA unique documentary about troops' experiences in Iraq and Afghanistan, based on writings by soldiers, Marines, and air men. Some writings were published in the New Yorker in summer 2006. A larger assortment was published as a book by Random House last September. The film drew upon the submissions by soldiers for the book. It's a remarkable portrait of troops at war - the complexities, doubts, and fears - written with honesty. The 81-minute version of the film (which will be in theatres) includes 11 pieces of writing, with different visual strategies, along with interviews with the writers, and with more established American writers who are also veterans. In the latter group are Tim O'Brien, Yusef Komunyakaa, Tobias Wolff, Joe Haldeman, James Salter, Anthony Swofford, Richard Currey, and Paul Fussell. The visual approaches range from poet Brian Turner reading directly to camera, to archival footage, to an animated \"graphic novel,\" to a still photo sequence shot by photographer Antonin Kratochvil. It's rooted in a program by the NEA that created a series of writing workshops at military bases. After those workshops, the writers submitted pieces for consideration in the book, edited by Andy Carroll. From those writings were selected 11 for inclusion in the film. There is also a 53-minute version of this film which will be airing on PBS as part of the series \"America at a Crossroads\" in April, 2007. Both of these are different from the other film 'Operation Homecoming\" from 2007, directed by Lawrence Bridges. That piece was produced by the NEA as a documentary about their writing workshops.  Written by Adam Hyman, co-producerSee less",
    "2007_648": "A documentary that chronicles Pras Michel's 9-day experiment as a homeless man in downtown Los Angeles.",
    "2007_649": "In ten minutes, everything can change - for these ten people, it will. An innovative real-time crime thriller in which the murderous events of one fateful day, committed between 11:50am and noon, are replayed from different points of view.",
    "2007_65": "A depressed woman learns that her husband was killed in a car accident the previous day, then awakens the next morning to find him alive and well at home; then awakens the day after that to find that he's dead.",
    "2007_650": "An unconventional love triangle between three childhood buddies; two girls, one born with Down syndrome, and one boy, who all grow up fighting who they are inside, how they are perceived by society as a whole, and who they ultimately ...See moreAn unconventional love triangle between three childhood buddies; two girls, one born with Down syndrome, and one boy, who all grow up fighting who they are inside, how they are perceived by society as a whole, and who they ultimately strive to become as individuals through the obstacles that are inherently present.  Written by Tom LeeSee less",
    "2007_651": "Annabelle Gurwitch's first-person take on getting the axe.",
    "2007_652": "Bisexual travel writer Nathan examines his increasingly complex feelings for Maggie as they travel through California's wine country on assignment.",
    "2007_653": "Two young Kurdish refugees, recently arrived in Germany struggle to make their way through the harshness of the occidental city. Their encounter with a gang of Turks will rapidly led them into an inevitable tragical spiral filled with ...See moreTwo young Kurdish refugees, recently arrived in Germany struggle to make their way through the harshness of the occidental city. Their encounter with a gang of Turks will rapidly led them into an inevitable tragical spiral filled with death and revenge  Written by AnonymousSee less",
    "2007_654": "Sachiko Hanai is a call girl. One day she is caught up in a gunfight and is shot in the forehead. Instead of killing her, the bullet in her head gives her psychic powers. She also accidentally comes into possession of a cylinder containing...See moreSachiko Hanai is a call girl. One day she is caught up in a gunfight and is shot in the forehead. Instead of killing her, the bullet in her head gives her psychic powers. She also accidentally comes into possession of a cylinder containing George W. Bush's finger, whose fingerprint is designed to launch a nuclear missile, and international spies are soon chasing her.  Written by Masood Meery, Mashhad, IRANSee less",
    "2007_655": "An inside look at what it took to bring the Wu-Tang Clan together for their final performance at the Rock the Bells Hip-Hop festival.",
    "2007_656": "For the past two decades researchers, activists, scientists, and progressive politicians have struggled to rouse the public and the federal government to take action on global warming. Concurrently, naysayers, industry funded think-tanks ...See moreFor the past two decades researchers, activists, scientists, and progressive politicians have struggled to rouse the public and the federal government to take action on global warming. Concurrently, naysayers, industry funded think-tanks and lobbyists have worked tirelessly to challenge, convolute and dismiss the issue as hysterical. Everything's Cool tells the harrowing story of what it takes to talk about global warming -- the art of duking it out with collective denial, the struggle to communicate the urgency of the crisis to an indifferent public and a laggard United States government. We follow a cadre of messengers who are passionate, exasperated, driven by fear, hope and a deep appreciation for the ever shrinking window of time we have to stop global warming. THE STORY AS IT IS EVOLVING We take to the road with veteran global warming messenger and author Ross Gelbspan, as he launches \"Boling Point\" -- his \"last\" and \"final\" book on the issue. We are behind the scenes at the Weather Channel for the education of Dr. Heidi Cullen, a climatologist cum television personality, who has the unique and often excruciating task of reporting and/explaining climate change in sound-bites fit for a primetime audience. We film a group of citizen-activists -- ages 18 to 80 - training for their inevitable \"elevator speech\" - their chance to tell the right story to the right audience at the right time and rouse the sleeping country. They are the Paul Reveres of the next energy revolution. Meanwhile the national NGOs, who have been working on the crisis of global warming for the past two decades -- including National Resources Defense Council, Greenpeace, Environmental Defense, - along with Moveon.org pin their oft-dashed messaging hopes on a summer Hollywood blockbuster. \"The Day After Tomorrow\" does what they've never been able to do. It fictionalizes every difficult aspect of global warming into a nightmarish, but undeniably compelling message. The impacts are severe and immediate, the rich countries are devastated, the skeptics, the delayers and the recalcitrant feds are taught their lessons, and it all happens in the time-span of a long weekend. For a moment it seems to be working- newspapers have cover stories, news programs devote entire segments to global warming -- the issue is finally in play! Activists, scientists even former VP Al Gore are in almost all the press coverage speaking right on message: \"this might be over the top and science fiction, but global warming is real and happening now.\" But our collective attention span is short. Spiderman 2 and Fahrenheit 911 soon push The Day After Tomorrow out of the theaters. The public discourse moves on leaving the issue profile of global warming essentially unchanged and mired near the very bottom of the issue heap coming into the election of 2004. Now what?  Written by Helfand, JudithSee less",
    "2007_657": "The story of a woman's attempt to reinvent her life after a tragedy. It takes years, but the dark, dormant emotions find their way to the surface and her life spirals out of control. When all else fails, she runs to the only place that is ...See moreThe story of a woman's attempt to reinvent her life after a tragedy. It takes years, but the dark, dormant emotions find their way to the surface and her life spirals out of control. When all else fails, she runs to the only place that is safe...the past.  Written by Jason RuscioSee less",
    "2007_658": "After serving nine years in prison for the revenge-murder of an opposing gang member, Dyno returns home. He is torn between his loyalty to his gang family and his loyalty to his wife and daughter.",
    "2007_659": "Set in 1948 against the backdrop of Communism's rise, \"Fei\" is the story of two sisters--Fei and Ying--bound together by the will of their late father, a legendary business entrepreneur, and their shared love for a charismatic ex-boxer, ...See moreSet in 1948 against the backdrop of Communism's rise, \"Fei\" is the story of two sisters--Fei and Ying--bound together by the will of their late father, a legendary business entrepreneur, and their shared love for a charismatic ex-boxer, Huang. They are two women whose paths have been dictated by the often cruel decrees of the men their lives--two women who must somehow transcend that influence...or lose everything.  Written by SKSee less",
    "2007_66": "After the death of his parents during World War II, young Hannibal Lecter moves in with his beautiful aunt and begins plotting revenge on the barbarians responsible for his sister's death.",
    "2007_660": "An awkward robber named Vincent Papineau seizes a cheap painting during a burgling of routine in Montreal. Reselling for a bread bite, he learns that it concealed 50 000$ dissimulated in it's frame and that it belonged in fact to a certain...See moreAn awkward robber named Vincent Papineau seizes a cheap painting during a burgling of routine in Montreal. Reselling for a bread bite, he learns that it concealed 50 000$ dissimulated in it's frame and that it belonged in fact to a certain Carlo, boss of the Marseillaise Maffia. In fact, the name of Carlo is the diminutive of... Carlotta Luciani, expert in vendettas. Carlotta launches out the search of her painting, in company of Marius, her henchman. The chance smile to Vincent, disguised as a priest to escape his prosecutors, he is noticed by two police officers who mistake him for Claude Laurin, a colleague of the \"brigade\" that everyone believed on vacation. Conscious that it will be uncovered at the return of the true cop Claude Laurin of which he usurped the identity, Vincent profits from it to elaborate an incredible plan with his friend Dieudonne.  Written by See less",
    "2007_661": "Berkeley is the story of Ben Sweet, an eighteen year old boy who comes to UC Berkeley in 1968 to study accounting and avoid the draft. There begins an odyssey through sex, drugs, rock and roll, and political activism which turns his world ...See moreBerkeley is the story of Ben Sweet, an eighteen year old boy who comes to UC Berkeley in 1968 to study accounting and avoid the draft. There begins an odyssey through sex, drugs, rock and roll, and political activism which turns his world upside down and leaves him on a path of exploration and self-discovery, far from the life of his father, Sy Sweet. The film depicts a group of young people protesting the Vietnam War.  Written by AnonymousSee less",
    "2007_662": "Reed Fish's life turns into chaos when a high school crush returns to Mud Meadows on the eve of his marriage to the small town's sweetheart.",
    "2007_663": "Determined to escape their poverty-stricken lives, four talented young women living on the underprivileged outskirts of Sao Paulo, Brazil, form an all-female rap group but find their road to success is riddled with sexism, racism, and ...See moreDetermined to escape their poverty-stricken lives, four talented young women living on the underprivileged outskirts of Sao Paulo, Brazil, form an all-female rap group but find their road to success is riddled with sexism, racism, and violence. One by one, they succumb to their grim realities. Until they discover that out of struggle come strength, and out of strength, the courage to continue on.  Written by Echo Bridge Home EntertainmentSee less",
    "2007_664": "On the Caribbean island of the Dominican Republic, tourists flock to pristine beaches, with little knowledge that a few miles away thousands of dispossessed Haitians are under armed guard on plantations harvesting sugarcane, most of which ...See moreOn the Caribbean island of the Dominican Republic, tourists flock to pristine beaches, with little knowledge that a few miles away thousands of dispossessed Haitians are under armed guard on plantations harvesting sugarcane, most of which ends up in US kitchens. Cutting cane by machete, they work 14 hour days, 7 days a week, frequently without access to decent housing, electricity, clean water, education, healthcare or adequate nutrition. The Price of Sugar follows a charismatic Spanish priest, Father Christopher Hartley, as he organizes some of this hemisphere's poorest people, challenging the powerful interests profiting from their work. This film raises key questions about where the products we consume originate, at what human cost they are produced and ultimately, where our responsibility lies.  Written by Louise Rosen Ltd.See less",
    "2007_665": "An exploration into the mysterious life of the late jazz vocalist Jackie Paris, which examines the question of how much we need to know about an artist's life to appreciate their art.",
    "2007_666": "A freedom-loving Iraqi journalist is mistaken as Tony Blair's would-be assassin and sent to Abu Ghraib Prison where he discovers the true meaning of liberation.",
    "2007_667": "Vargas, a 54 year old man, gets out of jail in the prvince of Corrientes, Argentina. Once released, he wants to find his now adult daughter, who lives in a swampy and remote area. To get there, he must cross great distances in a small boat...See moreVargas, a 54 year old man, gets out of jail in the prvince of Corrientes, Argentina. Once released, he wants to find his now adult daughter, who lives in a swampy and remote area. To get there, he must cross great distances in a small boat on the rivers, scoring deep into the jungle. Vargas is a quiet and self-contained man. He possesses the restraint of those living close to nature. A deep mystery surrounds him, the people he encounters and the places he goes through, all that taking in the unalterable world he finds almost unchanged after his long years of incarceration.  Written by anonymousSee less",
    "2007_668": "An eclectic group of people drawn from all walks of life find themselves under one roof for twenty-eight days with one thing in common, addiction.",
    "2007_669": "",
    "2007_67": "A skilled London police officer is transferred to a small town with a dark secret.",
    "2007_670": "Documentary about rock pioneer Roky Erickson, detailing his rise as a psychedelic hero, his lengthy institutionalization, his descent into poverty and filth, and his brother's struggle with their religious mother to improve Roky's care.",
    "2007_671": "In 2002, three French neofascist skinheads went to a public park in Rheims looking for an 'Arab' to attack when they came across Francois Chenu, a young gay man.",
    "2007_672": "Two small-time comics set their sights on the big city with a plan to become the next stand-up sensation, only to find out just how far one can fall when the bottom of the barrel drops out.See moreTwo small-time comics set their sights on the big city with a plan to become the next stand-up sensation, only to find out just how far one can fall when the bottom of the barrel drops out.  Written by Thomas MichaelSee less",
    "2007_673": "It accounts the events before and after one the most important events during that time, and they were told through eyewitnesses who were living at that time.",
    "2007_674": "Reverend Robert Gibbs is a young, hip pastor who temporarily takes over the helm of a Fundamentalist Baptist church while his predecessor Reverend Matthews recovers from a stroke. While trying to impress Reverend Matthews, Gibbs has to win...See moreReverend Robert Gibbs is a young, hip pastor who temporarily takes over the helm of a Fundamentalist Baptist church while his predecessor Reverend Matthews recovers from a stroke. While trying to impress Reverend Matthews, Gibbs has to win the approval of his congregation, the Deacon board, and most importantly Reverend Matthews? daughter Divine, who has recently lost her faith in God.  Written by Bullz Eye ProductionsSee less",
    "2007_675": "An unprecedented view of the deep secrets and deep pockets of the pro-life movement. Read more: Synopsis",
    "2007_676": "A man's journey to win back his former love forces him to comfront a past of emotional immaturity, drinking, and thwarted artistic ambitions.",
    "2007_677": "In Los Angeles, a depressed writer named Solo has writer's block after a successful first book of which he's ashamed, and he's broke, thanks to a year in classical psychoanalysis. In their final session, his therapist suggests that he gets...See moreIn Los Angeles, a depressed writer named Solo has writer's block after a successful first book of which he's ashamed, and he's broke, thanks to a year in classical psychoanalysis. In their final session, his therapist suggests that he gets a pet, so Solo buys a scrawny terrier that adds to his problems: the dog isn't house-trained; he owes money to a thug who's angry; at a dog park, he begs a woman he's just met to pay the veterinarian's bill when the dog is bitten; and his friend Casper has introduced him to a persistent rich girl who decides that she wants the dog. He could sell, settle his debts, and return to life with a clean carpet, or he could figure out why he doesn't want to part with the dog.  Written by See less",
    "2007_678": "\"The Trials of Darryl Hunt\" is a feature documentary about a brutal rape/murder case and a wrongly convicted man, Darryl Hunt, who spent nearly twenty years in prison for a crime he did not commit. Both a social justice story and a ...See more\"The Trials of Darryl Hunt\" is a feature documentary about a brutal rape/murder case and a wrongly convicted man, Darryl Hunt, who spent nearly twenty years in prison for a crime he did not commit. Both a social justice story and a personally driven narrative, the film chronicles this capital case from 1984 through 2004. With exclusive footage from two decades, the film frames the judicial and emotional response to a chilling crime - and the implications that reverberate from Hunt's conviction - against a backdrop of class and racial bias in the South and in the American criminal justice system. This documentary is the culmination of ten years of research and filming. In 1993, inspired by claims of injustice and police conspiracy, the filmmakers began to shoot in North Carolina. Working from a mix of formats (16mm and 24P video) the film melds the visceral reality of a murder case with first person accounts and cinematic imagery, illuminating perceptions and memories of events as they unfolded for the people closest to this haunting story. This unique look at one man's loss and redemption challenges the assumption that all Americans have the right to unbiased justice. Hunt's story - while one man's personal journey - reflects systemic issues of national concern: cross-racial eyewitness identification, prosecutorial misconduct, inexperienced defense attorneys assigned to capital cases, racial bias in death penalty cases and errors in police procedure. Barry Scheck from The Innocence Project, who worked on Hunt's case for ten years, and Gary Wells, professor and eyewitness expert, offer concrete examples where errors occurred in Hunt's saga and offer future remedies and effective ideas to prevent future \"Darryl Hunts.\" Hunt himself addresses the need for systemic reforms to prevent wrongful convictions, underscoring the haunting reality that Hunt could have been sentenced to death and we would never have known this story.  Written by Annie SundbergSee less",
    "2007_679": "Cheyenne, a journalist, decides to leave Paris after being laid off and to settle down in the middle of nowhere, far from the society she hates.The trouble is that she leaves Sonia, her true love, behind. The latter, a teacher who loves ...See moreCheyenne, a journalist, decides to leave Paris after being laid off and to settle down in the middle of nowhere, far from the society she hates.The trouble is that she leaves Sonia, her true love, behind. The latter, a teacher who loves her job, refuses to give up everything -including her comfort- to follow her. Sonia makes all the efforts in the world to forget Cheyenne, whether in the arms of Pierre, a charming anarchist, or in those of Beatrice, a gay woman who soon proves perverse and dangerous, only to realize that her heart belongs to Cheyenne and nobody else. If Cheyenne does not come back, Sonia feels life is not worth living any longer...  Written by Guy BellingerSee less",
    "2007_68": "After being committed for 17 years, Michael Myers, now a grown man and still very dangerous, escapes from the mental institution and immediately returns to Haddonfield to find his baby sister, Laurie.",
    "2007_680": "When an obnoxious detective loses his gun to four young thugs, it's up to the P.T.U. (Police Tactical Unit) and their iron-willed leader to recover the weapon and clean up the mess before daybreak.",
    "2007_681": "A cereal bar manager with dreams of making it big as a rock star, is admired by the locals in town until a greedy capitalist steals his entrepreneurial business.",
    "2007_682": "A look at avant-garde filmmaker Marie Menken.",
    "2007_683": "A look at the life and work of American publisher Barney Rosset, who struggled to bring controversial works like \"Tropic of Cancer\" and \"Naked Lunch\" to publication.",
    "2007_684": "",
    "2007_69": "A woman brings her family back to her childhood home, which used to be an orphanage for handicapped children. Before long, her son starts to communicate with an invisible new friend.",
    "2007_7": "Years after a plague kills most of humanity and transforms the rest into monsters, the sole survivor in New York City struggles valiantly to find a cure in this post-apocalyptic action thriller.",
    "2007_70": "Walter Sparrow becomes obsessed with a novel that he believes was written about him, as more and more similarities between himself and his literary alter ego seem to arise.",
    "2007_71": "A Las Vegas magician who can see into the future is pursued by FBI agents seeking to use his abilities to prevent a nuclear terrorist attack.",
    "2007_72": "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.",
    "2007_73": "A mature Queen Elizabeth endures multiple crises late in her reign including court intrigues, an assassination plot, the Spanish Armada, and romantic disappointments.",
    "2007_74": "After an Alaskan town is plunged into darkness for a month, it is attacked by a bloodthirsty gang of vampires.",
    "2007_75": "When his brother is murdered, a street dancer moves to Georgia to work his way through college. He joins a fraternity's step dancing team for a competition. Will he also get an education and the girl?",
    "2007_76": "Once in 500 years, ancient mythical creatures come to Earth, wreaking havoc and destruction. This time they must be stopped.",
    "2007_77": "After spending years in California, Amir returns to his homeland in Afghanistan to help his old friend Hassan, whose son is in trouble.",
    "2007_78": "A journalist goes undercover to ferret out businessman Harrison Hill as her childhood friend's killer. Posing as one of his temps, she enters into a game of online cat-and-mouse.",
    "2007_79": "A reverend puts an engaged couple through a grueling marriage preparation course to see if they are meant to be married in his church.",
    "2007_8": "After Homer pollutes the town's water supply, Springfield is encased in a gigantic dome by the EPA and the Simpsons are declared fugitives.",
    "2007_80": "A small-time rancher agrees to hold a captured outlaw who's awaiting a train to go to court in Yuma. A battle of wills ensues as the outlaw tries to psych out the rancher.",
    "2007_81": "Struggling to recover emotionally from a brutal assault that killed her fiance and left her in a coma, a radio personality begins a quest for vengeance against the perpetrators that leaves a bloody trail across New York City.",
    "2007_82": "A meddling mother tries to set her daughter up with the right man so her kid won't follow in her footsteps.",
    "2007_83": "The young apprentice of a magical, eccentric toy store owner learns to believe in herself, and in her friends, upon learning some grave news about the future.",
    "2007_84": "A widower finds out the woman he fell in love with is his brother's girlfriend.",
    "2007_85": "During World War II era, a young woman, Wang Jiazhi, gets swept up in a dangerous game of emotional intrigue with a powerful political figure, Mr. Yee.",
    "2007_86": "An orphaned musical prodigy uses his gift to try to find his birth parents.",
    "2007_87": "A Beagle must use his newly-bestowed superpowers to defend Capitol City from mad scientist Simon Barsinister.",
    "2007_88": "Six months after the rage virus was inflicted on the population of Great Britain, the US Army helps to secure a small area of London for the survivors to repopulate and start again. But not everything goes according to plan.",
    "2007_89": "Injuries sustained by two Army rangers behind enemy lines in Afghanistan set off a sequence of events involving a congressman, a journalist and a professor.",
    "2007_9": "Benjamin Gates must follow a clue left in John Wilkes Booth's diary to prove his ancestor's innocence in the assassination of Abraham Lincoln.",
    "2007_90": "A former Christian missionary, who specializes in debunking religious phenomena, investigates a small town which seems to be suffering from the 10 biblical plagues.",
    "2007_91": "In order to keep the woman of his dreams from falling for another guy, Charlie Logan has to break the curse that has made him wildly popular with single women: Sleep with Charlie once, and the next man you meet will be your true love.",
    "2007_92": "Newlyweds Nick and Suzanne decide to move to the suburbs to provide a better life for their two kids. But their idea of a dream home is disturbed by a contractor with a bizarre approach to business. Read more: Synopsis",
    "2007_93": "A freak storm unleashes a species of bloodthirsty creatures on a small town, where a small band of citizens hole up in a supermarket and fight for their lives.",
    "2007_94": "When a Las Vegas performer-turned-snitch named Buddy Israel decides to turn state's evidence and testify against the mob, it seems that a whole lot of people would like to make sure he's no longer breathing.",
    "2007_95": "After graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way, ...See moreAfter graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters that shape his life.See less",
    "2007_96": "A Russian teenager living in London who dies during childbirth leaves clues to a midwife in her journal that could tie her child to a rape involving a violent Russian mob family.",
    "2007_97": "The big screen adaptation of Perry's stage play about the trials of marriage, and what happens to one family when a sexy young temptress arrives on the scene.",
    "2007_98": "A New York City nightclub manager tries to save his brother and father from Russian Mafia hitmen.",
    "2007_99": "An ominous darkness invades a seemingly serene sunflower farm in North Dakota, and the Solomon family is torn apart by suspicion, mayhem and murder."
}