{
    "2008_1": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
    "2008_10": "The Pevensie siblings return to Narnia, where they are enlisted to once again help ward off an evil king and restore the rightful heir to the land's throne, Prince Caspian.",
    "2008_100": "Three kids hire a low-budget bodyguard to protect them from the playground bully.",
    "2008_101": "A poor Chinese laborer learns important lessons after his son gets a strange new toy. Read more: Synopsis",
    "2008_102": "During the Iraq War, a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.",
    "2008_103": "A newly married couple discovers disturbing, ghostly images in photographs they develop after a tragic accident. Fearing the manifestations may be connected, they investigate and learn that some mysteries are better left unsolved.",
    "2008_104": "Several people start receiving voice-mails from their future selves - messages which include the date, time, and some of the details of their deaths.",
    "2008_105": "A faded professional wrestler must retire, but finds his quest for a new life outside the ring a dispiriting struggle.",
    "2008_106": "Based on a true story, a troubled and racist African-American L.A.P.D. Officer will stop at nothing to force out a friendly interracial couple who just moved in next door to him.",
    "2008_107": "Four college freshmen and best friends find that it may take more than a shared pair of jeans to help them stay in touch as their lives go in different directions.",
    "2008_108": "The story of two outlaws and a bounty hunter in 1940s Manchuria and their rivalry to possess a treasure map while being pursued by the Japanese army and Chinese bandits.",
    "2008_109": "Jackie Moon, the owner-coach-player of the American Basketball Association's Flint Michigan Tropics, rallies his teammates to make their NBA dreams come true.",
    "2008_11": "A New York City writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one of them inadvertently leads Mr. Big to jilt her.",
    "2008_110": "Dr. RJ Stevens is a talk show host who visits his family in the deep south. While there he reunites with his brother Otis, his sister Betty, his cousin/rival Clyde and his childhood love interest Lucinda Allen.",
    "2008_111": "After being mistaken for terrorists and thrown into Guantánamo Bay, stoners Harold and Kumar escape and return to the U.S., where they proceed to flee across the country with federal agents in hot pursuit.",
    "2008_112": "A chronicle of the life of 18th-century aristocrat Georgiana, Duchess of Devonshire, who was reviled for her extravagant political and personal life.",
    "2008_113": "Lifelong platonic friends Zack and Miri look to solve their respective cash-flow problems by making an adult film together. As the cameras roll, however, the duo begin to sense that they may have more feelings for each other than they previously thought.",
    "2008_114": "A hitman who's in Bangkok to pull off a series of jobs violates his personal code when he falls for a local woman and bonds with his errand boy.",
    "2008_115": "A single mom takes her family to Georgia for the funeral of her father -- a man she never met. There, her clan is introduced to the crass, fun-loving Brown family. Read more: Synopsis",
    "2008_116": "Three young houseflies stow away aboard the Apollo 11 flight to the moon.",
    "2008_117": "A frustrated and conflicted teenager arrives at a new high school to discover an underground fight club and meet a classmate who begins to coerce him into fighting.",
    "2008_118": "Tank faces the ultimate test of friendship when his best friend hires him to take his ex-girlfriend out on a lousy date in order to make her realize how great her former boyfriend is.",
    "2008_119": "A television reporter and her cameraman are trapped inside a building quarantined by the CDC, after the outbreak of a mysterious virus which turns humans into bloodthirsty killers.",
    "2008_12": "Bella Swan moves to Forks and encounters Edward Cullen, a gorgeous boy with a secret.",
    "2008_120": "In 1925, an enterprising pro football player convinces America's too-good-to-be-true college football hero to play for his team and keep the league from going under.",
    "2008_121": "Pitka, an American raised outside of his country by gurus, returns to the States in order to break into the self-help business. His first challenge is to settle the romantic troubles and subsequent professional skid of a star hockey player...See morePitka, an American raised outside of his country by gurus, returns to the States in order to break into the self-help business. His first challenge is to settle the romantic troubles and subsequent professional skid of a star hockey player whose wife left him for a rival athlete.See less",
    "2008_122": "Through the innocent eyes of Bruno, the eight-year-old son of the commandant at a German concentration camp, a forbidden friendship with a Jewish boy on the other side of the camp fence has startling and unexpected consequences.",
    "2008_123": "In 1964, a teenage girl in search of the truth about her mother runs away to a small town in South Carolina and finds a family of independent women who can connect her to her past.",
    "2008_124": "Rookie cop Denny Colt returns from the beyond as The Spirit, a hero whose mission is to fight against the bad forces in Central City.",
    "2008_125": "2 bungling, petty criminal BFFs try to rob a church, but someone from staff beat them to it. They spend the night with the church staff to get the money.",
    "2008_126": "A short-term memory loss patient sets out on his journey to avenge the death of his beloved girl.",
    "2008_127": "Two families from different walks of life learn to work together.",
    "2008_128": "Scampia Vele is the corbusian architecture which has become a stronghold for Mafia of Naples, Italy.",
    "2008_129": "Over the course of one evening, an unsuspecting group of twenty-somethings find themselves bombarded by a series of natural disasters and catastrophic events.",
    "2008_13": "In the Far East, Alex O'Connell, the son of famed mummy fighters Rick and Evy O'Connell, unearths the mummy of the first Emperor of Qin -- a shape-shifting entity cursed by a witch centuries ago.",
    "2008_130": "Guilt-stricken after a job gone wrong, hitman Ray and his partner await orders from their ruthless boss in Bruges, Belgium, the last place in the world Ray wants to be.",
    "2008_131": "High school student Nick O'Leary, member of the Queercore band The Jerk Offs, meets college-bound Norah Silverberg when she asks him to be her boyfriend for five minutes.",
    "2008_132": "In an attempt to save his marriage, a firefighter uses a 40-day experiment known as \"The Love Dare.\"",
    "2008_133": "In London for his daughter's wedding, a rumpled man finds his romantic spirits lifted by a new woman in his life.",
    "2008_134": "A family's moral codes are tested when Ray Tierney investigates a case that reveals an incendiary police corruption scandal involving his own brother-in-law. For Ray, the truth is revelatory, a Pandora's Box that threatens to upend not ...See moreA family's moral codes are tested when Ray Tierney investigates a case that reveals an incendiary police corruption scandal involving his own brother-in-law. For Ray, the truth is revelatory, a Pandora's Box that threatens to upend not only the Tierney legacy but the entire NYPD.See less",
    "2008_135": "Animated fable about a cliche hunchbacked evil scientist's assistant who aspires to become a scientist himself, much to the displeasure of the rest of the evil science community.",
    "2008_136": "Two bumbling store clerks inadvertently erase the footage from all of the tapes in their video rental store. In order to keep the business running, they re-shoot every film in the store with their own camera, with a budget of zero dollars.",
    "2008_137": "A breathtaking, goose flesh igniting, awe inspiring love journey of an ordinary man Suri and his 'total opposite' love Taani.",
    "2008_138": "A chronicle of the life and Presidency of George W. Bush.",
    "2008_139": "Teacher and novelist François Begaudeau plays a version of himself as he negotiates a year with his racially mixed students from a tough Parisian neighborhood.",
    "2008_14": "A Mumbai teenager reflects on his life after being accused of cheating on the Indian version of \"Who Wants to be a Millionaire?\".",
    "2008_140": "A comic caper about Happy Singh, a Punjabi villager who goes through a series of misadventures and eventually becomes the Kinng of the Australian underworld.",
    "2008_141": "Two friends hired to police a small town that is suffering under the rule of a rancher find their job complicated by the arrival of a young widow.",
    "2008_142": "When straight arrow FBI agent Roy Clayton heads up the investigation into a dangerous international conspiracy, all clues seem to lead back to former U.S. Special Operations officer, Samir Horn.",
    "2008_143": "A dramatic retelling of the post-Watergate television interviews between British talk-show host David Frost and former president Richard Nixon.",
    "2008_144": "Bertram Pincus is a man whose people skills leave much to be desired. When Pincus dies unexpectedly, but is miraculously revived after seven minutes, he wakes up to discover that he now has the annoying ability to see ghosts.",
    "2008_145": "A look at Germany's terrorist group, The Red Army Faction (RAF), which organized bombings, robberies, kidnappings and assassinations in the late 1960s and '70s.",
    "2008_146": "A sixteenth century love story about a marriage of alliance that gave birth to true love between a great Mughal emperor, Akbar, and a Rajput princess, Jodha.",
    "2008_147": "Three female employees of the Federal Reserve plot to steal money that is about to be destroyed.",
    "2008_148": "When a Russian mobster orchestrates a crooked land deal, millions of dollars are up for grabs, drawing in the entire London underworld into a feeding frenzy at a time when the old criminal regime is losing turf to a wealthy foreign mob.",
    "2008_149": "Destiny makes two brothers- Ranvir and Rajiv - enemies of each other. Everything is fair in love and war.",
    "2008_15": "A frustrated office worker learns that he is the son of a professional assassin and that he shares his father's superhuman killing abilities.",
    "2008_150": "A ex-dancer has a heart problem and even with a transplant, he may still only have a few months to live. Time's spent looking at people/life in Paris from his balcony. His single mom sister moves in with her 3 kids to look after him.",
    "2008_151": "A young Mexican boy illegally travels to the U.S. to find his mother (who is illegally in the U.S.) after his grandmother passes away.",
    "2008_152": "A leisurely Mexican holiday takes a turn for the worse when a group of friends and a fellow tourist embark on a remote archaeological dig in the jungle, where something evil lives among the ruins. Read more: Synopsis",
    "2008_153": "A 3-D presentation of U2's global \"Vertigo\" tour. Shot at seven different shows, this production employs the greatest number of 3-D cameras ever used for a single project.",
    "2008_154": "When talk radio host Emma Lloyd advises one of her listeners to break up with her boyfriend, the jilted ex sets about getting his revenge.",
    "2008_155": "A futuristic action thriller where a team of people work to prevent a disaster threatening the future of the human race.",
    "2008_156": "A woman struggles to interact with her family and find her place in society after spending fifteen years in prison.",
    "2008_157": "A ghost tries to sabotage her former boyfriend's current relationship with a psychic.",
    "2008_158": "Two best friends being convinced that they are not in love search for each other's love.",
    "2008_159": "A city is ravaged by an epidemic of instant white blindness.",
    "2008_16": "Tells the story of Benjamin Button, a man who starts aging backwards with consequences.",
    "2008_160": "A British writer struggles to fit in at a high-profile magazine in New York City.",
    "2008_161": "A high school senior drives cross-country with his best friends to hook up with a babe he met online.",
    "2008_162": "A look at a few chapters in the life of Poppy, a cheery, colorful, North London schoolteacher whose optimism tends to exasperate those around her.",
    "2008_163": "A young Englishman marries a glamorous American. When he brings her home to meet the parents, she arrives like a blast from the future - blowing their entrenched British stuffiness out the window.",
    "2008_164": "Based on childhood days of Teruyo Nogami.",
    "2008_165": "A college professor travels to New York City to attend a conference and finds a young couple living in his apartment.",
    "2008_166": "For generations, the people of the City of Ember have flourished in an amazing world of glittering lights. But Ember's once powerful generator is failing and the great lamps that illuminate the city are starting to flicker.",
    "2008_167": "Two straight guys pretend to be gay in order to secure a Miami apartment. When both of them fall for their roommate Neha, hilarity ensues as they strive to convince one and all that they're gay whilst secretly trying to win her heart.",
    "2008_168": "An accountant is introduced to a mysterious sex club known as The List by his lawyer friend. But in this new world, he soon becomes the prime suspect in a woman's disappearance and a multi-million dollar heist.",
    "2008_169": "When Anita Rajan, CEO of Sheppard power plant, an international Company, brings a power plant proposal to set up in rural Maharashtra before the Nagres, insightful Shankar is quick to realize the benefits the power plant can bring to the ...See moreWhen Anita Rajan, CEO of Sheppard power plant, an international Company, brings a power plant proposal to set up in rural Maharashtra before the Nagres, insightful Shankar is quick to realize the benefits the power plant can bring to the people. After convincing Sarkar who is against it for various reasons, Shankar undertakes a journey along with Anita to the villages of Maharashtra to mobilize support from the masses. However, things are not what they seem to be and Shankar's dream project gradually becomes a political minefield. It is in this backdrop the evil forces mightier than ever, mushroom and gang up to bring down the regime of Sarkar and obliterate Shankar's name from the political horizon.  Written by gavin (gunmasterM@hotmail.com)See less",
    "2008_17": "The canine star of a fictional sci-fi/action show that believes his powers are real embarks on a cross country trek to save his co-star from a threat he believes is just as real.",
    "2008_170": "Set in Cincinnati at the height of the Great Depression, Kit Kittredge, a resourceful young girl, helps her mother run a boardinghouse after her father loses his job.",
    "2008_171": "At Oxford University, a professor and a grad student work together to try to stop a potential series of murders seemingly linked by mathematical symbols.",
    "2008_172": "In a remarkable turn-of-events, the result of the presidential election comes down to one man's vote.",
    "2008_173": "A young woman who has been in and out of rehab for the past ten years, returns home for the weekend for her sister's wedding.",
    "2008_174": "Guinevere Pettigrew, a middle-aged London governess, finds herself unfairly dismissed from her job. An attempt to gain new employment catapults her into the glamorous world and dizzying social whirl of an American actress and singer, Delysia Lafosse.",
    "2008_175": "A Brooklyn-set romantic drama about a bachelor torn between the family friend his parents wish he would marry and his beautiful but volatile new neighbor.",
    "2008_176": "A career-spanning documentary on The Rolling Stones, with concert footage from their \"A Bigger Bang\" tour.",
    "2008_177": "A girl with PTSD attempts to refresh her life at a new school, but soon finds it impossible when she's afflicted by not only bullying and bad memories, but also the supernatural.",
    "2008_178": "Cultural critic David Kepesh finds his life, which he indicates is a state of \"emancipated manhood\", thrown into tragic disarray by Consuela Castillo, a well-mannered student who awakens a sense of sexual possessiveness in her teacher.",
    "2008_179": "Bill Maher's take on the current state of world religion.",
    "2008_18": "Horton the Elephant struggles to protect a microscopic community from his neighbors who refuse to believe it exists.",
    "2008_180": "A poignant story of forbidden love and the loss of innocence set in England prior to World War II.",
    "2008_181": "Three lazy misfits - very timid Elliot (Larry the Cucumber), lazy Sedgewick (Mr. Lunt) and no self-confident George (Pa Grape) - dream of the day of putting on a show about pirates. With their own problems of might not having this dream ...See moreThree lazy misfits - very timid Elliot (Larry the Cucumber), lazy Sedgewick (Mr. Lunt) and no self-confident George (Pa Grape) - dream of the day of putting on a show about pirates. With their own problems of might not having this dream come true, they soon find themselves traveling back in time into the 17th century and begin a quest to rescue a royal family from an evil tyrant, and learn about being pirates.  Written by rocknrollunderdawgSee less",
    "2008_182": "Moving into a new house, a family witnesses an unfriendly ghost who wants to drive them away from the house. However, he befriends a little boy who changes his outlook forever.",
    "2008_183": "A man is charged with murder. He is Pigoil, the aging stage manager at Chansonia, a music hall in a Paris faubourg. His confession is a long flashback to New Year's Eve, 1935, when he discovers his wife is unfaithful and Galapiat, the ...See moreA man is charged with murder. He is Pigoil, the aging stage manager at Chansonia, a music hall in a Paris faubourg. His confession is a long flashback to New Year's Eve, 1935, when he discovers his wife is unfaithful and Galapiat, the local mobster, closes the music hall. Over the next few months, Pigoil loses custody of his beloved son, Jo-Jo, and must find work. Pigoil and his pals take over the Chansonia as a co-op; Galapiat is momentarily benign. Their star is the young Douce, a girl from near Lille for whom Galapiat lusts. She in turn falls in love with Milou, a local Red. There are ups and downs, but mostly ups - but what about Jo-Jo and what about the murder?  Written by See less",
    "2008_184": "After Rudi's wife Trudi suddenly dies, he travels to Japan to fulfill her dream of being a Butoh dancer.",
    "2008_185": "Though it's been about twenty years since they have spoken with one another, two estranged soul-singing legends agree to participate in a reunion performance at the Apollo Theater to honor their recently deceased band leader.",
    "2008_186": "Into the life of a widowed professor comes a new love and an unexpected visit from his adopted brother.",
    "2008_187": "The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history. Read more: Synopsis",
    "2008_188": "Raj is a heartbreaker. His love stories with Mahi, Radhika and Gayatri finally teach him about love and life in their own sweet, sexy and sassy way.",
    "2008_189": "A look at the strange bereavement behavior of an Italian executive. Based on a novel by Sandro Veronesi.",
    "2008_19": "Disgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, Thao Lor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino.",
    "2008_190": "What happens when you throw 2 guys who hate each other together? Add for good measure a beauty and a gangster and the trouble is no one can be trusted.",
    "2008_191": "The story of Italian politician Giulio Andreotti, who has served as Prime Minister of Italy seven times since the restoration of democracy in 1946.",
    "2008_192": "Oskar, an overlooked and bullied boy, finds love and revenge through Eli, a beautiful but peculiar girl.",
    "2008_193": "A veteran soldier returns from his completed tour of duty in Iraq, only to find his life turned upside down when he is arbitrarily ordered to return to field duty by the Army.",
    "2008_194": "An Israeli film director interviews fellow veterans of the 1982 invasion of Lebanon to reconstruct his own memories of his term of service in that conflict.",
    "2008_195": "Two siblings rival each other inside the world of professional soccer.",
    "2008_196": "A luckless architect discovers a social activist to be his lucky charm. Unfortunately, she's protecting the community center he's aiming to win a contract to tear down.",
    "2008_197": "Ajay's life turns upside down when he learns that his wife Piya has Alzheimer and he has no option, but to leave his wife in a mental hospital.",
    "2008_198": "During a long English summer in the early 1980s, two schoolboys from differing backgrounds set out to make a film inspired by First Blood.",
    "2008_199": "A drama centered on two fighters in the Holger Danske World War II resistance group.",
    "2008_2": "In 1957, archaeologist and adventurer Dr. Henry \"Indiana\" Jones, Jr. is called back into action and becomes entangled in a Soviet plot to uncover the secret behind mysterious artifacts known as the Crystal Skulls.",
    "2008_20": "In the prehistoric past, D'Leh is a mammoth hunter who bonds with the beautiful Evolet. When warriors on horseback capture Evolet and the tribesmen, D'Leh must embark on an odyssey to save his true love.",
    "2008_200": "Frank Castle, known as the Punisher, ruthlessly demolishes organized crime, but it starts an even bigger war.",
    "2008_201": "Agnes Jaoui plays a local political candidate Agathe Villanova, who returns to her childhood home in the south of France in order to help her sister Florence (Pascale Arbillot) sort through their recently deceased mother's belongings. ...See moreAgnes Jaoui plays a local political candidate Agathe Villanova, who returns to her childhood home in the south of France in order to help her sister Florence (Pascale Arbillot) sort through their recently deceased mother's belongings. While she's there, the son (Jamel Debbouze as Karim) of family maid (Mimouna Hadji) takes advantage of her presence and attempts to interview her as part of a documentary about successful women that he's undertaken with his film school teacher, Michel (co-writer Jean-Pierre Bacri). However, Michel's intentions aren't quite what they seem, as he's having an affair with Florence and hoping to persuade her to leave her husband. Meanwhile, Karim finds his own marriage threatened when his attractive hotel co-worker (Florence Loiret-Caille) declares an interest in him.  Written by AnonymousSee less",
    "2008_202": "A drama based on the life of college football hero Ernie Davis, the first African-American to win the Heisman Trophy.",
    "2008_203": "Gianni is a middle-aged man living in Rome with his imposing and demanding elderly mother. His only outlet from her and the increasing debt into which they are sinking, are the increasingly frequent quiet sessions at the local tavern. As ...See moreGianni is a middle-aged man living in Rome with his imposing and demanding elderly mother. His only outlet from her and the increasing debt into which they are sinking, are the increasingly frequent quiet sessions at the local tavern. As an Oriental saying goes, 'Moments of crisis are moments of opportunities'. These appear during the celebration of the holiday of Ferragosto on 15 August. That's when everybody leaves town to have fun. Opportunity knocks on Gianni's door in the most unexpected way.  Written by Warsaw Film FestivalSee less",
    "2008_204": "Set in 1944 Italy, the story of four black American soldiers who get trapped in a Tuscan village during WWII.",
    "2008_205": "Based on the life of French painter Seraphine de Senlis.",
    "2008_206": "A young Thai boxer learns the skills and inner meaning of martial arts.",
    "2008_207": "Chronicles the rise of Chess Records and its recording artists.",
    "2008_208": "In the 1980s, a drummer is abandoned by his band just before they become rock superstars. Twenty years later, the drummer sees his second chance at stardom arise when he is asked to perform with his teenage nephew's high school rock band.",
    "2008_209": "This documentary goes to coral reefs of the Bahamas and the waters of the Kingdom of Tonga for a close encounter with the surviving tribes of the ocean: wild dolphins and belugas, the love of a Humpback mother for her newborn calf, the ...See moreThis documentary goes to coral reefs of the Bahamas and the waters of the Kingdom of Tonga for a close encounter with the surviving tribes of the ocean: wild dolphins and belugas, the love of a Humpback mother for her newborn calf, the singing Humpback males, an orca the mighty King of the ocean, and the gentle manatee. Little-known aspects of these creatures capable of sophisticated communication and social interaction. Documents the life of these graceful, majestic yet endangered sea creatures.  Written by 3D EntertainmentSee less",
    "2008_21": "Bruce Banner, a scientist on the run from the U.S. Government, must find a cure for the monster he turns into whenever he loses his temper.",
    "2008_210": "A weak con man panics when he learns he's going to prison for fraud. He hires a mysterious martial arts guru who helps transform him into a martial arts expert who can fight off inmates who want to hurt or love him.",
    "2008_211": "Following her sister's death from drug addiction, a high school student is forced to leave her private school to return to her old, crime-filled neighborhood where she re-kindles an unlikely passion for the competitive world of step dancing.",
    "2008_212": "A small-town girl finally realizes her dream of becoming a famous supermodel but soon finds out that there's a price for her glamorous new life.",
    "2008_213": "April, 39, wants a baby but her husband leaves her. When her adoptive mother dies, she's contacted by her bio mom, a TV talk show host. April starts seeing the divorced dad of one of her students at school.",
    "2008_214": "On a tour of Britain in 1926, Harry Houdini (Guy Pearce) enters into a passionate affair with a psychic out to con him.",
    "2008_215": "Henry Durand is a young federal agent who is given a difficult assignment: spy on his mother and her boyfriend who is suspected of leading a gang of art thieves.",
    "2008_216": "Two psychopathic young men take a family hostage in their cabin.",
    "2008_217": "Two brothers and a sister witness the disappearance of their childhood memories when they must relinquish the family belongings to ensure their deceased mother's succession.",
    "2008_218": "About young British journalist, George Hogg, who with the assistance of a courageous Australian nurse, saves a group of orphaned children during the Japanese occupation of China in 1937.",
    "2008_219": "Ben Stein examines the issue of academic freedom and decides that there is none when it comes to the debate over intelligent design.",
    "2008_22": "A family learns important life lessons from their adorable, but naughty and neurotic dog.",
    "2008_220": "An angel, a man and 4 orphans come together to bring you a story filled with fun, excitement, tears, love and magic.",
    "2008_221": "A kidnapper has to settle a personal score with an influential businessman whose daughter he has kidnapped.",
    "2008_222": "Bertrand Beauvois, a well-known attorney, is in Monte Carlo to defend a businessman's mother who murdered a gigolo with ties to gangsters. The businessman provides a bodyguard, Christophe, who is thorough and unsmiling. The middle-aged ...See moreBertrand Beauvois, a well-known attorney, is in Monte Carlo to defend a businessman's mother who murdered a gigolo with ties to gangsters. The businessman provides a bodyguard, Christophe, who is thorough and unsmiling. The middle-aged Beauvois is drawn to Audrey, in her 20s, free spirited, a local TV weather girl who once dated Christophe. Although Christophe warns Beauvois to stay away from Audrey, he's hooked and spends every moment with her he's not in court. What's her angle: is she a plant who'll ruin the case; is Beauvois her toy; is she digging for gold; or, is she genuine? Beauvois loves the wild sex but not her promiscuity. Has Christophe failed to protect him?  Written by See less",
    "2008_223": "A Puerto Rican family living in the area of Humboldt Park in west Chicago face what may be their last Christmas together. Read more: Synopsis",
    "2008_224": "A son reunites his widowed father to the long lost lover of the latter and urges him to marry.",
    "2008_225": "The story of a Palestinian widow who must defend her lemontree field when a new Israeli Defense Minister moves next to her and threatens to have her lemon grove torn down.",
    "2008_226": "The troubled Vuillard family is no stranger to illness, grief, and banishment, but when their matriarch requires a bone-marrow transplant, the estranged clan reunites just in time for Christmas.",
    "2008_227": "4 mental patients formulate the plan to rescue their kidnapped doctor and teach the kidnappers a lesson.",
    "2008_228": "A woman's survivor's guilt from a Columbine-like event twenty years ago causes her present-day idyllic life to fall apart.",
    "2008_229": "A documentary on a chorus of senior citizens from Massachusetts who cover songs by Jimi Hendrix, Coldplay, Sonic Youth, and other unexpected musicians.",
    "2008_23": "As seniors in high school, Troy and Gabriella struggle with the idea of being separated from one another as college approaches. Along with the rest of the Wildcats, they stage a spring musical to address their experiences, hopes and fears ...See moreAs seniors in high school, Troy and Gabriella struggle with the idea of being separated from one another as college approaches. Along with the rest of the Wildcats, they stage a spring musical to address their experiences, hopes and fears about their future.See less",
    "2008_230": "During the reign of the Vikings, Kainan, a man from a far-off world, crash lands on Earth, bringing with him an alien predator known as the Moorwen. Though both man and monster are seeking revenge for violence committed against them, ...See moreDuring the reign of the Vikings, Kainan, a man from a far-off world, crash lands on Earth, bringing with him an alien predator known as the Moorwen. Though both man and monster are seeking revenge for violence committed against them, Kainan leads the alliance to kill the Moorwen by fusing his advanced technology with the Viking's Iron Age weaponry.See less",
    "2008_231": "An anti-American filmmaker who's out to abolish the July Fourth holiday is visited by three ghosts who try to change his perception of the country.",
    "2008_232": "With the ratings dropping for a wilderness-themed television show, two animal fans go to the Andes Mountains in search of Bigfoot.",
    "2008_233": "Based on a true story, North Face is a survival drama film about a competition to climb the most dangerous rock face in the Alps. Set in 1936, as Nazi propaganda urges the nation's Alpinists to conquer the unclimbed north face of the Swiss...See moreBased on a true story, North Face is a survival drama film about a competition to climb the most dangerous rock face in the Alps. Set in 1936, as Nazi propaganda urges the nation's Alpinists to conquer the unclimbed north face of the Swiss massif - the Eiger - two reluctant German climbers begin their daring ascent.  Written by Irishlass240 (smmorr240@al.com)See less",
    "2008_234": "Two weeks in the life of a fading Hollywood producer who's having a rough time trying to get his new picture made.",
    "2008_235": "A wild weekend is in store for three high school seniors who visit a local college campus as prospective freshmen. Read more: Synopsis",
    "2008_236": "Three strangers with the same name, Laxminarayan, travel to Pondi with their tasks. Chaos ensues when they are mistaken for each other as they stay in the same hotel.",
    "2008_237": "A Transsiberian train journey from China to Moscow becomes a thrilling chase of deception and murder when an American couple encounters a mysterious pair of fellow travelers.",
    "2008_238": "A grief counselor working with a group of plane-crash survivors finds herself at the root of a mystery when her clients begin to disappear.",
    "2008_239": "A drama with a two-tiered storyline concerning a mother and daughter who try to form a bond after the young woman's difficult childhood.",
    "2008_24": "A French public servant from Provence is banished to the far North. Strongly prejudiced against this cold and inhospitable place, he leaves his family behind to relocate temporarily there, with the firm intent to quickly come back.",
    "2008_240": "A young man learns he is the latest in line of a dynasty of ancestral warriors dedicated to guarding a mystic source of cosmic energy, and the time has come for him to take the role.",
    "2008_241": "A mom looks for another source of income, when her husband leaves with the money meant for the new mobile home. A nearby Indian territory stretches across the border to Canada with a drivable frozen river between. Smuggling?",
    "2008_242": "Young Florentines take refuge from the black plague and engage in bawdy adventures and lusty exchanges.",
    "2008_243": "A group of young film students run into real-life zombies while filming a horror movie of their own.",
    "2008_244": "A look at tightrope walker Philippe Petit's daring, but illegal, high-wire routine performed between New York City's World Trade Center's twin towers in 1974, what some consider, \"the artistic crime of the century\".",
    "2008_245": "A rich kid becomes the self-appointed psychiatrist to the student body of his new high school.",
    "2008_246": "Two estranged brothers must learn to work together to claim their rightful share of an inheritance left solely to their eldest sibling.",
    "2008_247": "Sokol and Lorna, two Albanian emigrants in Belgium, dream of leaving their dreary jobs to set up a snack bar. They need money, and a permanent resident status. Claudy is a junkie - he needs money to satisfy his addiction. Andrei, the ...See moreSokol and Lorna, two Albanian emigrants in Belgium, dream of leaving their dreary jobs to set up a snack bar. They need money, and a permanent resident status. Claudy is a junkie - he needs money to satisfy his addiction. Andrei, the cigarette smuggler, must hold up for a while outside Russia; he has loads of money. Fabio, the Italian taxi driver and aspiring gang boss, elaborates a clever scheme: he will pay Claudy to marry Lorna so that she acquires a Belgian citizenship. Then she is to re-marry Andrei, who will in this way obtain the coveted EU passport - and pay a hefty price to Fabio and Lorna for the service. Like all plans, this one will not survive the contact with reality.  Written by Eduardo Casais See less",
    "2008_248": "In this irreverent comedy, a failed actor-turned-worse-high-school-drama-teacher rallies his Tucson, AZ students as he conceives and stages politically incorrect musical sequel to Shakespeare's Hamlet.",
    "2008_249": "A romantic drama about a woman who enters into an affair after 30 years of marriage.",
    "2008_25": "On a quest to find out what happened to his missing brother, a scientist, his nephew and their mountain guide discover a fantastic and dangerous lost world in the center of the earth.",
    "2008_250": "A TV anchor keeps on blaming God for his unsuccessful life. God appears and he is given the God's Power for 10 days just to see how he manages to keep everyone happy.",
    "2008_251": "Robert Kearns takes on the Detroit automakers who he claims stole his idea for the intermittent windshield wiper.",
    "2008_252": "The story of the early days of California wine making featuring the now infamous, blind Paris wine tasting of 1976 that has come to be known as \"Judgment of Paris\".",
    "2008_253": "A theatre director struggles with his work, and the women in his life, as he creates a life-size replica of New York City inside a warehouse as part of his new play.",
    "2008_254": "Two boys travel a thousand miles to deliver three letters as a part of their film school assignment. However, little do they know that the journey they have embarked upon will give a new meaning to their life.",
    "2008_255": "When a small-town sheriff witnesses what he believes to be an attempted kidnapping, his effort to save the beautiful damsel in distress sets him down a wild path of comic mishap.",
    "2008_256": "Refusing to let anything spoil their romantic weekend break, a young couple confront a gang of loutish youths with terrifyingly brutal consequences.",
    "2008_257": "A sex-addicted con-man pays for his mother's hospital bills by playing on the sympathies of those who rescue him from choking to death.",
    "2008_258": "In a hospital on the outskirts of 1920s Los Angeles, an injured stuntman begins to tell a fellow patient, a little girl with a broken arm, a fantastic story of five mythical heroes. Thanks to his fractured state of mind and her vivid ...See moreIn a hospital on the outskirts of 1920s Los Angeles, an injured stuntman begins to tell a fellow patient, a little girl with a broken arm, a fantastic story of five mythical heroes. Thanks to his fractured state of mind and her vivid imagination, the line between fiction and reality blurs as the tale advances.See less",
    "2008_259": "A photographer's obsessive pursuit of dark subject matter leads him into the path of a serial killer who stalks late night commuters, ultimately butchering them in the most gruesome ways.",
    "2008_26": "A remake of the 1951 classic science fiction film about an alien visitor and his giant robot counterpart who visit Earth.",
    "2008_260": "A family gathers together for a commemorative ritual whose nature only gradually becomes clear.",
    "2008_261": "In a time of social change and unrest, war and poverty, a young working class woman, Maria, wins a camera in a lottery. The decision to keep it alters her whole life.",
    "2008_262": "A Swedish gay couple adopt what they think is an 18-month-old orphan, only to meet their new son, a 15-year-old homophobic delinquent.",
    "2008_263": "A group of medical students devise a deadly game: to see which one of them can commit the perfect murder.",
    "2008_264": "An autistic girl with powerful martial art skills looks to settle her ailing mother's debts by seeking out the ruthless gangs that owe her family money.",
    "2008_265": "It's the summer of 1994, and the streets of New York are pulsing with hip-hop. Set against this backdrop, a lonely teenager named Luke Shapiro spends his last summer before university selling marijuana throughout New York City, trading it ...See moreIt's the summer of 1994, and the streets of New York are pulsing with hip-hop. Set against this backdrop, a lonely teenager named Luke Shapiro spends his last summer before university selling marijuana throughout New York City, trading it with his unorthodox psychotherapist for treatment, while having a crush on his stepdaughter.See less",
    "2008_266": "Beautiful Carmen Colson and her ironworker husband Wayne are placed in the Federal Witness Protection program after witnessing an \"incident\". Thinking they are at last safe, they are targeted by an experienced hit man and a psychopathic ...See moreBeautiful Carmen Colson and her ironworker husband Wayne are placed in the Federal Witness Protection program after witnessing an \"incident\". Thinking they are at last safe, they are targeted by an experienced hit man and a psychopathic young upstart killer. The ensuing struggle will test Carmen to the limit.See less",
    "2008_267": "A 1940s-set drama where an adulterous man plots his wife's death instead of putting her through the humiliation of a divorce.",
    "2008_268": "Matty, a 41-year old mother of three with a husband in his midlife-crisis, meets 29-year old Johnny, a truck driver, who takes an interest in her.",
    "2008_269": "A thriller about a Copenhagen cop who moves to a small town after having a nervous breakdown.",
    "2008_27": "Maxwell Smart, a highly intellectual but bumbling spy working for the CONTROL agency, is tasked with preventing a terrorist attack from rival spy agency KAOS.",
    "2008_270": "Follows the plight of real-life dancers as they struggle through auditions for the Broadway revival of \"A Chorus Line\". Also investigates the history of the show and the creative minds behind the original and current incarnations.",
    "2008_271": "Irish republican Bobby Sands leads the inmates of a Northern Irish prison in a hunger strike.",
    "2008_272": "A fateful event leads to a job in the film business for top mixed-martial arts instructor Mike Terry. Though he refuses to participate in prize bouts, circumstances conspire to force him to consider entering such a competition.",
    "2008_273": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
    "2008_274": "Jean-Claude Van Damme gets involved in a bank robbery with hostages situation and reflects about his life during it.",
    "2008_275": "Still a stranger to her own body, a high school student discovers she has a physical advantage when she becomes the object of male violence.",
    "2008_276": "After having an affair with a student, a Cape Town professor moves to the Eastern Cape, where he gets caught up in a mess of post-apartheid politics.",
    "2008_277": "Agnès Varda explores her memories, mostly chronologically, with photographs, film clips, interviews, reenactments, and droll, playful contemporary scenes of her narrating her story.",
    "2008_278": "Life for an isolated rural family is upended when a major highway next to their property, constructed 10 years before but apparently abandoned, is finally opened.",
    "2008_279": "All Thomas wants is a normal adolescence but his autistic brother, Charlie, thwarts his every opportunity. Will Thomas, with the help of his girlfriend, Jackie, accept his brother?",
    "2008_28": "A retired CIA agent travels across Europe and relies on his old skills to save his estranged daughter, who has been kidnapped while on a trip to Paris.",
    "2008_280": "28th century soldier Mitch Hunter leads a fight against an army of underworld Mutants.",
    "2008_281": "This is the story of Romeo. A dude who was living the life. He had the works - the mansion to live in, the chicks to party with and the cars to be driven around in. Until one day, the family he was the favorite pet of, decided to move and ...See moreThis is the story of Romeo. A dude who was living the life. He had the works - the mansion to live in, the chicks to party with and the cars to be driven around in. Until one day, the family he was the favorite pet of, decided to move and left him back, abandoned on the mean streets of Mumbai. Romeo is now faced with situations he has never been in before. He encounters four strays, who scare the daylights out of him. But soon, he smooth talks his way into their hearts and he makes friends. Then, Romeo finds love! He encounters the beautiful, ravishing Laila, the most beautiful girl he has ever seen - and he loses his heart to her at first sight. Finally, he encounters a villain! The dreaded Don of the area - Charlie Anna. The Don who everyone is scared of. So hop on to the adventure as Romeo, wins friendship, love and a new life - inspite of Charlie Anna and his gang! Watch how Romeo turns into - Roadside Romeo! This Diwali - Get ready for a barking good time!!  Written by AnonymousSee less",
    "2008_282": "A broken-hearted hit man moves to the desert where he finds skilled swordsmen to carry out his contract killings.",
    "2008_283": "A burglar reflects on his life and loves; while the media speculates how he managed to pull off so many heists.",
    "2008_284": "Henry Poole moves in to a house in his old neighborhood, to spend what he believes are his remaining days alone. The discovery of a \"miracle\" by a nosy neighbor ruptures his solitude and restores his faith in life.",
    "2008_285": "After being fired from his job, an everyday guy faces pressure from his wife about having a baby, while having to deal with his suffocating mother, who has decided to move in with the couple.",
    "2008_286": "A woman tries to survive the invasion of Berlin by the Soviet troops during the last days of World War II.",
    "2008_287": "In 1956, Ernesto 'Che' Guevara and a band of Castro-led Cuban exiles mobilize an army to topple the regime of dictator Fulgencio Batista.",
    "2008_288": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2008_289": "A Chinese man travels to America to visit his daughter after her recent divorce. Though his trip starts off as a mission to see his daughter remarry, he sparks to an Iranian woman who, despite their language barrier, captures his heart.",
    "2008_29": "A teenager with teleportation abilities suddenly finds himself in the middle of an ancient war between those like him and their sworn annihilators.",
    "2008_290": "A young drug dealer falls in love while facing disruption among the men in his gang, and being offered a career as a Reggaetón singer.",
    "2008_291": "A woman agrees to go on a date with a man only if he finds a suitor for her unattractive best friend.",
    "2008_292": "Based on footage of real animals accompanied by a voice narrative, following a pair of beavers through the seasons as they have babies, gather food, maintain their dam, play, swim and defend their territory against predators and intruders.",
    "2008_293": "John Halder, a German literature professor in the 1930s, is initially reluctant to accept the ideas of the Nazi Party. He is pulled in different emotional directions by his wife, mother, mistress and Jewish friend.",
    "2008_294": "A portrait of the late gonzo journalist Hunter S. Thompson.",
    "2008_295": "Bhopal-based statuesque singing beauty, Chandni Shrivastava, falls in love with wealthy fellow-singer, Prem Ajmera. Her widowed dad, Bhushan, and his widowed mother both approve and they formally get engaged. Bhushan passes away suddenly ...See moreBhopal-based statuesque singing beauty, Chandni Shrivastava, falls in love with wealthy fellow-singer, Prem Ajmera. Her widowed dad, Bhushan, and his widowed mother both approve and they formally get engaged. Bhushan passes away suddenly and Chandni is unable to get married as there is no one to look after her much younger siblings, Anuj and Sandhya, and as a result the wedding gets postponed. She struggles to maintain the family by teaching music and continues to stay in touch with Prem. 12 years later, Anuj gets married to Natasha, and Chandni hopes to wed Prem, but things do terribly wrong when Natasha humiliates Prem and then decides to move out. Sandhya then demands that she re-locate to the U.S. to further her career, while Prem's mom issues an ultimatum that she either marry Prem immediately or relieve him so that he can get married to someone else.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2008_296": "For the first time ever, our children are growing up less healthy than we are. As the rate of cancer, infertility and other illnesses linked to environmental factors climbs upward each year, we must ask ourselves: why is this happening?",
    "2008_297": "Three women take a road trip to Santa Barbara in order to deliver the ashes of one of their dead husbands to his resentful daughter.",
    "2008_298": "A woman tries to extort money, using a young boy as bait.",
    "2008_299": "A English spice baron settles in South India during the waning years of the Raj.",
    "2008_3": "The Dragon Warrior has to clash against the savage Tai Lung as China's fate hangs in the balance. However, the Dragon Warrior mantle is supposedly mistaken to be bestowed upon an obese panda who is a novice in martial arts.",
    "2008_30": "A man challenges himself to say \"yes\" to everything.",
    "2008_300": "A corporation hires a professional assassin to pose as its trade show representative who must organize the wedding of a Middle Eastern pop star, which will allow him the opportunity to kill a Middle Eastern politician.",
    "2008_301": "Broke and alone on New Year's Eve, Wilson just wants to spend the rest of a very bad year in bed. But, when his best friend convinces him to post a personal ad, he meets a woman bent on finding the right guy to be with at midnight.",
    "2008_302": "Film-maker Werner Herzog travels to the McMurdo Station in Antarctica, looking to capture the continent's beauty and investigate the characters living there.",
    "2008_303": "A moving portrayal of the 2006 train bombings in Mumbai, this Indian drama follows the interconnected stories of several strangers.",
    "2008_304": "The story of a young Jack, newly released from serving a prison sentence for a violent crime he committed as a child.",
    "2008_305": "Over the summer, a series of unfortunate happening triggers a financial crisis for a young woman and she soon finds her life falling apart.",
    "2008_306": "A cinematic triptych of three Tokyo-set stories.",
    "2008_307": "In rural Alabama, two couples find themselves in a fight for survival. Running from a maniac (The Tin Man) bent on killing them, they flee deep into the woods and seek refuge in a house.",
    "2008_308": "A documentary on seniors at a high school in a small Indiana town and their various cliques. Read more: Synopsis",
    "2008_309": "A fading Hollywood star looks back at the days of his youth as he returns home from his best friend's funeral.",
    "2008_31": "A man and a woman are compelled, for legal reasons, to live life as a couple for a limited period of time. At stake is a large amount of money.",
    "2008_310": "Two FBI agents attempt to clarify the murders occurring in a desolate region. They approach the witnesses of the latest incident with the help of the local police. All of them hide something and all have wildly different stories to tell.",
    "2008_311": "At the edge of the Yangtze River, not far from the Three Gorges Dam, young men and women take up employment on a cruise ship, where they confront rising waters and a radically changing China.",
    "2008_312": "The opera \"La Bohème\" is about the tragic love story of Mimí and Rodolfo, set in Paris in the year 1830.",
    "2008_313": "An ordinary Japanese family slowly disintegrates after its patriarch loses his job at a prominent company.",
    "2008_314": "Activists arrive in Seattle, Washington en masse to protest a meeting of the World Trade Organization. Riots and chaos ensue as demonstrators successfully stop the WTO meetings.",
    "2008_315": "A screwball comedy centered on a Manhattan go-go dancing club, where a financial struggle between the owner, his accountant and his silent partner brother threatens the business's future.",
    "2008_316": "Ex-con Alex plans to flee to the South with his girl after a robbery. But something terrible happens and revenge seems inevitable.",
    "2008_317": "Before her death, Emma reflects on her life; beginning with her childhood, up through her final years in Nauvoo. Based on the life of Emma Hale Smith.",
    "2008_318": "A child escapes from Poland during World War II and first heads to Greece before coming of age in Canada.",
    "2008_319": "Few are aware that America may be on the brink of a financial meltdown. I.O.U.S.A. explores the country's shocking current fiscal condition and ways to avoid a national economic disaster.",
    "2008_32": "A hotel handyman's life changes when the lavish bedtime stories he tells his niece and nephew start to magically come true.",
    "2008_320": "An incarcerated woman struggles to raise her son from prison.",
    "2008_321": "Comic mayhem ensues when two lovely blondes, Dee and Dawn, are mistaken as international mob killers.",
    "2008_322": "A rugby player is put up in a juvenile detention center. There he plays for the Highland Rugby team and ultimately plays against his father in the National Championships.",
    "2008_323": "Cale, is determined to win a coveted spot on the Grand National racing team without compromising his devotion to his friends and family",
    "2008_324": "A stop-motion animated story about people living in a Sydney apartment complex looking for meaning in their lives. Read more: Synopsis",
    "2008_325": "Delgo, an adventurous but naive teenager, must rally his group of friends to protect their world from conflict between the Lockni and Nohrin people.",
    "2008_326": "Things go drastically wrong for a group of British holidaymakers in Spain.",
    "2008_327": "A man is obsessed with John Travolta's disco dancing character from Saturday Night Fever.",
    "2008_328": "A young Arab-American girl struggles with her sexual obsession, a bigoted Army reservist and her strict father during the Gulf War.",
    "2008_329": "A psychological thriller based on the concept of anamorphosis, a painting technique that manipulates the laws of perspective to create two competing images on a single canvas.",
    "2008_33": "Set in northern Australia before World War II, an English aristocrat who inherits a sprawling ranch reluctantly pacts with a stock-man in order to protect her new property from a takeover plot. As the pair drive 2,000 head of cattle over ...See moreSet in northern Australia before World War II, an English aristocrat who inherits a sprawling ranch reluctantly pacts with a stock-man in order to protect her new property from a takeover plot. As the pair drive 2,000 head of cattle over unforgiving landscape, they experience the bombing of Darwin, Australia, by Japanese forces firsthand.See less",
    "2008_330": "\"Beer for My Horses\" tells the story of two best friends that work together as deputies in a small town. The two defy the Sheriff and head off on an outrageous road trip to save the protagonist's girlfriend from drug lord kidnappers.",
    "2008_331": "Morgan Spurlock tours the Middle East to discuss the war on terror with Arabic people.",
    "2008_332": "Kamalpur-based Bhullar family make a lot of sacrifices to get their daughter and eldest son married; as well as ensure their youngest, Himmat, gets a good education in Patiala's Punjabi University. After Himmat completes his education and ...See moreKamalpur-based Bhullar family make a lot of sacrifices to get their daughter and eldest son married; as well as ensure their youngest, Himmat, gets a good education in Patiala's Punjabi University. After Himmat completes his education and returns home, the family even arrange his marriage with an America-based wealthy bride so that he can re-locate abroad and live a better life. The family's peace and harmony is shattered, the house gets divided, after Himmat refuses to marry the bride, and instead sets off with his friends to open a lowly Dhaba. He also starts wooing Resham, the wealthy daughter of Deep Singh, the President of Punjab Hotel Association - who will never permit her to marry a lowly Dhaba owner, and is already making plans to get her married to someone very wealthy.  Written by rAjOo (gunwanti@hotmail.com)See less",
    "2008_333": "In this documentary, the show's emcee, Vince Vaughn, and four stand-up comedians hand-picked by Vaughn, travel the country and perform in 30 cities. This film documents the interactions on and off stage along the way.",
    "2008_334": "A respected rabbi is forced to come to terms with the demands of his faith and the welfare of his own family.",
    "2008_335": "The Nazi occupation of Tunisia strains the bonds of friendship between a Muslim woman and a Sephardic Jewish woman who are both preparing for their marriages.",
    "2008_336": "A man accidentally gets into a time machine and travels back in time nearly an hour. Finding himself will be the first of a series of disasters of unforeseeable consequences.",
    "2008_337": "A professor of chemistry wins the Nobel Prize. His wife joins him to Stockholm but his PhD. working son gets kidnapped. The kidnapper demands $2,000,000 = prize sum.",
    "2008_338": "As Noah and Wade prepare to marry in Martha's Vineyard, the personal problems of their friends - and the unexpected arrival of rapper Baby Gat - threatens to permanently end their relationship.",
    "2008_339": "It's a case of mistaken ethnicity, where two non-Italians pretend to be Italian to win each others hearts in Boston's North End.",
    "2008_34": "An Israeli Special Forces Soldier fakes his death so he can re-emerge in New York City as a hair stylist.",
    "2008_340": "A filmmaker looks at the history and transformation of his birthplace, Liverpool, England.",
    "2008_341": "A redemptive tale of an aspiring rap artist surviving failed levees and her own troubled past and seizing a chance for a new beginning. Read more: Synopsis",
    "2008_342": "Trapped in an isolated gas station by a voracious Splinter parasite that transforms its still-living victims into deadly hosts, a young couple and an escaped convict must find a way to work together to survive this primal terror.",
    "2008_343": "Collective screening of the Academy Award nominated short films from the Live Action category for 2007.",
    "2008_344": "An employee at an Indian call-center travels to San Francisco to be with a guy she falls for over the phone. Read more: Synopsis",
    "2008_345": "A 90-year-old woman, rapidly losing her memory and knowing that sooner or later her life will be over, returns to the Manitoba farmhouse she grew up in to try and make peace with her dysfunctional family.",
    "2008_346": "-Sebastien Messier and Danny Demers have been friends forever. They've shared all sorts of things, including boxing. After an absence of a year and a half, Danny returns to Montreal (in Canada). He is at the lowest point, nothing awaits ...See more-Sebastien Messier and Danny Demers have been friends forever. They've shared all sorts of things, including boxing. After an absence of a year and a half, Danny returns to Montreal (in Canada). He is at the lowest point, nothing awaits him. Sebastien, on the contrary, is on his way. He's preparing for the fight of his life, for the title of world champion. The reunion of the two friends is emotional, full of memories and promises. Until a dramatic event shatters their paths - Blinded by ambition, Sebastian has lost the essential. He's adrift. It's the desire to measure up to Danny that makes him want to get on with his life. At first, Sebastian believes he only has to get back into shape to prove his superiority. But then the ghosts of the past reappear. He then finds the courage to face his demons until he gives Danny the ultimate proof of his friendship.See less",
    "2008_347": "Two assistant managers of a corporate grocery store vie for a coveted promotion.",
    "2008_348": "Several scary black-and-white animated segments in different styles appeal to our fear(s) of the dark.",
    "2008_349": "A 40-year-old who gave up a promising amateur boxing career 21 years ago is offered a path to the Olympics.",
    "2008_35": "A five-year-old boy develops a relationship with Ponyo, a young goldfish princess who longs to become a human after falling in love with him.",
    "2008_350": "When a lonely snowman wants to be part of the holiday fun, he decides to impersonate Santa! A hilarious clash that ensues where rocket-propelled reindeer face-off against snowball-launching igloos! ( Get it in 3D or 2D!!!!! )",
    "2008_351": "A drama that interweaves the life of a teenager, with his old baby sitter, her estranged husband, and their daughter.",
    "2008_352": "In Paris, a young American who works as a Michael Jackson look-alike meets Marilyn Monroe, who invites him to her commune in Scotland, where she lives with Charlie Chaplin and her daughter, Shirley Temple.",
    "2008_353": "A horror film told in three parts, from three perspectives, in which a mysterious transmission that turns people into killers invades every cell phone, radio, and television. Read more: Synopsis",
    "2008_354": "A woman out late for Christmas Eve shopping is soon terrorized by a small gang of troublemakers, and she must fight for her life.",
    "2008_355": "Two rival bikers gangs, the Victors and the Six-Six-Six's, refuel their decades-old rivalry.",
    "2008_356": "Frank Perry is an institutionalized convict fourteen years into a life sentence without parole. When his estranged daughter falls ill, he is determined to make peace with her before it's too late. He develops an ingenious escape plan, and ...See moreFrank Perry is an institutionalized convict fourteen years into a life sentence without parole. When his estranged daughter falls ill, he is determined to make peace with her before it's too late. He develops an ingenious escape plan, and recruits a dysfunctional band of escapists - misfits with unique skills required for their daring plan and united by desire to escape their hell hole of an existence. Much of the action takes place within the tunnels, sewers and underground rivers of subterranean London.  Written by AnonymousSee less",
    "2008_357": "Josh is an ordinary teen living in an ordinary suburb, wedged between the high school, the mine and the skate park. One morning, he finds his friend Thomas's dead body. Next, he discovers that three more friends also killed themselves, ...See moreJosh is an ordinary teen living in an ordinary suburb, wedged between the high school, the mine and the skate park. One morning, he finds his friend Thomas's dead body. Next, he discovers that three more friends also killed themselves, leaving him out of their pact. As the sole survivor, Josh becomes more and more detached from the world around him. Only Mia, his best friend's girl, can reach him. With more questions than answers, Josh's is the story of a survivor. It is a modern portrait of today's teens: invincible yet fragile, clear-thinking yet confused, idealistic yet jaded.  Written by AnonymousSee less",
    "2008_358": "A comedy centered on three flatmates living desperate lives in London.",
    "2008_359": "Everyone knows who he is. Now find out how he got there. The early life of American Evangelist Billy Graham.",
    "2008_36": "A dramatization of the July 20, 1944 assassination and political coup plot by desperate renegade German Army officers against Adolf Hitler during World War II.",
    "2008_360": "A guy fed up with his job and married to a cheating wife reluctantly mentors a rebellious teen.",
    "2008_361": "Errol Morris examines the incidents of abuse and torture of suspected terrorists at the hands of U.S. forces at the Abu Ghraib prison. Read more: Synopsis",
    "2008_362": "An examination of America's win-at-all-cost culture from the perspective of bodybuilding and performance enhancing drugs, as it focuses on a pair of siblings chasing their dream.",
    "2008_363": "After hitting something with her car, a bourgeois Argentine woman's life slowly descends into paranoia and isolation, as she fears she may have killed someone.",
    "2008_364": "Jumping continents and crossing cultures, \"Planet B-Boy\" looks at the history of breakdancing and its vibrant resurgence in urban cultures around the world.",
    "2008_365": "Alex Gibney exposes the haunting details of the USA's torture and interrogation practices during the War in Afghanistan.",
    "2008_366": "Doug Pray explores the life of surfer Dorian \"Doc\" Paskowitz.",
    "2008_367": "The story of an obsessively organized efficiency expert whose life unravels in unexpected ways when fate forces him to explore the serendipitous nature of love and forgiveness.",
    "2008_368": "Three different soldiers - a woman and two men - return from war and facing the peaceful life's problems of each other.",
    "2008_369": "Fact, fantasy and memory are woven seamlessly together in this portrait of film-maker Guy Maddin's home town of Winnipeg, Manitoba.",
    "2008_37": "Through a series of freak occurrences, a group of actors shooting a big-budget war movie are forced to become the soldiers they are portraying.",
    "2008_370": "When she is reduced to appearing in a circus, a notorious beauty thinks back on her past loves.",
    "2008_371": "After the tsunami struck the coast town of Takua Pa, young architect Ton moves in town to develop a construction project and settles in a small hotel run by Na, a young sensitive local girl. They begin a secret love affair, but soon rumors...See moreAfter the tsunami struck the coast town of Takua Pa, young architect Ton moves in town to develop a construction project and settles in a small hotel run by Na, a young sensitive local girl. They begin a secret love affair, but soon rumors spread and they meet with strong opposition from the town's residents.  Written by fabreuSee less",
    "2008_372": "Fifteen young sailors... six months of intense training... one chance at the brass ring. This documentary tells the story of a group of intrepid and determined young men and women, on the cusp of adulthood, as they embark on life's first ...See moreFifteen young sailors... six months of intense training... one chance at the brass ring. This documentary tells the story of a group of intrepid and determined young men and women, on the cusp of adulthood, as they embark on life's first great adventure. Racing a high-performance 52-foot sloop in the TRANSPAC, the most revered of open-ocean sailing competitions, the crew of \"Morning Light\" matches wits and skills in a dramatic 2300 mile showdown against top professionals. From their earliest training sessions in Hawaii conducted by world-class teachers through their test of endurance on the high seas, they form an unbreakable bond in the process of becoming a singular team that is greater than the sum of its parts.  Written by Walt Disney PicturesSee less",
    "2008_373": "Critically acclaimed documentary about the 1968 football game played by two undefeated teams from Harvard and Yale.",
    "2008_374": "A Lahore-born London Police Commander deals with personal issues and investigates the shooting death of a fellow-Muslim.",
    "2008_375": "Two brilliant young women discover their own voices in a repressive orthodox culture where females are forbidden to sing, let alone speak out.",
    "2008_376": "The story of a group of Israeli soldiers stationed in an outpost prior to the withdrawal of forces of 2000.",
    "2008_377": "A group of college kids go after-hours bowling. The fun is suddenly halted when abnormal things begin happening on the 13th alley. Everyone runs to escape, but all exits have been boarded up! Who is out for revenge? Read more: Synopsis",
    "2008_378": "Film-maker Kate Churchill is determined to prove that yoga can transform anyone. Nick Rosen is skeptical but agrees to be her guinea pig. Kate immerses Nick in yoga, and follows him around the world as he examines the good, the bad and the...See moreFilm-maker Kate Churchill is determined to prove that yoga can transform anyone. Nick Rosen is skeptical but agrees to be her guinea pig. Kate immerses Nick in yoga, and follows him around the world as he examines the good, the bad and the ugly of yoga. The two encounter celebrity yogis, true believers, kooks and world-renowned gurus. Tensions run high as Nick's transformative progress lags and Kate's plan crumbles. Ultimately, what they find is not what they expected.  Written by Kate ChurchillSee less",
    "2008_379": "An inept tae kwon do instructor struggles with marital troubles and an unhealthy obsession with fellow tae kwon do enthusiast Chuck \"The Truck\" Wallace.",
    "2008_38": "Jerry and Rachel are two strangers thrown together by a mysterious phone call from a woman they have never met. Threatening their lives and family, she pushes Jerry and Rachel into a series of increasingly dangerous situations, using the ...See moreJerry and Rachel are two strangers thrown together by a mysterious phone call from a woman they have never met. Threatening their lives and family, she pushes Jerry and Rachel into a series of increasingly dangerous situations, using the technology of everyday life to track and control their every move.See less",
    "2008_380": "A gun-slinging preacher returns to the debaucherous town of Playa Diablo seeking revenge from the notorious scorpion-venom drinking bandito El Sobero - lead outlaw and number one bad guy. El Sobero and his band of bad banditos are also ...See moreA gun-slinging preacher returns to the debaucherous town of Playa Diablo seeking revenge from the notorious scorpion-venom drinking bandito El Sobero - lead outlaw and number one bad guy. El Sobero and his band of bad banditos are also returning to Playa Diablo seeking their own revenge against the town sheriff. With the Bounty Hunter dragging up slowly behind there is sure to be a confrontation of Biblical proportions as they all meet in the circle of death.  Written by Mike BruceSee less",
    "2008_381": "The war in Iraq is the backdrop as the Crosby, Stills, Nash, and Young \"Freedom of Speech Tour\" crisscrosses North America. Echoes of Vietnam-era anti-war sentiment abound as the band connects with today's audiences.",
    "2008_382": "Georgina is an ambitious young London professional who learns she has only one month left in which to conceive a child. After exhausting all possibilities with her baby-phobic boyfriend, Georgina turns to her wildly optimistic friend Clem,...See moreGeorgina is an ambitious young London professional who learns she has only one month left in which to conceive a child. After exhausting all possibilities with her baby-phobic boyfriend, Georgina turns to her wildly optimistic friend Clem, with whom she sets out to identify and \"land\" the perfect father for her child.  Written by AnonymousSee less",
    "2008_383": "A boy's barmitzvah looks set to be a disaster when it coincides with the 1966 World Cup Final. Read more: Synopsis",
    "2008_384": "Alejandro, a resourceful street orphan on the verge of adolescence, lives and works in an auto-body repair shop in a sprawling junkyard on the outskirts of Queens, New York. In this chaotic world of adults, Alejandro struggles to make a ...See moreAlejandro, a resourceful street orphan on the verge of adolescence, lives and works in an auto-body repair shop in a sprawling junkyard on the outskirts of Queens, New York. In this chaotic world of adults, Alejandro struggles to make a better life for himself and his sixteen-year-old sister.See less Read more: Synopsis",
    "2008_385": "When an ostrich-rancher focuses on replacing his daughter's hearing aid, which breaks right before crucial exams, everything changes for a struggling rural family in Iran. Karim motorbikes into a world alien to him - incredibly hectic ...See moreWhen an ostrich-rancher focuses on replacing his daughter's hearing aid, which breaks right before crucial exams, everything changes for a struggling rural family in Iran. Karim motorbikes into a world alien to him - incredibly hectic Tehran, where sudden opportunities for independence, thrill and challenge him. But his honor and honesty, plus traditional authority over his inventive clan, are tested, as he stumbles among vast cultural and economic gaps between his village nestled in the desert, and a throbbing international metropolis.  Written by David StevensSee less",
    "2008_386": "The love story between British writer, Christopher Isherwood (whose book 'The Berlin Stories' inspired the musical and film Cabaret) and Don Bachardy, American portrait artist.",
    "2008_387": "Three generations of women in a Mexican American family experience sexual awakenings over the course of a summer.",
    "2008_388": "Fair Trade Pictures to support human rights activism against human trafficking and slavery on a community level.",
    "2008_389": "For the first time ever, survivors of the famous 1972 Andes plane crash tell in their own words their harrowing story of survival.",
    "2008_39": "A group of friends venture deep into the streets of New York on a rescue mission during a rampaging monster attack.",
    "2008_390": "The drama follows a twelve-year-old girl's struggle to come to terms with her mother's abandonment.",
    "2008_391": "In this live performance of Giuseppe Verdi's opera, Violetta, a courtesan much wooed by Parisian society, organizes a grand party that is attended, amongst others, by the young Alfredo Germont. He confesses his feelings to Violetta, who is...See moreIn this live performance of Giuseppe Verdi's opera, Violetta, a courtesan much wooed by Parisian society, organizes a grand party that is attended, amongst others, by the young Alfredo Germont. He confesses his feelings to Violetta, who is already suffering from consumption. She vacillates between genuine affection and a realistic assessment of her situation as a \"fallen woman\", which precludes any lasting relationship with a man.  Written by AnonymousSee less",
    "2008_392": "A man endeavors to collect memories of his grandparents who died in a concentration camp during the Holocaust. Read more: Synopsis",
    "2008_393": "The story of a pregnant Chinese girl's life in the U.S. Based on the the short story by Yiyun Li.",
    "2008_394": "A worldwide epidemic encourages a biotech company to launch an organ-financing program similar in nature to a standard car loan. The repossession clause is a killer, however.",
    "2008_395": "This documentary tells the story of a group of Australian and South African surfers who revolutionized their sport in Hawaii during the winter of 1975.",
    "2008_396": "A film about Mark David Chapman in the days leading up to the infamous murder of Beatle John Lennon. Read more: Synopsis",
    "2008_397": "The story of the Australian exploitation genre cinema of 1970s and 80s.",
    "2008_398": "An exploration of the dark side of Christianity, following acclaimed author and former priest James Carroll on a journey of remembrance and reckoning.",
    "2008_399": "Archival footage, animation, and music are used to look back at the eight anti-war protesters who were put on trial following the 1968 Democratic National Convention. Read more: Synopsis",
    "2008_4": "Hancock is a superhero whose ill-considered behavior regularly causes damage in the millions. He changes when the person he saves helps him improve his public image.",
    "2008_40": "A man with a fateful secret embarks on an extraordinary journey of redemption by forever changing the lives of seven strangers.",
    "2008_400": "Mistaken for his character Ash from the 'Evil Dead' trilogy, Bruce Campbell is forced to fight a real monster in a small Oregon town.",
    "2008_401": "In modern-day Saigon, three lonely strangers form a unique family as a ten-year old orphan plays matchmaker to a zookeeper and a beautiful flight attendant.",
    "2008_402": "Three women are stalked by a killer with a grudge that extends back to the girls' childhoods.",
    "2008_403": "A documentary about four girls who transform their lives at the Rock 'n' Roll Camp for Girls.",
    "2008_404": "A drama that follows the travails of the Pineda family in the Filipino city of Angeles. Bigamy, unwanted pregnancy, possible incest and bothersome skin irritations are all part of their daily challenges, but the real \"star\" of the show is ...See moreA drama that follows the travails of the Pineda family in the Filipino city of Angeles. Bigamy, unwanted pregnancy, possible incest and bothersome skin irritations are all part of their daily challenges, but the real \"star\" of the show is an enormous, dilapidated movie theater that doubles as family business and living space. At one time a prestige establishment, the theater now runs porn double bills and serves as a meeting ground for hustlers of every conceivable persuasion. The film captures the sordid, fetid atmosphere, interweaving various family subplots with the comings and goings of customers, thieves and even a runaway goat while enveloping the viewer in a maelstrom of sound, noise and continuous motion.  Written by Regent ReleasingSee less",
    "2008_405": "Screenwriter Paul Javal's marriage to his wife Camille disintegrates during movie production as she spends time with the producer. Layered conflicts between art and business ensue.",
    "2008_406": "A young woman commits a hit-and-run, then finds her fate tied to her victim.",
    "2008_407": "Two boys from a small town find their courage tested when they accidentally stow away aboard an airplane owned by the mob.",
    "2008_408": "In a strange and isolated chateau, a man becomes acquainted with a woman and insists that they have met before.",
    "2008_409": "When his college dreams are sidelined by family obligations, a young man finds comfort in surfing with his best friend's brother.",
    "2008_41": "A prince of the mythical world starts a rebellion against humanity in order to rule the Earth, and Hellboy his team must fight to stop him from locating the all-powerful Golden Army.",
    "2008_410": "Water is the very essence of life, sustaining every being on the planet. 'Flow' confronts the disturbing reality that our crucial resource is dwindling and greed just may be the cause.",
    "2008_411": "4 \"actors\" go to a cabin in the woods for the weekend to write a movie script. They talk about a relationship movie or a paper bag over the head movie. It starts with an anonymous baghead and slowly escalates.",
    "2008_412": "A drama set in the American South, where a precocious, troubled girl finds a safe haven in the music and movement of Elvis Presley. Read more: Synopsis",
    "2008_413": "This documentary gives insight to the lives of five ballerinas, all at different points in their careers. Looking at the operations of the Vagonova Academy and the Mariinsky Theatre, the life of a ballerina is disclosed.",
    "2008_414": "A lot things go down in the old town. When a white supremacy group comes by.",
    "2008_415": "An 80-year-old man continues to pursue his love life with youthful vigor, risking his relationship with the woman he loves. Based on the short stories by Isaac Bashevis Singer.",
    "2008_416": "Follow six diverse trainers as they jockey for position along the 2006 Kentucky Derby trail. Read more: Synopsis",
    "2008_417": "A bullied and demoralized gay student at an all-boys school uses a magical flower derived from Shakespeare's \"A Midsummer Night's Dream' to turn many in his community gay, including a comely rugby player for himself.",
    "2008_418": "A man who has avoided his wife and child at home has a change of heart after an imposed stay in his own parents' loft.",
    "2008_419": "An improvisational comedy using a handful of actors playing characters competing in an actual poker tournament.",
    "2008_42": "Upon moving into the run-down Spiderwick Estate with their mother, twin brothers Jared and Simon Grace, along with their sister Mallory, find themselves pulled into an alternate world full of faeries and other creatures.",
    "2008_420": "Lou Reed's 2006 live concert performance of his 1973 concept album \"Berlin\", filmed over five nights at St. Ann's Warehouse in Brooklyn, New York.",
    "2008_421": "People from all walks of life are asked \"What is God?\"",
    "2008_422": "An allegorical comedy centered on two childhood sweethearts who seem destined for one another until the women of their isolated village, angered by male indifference toward the water shortage, go on a sex strike that threatens the young ...See moreAn allegorical comedy centered on two childhood sweethearts who seem destined for one another until the women of their isolated village, angered by male indifference toward the water shortage, go on a sex strike that threatens the young couple's first night of love.  Written by Sundance Film FestivalSee less",
    "2008_423": "Through a focus on the life of Dalton Trumbo (1905-1976), this film examines the effects on individuals and families of a congressional pursuit of Hollywood Communists after World War II. Trumbo was one of several writers, directors, and ...See moreThrough a focus on the life of Dalton Trumbo (1905-1976), this film examines the effects on individuals and families of a congressional pursuit of Hollywood Communists after World War II. Trumbo was one of several writers, directors, and actors who invoked the First Amendment in refusing to answer questions under oath. They were blacklisted and imprisoned. We follow Trumbo to prison, to exile in Mexico with his family, to poverty, to the public shunning of his children, to his writing under others' names, and to an eventual but incomplete vindication. Actors read his letters; his children and friends remember and comment. Archive photos, newsreels and interviews add texture.  Written by See less",
    "2008_424": "The near future. Like tomorrow. In a world marked by closed borders, corporate warriors, and a global computer network, three strangers risk their lives to connect, break through the barriers of technology, and unseal their fates.",
    "2008_425": "Based on the true story of the double initial killings in Rochester, NY.",
    "2008_426": "A documentary on gay, lesbian, and transgender Muslims across the Muslim and Western worlds.",
    "2008_427": "Andy, Nico, Jarod and Griff reunite in Fort Lauderdale for Spring Break and participate in a contest called \"Gays Gone Wild\" to determine who can attain the most \"buttlove\" over the course of the vacation.",
    "2008_428": "Examines the public scandal and private tragedy which led to legendary filmmaker Roman Polanski's sudden flight from the United States.",
    "2008_429": "Tom Ripley is a talented mimic, moocher, forger and all-around criminal improviser; but there's more to Tom Ripley than even he can guess.",
    "2008_43": "A couple struggles to visit all four of their divorced parents on Christmas.",
    "2008_430": "A loser moves in with his brother's (in Iraq) wife to look after her two evil sons. She gets him a job wearing a Kabluey costume.",
    "2008_431": "A documentary about Louise Bourgeois by director Camille Guichard. Bourgeois created art for more than fifty years and at the time of filming was still creating.",
    "2008_432": "Still reeling from the death of her father, a young girl spends one last summer at the Jersey Shore before heading off to college. But when her plans fall apart, the girl stumbles into a mysterious world of Russian sailors, high-stakes ...See moreStill reeling from the death of her father, a young girl spends one last summer at the Jersey Shore before heading off to college. But when her plans fall apart, the girl stumbles into a mysterious world of Russian sailors, high-stakes gambling, and unexpected love.  Written by AnonymousSee less",
    "2008_433": "A boy in abject poverty works in a hotel and becomes obsessed with a swimming pool in the opulent hills of Panjim, Goa, India. His life gets turned upside-down when he attempts to meet the mysterious family who lives at the house.",
    "2008_434": "In post-war Italy, a working-class man's bicycle is stolen. He and his son set out to find it.",
    "2008_435": "A documentary about the development around Barton Springs in Austin, Texas, and the environment's unexpected response to human interference. Read more: Synopsis",
    "2008_436": "A group of women rise up to peace to Liberia and help bring to power the country's first female head of state.",
    "2008_437": "Deep in the bayou sits a floating town called Little Chenier. It is here that Beaux and his mentally challenged brother, Pemon, run a bait-and-tackle shop. Pemon is accused of a crime, and Beaux chooses to protect his brother at all costs.",
    "2008_438": "A movie director entices his young friend to come to the beach on the pretext of writing a script. He then starts an affair with the friend's girlfriend.",
    "2008_439": "As an ex-gambler teaches a hot-shot college kid some things about playing cards, he finds himself pulled into the world series of poker, where his protege is his toughest competition.",
    "2008_44": "A disk containing mysterious information from a CIA agent ends up in the hands of two unscrupulous and daft gym employees who attempt to sell it.",
    "2008_440": "A love story based in 1974 and 2004. A 47-year-old Christian man, on the other side of an unwanted divorce, reminisces about his old high school girlfriend from 30 years prior.",
    "2008_441": "A sex and drug addicted young man who is forced into a Christian-run ministry in an attempt to cure him of his \"gay affliction\", where instead he is faced with the truth in his heart and spirit.",
    "2008_442": "",
    "2008_443": "Praying with Lior asks whether someone with Down syndrome can be a spiritual genius. Many believe Lior is close to God -- at least that's what his family and community believe -- though he's also a burden, a best friend, an inspiration and...See morePraying with Lior asks whether someone with Down syndrome can be a spiritual genius. Many believe Lior is close to God -- at least that's what his family and community believe -- though he's also a burden, a best friend, an inspiration and an embarrassment, depending on who is asked and when. As this documentary moves to its climax, Lior must pass through the gateway to manhood - his Bar Mitzvah.  Written by First Run FeaturesSee less",
    "2008_444": "A disillusioned medical student is stranded for a summer in a remote community of counterculture pot farmers, the last place in the world he imagined he would discover himself.",
    "2008_445": "An intimate portrait of poet, painter, musician and singer Patti Smith that mirrors the essence of the artist herself.",
    "2008_446": "",
    "2008_447": "A drama set in the Mississippi delta, where one man's suicide affects three people's lives.",
    "2008_448": "They are married men that pass H.I.V. to their male or female partners. Many of the men hide behind the vow of marriage, but still desire men. The women know, but have grown accustomed to the extravagant lifestyle.",
    "2008_449": "A kid dreams of playing professional basketball in order to escape his dead-end job, living in the suburbs, his bossy older brother and running his Mom's ping pong classes. Read more: Synopsis",
    "2008_45": "A science teacher, his wife, and a young girl struggle to survive a plague that causes those infected to commit suicide.",
    "2008_450": "A television producer with a penchant for drinking and gambling is sent to Las Vegas to convince his troubled niece to enter rehab.",
    "2008_451": "In a society where \"celebutantes\" like Paris Hilton dominate newsstands and models who weigh less than 90 pounds die from malnutrition, female body image is one of the more dire problems facing today's society. \"America the Beautiful\" ...See moreIn a society where \"celebutantes\" like Paris Hilton dominate newsstands and models who weigh less than 90 pounds die from malnutrition, female body image is one of the more dire problems facing today's society. \"America the Beautiful\" illuminates the issue by covering every base. Child models, plastic surgery, celebrity worship, airbrushed advertising, dangerous cosmetics - no rock is left unturned.  Written by samantha urbanSee less",
    "2008_452": "August Evening follows an aging undocumented farm worker named Jaime and his young, widowed daughter-in-law, Lupe, as their lives are thrown into upheaval. Lupe is more of a daughter to Jaime than his own children, and the two try to stick...See moreAugust Evening follows an aging undocumented farm worker named Jaime and his young, widowed daughter-in-law, Lupe, as their lives are thrown into upheaval. Lupe is more of a daughter to Jaime than his own children, and the two try to stick together... but change is inevitable.  Written by anonymousSee less",
    "2008_453": "Excellent documentary describing events leading up to the February 1996 shoot down by Cuban Air Force Migs of 2 U.S. registered Cessna 337 aircraft operated by the Cuban exile organization Brothers To The Rescue based in Miami, USA.",
    "2008_454": "Hook up artist Luke surprises himself when he considers becoming monogamous after meeting and dating smug and handsome Stephen, but Stephen might not be all that he seems, will Luke be disappointed?",
    "2008_455": "The story of an injured American veteran returning home from the war Iraq is set against the backdrop of a critical indictment of the government's handling of the U.S.-led invasion.",
    "2008_456": "An eccentric man living alone in a decrepit house in Tokyo periodically transforms into a 100-foot tall giant in order to defend Japan against similarly sized monsters.",
    "2008_457": "Birth: it's a miracle. A rite of passage. A natural part of life. But more than anything, birth is a business. Compelled to find answers after a disappointing birth experience with her first child, actress Ricki Lake recruits filmmaker ...See moreBirth: it's a miracle. A rite of passage. A natural part of life. But more than anything, birth is a business. Compelled to find answers after a disappointing birth experience with her first child, actress Ricki Lake recruits filmmaker Abby Epstein to explore the maternity care system in America. Focusing on New York City, the film reveals that there is much to distrust behind hospital doors and follows several couples who decide to give birth on their own terms. There is an unexpected turn when director Epstein not only discovers she is pregnant, but finds the life of her child on the line. Should birth be viewed as a natural life process, or should every delivery be treated as a potential medical emergency?See less",
    "2008_458": "An illegal Chinese immigrant falls behind on payments on an enormous smuggling debt. Ming Ding has only until the end of the day to come up with the money.",
    "2008_459": "Based on actual events, a Chinese university student responds violently when his chances for a Nobel Prize are dashed by school politics.",
    "2008_46": "After serving as a bridesmaid 27 times, a young woman wrestles with the idea of standing by her sister's side as her sibling marries the man she's secretly in love with.",
    "2008_460": "Deep in the heart of Utah, commonly referred to as \"Happy Valley,\" residents enjoy one of the lowest crime rates, highest literacy and language fluency - even the most jello consumption - across the nation. Yet under the glossy exterior of...See moreDeep in the heart of Utah, commonly referred to as \"Happy Valley,\" residents enjoy one of the lowest crime rates, highest literacy and language fluency - even the most jello consumption - across the nation. Yet under the glossy exterior of this beautiful community, there are less popular categories that Happy Valley contends in but doesn't advertise, including prescription drug abuse, double the national average of anti-depressant drugs, even suicide. In Happy Valley at least one teen per week dies from drug overdose. The real-life true story, Happy Valley, sheds light on the growing problem of prescription drug abuse in Utah County and, as importantly, the associated issues of denial, conformity, social pressure and guilt. The film intimately follows several lives and families that have been dramatically affected by prescription drug abuse leading to street drug abuse and addiction. From these stories and a single father's journey to reunite a family emerge unconditional love, forgiveness, acceptance... even transformation.  Written by Forever Green PicturesSee less",
    "2008_461": "The film features live stand-up performances by Azhar Usman, Preacher Moss and Mohammed Amer as well as behind the scenes sequences highlighting the individual comedians. The trio poke fun at Muslims and non-Muslims alike and their comedic...See moreThe film features live stand-up performances by Azhar Usman, Preacher Moss and Mohammed Amer as well as behind the scenes sequences highlighting the individual comedians. The trio poke fun at Muslims and non-Muslims alike and their comedic material plays with stereotypes to invite people to think outside of their fixed cultural perceptions.  Written by AnonymousSee less",
    "2008_462": "In a French forest in 1798, a child is found who cannot walk, speak, read or write. A doctor becomes interested in the child and patiently attempts to civilize him.",
    "2008_463": "A turbulent and intriguing love story between two parking officers in the city of Los Angeles.",
    "2008_464": "One man's journey into the world of the so-called 'Bloodline' conspiracy, at the heart of Dan Brown's The Da Vinci Code, where a secret society, the Priory of Sion, claims to have guarded evidence of the marriage of Mary Magdalene and ...See moreOne man's journey into the world of the so-called 'Bloodline' conspiracy, at the heart of Dan Brown's The Da Vinci Code, where a secret society, the Priory of Sion, claims to have guarded evidence of the marriage of Mary Magdalene and Jesus Christ, their children and their descendants down through the centuries.  Written by AnonymousSee less",
    "2008_465": "A suave but cynical man supports his family by marrying and murdering rich women for their money, but the job has some occupational hazards.",
    "2008_466": "This documentary follows the lives and careers of a collective group of Do-it-yourself artists and designers who inadvertently affected the art world.",
    "2008_467": "Based on a true-story - A Plumm Summer tells the remarkable tale of two young brothers, Elliott and Rocky Plumm, who go head-to-head with the FBI in order to crack the \"frog-napping\" case and get their beloved TV puppet, Froggy Doo back on...See moreBased on a true-story - A Plumm Summer tells the remarkable tale of two young brothers, Elliott and Rocky Plumm, who go head-to-head with the FBI in order to crack the \"frog-napping\" case and get their beloved TV puppet, Froggy Doo back on the air, all the while become local heroes and best friends.See less Read more: Synopsis",
    "2008_468": "In 2007 Mobile, Alabama, Mardi Gras is celebrated... and complicated. Following a cast of characters, parades, and parties across an enduring color line, we see that beneath the surface of pageantry lies something else altogether.",
    "2008_469": "The story of two brothers who lead totally different lives. Jake Hunt enjoys life to the fullest in Thailand, while his shy brother Oliver deals with his own depressions back home in the USA. Their dominant mother wants Jake back home and ...See moreThe story of two brothers who lead totally different lives. Jake Hunt enjoys life to the fullest in Thailand, while his shy brother Oliver deals with his own depressions back home in the USA. Their dominant mother wants Jake back home and for this reason, Oliver is sent to Thailand to retrieve his brother. Once there, Oliver finds himself in Jake's bizarre life and falls in love with a beautiful girl, Lek. However, it is not a coincidence that she and Oliver have met.  Written by Rene Tran-GuillotSee less",
    "2008_47": "\"21\" is the fact-based story about six MIT students who were trained to become experts in card counting and subsequently took Vegas casinos for millions in winnings.",
    "2008_470": "The Murrow, Polk, and IDA Award-winning documentary Boogie Man is about Lee Atwater, a blues-playing rogue whose rise from the South to Chairman of the GOP made him a political rock star. He mentored George W. Bush and Karl Rove while ...See moreThe Murrow, Polk, and IDA Award-winning documentary Boogie Man is about Lee Atwater, a blues-playing rogue whose rise from the South to Chairman of the GOP made him a political rock star. He mentored George W. Bush and Karl Rove while leading the Republican party to historic victories, helping make liberal a dirty word, and transforming the way America elects our Presidents. In interviews with Republicans and friends of Atwater, Boogie Man examines his role in America's shift to the right. To Democrats offended by the 1988 Willie Horton controversy, Atwater was a remorseless political assassin dubbed by one Congresswoman \"the most evil man in America.\" The film examines his irreverent sense of humor, his understanding of the American heartland, and his unapologetic vision of politics as war. It ends with a portrait of a cynic's deathbed search for meaning.  Written by AnonymousSee less",
    "2008_471": "The true-life story of Darby Crash, who became an L.A. punk icon after getting kicked out of high school and forming The Germs with a collection of friends who have little experience with their instruments or playing music.",
    "2008_472": "A sketch comedy movie about the joys and embarrassments of teen sex. But mostly the embarrassments.",
    "2008_473": "A beautiful woman (Mori) decides to transform into an ugly duckling in an attempt to ward off men and avoid more romantic disappointments.",
    "2008_474": "",
    "2008_475": "To a soundtrack the mixes gospel with hip-hop, this film tells the story of the heroic but often overlooked protests by black and white civil rights supporters in 1964 in Saint Augustine, Florida, and the inequalities that persist to this ...See moreTo a soundtrack the mixes gospel with hip-hop, this film tells the story of the heroic but often overlooked protests by black and white civil rights supporters in 1964 in Saint Augustine, Florida, and the inequalities that persist to this day in the local African American community.  Written by Stephen CobbSee less",
    "2008_476": "A wave twisting tale of a soul searching surfer experiencing an existential crisis.",
    "2008_477": "Eight of the U.S.'s top high school basketball players compete in the first \"Elite 24\" tournament at Rucker Park.",
    "2008_478": "",
    "2008_479": "An Internet-addicted prep-school student captures on video camera the drug overdose of two girls.",
    "2008_48": "The attempted assassination of the American President is told and re-told from several different perspectives.",
    "2008_480": "Jeff is taking care of everything Mark left behind when he died in an accident. Mark was about to have a visitor, Andrea, an Italian guy he met online. Jeff and Andrea have the chance to share memories of the Mark they knew while getting ...See moreJeff is taking care of everything Mark left behind when he died in an accident. Mark was about to have a visitor, Andrea, an Italian guy he met online. Jeff and Andrea have the chance to share memories of the Mark they knew while getting to know each other.See less",
    "2008_481": "",
    "2008_482": "Box elder bugs are loud, scary looking, and dependent on group swarming. Yet, they're also completely harmless and extremely passive aggressive. Using this metaphor to address a generation that thinks big, talks fast, and threatens to ...See moreBox elder bugs are loud, scary looking, and dependent on group swarming. Yet, they're also completely harmless and extremely passive aggressive. Using this metaphor to address a generation that thinks big, talks fast, and threatens to change the world, Box Elder is an unapologetic portrait of a youth movement at odds with its own ambivalence, exposing a generation defined by privilege, potential, and self-induced paralysis. The film follows four best friends through their last years of college. Dependant on their parents financially, and on each other emotionally, they spend their time sleeping in, hanging out, and eating lots of sandwiches. Using break-ups and re-occurring scholastic failures to impose a quarter-life crisis, they take turns postponing responsibility, avoiding accountability, and looking for someone or something to substantiate their lives, all the while hedging their bets and mastering the art of treading water and getting away with it. It's a collegiate love letter.  Written by TSSee less",
    "2008_483": "The hockey career of former Toronto Maple Leaf Eric McNally, who was known as a tough enforcer, came to an end with a shoulder injury. He is now a sportscaster. Except to his assistant Nula, what he hasn't told his work colleagues is that ...See moreThe hockey career of former Toronto Maple Leaf Eric McNally, who was known as a tough enforcer, came to an end with a shoulder injury. He is now a sportscaster. Except to his assistant Nula, what he hasn't told his work colleagues is that he is gay and that he is in a long term relationship with a sports lawyer named Sam. Eric feels that he can't be openly gay as an ex-hockey player or as a public figure still associated with professional hockey. Eric and Sam's life is turned upside down when they take temporary custody of Scot Latour, whose drug addict mother, Julie, recently passed away from a drug overdose. Julie assigned custody of Scot to her ex-boyfriend, Billy, who is Sam's deadbeat brother. Sam is certain that Billy will eventually come for Scot when he learns that Julie's insurance money also comes with custody. Having only had Julie's influence in his life, Scot is a flamboyant adolescent, who wears make-up, a feather boa and his mother's charm bracelet, and who loves musicals and singing Christmas carols. As they all wait for Billy's arrival, Eric, despite not being Scot's father, and Scot have to figure out how to come to terms with each other - Scot being a boy who expresses himself freely whatever the consequences, and Eric always being concerned about maintaining a macho exterior - within their temporary guardian/charge relationship.  Written by HuggoSee less",
    "2008_484": "A crime drama set in LA's Koreatown, UNDOING introduces us to Samuel, who returns after a mysterious absence to reconcile the death of his best friend exactly one year ago. Read more: Synopsis",
    "2008_485": "Two childhood friends from South Boston turn to crime as a way to get by, ultimately causing a strain in their personal lives and their friendship.",
    "2008_486": "A teenager turns her babysitting service into a call-girl service for married guys after fooling around with one of her customers.",
    "2008_487": "The story is about a 12 year old girl who loses her mother in an automobile accident. Her father struggles with the loss of his wife and trying to raise his young daughter who believes her father is partly responsible for her mother's ...See moreThe story is about a 12 year old girl who loses her mother in an automobile accident. Her father struggles with the loss of his wife and trying to raise his young daughter who believes her father is partly responsible for her mother's death. Belle's maternal grandfather is a changed man since losing his daughter in the accident. He finds it difficult to have a relationship with Belle since she is a constant reminder of her mother. It is Atticus the new puppy who will change Belle's life and the lives of those who love her.  Written by Dennis FallonSee less",
    "2008_488": "15-year-old Tracey Berkowitz is naked under a shower curtain at the back of a bus, looking for her little brother Sonny, who thinks he's a dog.",
    "2008_489": "A look at the inspiration behind Thomas Kinkade's painting The Christmas Cottage, and how the artist was motivated to begin his career after discovering his mother was in danger of losing their family home.",
    "2008_49": "Romantic sparks occur between two dance students from different backgrounds at the Maryland School of the Arts.",
    "2008_490": "The epic story of a family forced to emigrate from Laos after the chaos of the secret air war waged by the U.S. during the Vietnam War. Kuras has spent the last 23 years chronicling the family's extraordinary journey in this deeply ...See moreThe epic story of a family forced to emigrate from Laos after the chaos of the secret air war waged by the U.S. during the Vietnam War. Kuras has spent the last 23 years chronicling the family's extraordinary journey in this deeply personal, poetic, and emotional film.  Written by AnonymousSee less",
    "2008_491": "A young woman engaged to be married finds her life changed forever when she meets her best friend's girlfriend.",
    "2008_492": "At Christmas 2003, New York-based film critic Godfrey Cheshire is visiting his family in North Carolina when his cousin Charlie Silver tells him something startling. Charlie inherited Midway Plantation, the ancestral home of his and ...See moreAt Christmas 2003, New York-based film critic Godfrey Cheshire is visiting his family in North Carolina when his cousin Charlie Silver tells him something startling. Charlie inherited Midway Plantation, the ancestral home of his and Cheshire's extended family, and has been its devoted caretaker. But now Charlie and his wife Dena have made a decision: They want to move Midway - the antebellum manor house and several outbuildings - to a new location to escape Raleigh's encroaching sprawl. Can you really transplant a plantation? Will the \"place\" be the same if it is uprooted from the soil in which it has stood since 1848? Charlie's plan provokes immediate controversy in Cheshire's tradition-minded family. For Cheshire, it brings back memories of the wild, strange and magical place Midway seemed when he was a child, and of the stories he heard there - stories of his mother's family, the Hintons, settling the area in the early 1700s, fighting in the Revolution, being invaded by Yankee troops in the Civil War, and surviving Reconstruction. Yet stories, Cheshire realizes, both convey and conceal. The reality of the Southern plantation was that it depended on the institution of slavery. In Cheshire's family, stories of slaves always depicted them as happy and devoted, which surely disguised a more painful, complex reality. In fact, Midway bred two sets of Hintons, one white, one black. For years, they have rarely encountered each other. But that begins to change as Cheshire sets out to chronicle Charlie's attempt to move Midway.  Written by Godfrey CheshireSee less",
    "2008_493": "East meets West in the Deep South. An overcrowded maximum-security prison-the end of the line in Alabama's correctional system-is dramatically changed by the influence of an ancient meditation program. Behind high security towers and a ...See moreEast meets West in the Deep South. An overcrowded maximum-security prison-the end of the line in Alabama's correctional system-is dramatically changed by the influence of an ancient meditation program. Behind high security towers and a double row of barbed wire and electrical fence dwells a host of convicts who will never see the light of day. But for some of these men, a spark is ignited when it becomes the first maximum-security prison in North America to hold an extended Vipassana retreat, an emotionally and physically demanding course of silent meditation lasting ten days. The Dhamma Brothers tells a dramatic tale of human potential and transformation as it closely follows and documents the stories of the prison inmates at Donaldson Correction Facility who enter into this arduous and intensive program.  Written by Balcony ReleasingSee less",
    "2008_494": "A look at the relationship between a lonely introverted girl and a young video store clerk vying for her attention.",
    "2008_495": "A ruthless philantrophist. A bhangra rapper. An over-protected prodigy. A reckless actress. A lovelorn businessman. An entrepreneurial yogi. And a Loin King. Enter a roller-coaster world of seven strangers whose lives collide during a ...See moreA ruthless philantrophist. A bhangra rapper. An over-protected prodigy. A reckless actress. A lovelorn businessman. An entrepreneurial yogi. And a Loin King. Enter a roller-coaster world of seven strangers whose lives collide during a singing contest in a small New Jersey town.  Written by Manish AcharyaSee less",
    "2008_496": "Refusenik chronicles the thirty-year international movement to free Soviet Jews. The first retrospective film about the movement, it has been called a \"seminal\" work on the subject. Told through the eyes of activists on both sides of the ...See moreRefusenik chronicles the thirty-year international movement to free Soviet Jews. The first retrospective film about the movement, it has been called a \"seminal\" work on the subject. Told through the eyes of activists on both sides of the Iron Curtain - many whom survived punishment in Soviet Gulag labor camps - the film is a tapestry of first person accounts of heroism, sacrifice, and ultimately, liberation.  Written by Laura BialisSee less",
    "2008_497": "Asks the question, Is it really possible to relate to ones parents and siblings after being replaced by the family dog? . . . Perhaps as friends - weird friends?",
    "2008_498": "Academy Award®-nominated director Scott Hicks (\"Shine\") documents an eventful year in the career and personal life of distinguished Western classical composer Philip Glass as he interacts with a number of friends and collaborators, who ...See moreAcademy Award®-nominated director Scott Hicks (\"Shine\") documents an eventful year in the career and personal life of distinguished Western classical composer Philip Glass as he interacts with a number of friends and collaborators, who include Chuck Close, Ravi Shankar, and Martin Scorsese.  Written by AnonymousSee less",
    "2008_499": "Matt is shocked to learn that his ex-boyfriend Ryan is getting married, and he makes plans to rescue him from whatever \"she-devil\" has lured him into this huge mistake.",
    "2008_5": "The story of a bride-to-be trying to find her real father told using hit songs by the popular 1970s group ABBA.",
    "2008_50": "While on vacation in Mexico, Chloe, a ritzy Beverly Hills chihuahua, finds herself lost and in need of assistance in order to get back home.",
    "2008_500": "A curious and lost Eleonore looks for something everywhere, even in the bags of strangers who find themselves sadly smiling only well after she's left their lives. They owe her their thanks.",
    "2008_501": "A documentary on a New York City woman who has spent most of her 93 years in the world of movies, TV, commercial, and print media.",
    "2008_502": "Follows a family of Native Americans living in the City of Angels.",
    "2008_503": "\"Fighting for Life\" follows American military doctors, nurses and medics on the front lines of the Iraq War, young wounded soldiers and marines determined to survive and to heal, and students of USU, the \"best medical school no one's ever ...See more\"Fighting for Life\" follows American military doctors, nurses and medics on the front lines of the Iraq War, young wounded soldiers and marines determined to survive and to heal, and students of USU, the \"best medical school no one's ever heard of,\" on their journey toward becoming career military physicians.  Written by Terry SandersSee less",
    "2008_504": "In the weeks after Hurricane Katrina, the tiny town of LaPlace was overrun with thousands of displaced New Orleans residents. Their already bursting-at-the-seams high school, East St. John, took in over 450 new students. Twenty of them ...See moreIn the weeks after Hurricane Katrina, the tiny town of LaPlace was overrun with thousands of displaced New Orleans residents. Their already bursting-at-the-seams high school, East St. John, took in over 450 new students. Twenty of them were football players. In order to make them feel more welcome, the coach declared all positions were open (even those help by ESJ seniors). For some, that meant the opportunity to play the sport they lived for, but for others, it put their scholarship chances (for many, their only chance at a college education) in jeopardy. But rather than fight or turn bitter, these young men banded together in the face of tragedy to create a team.  Written by Variance FilmsSee less",
    "2008_505": "After marrying the beautiful Abril and moving back to the small town where she grew up, proud new groom Daniel realizes that his new bride keeps a dark secret, and that earning the respect of the locals just might cost him his life.",
    "2008_506": "",
    "2008_507": "It's hard to run for office - even in high school. And the campaign for student body president at Stuyvesant, perhaps the most prestigious public high school in the country, is almost as sophisticated as any presidential election. ...See moreIt's hard to run for office - even in high school. And the campaign for student body president at Stuyvesant, perhaps the most prestigious public high school in the country, is almost as sophisticated as any presidential election. Candidates must choose running mates, navigate primaries, write political platforms, perform in televised debates, shake as many hands as possible, and win newspaper endorsements. But unlike presidential candidates, they also have to do their homework, take their SATs and write their college applications. FRONTRUNNERS follows the recent elections at the country's most competitive high school, exploring how politics works at a nascent level. As the race unfolds, it takes on undertones familiar to anyone who has watched a national election -- revealing that teenagers have an implicit understanding of how strategy, race, gender, personality, platforms, charisma, and hairstyle figure into a winning campaign.  Written by AnonymousSee less",
    "2008_508": "The Dukes, a Doo Wop group, were on top of the world at 17, and struggle for survival in 2008. Their manager is desperately trying to get them work but is met with failure at every turn. Finally pushed to the extreme , they pull a heist ...See moreThe Dukes, a Doo Wop group, were on top of the world at 17, and struggle for survival in 2008. Their manager is desperately trying to get them work but is met with failure at every turn. Finally pushed to the extreme , they pull a heist only a fool would attempt, which leaves them even more desperate. When all seems lost, they find themselves. Underneath the laughter, the film explores the intricacies of redefining yourself; not dealing only with lost fame, but for anyone who's found themselves at the bottom of the mountain looking up to where they once were; and how, in changing times, to hold on to your true self.  Written by Bob ByersSee less",
    "2008_509": "Twelve episodic tales in the life of a Parisian woman and her slow descent into prostitution.",
    "2008_51": "The first chapter of a two-part story centered on a battle fought in China's Three Kingdoms period (220-280 A.D.).",
    "2008_510": "Emotionally devastated by the death of his uncle, Boston carpenter Jack O'Toole (McIntyre) writes a play inspired by the man's wake. When nobody will produce the play, Jack quits his job to produce it himself, imagining that this play will...See moreEmotionally devastated by the death of his uncle, Boston carpenter Jack O'Toole (McIntyre) writes a play inspired by the man's wake. When nobody will produce the play, Jack quits his job to produce it himself, imagining that this play will give a new start to the strained relationship Jack has with his father. But the only stage Jack can afford is in the back room of a neighborhood pub. In this humble environment, Jack pulls together a theater company of sorts and brings his story to the stage, and in the process he brings together his family and friends and helps them move beyond their loss.  Written by Masood, Mashhad, IRANSee less",
    "2008_511": "A Chicago journalist suffering from memory loss takes leaves from his job and returns to his rural hometown, where he bonds with his Alzheimer's-impaired uncle Rollie and his old flame.",
    "2008_512": "A drama centered on two women who engage in a dangerous relationship during South Africa's apartheid era. Read more: Synopsis",
    "2008_513": "A three-part look at the ironies of love, with stories that involve a young boy, a hostage situation, and a divorced elderly couple caught in a love triangle. Read more: Synopsis",
    "2008_514": "April (age 15) is running from one bad situation into another, hoping to find an answer that doesn't involve nudity, and falls in with a group of confused kids chasing their dreams. The black widow in the web is the sexy, pot-dealing Sally.",
    "2008_515": "The epic tale of David Fandila's quest to become the world's top-ranked bullfighter.",
    "2008_516": "In two days, Omer will hit a milestone; his 30th birthday. Like many his age, he hasn't found himself. But then Omer is hardly looking. Instead he chooses to loose himself among the stacks of books at the local library, where he works. It ...See moreIn two days, Omer will hit a milestone; his 30th birthday. Like many his age, he hasn't found himself. But then Omer is hardly looking. Instead he chooses to loose himself among the stacks of books at the local library, where he works. It is a respite from real life. From time to time he goes on blind dates. He meets Danny on one of his dates. 20 years old and full of enthusiasm, Danny dreams of becoming a dancer. Shirley, Omer's little sister, has her own problems. Aside from being Omer's greatest annoyance, she is in an unconventional relationship with, Michal, owner of the city's hippest coffeehouse and her boss. Just when it seems that Omer has completely lost his spark and all seems lost, Enter Ronen, the handsome journalist who ignites the flame Omer has been seeking. Everyone is hoping for a change. They are waiting for the light. The light that will thaw their frozen hearts. But only one person has the answer, Matilda Rose, the alien loving best-selling novelist can solve the issue; Is love dead or are we just looking in all the wrong places?  Written by Yair HochnerSee less",
    "2008_517": "In New York, detective Alex Scott is investigating with his partner Sergio Perez the disappearance of several children. When they visit the Mexican witch Gloria, the woman advises that a powerful evil force is chasing the reincarnation of ...See moreIn New York, detective Alex Scott is investigating with his partner Sergio Perez the disappearance of several children. When they visit the Mexican witch Gloria, the woman advises that a powerful evil force is chasing the reincarnation of her son and drowning the other children to bring pain to their mothers.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2008_518": "Charlie is approached by his crook brother Chico, who is chased by two gangsters. Charlie helps him to escape, but he upsets the criminals, so when his brother Fido is kidnapped, Charlie has to take an attitude with tragic consequences.",
    "2008_519": "A documentary on professional basketball's influence on Jewish culture. Read more: Synopsis",
    "2008_52": "A discovery made by a kung fu obsessed American teen sends him on an adventure to China, where he joins up with a band of martial arts warriors in order to free the imprisoned Monkey King.",
    "2008_520": "Legendary jazz trumpeter, Jack Sheldon, is just 'trying to get good' - not only on his horn, but in his life as well. Wrestling with his demons of drugs, alcohol and unspeakable personal tragedy, Jack's musical journey through the decades ...See moreLegendary jazz trumpeter, Jack Sheldon, is just 'trying to get good' - not only on his horn, but in his life as well. Wrestling with his demons of drugs, alcohol and unspeakable personal tragedy, Jack's musical journey through the decades reveals one artist's 'divine dissatisfaction' in the pursuit of excellence.  Written by AnonymousSee less",
    "2008_521": "A flood in Prague has damaged Marcela and Jarda's home. He behaves boorishly over their son's asthma so she threatens divorce and takes the kids to her mom's, a possessive woman whose husband is a creep. While Marcela is there, Jarda is ...See moreA flood in Prague has damaged Marcela and Jarda's home. He behaves boorishly over their son's asthma so she threatens divorce and takes the kids to her mom's, a possessive woman whose husband is a creep. While Marcela is there, Jarda is jailed for possession of a stolen car (he's a mechanic who's turned his garage into a chop shop). Benes, the urbane man whose car it is, befriends Marcela, and soon she has options. Jarda's mother and her mother push her in opposite directions. Jarda has animal magnetism, Benes offers security, and her own body and mind may be at cross purposes. The Cold War is over, Czechs are free to behave well or badly. What's best?  Written by See less",
    "2008_522": "A landmark court decision in Massachusetts allows gay people in that state to marry - forcing activists, legislators, and ordinary people to reconsider how they view same-sex relationships.",
    "2008_523": "After an A-list star accidentally dies at a Christmas party, a group of ten Hollywood insiders seek redemption.",
    "2008_524": "A filmmaker decides to memorialize a murdered friend when his friend's ex-girlfriend announces she is expecting his son.",
    "2008_525": "Josie Patterson is attempting to start her life over after a tragic incident changed the life she previously knew forever. She gets a job at a small town diner and attempts to establish new relationships. However, the shame over her past ...See moreJosie Patterson is attempting to start her life over after a tragic incident changed the life she previously knew forever. She gets a job at a small town diner and attempts to establish new relationships. However, the shame over her past mistakes prevents her from getting close to anyone. Then, an unlikely friendship with a kind hearted co-worker, Mani, and a romance with a young, drifter musician named Max challenge Josie to recognize that she can't hide from her past forever. These unlikely connections give Josie the strength to reconnect with the young son she thought she had lost forever.  Written by JeffSee less",
    "2008_526": "A man who is being driven crazy by the noise in New York City decides to take vigilante action against it.",
    "2008_527": "The owner of a 1930s nightclub loses control of his life amid love triangles and too much debt. Read more: Synopsis",
    "2008_528": "Young, beautiful and intelligent, Trevor (screenwriter Brent Gorski) is in a stalemate. Entangled in an unhealthy relationship with Darrell, a self-destructive heroin addict, and trapped in a telemarketing job, Trevor finds scant comfort ...See moreYoung, beautiful and intelligent, Trevor (screenwriter Brent Gorski) is in a stalemate. Entangled in an unhealthy relationship with Darrell, a self-destructive heroin addict, and trapped in a telemarketing job, Trevor finds scant comfort in Los Angeles' vapid party scene, where conversation rarely rises above inquiries like \"So, are you an actor?\" Worse still, he and his two best friends - roommate Andie and singer Jake - are being pulled apart by boredom and discontent. At the hospital for his boyfriend's latest overdose, Trevor finds a potential new beginning in Ephram, a medical intern with ambition, a warm demeanor and strikingly good looks. After they spend a romantic evening together, Trevor seems poised to make some changes. He begins by ending his relationship with Darrell and then strives to reconnect with Andie and Jake. But what should be a joyous event - a party celebrating a negative HIV test - explodes into rage and sorrow. Darrell shows up unannounced and makes a scene, Ephram suggests that Trevor isn't ready for a commitment, and Andie, reeling from a painful revelation, kicks Trevor while he's down. Though pulled in multiple directions, Trevor remains committed to bettering his life. But first he must realize that some people are too precious to abandon. Director Rosser Goodman (That's What I'm Talkin' 'Bout, Frameline29) finds rich emotional territory in Gorski's script, keeping it both focused and raw.  Written by JONATHAN L. KNAPPSee less",
    "2008_529": "The military draft is back, three best friends are drafted and given 30 days to report for duty. In that time, they're forced to confront everything they believe about courage, duty, love, friendship and honor.",
    "2008_53": "Two aimless middle-aged losers still living at home are forced against their will to become roommates when their parents marry.",
    "2008_530": "A reclusive man sets out for justice and redemption when three troublesome teens kill his dog for no good reason.",
    "2008_531": "A married couple's relationship begins to fall apart as their 10th wedding anniversary approaches. Read more: Synopsis",
    "2008_532": "Six vignettes set in different sections of Paris, by six directors. St. Germain des Pres (Douchet), Gare du Nord (Rouch), Rue St. Denis (Pollet), and Montparnasse et Levallois (Godard) are stories of love, flirtation and prostitution; ...See moreSix vignettes set in different sections of Paris, by six directors. St. Germain des Pres (Douchet), Gare du Nord (Rouch), Rue St. Denis (Pollet), and Montparnasse et Levallois (Godard) are stories of love, flirtation and prostitution; Place d'Etoile (Rohmer) concerns a haberdasher and his umbrella; and La Muette (Chabrol), a bourgeois family and earplugs.  Written by C. McMullenSee less",
    "2008_533": "A troubled 15-year-old boy attempting to cope with the recent death of his mother sets out to research Dr. Max Gerson's claims of a diet that can cure cancer as his first assignment for home-schooling in this documentary from filmmaker ...See moreA troubled 15-year-old boy attempting to cope with the recent death of his mother sets out to research Dr. Max Gerson's claims of a diet that can cure cancer as his first assignment for home-schooling in this documentary from filmmaker Steve Kroschel (Avalanche, Dying to Have Known). Garrett is a boy who has always been close to nature. He lives on a reserve with a menagerie of orphaned animals, and over the years he's become especially sensitive to the nutritional needs of the diet-sensitive animals he's charged with caring for. When Garrett's mother suffers a tragic and untimely death, the boy falls into a dangerous downward spiral and nearly flunks out of school. Increasingly concerned for Garrett's well-being and determined to strengthen their bond despite the many challenges on the horizon, his father makes the decision to begin home-schooling the distressed teen. Garrett's first assignment: study a controversial book written by Dr. Max Gerson, a physician who claims to have discovered a diet that's capable of curing cancer. Is Dr. Gerson's therapy truly the legitimate, alternative cure it appears to be? In order to find out the truth behind this long-suppressed treatment, Garrett interviews not only Dr. Gerson's family members, but various doctors, skeptics, and cancer patients as well. His studies completed and his findings revelatory, Garrett now sets out to tell the entire world about The Gerson Miracle.  Written by AlinSee less",
    "2008_534": "Sumin is an orphan trying to balance work in a factory with study at an art college and an evening job. One night, a rich young businessman makes an advance on him during one of his driving jobs. They meet again the next day: it is during ...See moreSumin is an orphan trying to balance work in a factory with study at an art college and an evening job. One night, a rich young businessman makes an advance on him during one of his driving jobs. They meet again the next day: it is during a round of redundancy cuts at the factory where Sumin refuses an attempt by a man (who is in fact the boss' son Jaemin) to save his job. Eventually, Sumin is seduced into working as a prostitute in an up-market boy-brothel as Jaemin's obsession with him grows, leaving Jaemin helpless in the face of his overwhelming desire. This is a film of bold sexuality, where unexpected passion, desire and misunderstandings wreak havoc of an operatic intensity.  Written by London Lesbian & Gay Film FestivalSee less",
    "2008_535": "A Seattle history professor, drawn back to his estranged family on the Oregon coast to execute his late mother's estate, is reaquainted with his best friend from childhood, with whom he has a long-awaited tryst. Caught in an accelerating ...See moreA Seattle history professor, drawn back to his estranged family on the Oregon coast to execute his late mother's estate, is reaquainted with his best friend from childhood, with whom he has a long-awaited tryst. Caught in an accelerating series of events, he discovers aspects of his father's New Age cult which take on a dangerous and apocalyptic significance.  Written by Grant CogswellSee less",
    "2008_536": "In southwestern Ontario, ex-baseball player Ray Dokes, upon being released from jail, returns to his rural hometown to stay temporarily with his deceased father's Texan friend, small time horse breeder Pete Culpepper, until he has some ...See moreIn southwestern Ontario, ex-baseball player Ray Dokes, upon being released from jail, returns to his rural hometown to stay temporarily with his deceased father's Texan friend, small time horse breeder Pete Culpepper, until he has some footing in whatever the next phase of his life. Ray's two year incarceration was for assaulting Sonny Stanton, the arrogant son of the wealthiest stable owner and horse breeder in the area, Earl Stanton. The assault left Sonny needing a cane with which to walk. The general consensus is that Ray got a raw deal in that Sonny was the one who did the provoking by his actions. It is also consensus that Sonny is generally not a nice person, he who is not averse to using violence even against women, and has racked up a mountain of gambling debts, mostly betting against his father's horses purely as an act of defiance. Although Ray begins a sexual relationship with Pete's new spirited jockey, Chrissie Nugent, he wants to make things right with his old girlfriend, Etta Parr. Sonny has been buying up all the concessions for a combination golf course/residential development, Etta one of the holdouts, she who will sell her property to anyone but Sonny or his associates. Sonny's fortunes take a turn for the worse when his father goes into a coma while out of the country, with his stepmother invoking power of attorney, freezing all of Earl's assets so that Sonny cannot touch them while Earl is in his current state. When he goes further into gambling debt in trying to get some cash, Sonny believes he has a way out when two of his cousins, stable hands Dean Calder and Paulie Stanton, steal Jumpin Jack Flash, Stanton Stables' most prized horse insured for $10 million and arguably the fastest horse currently in North America. Dean plans to keep the horse only temporarily, specifically to market its services as a stud. In Jumpin Jack Flash, Sonny sees $10 million in his pocket if he can get someone to kill the horse. In finding out about the theft, Ray, in turn, comes up with a plan that he thinks will put Sonny in his place once and for all. But if the plan goes awry, it could mean Ray is headed back to the slammer for a much longer time.  Written by HuggoSee less",
    "2008_537": "On a Tuesday night, five couples have separate sexual adventures.",
    "2008_538": "An escaped convict tries to hide out at his former lover's house, but she has since married and is reluctant to help him.",
    "2008_539": "Major Nick Reed is an intrepid analyst for Army Intelligence. It's his job to locate a secret enemy base whose fighters - the dreaded Ghost Squadron - attack our bombers. Complicating his efforts is a chance meeting with his former love, ...See moreMajor Nick Reed is an intrepid analyst for Army Intelligence. It's his job to locate a secret enemy base whose fighters - the dreaded Ghost Squadron - attack our bombers. Complicating his efforts is a chance meeting with his former love, Lt. Monica Tasty, and her current beau, Major Mitch Dunning. Can Reed find the fighter base in time for the 4th Armoured to attack? Will the Nazi learn our next target and send the Ghost Squadron to attack our bombers? Why do some women fall for the bad boys, completely ignoring the good responsible men right in front of them? Learn the answers in 'At War With Intelligence.'  Written by Matt CarsonSee less",
    "2008_54": "A CIA agent on the ground in Jordan hunts down a powerful terrorist leader while being caught between the unclear intentions of his American supervisors and Jordan Intelligence.",
    "2008_540": "Fashion designer Amer Atrash, perpetually on the verge of success, is undergoing a personal crisis in both his marriage and his business. Attributing his misfortune to bad karma from a wrongdoing committed fifteen years prior, he sets out ...See moreFashion designer Amer Atrash, perpetually on the verge of success, is undergoing a personal crisis in both his marriage and his business. Attributing his misfortune to bad karma from a wrongdoing committed fifteen years prior, he sets out to correct his mistake, and in doing so, experiences a spiritual awakening.  Written by TrevorSee less",
    "2008_541": "A man stuck in the reveries of his youth tracks down the boyhood friend he once tormented, only to find that simpler times were more complicated than he thought.",
    "2008_542": "Alcoholic playboy Kyle Hadley marries the woman secretly loved by his poor but hard-working best friend, who in turn is pursued by Kyle's nymphomaniac sister.",
    "2008_543": "The lives of homeless people are changed forever through an international soccer competition. This film follows six players as they set off for Cape Town, South Africa to play in the Homeless World Cup. Read more: Synopsis",
    "2008_544": "A teenager with an early onset of male-pattern baldness befriends his high school's janitor. Read more: Synopsis",
    "2008_545": "For those who were young, living under the delusions of love and soft drugs in Paris, May 1968 - even if the guitar is still playing, they can't hear it any longer.",
    "2008_546": "A desperate young man, on the run from a dangerous drug dealer, returns to his mother, years after a family tragedy drove them far apart, to hide. However, his old and new life are about to collide. Read more: Synopsis",
    "2008_547": "August centers on two brothers fighting to keep their start-up company afloat on Wall Street during August 2001, a month before the 9/11 terrorist attacks.",
    "2008_548": "The fictional story of an ex-football star, Johnny Dunn, who moves far from the spotlight after a family tragedy to a small, desert town he owns called Jake's Corner. This dramatic comedy is a cross between Kramer vs. Kramer and Northern ...See moreThe fictional story of an ex-football star, Johnny Dunn, who moves far from the spotlight after a family tragedy to a small, desert town he owns called Jake's Corner. This dramatic comedy is a cross between Kramer vs. Kramer and Northern Exposure. Set in the real town of Jake's Corner, Arizona, it is a rest stop for travelers making their way through the Arizona desert, but for the people who live there, it's a rest stop for life. Johnny and the eclectic ensemble that live and work in the town occupy trailers behind the Corner Store and Jake's Corner Bar. Through the years, this cast of misfits has become closer than most families - they are kin. The dynamic of the town is changed forever when Johnny's young nephew comes to live with him.  Written by AnonymousSee less",
    "2008_549": "A \"coming of age\" story where two old friends flee from New York City on a three-day road trip to Montreal, Canada to escape their problems. Read more: Synopsis",
    "2008_55": "Following Jigsaw's grisly demise, Mark Hoffman is commended as a hero, but Agent Strahm is suspicious, and delves into Hoffman's past. Meanwhile, another group of people are put through a series of gruesome tests.",
    "2008_550": "A film about life inside the US Army's Iraq simulation in California's Mojave Desert.",
    "2008_551": "Charlie and Cliff decide they want to go to the Full Moon party in Thailand. Along the way they travel around the world sprinkling the ashes of their dead friend Paul. As they go from country to country they meet a wide variety of crazy ...See moreCharlie and Cliff decide they want to go to the Full Moon party in Thailand. Along the way they travel around the world sprinkling the ashes of their dead friend Paul. As they go from country to country they meet a wide variety of crazy people and have insane adventures.  Written by annonymousSee less",
    "2008_552": "When his mother dies, a teenager takes a road-trip in a stolen car to find his long-lost brother. Along the way he discovers a profound connection with the car-owner and with himself as well.",
    "2008_553": "A semi-paralyzed radio reporter is sent out to investigate a story that leads him into an odd subculture and on a journey of disturbing self-realization.",
    "2008_554": "Soon after the fall of Baghdad in 2003, a young and charismatic film student, Muthana Mohmed, stands in the rubble of the city's film school and explains to an American television audience that his dream of becoming a filmmaker has been ...See moreSoon after the fall of Baghdad in 2003, a young and charismatic film student, Muthana Mohmed, stands in the rubble of the city's film school and explains to an American television audience that his dream of becoming a filmmaker has been destroyed - first by Saddam Hussein, then by American bombs. This brief, fortuitous appearance on MTV changes Muthana's life forever. Watching in the United States, actor/director Liev Schreiber stops channel surfing, utterly captivated. Feeling guilty about a war he opposed, Schreiber decides to extend to the unknown Iraqi the opportunity of a lifetime - to come to Prague to work on an American movie, Everything is Illuminated. On set, frustrated expectations complicate the relationship between Muthana and his American benefactors in what becomes a cross-cultural endeavor gone awry. Filmmaker Nina Davenport becomes increasingly entangled in the young Iraqi's life as his visa is about to expire and the threat of returning to Baghdad looms. Operation Filmmaker, revealing on several levels, addresses the power dynamics between the American filmmaker and her Iraqi subject, unfolding as an engaging parable about the U.S. invasion of Iraq.  Written by anonymousSee less",
    "2008_555": "Documentary looking back at the USSR's Sputnik satellite and its effects at the time and over the last 50 years.",
    "2008_556": "After being abducted as children, and suffering years of abuse, a teenage boy and girl find themselves living on the street.",
    "2008_557": "Otto is a handsome, sensitive, neo-Goth zombie with an identity crisis wandering the streets of the city, until one day he auditions for a zombie film... Read more: Synopsis",
    "2008_558": "Whaledreamers is the heartfelt story of the return of an aboriginal whale dreaming tribe from the edge of extinction and the equally, long journey of the whales, not only to survive the slaughter by man, but to engage the human race into ...See moreWhaledreamers is the heartfelt story of the return of an aboriginal whale dreaming tribe from the edge of extinction and the equally, long journey of the whales, not only to survive the slaughter by man, but to engage the human race into waking up in time.  Written by AnonymousSee less",
    "2008_559": "A famous int'l conductor returns to his small childhood town in northern Sweden for early retirement. He's asked to help with the church choir. He affects the lives of all in the choir.",
    "2008_56": "Grief-stricken mother Christine Collins (Angelina Jolie) takes on the L.A.P.D. to her own detriment when it tries to pass off an obvious impostor as her missing child.",
    "2008_560": "Tom Jeffords tries to make peace between settlers and Apaches in Arizona territory.",
    "2008_561": "Tru moves to a conservative suburb where her friendship with the closeted football player is jeopardized when she starts their school's first Gay-Straight Alliance.",
    "2008_562": "Mid-level gangster Wah falls in love with his beautiful cousin, but must also continue to protect his volatile partner-in-crime and friend, Fly.",
    "2008_563": "Swaziland is the last absolute monarchy in the world and one of the few African countries that has never faced a civil war. This portrait of a nation in transition juxtaposes the opulent life of the royal family to the bare subsistence of ...See moreSwaziland is the last absolute monarchy in the world and one of the few African countries that has never faced a civil war. This portrait of a nation in transition juxtaposes the opulent life of the royal family to the bare subsistence of Swazi citizens who are poised to fight for a better life.  Written by Michael SkolnikSee less",
    "2008_564": "A look at the bond between an illegal immigrant and a blue-collar Italian-American from Queens.",
    "2008_565": "A between-the-sheets peek at Black Love and Sexuality.",
    "2008_566": "Filmmaker Dorothy Fadiman shines a spotlight on the gritty reality of the last decade's most egregious incidents of U.S. electoral insecurity.",
    "2008_567": "\"A Walk to Beautiful\" tells the story of five women in Ethiopia suffering from devastating childbirth injuries. Rejected by their husbands and ostracized by their communities, these women are left to spend the rest of their lives in ...See more\"A Walk to Beautiful\" tells the story of five women in Ethiopia suffering from devastating childbirth injuries. Rejected by their husbands and ostracized by their communities, these women are left to spend the rest of their lives in loneliness and shame. We follow each of these women on their journey to a special hospital in Addis Ababa where they find solace for the first time in years, and we stay with them as their lives begin to change. Through the intimate experiences all five share, we are no longer in the heart of Africa-we are in the hearts of these women. The trials they endure and their attempts to rebuild their lives tell a universal story of hope, courage, and transformation.  Written by Mary Olive SmithSee less",
    "2008_568": "Raquela, a transsexual from the Philippines, dreams of escaping the streets of Cebu City for a fairy tale life in Paris.",
    "2008_569": "A lonely comic book fan, Les Franken, has a reaction to medication and becomes convinced he's a superhero.",
    "2008_57": "In Thailand, John Rambo joins a group of mercenaries to venture into war-torn Burma, and rescue a group of Christian aid workers who were kidnapped by the ruthless local infantry unit.",
    "2008_570": "The lives of two strangers - a struggling mother and a gambling addict - who meet in tragedy. Years pass and they must come to terms with themselves and one another. Read more: Synopsis",
    "2008_571": "In the distant future, a savage trained only to kill finds a way into the community of bored immortals that alone preserves humanity's achievements.",
    "2008_572": "In the late summer of 2006, in the middle of the insurgency, filmmakers Eddy Moretti and Suroosh Alvi traveled to Baghdad to meet and interview the only heavy metal band in Iraq, Acrassicauda. \"Heavy Metal in Baghdad\" is the story of the ...See moreIn the late summer of 2006, in the middle of the insurgency, filmmakers Eddy Moretti and Suroosh Alvi traveled to Baghdad to meet and interview the only heavy metal band in Iraq, Acrassicauda. \"Heavy Metal in Baghdad\" is the story of the band and its members, young Iraqis whose lives have been distorted and displaced by years of continual warfare in their homeland. The filmmakers have collected glimpses into the struggles of Acrassicauda as they try to stay together and stay alive. Their struggle is the untold story of the hopes and dreams of an entire generation of young Iraqis.  Written by AnonymousSee less",
    "2008_573": "A tribute to the Congolese people, who despite desperate poverty, a history of oppression and an ongoing civil war that has killed nearly 4 million people, continue to be sustained by music.",
    "2008_574": "Idealistic 15-year old Owen gets the chance of a lifetime to be the youth spokesman for U.S. Senate Candidate Lawrence Connor, only to be exploited in a fierce campaign of TV and radio ads, posters, interviews, and speaking engagements in ...See moreIdealistic 15-year old Owen gets the chance of a lifetime to be the youth spokesman for U.S. Senate Candidate Lawrence Connor, only to be exploited in a fierce campaign of TV and radio ads, posters, interviews, and speaking engagements in the cut throat media-image-is-all world of American politics.  Written by Bob LeeSee less",
    "2008_575": "Ruza left Belgrade for Switzerland as a young woman full of hope for a new and better life. Twentyfive years later she appears to have achieved everything: She owns a canteen in Zurich, which she manages with a firm grip and financial ...See moreRuza left Belgrade for Switzerland as a young woman full of hope for a new and better life. Twentyfive years later she appears to have achieved everything: She owns a canteen in Zurich, which she manages with a firm grip and financial success. Ruza values her meticulously structured daily routine, both in her professional and private life. Ruzas's orderly world shifts when 22 year-old Ana from Sarajevo enters the scene. She feels threatened by Ana's direct and impulsive manner while at the same time she is intrigued by her zest for life. Slowly a friendship develops between these two self-willed women. However, a certain distance between them remains: Ruza's afraid to open herself up completely, and Ana has a secret too difficult for herself to reveal.See less",
    "2008_576": "A man and woman must face the tension that builds between them during a long-distance relationship.",
    "2008_577": "A mysterious drifter lures two boys into uncovering the secrets of a sleepy southern town.",
    "2008_578": "A lurid tale of lawyers, lawsuits and America's fascination with both.",
    "2008_579": "A pool shark takes the ultimate gamble when she kidnaps her own son and flees her ex-husband.",
    "2008_58": "A new clue to the whereabouts of a lost treasure rekindles a married couple's sense of adventure -- and their estranged romance.",
    "2008_580": "God and Gays: Bridging the Gap explores sexuality and spirituality through the eyes and experiences of people wanting a relationship with the very religion that rejects them. Read more: Synopsis",
    "2008_581": "Gabe and Kakela are happily engaged couple in the mountain of Calabasas, CA. Gabe works as a horse riding instructor and Kakela is a trying-to-be writer. They live in house complex with Nina who is currently separated from her husband. One...See moreGabe and Kakela are happily engaged couple in the mountain of Calabasas, CA. Gabe works as a horse riding instructor and Kakela is a trying-to-be writer. They live in house complex with Nina who is currently separated from her husband. One day, their long-time friend Tre rushes in and asks for short stay after his break-up with his girlfriend. Two men and two women start living under the same roof began its strange journey of the relationship in a isolated world near the city.  Written by Katz UenoSee less",
    "2008_582": "Still mourning the loss of his beloved wife and daughter in a horrendous car accident, a reclusive sexagenarian decides to visit a rather peculiar and secretive brothel.",
    "2008_583": "A flying octopus. A Trojan horse. Two 100-foot-tall soccer players. All made out of balloons. These are just some of the masterful creations you will see as \"TWISTED: A Balloonamentary\" takes you right into the heart of Twist and Shout, ...See moreA flying octopus. A Trojan horse. Two 100-foot-tall soccer players. All made out of balloons. These are just some of the masterful creations you will see as \"TWISTED: A Balloonamentary\" takes you right into the heart of Twist and Shout, one of the world's premier balloon twisting conventions. Exploring how eight balloon twisters' lives are dramatically changed by a little piece of latex, this hilarious and heartwarming documentary is about passion, salvation, love, death, race, religion, and a whole lot of balloons. With animation narrated by JON STEWART, \"TWISTED: A Balloonamentary\" is a story about people who discover that once you can make a balloon dog, you can do anything.  Written by Sara Taksler and Naomi GreenfieldSee less",
    "2008_584": "A young math genius discovers a huge solar storm on the verge of destroying the Earth's power grid and he must alert the world before a powerful businessman stops him. Read more: Synopsis",
    "2008_585": "A failed boxer (Leguizamo) struggles to find a job and an apartment for his family on Christmas Eve.",
    "2008_586": "On a day trip through the countryside, aspiring opera singer In-jeong flees to the woods to escape the advances of her lecherous professor and mentor, Yeong-sun. When a seemingly harmless local man offers her a ride to the bus station, ...See moreOn a day trip through the countryside, aspiring opera singer In-jeong flees to the woods to escape the advances of her lecherous professor and mentor, Yeong-sun. When a seemingly harmless local man offers her a ride to the bus station, In-jeong thinks she's been saved - until he insists that they stop to meet his friends, a disturbed group of country-bred thugs. In-jeong finds herself reunited with Yeong-sun and it slowly becomes clear that the pair is being held captive to participate in the gang's sadistic mind games. This film examines the power struggles that exist even at the lowest rung of society.  Written by Peter KuoSee less",
    "2008_587": "Pic documents the daily lives of a small community of the living deceased who make their home in Los Angeles.",
    "2008_588": "In a half-changed world, women are often forced to choose: Mothering or working? Your children's wellbeing or your own own? Responsibility or self expression? Who Does She Think She Is?, a documentary by Academy Award winning filmmaker ...See moreIn a half-changed world, women are often forced to choose: Mothering or working? Your children's wellbeing or your own own? Responsibility or self expression? Who Does She Think She Is?, a documentary by Academy Award winning filmmaker Pamela Tanner Boll, features five fierce women who refuse to choose. Through their lives, we explore some of the most problematic intersections of our time: mothering and creativity, partnering and independence, economics and art. Along the way, the film invites us to consider both ancient legacies of women worshipped as cultural muses and more modern times where most people can't even name a handful of female artists. In the end, the diverse women in the film demonstrate that our creativity and our caregiving are not mutually exclusive, but deeply connected. In fact, their co-existence might just be the key to finishing the job.  Written by Courtney MartinSee less",
    "2008_589": "A recluse telemarkets at an office, where his boss is his only friend. As he befriends a new, social colleague and sketches/paints her, his dark mind surfaces.",
    "2008_59": "Frank Martin is forced to deliver Valentina, the kidnapped daughter of a Ukrainian government official, from Marseilles to Odessa on the Black Sea. En route, he has to contend with thugs who want to intercept Valentina's safe delivery.",
    "2008_590": "Without one eccentric first-generation Jewish immigrant from Transylvania, the New York City Marathon simply wouldn't exist. Ehrlich's fun, loving, and inspirational tribute to the late Fred Lebow shows how one man's imagination, ...See moreWithout one eccentric first-generation Jewish immigrant from Transylvania, the New York City Marathon simply wouldn't exist. Ehrlich's fun, loving, and inspirational tribute to the late Fred Lebow shows how one man's imagination, determination, and love for running created one of the world's most popular sporting events.  Written by Tribeca Film FestivalSee less",
    "2008_591": "On February 16, 1989 Larry Bloch and a team of novices achieved something unique in a former Chineese-food warehouse just south of the Holland Tunnel in Manhattan. Not only did this inexperienced collective open a nightclub in the ...See moreOn February 16, 1989 Larry Bloch and a team of novices achieved something unique in a former Chineese-food warehouse just south of the Holland Tunnel in Manhattan. Not only did this inexperienced collective open a nightclub in the mostly-underdeveloped Tribeca region but they created one that fused music with activism in an all together distinctive manner.  Written by Dean BudnickSee less",
    "2008_592": "A mysterious client of private eye Don Strachey pays him cash to tail a woman who turns out to be an undercover officer; an older lesbian couple are victims of threats and vandalism; an old flame of his lover Tim shows up to support the ...See moreA mysterious client of private eye Don Strachey pays him cash to tail a woman who turns out to be an undercover officer; an older lesbian couple are victims of threats and vandalism; an old flame of his lover Tim shows up to support the older couple; neighbors are angry at the couple for refusing to sell out to a developer; and, parents are angry at one of the couple, Dorothy, for being a good guidance counselor to gay teens. Her partner, Edith, wants to move away; Dorothy is adamant about staying. When someone dies in a fire in their barn, the stakes get higher. Don, who does not believe in coincidence, gives the police enough information to stay on their good side as he pursues the truth.  Written by See less",
    "2008_593": "Failing test scores, drunk teachers, and an extortionist principal; it's up to Vice-Principal Tom to expose the principal's corruption and turn the school around before the school board shuts them down.",
    "2008_594": "David Terran wrote scientific theories predicting an inevitable shift in Earth's magnetic poles. Then an Iranian underground nuclear test sets off a global phenomenon that matches David's doomsday scenario. Read more: Synopsis",
    "2008_595": "A drama about two Ethiopians who enter a marriage of convenience and struggle to maintain traditional values as they strive toward their dreams.",
    "2008_596": "A documentary on Arnold Schwarzenegger's gubernatorial campaign in California.",
    "2008_597": "In Miami, the successful lawyer Stacy and her colleague and friend Lauren are enjoying a party promoted by the company where they work when Stacy receives a call from her hometown Venice telling that her sister Kate was murdered. Stacy ...See moreIn Miami, the successful lawyer Stacy and her colleague and friend Lauren are enjoying a party promoted by the company where they work when Stacy receives a call from her hometown Venice telling that her sister Kate was murdered. Stacy heads to Venice and meets her former high school mate Bobby in charge of the investigation of the case but without any lead. Stacy meets Kate's employer Roger trying to get some information about her sister since they were distant and without contact for a long time. While in Kate's house, she finds an external HD hidden in her Teddy Bear and she discovers that Kate was a user of a site that promoted encounters for kinky sex; together she finds the address book of her sister with a couple of names. Stacy joins the site and schedules to meet with the guys listed in the address book sure that one of them might be the killer of her sister.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2008_598": "Victor Reynolds arrives at the notorious House of Usher, whereupon he is greeted by old acquaintances Roderick and Madeline Usher and their servant, Markus. As Victor uncovers more about the history of the house and the disappearances of ...See moreVictor Reynolds arrives at the notorious House of Usher, whereupon he is greeted by old acquaintances Roderick and Madeline Usher and their servant, Markus. As Victor uncovers more about the history of the house and the disappearances of those that entered it previously, he begins to realize that he is in mortal danger.  Written by tixylixSee less",
    "2008_599": "Tim Callahan, aide to New York Senator Lauren Platt, is disappointed that all of the $3 million funding has been pulled from his latest pet project, a safe zone for children and youth. His personal partner, private investigator Donald ...See moreTim Callahan, aide to New York Senator Lauren Platt, is disappointed that all of the $3 million funding has been pulled from his latest pet project, a safe zone for children and youth. His personal partner, private investigator Donald Strachey, believes Tim's passion for the project stems from the fact of his own sister's troubled youth, she who has been missing since age seventeen. Tim believes his prayers have been answered when a man, identifying himself as a lawyer, tells him that he represents someone who wants to make a $3 million anonymous donation to the project. Those prayers turn into a nightmare when that lawyer is later found murdered, the dead body in Donald's car. The murdered man is Jake Lenigan, a third generation lawyer in a powerful family law firm. Jake's father was murdered twelve years earlier, the perceived suspect in that case being his wife Joan, who has since disappeared. Tim and Donald's situation becomes even more nightmarish when Tim anonymously receives that $3 million in untraceable Euro bonds. The murderer will do whatever is necessary to get that money back from Tim and Donald, the latter who is working with the police to find Lenigan's purpose in wanting to donate the money to Tim's cause, find if Jake's father's murder has anything to do with this case, discover the owner of the money and thus the probable murderer, and most importantly protect himself and his boyfriend from being possible murder victims.  Written by HuggoSee less",
    "2008_6": "The Madagascar animals fly back to New York City, but crash-land on an African nature reserve, where they meet others of their own kind, and Alex especially discovers his royal heritage as prince of a lion pride.",
    "2008_60": "Post-WWII Germany: Nearly a decade after his affair with an older woman came to a mysterious end, law student Michael Berg re-encounters his former lover as she defends herself in a war-crime trial.",
    "2008_600": "A NASA scientist discovers that their manned space station has been struck by a meteor. The station is now hurtling towards Los Angeles, carrying with it a secret nuclear reactor, putting million of lives at risk.",
    "2008_601": "Ex-spy Jacob Keane is drawn back into the shadowy world of international espionage when his former partner Marta reappears after seventeen years, her memory erased, on the run from a pair of deadly, psychopathic assassins. Read more: Synopsis",
    "2008_602": "Caught in the middle of a bank robbery, a slacker and a bank employee become the ones who arbitrate the intense situation.",
    "2008_603": "Young Musa is orphaned after a mysterious illness strikes his village in KwaZulu Natal. To help his grandmother, Musa sets out for Johannesburg with his father's last gift, a tribal drum, in search of work and his uncle. The journey ...See moreYoung Musa is orphaned after a mysterious illness strikes his village in KwaZulu Natal. To help his grandmother, Musa sets out for Johannesburg with his father's last gift, a tribal drum, in search of work and his uncle. The journey confronts him with the stark realities of urban life, but his indomitable spirit never wavers; he returns with a truth and understanding his elders have failed to grasp.  Written by Zoe EltonSee less",
    "2008_604": "Lydia is an overweight sales clerk in a trendy home furnishings store, nearing 30. Though she is a member of a Fat Acceptance Group (a movement dedicated to fighting prejudice against overweight people), she is still struggling with ...See moreLydia is an overweight sales clerk in a trendy home furnishings store, nearing 30. Though she is a member of a Fat Acceptance Group (a movement dedicated to fighting prejudice against overweight people), she is still struggling with complex feelings about her body and its place in the world. Darcy, a recovering-anorexic real estate agent in her mid-20s, is struggling with the same issues from a very different perspective. Her attempt to join the Fat Acceptance Group (since she sees herself as fat) is quickly rejected - but it introduces her to Lydia. Lydia is initially wary of Darcy's efforts to become friends, but Darcy's hunger for emotional contact breaks through the wall of apparent differences and they begin an unexpected friendship. At the same time Lydia gets involved in a sexual relationship with Bob, an overweight man who joins her in walking for exercise early mornings at Venice beach. Stirred emotionally by this new romance and by her conflict with the Fat Acceptance Group, Lydia decides to ask her new friend for an unusual favor: she wants anorexia lessons. When Darcy lets Lydia inside her secret inner world, it forces both women to confront buried feelings about their bodies. Sexuality and fashion, anger and femininity, trust and fear, hunger and satisfaction: there are things that women can only talk about honestly with other women. But they never seem to find a way to do it. This is a movie about two women who do.  Written by AnonymousSee less",
    "2008_605": "An irresponsible party girl begins a journey to re-discover her tap dancing roots.",
    "2008_606": " Read more: Synopsis",
    "2008_607": "This modernization of Shakespear's tragic love story Romeo and Juliette is set in Los Angeles against a backdrop of inter-racial romance.",
    "2008_61": "A guy in love with an engaged woman tries to win her over after she asks him to be her maid of honor.",
    "2008_62": "Devastated Peter takes a Hawaiian vacation in order to deal with the recent break-up with his TV star girlfriend, Sarah. Little does he know, Sarah's traveling to the same resort as her ex - and she's bringing along her new boyfriend.",
    "2008_63": "A process server and his marijuana dealer wind up on the run from hitmen and a corrupt police officer after he witnesses his dealer's boss murder a competitor while trying to serve papers on him.",
    "2008_64": "A young girl inhabits an isolated island with her scientist father and communicates with a reclusive author of the novel she's reading.",
    "2008_65": "Two friends on a summer holiday in Spain become enamored with the same painter, unaware that his ex-wife, with whom he has a tempestuous relationship, is about to re-enter the picture.",
    "2008_66": "A young driver, Speed Racer, aspires to be champion of the racing world with the help of his family and his high-tech Mach 5 automobile.",
    "2008_67": "Wild behavior forces a pair of energy drink reps to enroll in a Big Brother program.",
    "2008_68": "Coming together to solve a series of murders in New York City are a police detective and an assassin, who will be hunted by the police, the mob, and a ruthless corporation.",
    "2008_69": "An unusually brave mouse helps to restore happiness to a forlorn kingdom after making friends with a gentleman rat.",
    "2008_7": "James Bond descends into mystery as he tries to stop a mysterious organisation from eliminating a country's most valuable resource.",
    "2008_70": "A spoof of 300 and many other movies, TV series/shows/commercials, video games and celebrities. King Leonidas of Sparta and his army of 12 go to war against Xerxes of Persia to fight to the death for Sparta's freedom.",
    "2008_71": "A doctor, who is travelling to see his estranged son, sparks with an unhappily married woman at a North Carolina inn.",
    "2008_72": "A young couple staying in an isolated vacation home are terrorized by three unknown assailants.",
    "2008_73": "Two veteran New York City detectives work on a case of serial executions of criminals who escaped justice.",
    "2008_74": "Two sisters contend for the affection of King Henry VIII.",
    "2008_75": "An ex-cop and his family are the target of an evil force that is using mirrors as a gateway into their home.",
    "2008_76": "Ex-con Jensen Ames is forced by the warden of a notorious prison to compete in our post-industrial world's most popular sport: a car race in which inmates must brutalize and kill one another on the road to victory.",
    "2008_77": "A young couple living in a Connecticut suburb during the mid-1950s struggle to come to terms with their personal problems while trying to raise their two children.",
    "2008_78": "Veteran-turned-mercenary Toorop takes the high-risk job of escorting a woman from Russia to America. Little does he know that she is host to an organism that a cult wants to harvest in order to produce a genetically modified Messiah.",
    "2008_79": "Orphaned high school student Rick Riker is bitten by a radioactive dragonfly, develops super powers (except for the ability to fly), and becomes a hero. Read more: Synopsis",
    "2008_8": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
    "2008_80": "A 3-D concert film of the 2007 Hannah Montana/Miley Cyrus tour. Read more: Synopsis",
    "2008_81": "A newly unemployed cellist takes a job preparing the dead for funerals.",
    "2008_82": "After Playboy bunny Shelley is kicked out of the playboy mansion, she finds a job as the house mother for a sorority full of socially awkward girls.",
    "2008_83": "Mulder and Scully are called back to duty by the FBI when a former priest claims to be receiving psychic visions pertaining to a kidnapped agent.",
    "2008_84": "After the Republic's victory on Christophsis, Anakin and his new apprentice Ahsoka Tano must rescue the kidnapped son of Jabba the Hutt. Political intrigue complicates their mission.",
    "2008_85": "An undercover cop, disillusioned by the death of his wife, is implicated in the murder of an officer and must struggle to clear himself.",
    "2008_86": "Three chimps are sent into space to explore the possibility of alien life when an unmanned space shuttle crash lands on an uncharted planet.",
    "2008_87": "Martine offers Terry a lead on a foolproof bank hit on London's Baker Street. She targets a roomful of safe deposit boxes worth millions in cash and jewelry along with a treasure trove of dirty secrets.",
    "2008_88": "A successful, single businesswoman who dreams of having a baby discovers she is infertile and hires a working class woman to be her unlikely surrogate.",
    "2008_89": "A teenage girl discovers her father has an amazing talent to bring characters out of their books and must try to stop a freed villain from destroying them all, with the help of her father, her aunt, and a storybook's hero.",
    "2008_9": "In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.",
    "2008_90": "Violinist Sydney Wells was accidentally blinded by her sister Helen when she was five years old. She submits to a cornea transplantation, and while recovering from the operation, she realizes that she is seeing dead people.",
    "2008_91": "Donna's senior prom is supposed to be the best night of her life, though a sadistic killer from her past has different plans for her and her friends.",
    "2008_92": "A political consultant tries to explain his impending divorce and past relationships to his 11-year-old daughter.",
    "2008_93": "The story of Harvey Milk and his struggles as an American gay activist who fought for gay rights and became California's first openly gay elected official.",
    "2008_94": "FBI agent Jennifer Marsh is tasked with hunting down a seemingly untraceable serial killer who posts live videos of his victims on the Internet. As time runs out, the cat and mouse chase becomes more personal.",
    "2008_95": "A Catholic school principal questions a priest's ambiguous relationship with a troubled young student.",
    "2008_96": "When an overachieving high school student decides to travel around the country to choose the perfect college, her overprotective cop father decides to accompany her to keep her on the straight and narrow.",
    "2008_97": "A crew of miniature aliens operate a spaceship that has a human form. While trying to save their planet, the aliens encounter a new problem, as their ship becomes smitten with an Earth woman.",
    "2008_98": "Jewish brothers in Nazi-occupied Eastern Europe escape into the Belarussian forests, where they join Russian resistance fighters, and endeavor to build a village, in order to protect themselves and about one thousand Jewish non-combatants.",
    "2008_99": "A wealthy New Yorker wrestles with the decision to leave her cheating husband, as she and her friends discover that women really can have it all."
}