{
    "2009_1": {
        "plotSummary": "A paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.",
        "runtimeMinutes": "162"
    },
    "2009_10": {
        "plotSummary": "Three buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding.",
        "runtimeMinutes": "100"
    },
    "2009_100": {
        "plotSummary": "An urbane fox cannot resist returning to his farm raiding ways and then must help his community survive the farmers' retaliation.",
        "runtimeMinutes": "87"
    },
    "2009_101": {
        "plotSummary": "After kidnapping and brutally assaulting two young women, a gang unknowingly finds refuge at a vacation home belonging to the parents of one of the victims: a mother and father who devise an increasingly gruesome series of revenge tactics.",
        "runtimeMinutes": "110"
    },
    "2009_102": {
        "plotSummary": "Former C.I.A. spy Bob Ho takes on his toughest assignment to date: looking after his girlfriend's three kids, who haven't exactly warmed to their mom's beau.",
        "runtimeMinutes": "94"
    },
    "2009_103": {
        "plotSummary": "The life and death story of The Notorious B.I.G. (a.k.a. Christopher Wallace), who came straight out of Brooklyn to take the world of rap music by storm.",
        "runtimeMinutes": "122"
    },
    "2009_104": {
        "plotSummary": "Lisbeth is recovering in a hospital and awaiting trial for three murders when she is released. Mikael must prove her innocence, but Lisbeth must be willing to share the details of her sordid experiences with the court.",
        "runtimeMinutes": "147"
    },
    "2009_105": {
        "plotSummary": "A young man comforts his older brother's wife and children after he goes missing in Afghanistan.",
        "runtimeMinutes": "105"
    },
    "2009_106": {
        "plotSummary": "The U.S. government decides to go after an agro-business giant with a price-fixing accusation, based on the evidence submitted by their star witness, vice president-turned-informant Mark Whitacre.",
        "runtimeMinutes": "108"
    },
    "2009_107": {
        "plotSummary": "Anna returns home after a stint in a mental hospital, but her recovery is jeopardized by her cruel stepmother and ghastly visions of her dead mother.",
        "runtimeMinutes": "87"
    },
    "2009_108": {
        "plotSummary": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.",
        "runtimeMinutes": "81"
    },
    "2009_109": {
        "plotSummary": "Under constant attack by Angels, NERV introduces two new pilots: the mysterious Makinami Mari Illustrous and the intense Asuka Langley Shikinami. Parallel to the incursion, Gendo Ikari and SEELE proceed the secret project that involves ...See moreUnder constant attack by Angels, NERV introduces two new pilots: the mysterious Makinami Mari Illustrous and the intense Asuka Langley Shikinami. Parallel to the incursion, Gendo Ikari and SEELE proceed the secret project that involves both Rei and Shinji.  Written by Anime News NetworkSee less",
        "runtimeMinutes": "112"
    },
    "2009_11": {
        "plotSummary": "The world-famous singing preteen chipmunk trio return to contend with the pressures of school, celebrity, and a rival female music group known as The Chipettes.",
        "runtimeMinutes": "88"
    },
    "2009_110": {
        "plotSummary": "Thirty years ago Bolshoi Orchestra conductor Andreï Filipov was fired for hiring Jewish musicians. Now a lowly janitor, an opportunity arises to gather his old musicians to go and pose as the official Buolshoi orchestra in Paris.",
        "runtimeMinutes": "119"
    },
    "2009_111": {
        "plotSummary": "In a future mind-controlling game, death row convicts are forced to battle in a 'Doom'-type environment. Convict Kable, controlled by Simon, a skilled teenage gamer, must survive thirty sessions in order to be set free.",
        "runtimeMinutes": "95"
    },
    "2009_112": {
        "plotSummary": "Convinced that a CCN cameraman is her true love, an eccentric crossword puzzler trails him as he travels all over the country, hoping to convince him that they belong together.",
        "runtimeMinutes": "99"
    },
    "2009_113": {
        "plotSummary": "When an android replica of a boy is rejected by his aggrieved creator, he goes off to find his own identity in an adventure that would make him the greatest hero of his time.",
        "runtimeMinutes": "94"
    },
    "2009_114": {
        "plotSummary": "A historical drama set in Roman Egypt, concerning a slave who turns to the rising tide of Christianity in the hope of pursuing freedom while falling in love with his mistress, the philosophy and mathematics professor Hypatia of Alexandria.",
        "runtimeMinutes": "127"
    },
    "2009_115": {
        "plotSummary": "Laurie Strode struggles to come to terms with her brother Michael's deadly return to Haddonfield, Illinois; meanwhile, Michael prepares for another reunion with his sister.",
        "runtimeMinutes": "105"
    },
    "2009_116": {
        "plotSummary": "Teenager Darren Shan meets a mysterious man at a freak show who turns out to be a vampire. After a series of events, Darren must leave his normal life and go on the road with the Cirque du Freak, becoming a creature of the night.",
        "runtimeMinutes": "119"
    },
    "2009_117": {
        "plotSummary": "A newspaper journalist discovers a homeless musical genius and tries to improve his situation.",
        "runtimeMinutes": "117"
    },
    "2009_118": {
        "plotSummary": "Harry Caine, a blind writer, reaches this moment in time when he has to heal his wounds from 14 years back. He was then still known by his real name, Mateo Blanco, and directing his last movie.",
        "runtimeMinutes": "127"
    },
    "2009_119": {
        "plotSummary": "Three unconnected Brooklyn cops wind up at the same deadly location after enduring vastly different career paths.",
        "runtimeMinutes": "132"
    },
    "2009_12": {
        "plotSummary": "Security guard Larry Daley infiltrates the Smithsonian Institution in order to rescue Jedediah and Octavius, who have been shipped to the museum by mistake.",
        "runtimeMinutes": "105"
    },
    "2009_120": {
        "plotSummary": "A band of rogue DJs that captivated Britain, playing the music that defined a generation and standing up to a government that wanted classical music, and nothing else, on the airwaves.",
        "runtimeMinutes": "135"
    },
    "2009_121": {
        "plotSummary": "A widower whose book about coping with loss turns him into a best-selling self-help guru, falls for the hotel florist where his seminar is given, only to learn that he hasn't yet truly confronted his wife's passing.",
        "runtimeMinutes": "109"
    },
    "2009_122": {
        "plotSummary": "A middle-aged, misanthropic divorcee from New York City surprisingly enters a fulfilling, Pygmalion-type relationship with a much younger, unsophisticated Southern girl.",
        "runtimeMinutes": "93"
    },
    "2009_123": {
        "plotSummary": "A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later.",
        "runtimeMinutes": "129"
    },
    "2009_124": {
        "plotSummary": "Chelios faces a Chinese mobster who has stolen his nearly indestructible heart and replaced it with a battery-powered ticker which requires regular jolts of electricity to keep working.",
        "runtimeMinutes": "96"
    },
    "2009_125": {
        "plotSummary": "A small wooden box arrives on the doorstep of a married couple, who know that opening it will grant them a million dollars and kill someone they don't know.",
        "runtimeMinutes": "115"
    },
    "2009_126": {
        "plotSummary": "In New York City, a young counterfeiter is introduced to the world of underground street fighting by a seasoned scam artist, who becomes his manager on the bare-knuckling brawling circuit.",
        "runtimeMinutes": "105"
    },
    "2009_127": {
        "plotSummary": "A comedy set in a world where no one has ever lied, until a writer seizes the opportunity for personal gain.",
        "runtimeMinutes": "100"
    },
    "2009_128": {
        "plotSummary": "A newly possessed high school cheerleader turns into a succubus who specializes in killing her male classmates. Can her best friend put an end to the horror?",
        "runtimeMinutes": "102"
    },
    "2009_129": {
        "plotSummary": "Street dancer Thomas Uncles is from the wrong side of the tracks, but his bond with the beautiful Megan White might help the duo realize their dreams as they enter in the mother of all dance battles. Read more: Synopsis",
        "runtimeMinutes": "83"
    },
    "2009_13": {
        "plotSummary": "The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful Romulan from the future creates black holes to destroy the Federation one planet at a time.",
        "runtimeMinutes": "127"
    },
    "2009_130": {
        "plotSummary": "Larry Gopnik, a Midwestern physics teacher, watches his life unravel over multiple sudden incidents. Though seeking meaning and answers amidst his turmoils, he seems to keep sinking.",
        "runtimeMinutes": "106"
    },
    "2009_131": {
        "plotSummary": "Michael Harding (Penn Badgely) returns home from military school to find his mother Susan (Sela Ward) happily in love and living with her new boyfriend David (Dylan Walsh). As the two men get to know each other, he becomes more and more ...See moreMichael Harding (Penn Badgely) returns home from military school to find his mother Susan (Sela Ward) happily in love and living with her new boyfriend David (Dylan Walsh). As the two men get to know each other, he becomes more and more suspicious of the man who is always there with a helpful hand.See less",
        "runtimeMinutes": "101"
    },
    "2009_132": {
        "plotSummary": "A dramatization of the turbulent first years of Queen Victoria's rule, and her enduring romance with Prince Albert.",
        "runtimeMinutes": "105"
    },
    "2009_133": {
        "plotSummary": "A Miami, Florida businesswoman adjusts to her new life in a small Minnesota town.",
        "runtimeMinutes": "97"
    },
    "2009_134": {
        "plotSummary": "A young boy's discovery of a colorful, wish-granting rock causes chaos in the suburban town of Black Falls when jealous kids and scheming adults alike set out to get their hands on it. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2009_135": {
        "plotSummary": "A social worker fights to save a girl from her abusive parents, only to discover that the situation is more dangerous than she ever expected. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2009_136": {
        "plotSummary": "In a dangerous post-apocalyptic world, an ailing father defends his son as they slowly travel to the sea.",
        "runtimeMinutes": "111"
    },
    "2009_137": {
        "plotSummary": "A group of sorority sisters try to cover up the death of their house-sister after a prank gone wrong, only to be stalked by a serial killer.",
        "runtimeMinutes": "101"
    },
    "2009_138": {
        "plotSummary": "Bi-polar mall security guard Ronnie Barnhardt is called into action to stop a flasher from turning shopper's paradise into his personal peep show. But when Barnhardt can't bring the culprit to justice, a surly police detective is recruited...See moreBi-polar mall security guard Ronnie Barnhardt is called into action to stop a flasher from turning shopper's paradise into his personal peep show. But when Barnhardt can't bring the culprit to justice, a surly police detective is recruited to close the case.See less",
        "runtimeMinutes": "86"
    },
    "2009_139": {
        "plotSummary": "A coming-of-age story about a teenage girl in 1960s suburban London, and how her life changes with the arrival of a playboy nearly twice her age.",
        "runtimeMinutes": "100"
    },
    "2009_14": {
        "plotSummary": "A woman transformed into a giant after she is struck by a meteorite on her wedding day becomes part of a team of monsters sent in by the U.S. government to defeat an alien mastermind trying to take over Earth.",
        "runtimeMinutes": "94"
    },
    "2009_140": {
        "plotSummary": "An English professor, one year after the sudden death of his boyfriend, is unable to cope with his typical days in 1960s Los Angeles.",
        "runtimeMinutes": "99"
    },
    "2009_141": {
        "plotSummary": "In Maoist China, a boy is taken from his family and trained to become a dancer, but everything he knows is challenged when he is chosen to attend a ballet summer school in Houston, Texas.",
        "runtimeMinutes": "117"
    },
    "2009_142": {
        "plotSummary": "A 3-D concert film of the 2008 Jonas Brothers \"Burning Up\" concert tour, as well as documentary footage on the lives of the three brothers. Read more: Synopsis",
        "runtimeMinutes": "76"
    },
    "2009_143": {
        "plotSummary": "A financial executive who can't stop his career downspiral is invited into his daughter's imaginary world, where solutions to his problems await. Read more: Synopsis",
        "runtimeMinutes": "107"
    },
    "2009_144": {
        "plotSummary": "A newbie guard for an armored truck company is coerced by his veteran coworkers to steal a truck containing $42 million. But a wrinkle in their supposedly foolproof plan divides the group, leading to a potentially deadly resolution.",
        "runtimeMinutes": "88"
    },
    "2009_145": {
        "plotSummary": "Two pairs of lovers on a Hawaiian vacation discover that psychopaths are stalking and murdering tourists on the islands.",
        "runtimeMinutes": "98"
    },
    "2009_146": {
        "plotSummary": "Another mission of world-known French secret agent leads him to exotic Brazil.",
        "runtimeMinutes": "101"
    },
    "2009_147": {
        "plotSummary": "An old-fashioned romantic tells his personal love story to a modern man who has just broken up with his girlfriend. Has love really ever changed?",
        "runtimeMinutes": "128"
    },
    "2009_148": {
        "plotSummary": "A cop turns con man once he comes out of the closet. Once imprisoned, he meets the second love of his life, whom he'll stop at nothing to be with.",
        "runtimeMinutes": "102"
    },
    "2009_149": {
        "plotSummary": "Two crew members of a spaceship wake up from hypersleep to discover that all their colleagues are missing. Despite this, it appears that they are not alone.",
        "runtimeMinutes": "108"
    },
    "2009_15": {
        "plotSummary": "The early years of James Logan, featuring his rivalry with his brother Victor Creed, his service in the special forces team Weapon X, and his experimentation into the metal-lined mutant Wolverine.",
        "runtimeMinutes": "107"
    },
    "2009_150": {
        "plotSummary": "A disgruntled tour guide in Greece gains an unexpected new outlook on life thanks to one of the people on what she intends to be her last tour.",
        "runtimeMinutes": "98"
    },
    "2009_151": {
        "plotSummary": "A look at the life of legendary American pilot Amelia Earhart, who disappeared while flying over the Pacific Ocean in 1937 in an attempt to make a flight around the world.",
        "runtimeMinutes": "111"
    },
    "2009_152": {
        "plotSummary": "Strange events happen in a small village in the north of Germany during the years before World War I, which seem to be ritual punishment. Who is responsible?",
        "runtimeMinutes": "144"
    },
    "2009_153": {
        "plotSummary": "In order to ascertain the current situation inside, a supposed medical officer and a GEO team step into the quarantined and ill-fated apartment building.",
        "runtimeMinutes": "85"
    },
    "2009_154": {
        "plotSummary": "The two most popular guys in high school decide to ditch football camp for cheerleader camp. For the girls and for the glory.",
        "runtimeMinutes": "90"
    },
    "2009_155": {
        "plotSummary": "A student tries to fix a problem he accidentally caused in OZ, a digital world, while pretending to be the fiance of his friend at her grandmother's 90th birthday.",
        "runtimeMinutes": "114"
    },
    "2009_156": {
        "plotSummary": "In Hamburg, German-Greek chef Zinos unknowingly disturbs the peace in his locals-only restaurant by hiring a more talented chef.",
        "runtimeMinutes": "99"
    },
    "2009_157": {
        "plotSummary": "U.S. Marshal Carrie Stetko tracks a killer in Antarctica, as the sun is about to set for six months.",
        "runtimeMinutes": "101"
    },
    "2009_158": {
        "plotSummary": "A young Arab man is sent to a French prison.",
        "runtimeMinutes": "155"
    },
    "2009_159": {
        "plotSummary": "An examination of the social costs of corporate interests pursuing profits at the expense of the public good.",
        "runtimeMinutes": "127"
    },
    "2009_16": {
        "plotSummary": "In 2018, a mysterious new weapon in the war against the machines, half-human and half-machine, comes to John Connor on the eve of a resistance attack on Skynet. But whose side is he on, and can he be trusted?",
        "runtimeMinutes": "115"
    },
    "2009_160": {
        "plotSummary": "Detective Danny Fisher discovers his girlfriend has been kidnapped by an ex-con tied to Fisher's past, and he'll have to successfully complete 12 challenges in order to secure her safe release.",
        "runtimeMinutes": "108"
    },
    "2009_161": {
        "plotSummary": "In the summer of 1987, a college graduate takes a 'nowhere' job at his local amusement park, only to find it's the perfect course to get him prepared for the real world.",
        "runtimeMinutes": "107"
    },
    "2009_162": {
        "plotSummary": "A mother desperately searches for the killer who framed her son for a girl's horrific murder.",
        "runtimeMinutes": "129"
    },
    "2009_163": {
        "plotSummary": "A man and his friends come up with an intricate and original plan to destroy two big weapons manufacturers.",
        "runtimeMinutes": "105"
    },
    "2009_164": {
        "plotSummary": "In Bodeen, Texas, an indie-rock loving misfit finds a way of dealing with her small-town misery after she discovers a roller derby league in nearby Austin.",
        "runtimeMinutes": "111"
    },
    "2009_165": {
        "plotSummary": "In order to raise the tuition to send her young son to private school, a mom starts an unusual business -- a biohazard removal/crime scene clean-up service -- with her unreliable sister.",
        "runtimeMinutes": "91"
    },
    "2009_166": {
        "plotSummary": "A widower who realized his only connection to his family was through his wife sets off on an impromptu road trip to reunite with each of his grown children.",
        "runtimeMinutes": "100"
    },
    "2009_167": {
        "plotSummary": "A nerdy valedictorian proclaims his love for Beth Cooper--the hottest, most popular girl in school--during his graduation speech. That very night, she shows up at his door offering to show him the best night of his life.",
        "runtimeMinutes": "102"
    },
    "2009_168": {
        "plotSummary": "A couple who is expecting their first child travel around the U.S. in order to find a perfect place to start their family. Along the way, they have misadventures and find fresh connections with an assortment of relatives and old friends ...See moreA couple who is expecting their first child travel around the U.S. in order to find a perfect place to start their family. Along the way, they have misadventures and find fresh connections with an assortment of relatives and old friends who just might help them discover \"home\" on their own terms for the first time.See less",
        "runtimeMinutes": "98"
    },
    "2009_169": {
        "plotSummary": "Used-car liquidator Don Ready is hired by a flailing auto dealership to turn their Fourth of July sale into a majorly profitable event.",
        "runtimeMinutes": "89"
    },
    "2009_17": {
        "plotSummary": "Brian O'Conner, back working for the FBI in Los Angeles, teams up with Dominic Toretto to bring down a heroin importer by infiltrating his operation.",
        "runtimeMinutes": "107"
    },
    "2009_170": {
        "plotSummary": "So called friends at a dinner party end up acting like a dysfunctional family.",
        "runtimeMinutes": "100"
    },
    "2009_171": {
        "plotSummary": "The life of a determined young girl is changed when she befriends her building's concierge, a solitary woman who is more than what she seems.",
        "runtimeMinutes": "100"
    },
    "2009_172": {
        "plotSummary": "Waris Dirie, born 1965 in Somalia, flees at 13 when sold as 4th wife. She's maid at the Somalian embassy in London, then McDonald's, where she's discovered and becomes int'l top model. 1997, she speaks up against female genital mutilation.",
        "runtimeMinutes": "120"
    },
    "2009_173": {
        "plotSummary": "The three-year romance between 19th-century poet John Keats and Fanny Brawne near the end of his life.",
        "runtimeMinutes": "119"
    },
    "2009_174": {
        "plotSummary": "Damien and Leito return to District 13 on a mission to bring peace to the troubled sector that is controlled by five different gang bosses, before the city's secret services take drastic measures to solve the problem.",
        "runtimeMinutes": "101"
    },
    "2009_175": {
        "plotSummary": "A historical drama that illustrates Russian author Leo Tolstoy's (Christopher Plummer's) struggle to balance fame and wealth with his commitment to a life devoid of material things.",
        "runtimeMinutes": "112"
    },
    "2009_176": {
        "plotSummary": "An action-comedy about a simple cook from Chandni Chowk mistaken for the reincarnation of an ancient peasant warrior Liu Shengh by residents of an oppressed Chinese village.",
        "runtimeMinutes": "154"
    },
    "2009_177": {
        "plotSummary": "In the ancient walled city of Delhi, an American-born Indian finds himself on an unexpected inner journey as he learns about himself and his roots.",
        "runtimeMinutes": "141"
    },
    "2009_178": {
        "plotSummary": "Through a failed medical experiment, a priest is stricken with vampirism and is forced to abandon his ascetic ways.",
        "runtimeMinutes": "134"
    },
    "2009_179": {
        "plotSummary": "When a teenager, Chun-Li witnesses the kidnapping of her father by wealthy crime lord M. Bison. When she grows up, she goes into a quest for vengeance and becomes the famous crime-fighter of the Street Fighter universe.",
        "runtimeMinutes": "96"
    },
    "2009_18": {
        "plotSummary": "A young fugitive prince and princess must stop a villain who unknowingly threatens to destroy the world with a special dagger that enables the magic sand inside to reverse time.",
        "runtimeMinutes": "116"
    },
    "2009_180": {
        "plotSummary": "A new kid in town assembles a fledgling rock band -- together, they achieve their dreams and compete against the best in the biggest event of the year, a battle of the bands.",
        "runtimeMinutes": "111"
    },
    "2009_181": {
        "plotSummary": "A sex comedy centered on a serial womanizer and his jilted lover.",
        "runtimeMinutes": "97"
    },
    "2009_182": {
        "plotSummary": "Eric, a football fanatic postman whose life is descending into crisis, receives some life coaching from the famously philosophical Eric Cantona.",
        "runtimeMinutes": "116"
    },
    "2009_183": {
        "plotSummary": "Two down on their luck men tries to kidnap a wealthy businesswoman's dog to demand a hefty ransom from her. Things goes haywire when the dog goes missing.",
        "runtimeMinutes": "162"
    },
    "2009_184": {
        "plotSummary": "Joel, the owner of an extract plant, tries to contend with myriad personal and professional problems, such as his potentially unfaithful wife and employees who want to take advantage of him.",
        "runtimeMinutes": "92"
    },
    "2009_185": {
        "plotSummary": "A car accident and shifting affections test the bond between a married couple.",
        "runtimeMinutes": "99"
    },
    "2009_186": {
        "plotSummary": "In 1937, Japan occupied Nanjing, the Chinese capital. There was a battle and subsequent atrocities against the inhabitants, especially those who took refuge in the International Security Zone. Read more: Synopsis",
        "runtimeMinutes": "132"
    },
    "2009_187": {
        "plotSummary": "The MacManus brothers are living a quiet life in Ireland with their father, but when they learn that their beloved priest has been killed by mob forces, they go back to Boston to bring justice to those responsible and avenge the priest.",
        "runtimeMinutes": "118"
    },
    "2009_188": {
        "plotSummary": "Terence McDonagh is a drug- and gambling-addled detective in post-Katrina New Orleans investigating the killing of five Senegalese immigrants.",
        "runtimeMinutes": "122"
    },
    "2009_189": {
        "plotSummary": "An elderly ex-serviceman and widower looks to avenge his best friend's murder by doling out his own form of justice.",
        "runtimeMinutes": "103"
    },
    "2009_19": {
        "plotSummary": "An animated retelling of Charles Dickens' classic novel about a Victorian-era miser taken on a journey of self-redemption, courtesy of several mysterious Christmas apparitions.",
        "runtimeMinutes": "96"
    },
    "2009_190": {
        "plotSummary": "Desperate to repay his debt to his ex-wife, an ex-con plots a heist at his new employer's country home, unaware that a second criminal has also targeted the property, and rigged it with a series of deadly traps.",
        "runtimeMinutes": "90"
    },
    "2009_191": {
        "plotSummary": "Two inept criminals are mistakenly delivered a package of cocaine and think they've hit the jackpot, triggering a series of events that changes ten people's lives forever.",
        "runtimeMinutes": "84"
    },
    "2009_192": {
        "plotSummary": "A man working at his parents' motel in the Catskills inadvertently sets in motion the generation-defining concert in the summer of 1969. Read more: Synopsis",
        "runtimeMinutes": "120"
    },
    "2009_193": {
        "plotSummary": "Astronaut Sam Bell has a quintessentially personal encounter toward the end of his three-year stint on the Moon, where he, working alongside his computer, GERTY, sends back to Earth parcels of a resource that has helped diminish our ...See moreAstronaut Sam Bell has a quintessentially personal encounter toward the end of his three-year stint on the Moon, where he, working alongside his computer, GERTY, sends back to Earth parcels of a resource that has helped diminish our planet's power problems.See less",
        "runtimeMinutes": "97"
    },
    "2009_194": {
        "plotSummary": "The desperate lives of two estranged twin brothers converge over missing drugs, politics, racial prejudice, corrupt cops and an unplanned pregnancy.",
        "runtimeMinutes": "130"
    },
    "2009_195": {
        "plotSummary": "The son of a courtesan retreats into a fantasy world after being forced to end his relationship with the older woman who educated him in the ways of love.",
        "runtimeMinutes": "100"
    },
    "2009_196": {
        "plotSummary": "Eleven love stories set in one of the most loved and hated cities of the world, New York City.",
        "runtimeMinutes": "103"
    },
    "2009_197": {
        "plotSummary": "In an Indian village, a struggling barber sees his luck begin to turn when residents learn that a famous actor he once knew is coming to town.",
        "runtimeMinutes": "137"
    },
    "2009_198": {
        "plotSummary": "Prison guard Vince tells Molly from acting class, that one inmate is his 24 y.o. love child. Vince takes him home to stay with his family - straight A son with fat girl fetish, college dropout/stripper daughter and cute wife.",
        "runtimeMinutes": "104"
    },
    "2009_199": {
        "plotSummary": "A political satire about a group of skeptical American and British operatives attempting to prevent a war between two countries.",
        "runtimeMinutes": "106"
    },
    "2009_2": {
        "plotSummary": "As Harry Potter (Daniel Radcliffe) begins his sixth year at Hogwarts, he discovers an old book marked as \"the property of the Half-Blood Prince\" and begins to learn more about Lord Voldemort's (Ralph Fiennes') dark past.",
        "runtimeMinutes": "153"
    },
    "2009_20": {
        "plotSummary": "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.",
        "runtimeMinutes": "153"
    },
    "2009_200": {
        "plotSummary": "Suzanne \"Dame Kristin Scott Thomas\" is a well to do married mother, but her bourgeois lifestyle gets her down and she decides to go back to work as a physiotherapist by building an office in their backyard. Then Suzanne falls in love with ...See moreSuzanne \"Dame Kristin Scott Thomas\" is a well to do married mother, but her bourgeois lifestyle gets her down and she decides to go back to work as a physiotherapist by building an office in their backyard. Then Suzanne falls in love with the man hired to build the office.See less",
        "runtimeMinutes": "85"
    },
    "2009_201": {
        "plotSummary": "A grieving couple retreat to their cabin in the woods, hoping to repair their broken hearts and troubled marriage, but nature takes its course and things go from bad to worse. Read more: Synopsis",
        "runtimeMinutes": "108"
    },
    "2009_202": {
        "plotSummary": "A chronicle of John Lennon's first years, focused mainly in his adolescence and his relationship with his stern aunt Mimi, who raised him, and his absentee mother Julia, who re-entered his life at a crucial moment in his young life.",
        "runtimeMinutes": "98"
    },
    "2009_203": {
        "plotSummary": "A documentary chronicling Vogue editor-in-chief Anna Wintour's preparations for the 2007 fall-fashion issue.",
        "runtimeMinutes": "90"
    },
    "2009_204": {
        "plotSummary": "Ryden Malby graduates from college and is forced to move back into her childhood home with her eccentric family, while she attempts to find a job, the right guy, and just a hint of where her life is headed.",
        "runtimeMinutes": "88"
    },
    "2009_205": {
        "plotSummary": "A peaceful alien planet faces annihilation, as the homeless remainder of the human race sets its eyes on Terra. Mala, a rebellious Terrian teenager, will do everything she can to stop it.",
        "runtimeMinutes": "90"
    },
    "2009_206": {
        "plotSummary": "Paris 1913. Coco Chanel is infatuated with the rich and handsome Boy Capel, but she is also compelled by her work. Igor Stravinsky's The Rite of Spring is about to be performed. The revolutionary dissonances of Igor's work parallel Coco's ...See moreParis 1913. Coco Chanel is infatuated with the rich and handsome Boy Capel, but she is also compelled by her work. Igor Stravinsky's The Rite of Spring is about to be performed. The revolutionary dissonances of Igor's work parallel Coco's radical ideas. She wants to democratize women's fashion; he wants to redefine musical taste. Coco attends the scandalous first performance of The Rite in a chic white dress. The music and ballet are criticized as too modern, too foreign. Coco is moved but Igor is inconsolable. Paris 1920, Coco is newly wealthy and successful but grief-stricken after Boy's death in a car crash. Igor, following the Russian Revolution is now a penniless refugee living in exile in Paris. Coco is introduced to Igor by Diaghilev, impresario of the Ballets Russes. The attraction between them is instant and electric. Coco invites Igor along with his wife - now sick with consumption - together with his four children and a menagerie of birds to stay at her new villa, Bel Respiro, in Garches.  Written by Chris GreenhalghSee less",
        "runtimeMinutes": "119"
    },
    "2009_207": {
        "plotSummary": "A vampire named Saya, who is part of covert government agency that hunts and destroys demons in a post-WWII Japan, is inserted in a military school to discover which one of her classmates is a demon in disguise.",
        "runtimeMinutes": "91"
    },
    "2009_208": {
        "plotSummary": "As a lethal virus spreads globally, four friends seek a reputed plague-free haven. But while avoiding the infected, the travelers turn on one another.",
        "runtimeMinutes": "85"
    },
    "2009_209": {
        "plotSummary": "The story of Mussolini's secret lover, Ida Dalser, and their son Albino.",
        "runtimeMinutes": "128"
    },
    "2009_21": {
        "plotSummary": "A pushy boss forces her young assistant to marry her in order to keep her visa status in the U.S. and avoid deportation to Canada.",
        "runtimeMinutes": "108"
    },
    "2009_210": {
        "plotSummary": "The Brothers Bloom are the best con men in the world, swindling millionaires with complex scenarios of lust and intrigue. Now they've decided to take on one last job - showing a beautiful and eccentric heiress the time of her life with a ...See moreThe Brothers Bloom are the best con men in the world, swindling millionaires with complex scenarios of lust and intrigue. Now they've decided to take on one last job - showing a beautiful and eccentric heiress the time of her life with a romantic adventure that takes them around the world.See less",
        "runtimeMinutes": "114"
    },
    "2009_211": {
        "plotSummary": "Jean, his loving wife and son live a simple, happy life. At his son's homeroom teacher Madamoiselle Chambon's request, he volunteers as substitute teacher and starts to fall for her delicate and elegant charm. His ordinary life between ...See moreJean, his loving wife and son live a simple, happy life. At his son's homeroom teacher Madamoiselle Chambon's request, he volunteers as substitute teacher and starts to fall for her delicate and elegant charm. His ordinary life between family and work starts to falter.  Written by Pusan International Film FestivalSee less",
        "runtimeMinutes": "101"
    },
    "2009_212": {
        "plotSummary": "A simple Chinese immigrant wages a perilous war against one of the most powerful criminal organizations on the planet.",
        "runtimeMinutes": "119"
    },
    "2009_213": {
        "plotSummary": "A Honduran young girl and a Mexican gangster are united in a journey across the American border.",
        "runtimeMinutes": "96"
    },
    "2009_214": {
        "plotSummary": "The life story of the multi-talented German nun Hildegard von Bingen. The film portrays an original woman - best known as a composer and religious visionary - whose grand claims often run counter to the patriarchal world around her. The ...See moreThe life story of the multi-talented German nun Hildegard von Bingen. The film portrays an original woman - best known as a composer and religious visionary - whose grand claims often run counter to the patriarchal world around her. The monks and nuns at the convent become a kind of family, offering both confidants and enemies. For example Jutta, struggling with her jealousy of Hildegard's success, and the young Richardis who worships Hildegard both as an intellectual role model and a mother figure.  Written by Göteborg International Film FestivalSee less",
        "runtimeMinutes": "110"
    },
    "2009_215": {
        "plotSummary": "A quirky woman who spends her free time as a pilot has her purse stolen; when a mysterious man finds her wallet, they embark on a peculiar romance.",
        "runtimeMinutes": "104"
    },
    "2009_216": {
        "plotSummary": "An unflattering look inside America's corporate controlled food industry.",
        "runtimeMinutes": "94"
    },
    "2009_217": {
        "plotSummary": "Eugene believes in no sex before marriage. So DID his girlfriend, Cindi. His BFF loves sex. At Senior Prom, just before sex with Cindi, he falls into a coma. Waking up 4 years later, his Cindi is Miss March in Playboy. Can he get her back?",
        "runtimeMinutes": "90"
    },
    "2009_218": {
        "plotSummary": "Remake of the 1956 film noir film \"Beyond a Reasonable Doubt\" in which a writer's plan to expose a corrupt district attorney takes an unexpected turn.",
        "runtimeMinutes": "106"
    },
    "2009_219": {
        "plotSummary": "When Vikram gets tapped to play the male lead in a Bollywood film, he can't believe his luck. But it may ruin his relationship with his girlfriend.",
        "runtimeMinutes": "156"
    },
    "2009_22": {
        "plotSummary": "The story of Michael Oher, a homeless and traumatized boy who became an All-American football player and first-round NFL draft pick with the help of a caring woman and her family.",
        "runtimeMinutes": "129"
    },
    "2009_220": {
        "plotSummary": "A spoiled young adult living in Mumbai experiences a change in his lazy ways when he meets a woman at a party, who inspires him to \"wake up\".",
        "runtimeMinutes": "138"
    },
    "2009_221": {
        "plotSummary": "A florist, who abides by a strict five-date-limit with any man, finds herself wanting more with the new restaurateur in town.",
        "runtimeMinutes": "98"
    },
    "2009_222": {
        "plotSummary": "Chris Rock explores the wonders of African-American hairstyles.",
        "runtimeMinutes": "96"
    },
    "2009_223": {
        "plotSummary": "The story of the controversial Brian Clough's 44-day reign as the coach of the English football club Leeds United.",
        "runtimeMinutes": "98"
    },
    "2009_224": {
        "plotSummary": "After breaking up with his childhood sweetheart, a young man finds solace in drugs. Meanwhile, a teenage girl is caught in the world of prostitution. Will they be destroyed, or will they find redemption?",
        "runtimeMinutes": "144"
    },
    "2009_225": {
        "plotSummary": "A well known Parisian inspector becomes involved in an investigation while on holiday.",
        "runtimeMinutes": "110"
    },
    "2009_226": {
        "plotSummary": "Crossing Over is about illegal aliens of many nationalities in the Los Angeles area and the authorities and individuals dealing with them.",
        "runtimeMinutes": "113"
    },
    "2009_227": {
        "plotSummary": "Set in 1980s seaside England, this is the story of Edward, an unusual ten-year-old boy growing up in an old people's home run by his parents. While his mother struggles to keep the family business afloat, and his father copes with the ...See moreSet in 1980s seaside England, this is the story of Edward, an unusual ten-year-old boy growing up in an old people's home run by his parents. While his mother struggles to keep the family business afloat, and his father copes with the on-set of a mid-life crisis, Edward is busy tape-recording the elderly residents to try and discover what happens when they die. Increasingly obsessed with ghosts and the afterlife, Edward's is a rather lonely existence until he meets Clarence, the latest recruit to the home, a retired magician with a liberating streak of anarchy. This movie tells the story of this odd couple, a boy and an old man, facing life together, with Edward learning to live in the moment, and Clarence coming to terms with the past.See less",
        "runtimeMinutes": "94"
    },
    "2009_228": {
        "plotSummary": "A sports writer becomes a single parent in tragic circumstances.",
        "runtimeMinutes": "104"
    },
    "2009_229": {
        "plotSummary": "After leaving her philandering husband, an elegant socialite takes her two sons on a road trip across America in search of a better life. Read more: Synopsis",
        "runtimeMinutes": "108"
    },
    "2009_23": {
        "plotSummary": "An elite military unit comprised of special operatives known as G.I. Joe, operating out of The Pit, takes on an evil organization led by a notorious arms dealer.",
        "runtimeMinutes": "118"
    },
    "2009_230": {
        "plotSummary": "Adam, a lonely man with Asperger's Syndrome, develops a relationship with his upstairs neighbor, Beth.",
        "runtimeMinutes": "99"
    },
    "2009_231": {
        "plotSummary": "A romantic comedy about an Indian stuntman who takes Hollywood by storm but cannot find true love.",
        "runtimeMinutes": "142"
    },
    "2009_232": {
        "plotSummary": "A little loggerhead turtle follows in the path of her ancestors on one of the most extraordinary journeys in the natural world. Born on a beach in Florida, she rides the Gulf Stream all the way to the frozen north and ultimately swims ...See moreA little loggerhead turtle follows in the path of her ancestors on one of the most extraordinary journeys in the natural world. Born on a beach in Florida, she rides the Gulf Stream all the way to the frozen north and ultimately swims around the entire North Atlantic to Africa and back to the beach where she was born.  Written by AnonymousSee less",
        "runtimeMinutes": "79"
    },
    "2009_233": {
        "plotSummary": "Bennie travels to Buenos Aires to find his long-missing older brother, a once-promising writer who is now a remnant of his former self. Bennie's discovery of his brother's near-finished play might hold the answer to understanding their ...See moreBennie travels to Buenos Aires to find his long-missing older brother, a once-promising writer who is now a remnant of his former self. Bennie's discovery of his brother's near-finished play might hold the answer to understanding their shared past and renewing their bond.See less",
        "runtimeMinutes": "127"
    },
    "2009_234": {
        "plotSummary": "After her much older husband forces a move to a suburban retirement community, Pippa Lee engages in a period of reflection and finds herself heading toward a quiet nervous breakdown.",
        "runtimeMinutes": "98"
    },
    "2009_235": {
        "plotSummary": "A chambermaid and an ex-cop meet at a speed dating event and a romance develops. But during a romantic getaway things suddenly take a dark turn.",
        "runtimeMinutes": "95"
    },
    "2009_236": {
        "plotSummary": "While on a Mediterranean vacation, a seemingly happy boyfriend and girlfriend find their connection to one another tested as they bond with another couple.",
        "runtimeMinutes": "119"
    },
    "2009_237": {
        "plotSummary": "A traveling art saleswoman tries to shake off a flaky motel manager who falls for her and won't leave her alone.",
        "runtimeMinutes": "94"
    },
    "2009_238": {
        "plotSummary": "A man experiences a supernatural occurrence at his newly purchased apartment; a soap opera being telecast exclusively on his TV, which shows the future of his family.",
        "runtimeMinutes": "138"
    },
    "2009_239": {
        "plotSummary": "A chambermaid on Corsica is obsessed with chess after seeing a US expat play it lovingly with l'Americaine. She cleans his house and now also plays with him on Tuesdays.",
        "runtimeMinutes": "97"
    },
    "2009_24": {
        "plotSummary": "A specially trained squad of guinea pigs is dispatched to stop a diabolical billionaire from taking over the world.",
        "runtimeMinutes": "88"
    },
    "2009_240": {
        "plotSummary": "When Katie, an ordinary woman, meets Paco, an ordinary man, something magical happens: a love story. From this union an extraordinary child is born: Ricky.",
        "runtimeMinutes": "89"
    },
    "2009_241": {
        "plotSummary": "A recently widowed detective still grieving over his wife's death discovers a shocking connection between a serial killing spree and the Four Horsemen of the Apocalypse.",
        "runtimeMinutes": "90"
    },
    "2009_242": {
        "plotSummary": "Everything changes for 15-year-old Mia when her mum brings home a new boyfriend.",
        "runtimeMinutes": "123"
    },
    "2009_243": {
        "plotSummary": "In 1937, a teenager is cast in the Mercury Theatre production of \"Julius Caesar\", directed by a young Orson Welles.",
        "runtimeMinutes": "114"
    },
    "2009_244": {
        "plotSummary": "A young man who was sentenced to seven years in prison for robbing a post office ends up spending three decades in solitary confinement. During this time, his own personality is supplanted by his alter-ego, Charles Bronson.",
        "runtimeMinutes": "92"
    },
    "2009_245": {
        "plotSummary": "A look at the life of legendary fashion designer Valentino.",
        "runtimeMinutes": "96"
    },
    "2009_246": {
        "plotSummary": "At first, the strange phone messages promised great wealth. Soon, though, government agents pursue the young engineer receiving them around the world.",
        "runtimeMinutes": "105"
    },
    "2009_247": {
        "plotSummary": "A drama centered on the trials and tribulations of a proud Palestinian Christian immigrant single mother and her teenage son in small town Indiana.",
        "runtimeMinutes": "96"
    },
    "2009_248": {
        "plotSummary": "A failed film producer and an unemployed Chartered Accountant decide to make a 'sure flop' movie",
        "runtimeMinutes": "131"
    },
    "2009_249": {
        "plotSummary": "The story of a husband who suspects his wife of adultery, and sets out to track down the other man in her life.",
        "runtimeMinutes": "88"
    },
    "2009_25": {
        "plotSummary": "A waitress, desperate to fulfill her dreams as a restaurant owner, is set on a journey to turn a frog prince back into a human being, but she has to face the same problem after she kisses him.",
        "runtimeMinutes": "97"
    },
    "2009_250": {
        "plotSummary": "Torn between faith and science, and suffering hallucinations, English naturalist Charles Darwin struggles to complete 'On the Origin of Species' and maintain his relationship with his wife.",
        "runtimeMinutes": "108"
    },
    "2009_251": {
        "plotSummary": "While on a trip to Thailand, a successful American businessman tries to radically change his life. Back in New York, his wife and daughter find their relationship with their live-in Filipino maid changing around them. At the same time, in ...See moreWhile on a trip to Thailand, a successful American businessman tries to radically change his life. Back in New York, his wife and daughter find their relationship with their live-in Filipino maid changing around them. At the same time, in the Philippines, the maid's family struggles to deal with her absence.See less",
        "runtimeMinutes": "125"
    },
    "2009_252": {
        "plotSummary": "A ski vacation turns horrific for a group of medical students, as they find themselves confronted by an unimaginable menace: Nazi zombies.",
        "runtimeMinutes": "92"
    },
    "2009_253": {
        "plotSummary": "The story of a mysterious loner, a stranger in the process of completing a criminal job.",
        "runtimeMinutes": "116"
    },
    "2009_254": {
        "plotSummary": "A contemporary story of 3 friends discovering a new world set against the larger than life New York City. But one day the world around them changed.",
        "runtimeMinutes": "153"
    },
    "2009_255": {
        "plotSummary": "A documentary on the electric guitar from the point of view of three significant rock musicians: the Edge, Jimmy Page and Jack White. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2009_256": {
        "plotSummary": "An unhappily married couple find love in strange situations.",
        "runtimeMinutes": "109"
    },
    "2009_257": {
        "plotSummary": "A young boy in a remote medieval outpost under siege from barbarian raids is beckoned to adventure when a celebrated master illuminator arrives with an ancient book, brimming with secret wisdom and powers.",
        "runtimeMinutes": "71"
    },
    "2009_258": {
        "plotSummary": "A drama centered on a young woman who claims she was the target of an anti-Semetic attack and the subsequent media sensation it creates.",
        "runtimeMinutes": "97"
    },
    "2009_259": {
        "plotSummary": "Hannah Maynard, a prosecutor of Hague's Tribunal for war crimes in former Yugoslavia, charges a Serbian commander for killing Bosnians. However, her main witness might be lying, so the court sends a team to Bosnia to investigate.",
        "runtimeMinutes": "103"
    },
    "2009_26": {
        "plotSummary": "A compilation of interviews, rehearsals, and backstage footage of Michael Jackson as he prepared for his series of sold-out shows in London.",
        "runtimeMinutes": "111"
    },
    "2009_260": {
        "plotSummary": "A drama centered on a maid trying to hold on to her position after having served a family for 23 years.",
        "runtimeMinutes": "95"
    },
    "2009_261": {
        "plotSummary": "An American soldier struggles with an ethical dilemma when he becomes involved with a widow of a fallen officer.",
        "runtimeMinutes": "113"
    },
    "2009_262": {
        "plotSummary": "Fausta is suffering from a rare disease called the Milk of Sorrow, which is transmitted through the breast milk of pregnant women who were abused or raped during or soon after pregnancy. While living in constant fear and confusion due to ...See moreFausta is suffering from a rare disease called the Milk of Sorrow, which is transmitted through the breast milk of pregnant women who were abused or raped during or soon after pregnancy. While living in constant fear and confusion due to this disease, she must face the sudden death of her mother. She chooses to take drastic measures to not follow in her mother's footsteps.  Written by Pusan International Film FestivalSee less",
        "runtimeMinutes": "95"
    },
    "2009_263": {
        "plotSummary": "A true-story account of a German businessman who saved more than 200,000 Chinese during the Nanjing massacre in 1937-38.",
        "runtimeMinutes": "134"
    },
    "2009_264": {
        "plotSummary": "Follows six extreme sports stars as they prepare for and then compete in the 2008 Summer X-Games in Los Angeles. Kyle Loza practices a new motocross trick, landing in a pit of foam. Can he do it in front of thousands and land safely on ...See moreFollows six extreme sports stars as they prepare for and then compete in the 2008 Summer X-Games in Los Angeles. Kyle Loza practices a new motocross trick, landing in a pit of foam. Can he do it in front of thousands and land safely on dirt? Travis Pastrana shifts from a bike to a rally car - in part because he's broken so many bones. Shaun White finishes his snowboard season and jumps immediately onto his skateboard. Retired motocross champion Ricky Cunningham takes up a new event. In the finale, after practicing together as friends and competitors, Bob Burnquist and Danny Way face off on the mega ramp.  Written by See less",
        "runtimeMinutes": "92"
    },
    "2009_265": {
        "plotSummary": "A woman finds that her neighbors are terrorists, and her husband is not who he claims to be.",
        "runtimeMinutes": "161"
    },
    "2009_266": {
        "plotSummary": "A guy tries to patch things up with his soon-to-be-married pal after botching things up at his bachelor party.",
        "runtimeMinutes": "105"
    },
    "2009_267": {
        "plotSummary": "A wise old Christian man imparts Biblical truths to three boys during the summer of 1970.",
        "runtimeMinutes": "96"
    },
    "2009_268": {
        "plotSummary": "Charlyne Yi embarks on a quest across America to make a documentary about the one subject she doesn't fully understand: Love.",
        "runtimeMinutes": "88"
    },
    "2009_269": {
        "plotSummary": "During the First Lebanon War in 1982, a lone tank and a paratroopers platoon are dispatched to search a hostile town.",
        "runtimeMinutes": "93"
    },
    "2009_27": {
        "plotSummary": "A local scientist is often regarded as a failure until he invents a machine that can make food fall from the sky. But little does he know, that things are about to take a turn for the worst.",
        "runtimeMinutes": "90"
    },
    "2009_270": {
        "plotSummary": "The poet Missak Manouchian leads a mixed bag of youngsters and immigrants in a clandestine battle against the Nazi occupation. Twenty-two men and one woman fighting for an ideal and for freedom. News of their daring attacks, including the ...See moreThe poet Missak Manouchian leads a mixed bag of youngsters and immigrants in a clandestine battle against the Nazi occupation. Twenty-two men and one woman fighting for an ideal and for freedom. News of their daring attacks, including the assassination of an SS general, eventually reaches Berlin.  Written by American Film MarketSee less",
        "runtimeMinutes": "139"
    },
    "2009_271": {
        "plotSummary": "Using state-of-the-art equipment, a group of activists, led by renowned dolphin trainer Ric O'Barry, infiltrate a cove near Taijii, Japan to expose both a shocking instance of animal abuse and a serious threat to human health.",
        "runtimeMinutes": "92"
    },
    "2009_272": {
        "plotSummary": "A look at segments of the Italian population who are consumed with celebrity worship.",
        "runtimeMinutes": "85"
    },
    "2009_273": {
        "plotSummary": "On the steppes of Kazakhstan, Asa lives in a yurt with his sister Samal, her husband Ondas, and their three children. Ondas is a herdsman, tough and strong. It's dry, dusty, and windy; too many lambs are stillborn. Against this backdrop, ...See moreOn the steppes of Kazakhstan, Asa lives in a yurt with his sister Samal, her husband Ondas, and their three children. Ondas is a herdsman, tough and strong. It's dry, dusty, and windy; too many lambs are stillborn. Against this backdrop, Asa, a dreamer who's slight of build and recently finished with a stint in the Russian Navy, tries to establish a life on the steppes. He, his friend Boni, and Ondas call on Tulpan, the only single girl in the area. The men talk to her parents while she listens out of sight. Her answer and Asa's later trips to talk to her form an arc of hope against the harsh land. Is this the place of Asa's dreams? What about the other lambs?  Written by See less",
        "runtimeMinutes": "100"
    },
    "2009_274": {
        "plotSummary": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
        "runtimeMinutes": "102"
    },
    "2009_275": {
        "plotSummary": "Dominican baseball star Miguel \"Sugar\" Santos is recruited to play in the U.S. minor-leagues.",
        "runtimeMinutes": "114"
    },
    "2009_276": {
        "plotSummary": "The story of the actress, writer, and broadcasting pioneer Gertrude Berg.",
        "runtimeMinutes": "92"
    },
    "2009_277": {
        "plotSummary": "Paul is an actor who feels bogged down by his participation in a production of Chekov's play, Vanya.",
        "runtimeMinutes": "101"
    },
    "2009_278": {
        "plotSummary": "In a village where girls don't play cricket, Veera puts on a turban and beard and becomes Veer to fulfill her dreams and meets Rohan. And fun begins.",
        "runtimeMinutes": "148"
    },
    "2009_279": {
        "plotSummary": "The film follows the production of seven ballets by the Paris Opera Ballet.",
        "runtimeMinutes": "159"
    },
    "2009_28": {
        "plotSummary": "When attending their son's college graduation, a couple reignite the spark in their relationship. But the complicated fact is they're divorced and he's remarried.",
        "runtimeMinutes": "121"
    },
    "2009_280": {
        "plotSummary": "A desperate woman asks for a meeting with a journalist to disclose the cruel and inhumane punishment of her niece.",
        "runtimeMinutes": "116"
    },
    "2009_281": {
        "plotSummary": "Pablo Olivares is a lively and talented child born into a Christian family. His father's emotional absence causes Pablo to get involved with friends who introduce him to the world of rock n' roll and he becomes captivated by occultism.",
        "runtimeMinutes": "78"
    },
    "2009_282": {
        "plotSummary": "A drama set in the days leading up to the 2008 Presidential election, and centered on a high-end Manhattan call girl meeting the challenges of her boyfriend, her clients, and her work.",
        "runtimeMinutes": "77"
    },
    "2009_283": {
        "plotSummary": "An examination of the creation of the state of Israel in 1948 through to the present day. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2009_284": {
        "plotSummary": "The relationship between a father and daughter is complicated by the arrival of a handsome young man.",
        "runtimeMinutes": "100"
    },
    "2009_285": {
        "plotSummary": "A mixture of original interviews, archival footage, and photographs sheds light on the life experiences of Mike Tyson.",
        "runtimeMinutes": "90"
    },
    "2009_286": {
        "plotSummary": "Star Wars fanatics take a cross-country trip to George Lucas' Skywalker Ranch so their dying friend can see a screening of Star Wars: Episode I - The Phantom Menace before its release. Read more: Synopsis",
        "runtimeMinutes": "120"
    },
    "2009_287": {
        "plotSummary": "This documentary follows NBA superstar LeBron James and four of his talented teammates through the trials and tribulations of high school basketball in Ohio and James' journey to fame.",
        "runtimeMinutes": "105"
    },
    "2009_288": {
        "plotSummary": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
        "runtimeMinutes": "76"
    },
    "2009_289": {
        "plotSummary": "Since 1978, Anvil has become one of heavy metal's most influential yet commercially unsuccessful acts. In 2006, after a fledging European tour Anvil sets out to record their thirteenth album and continue to follow their dreams.",
        "runtimeMinutes": "80"
    },
    "2009_29": {
        "plotSummary": "The Feds try to take down notorious American gangsters John Dillinger, Baby Face Nelson and Pretty Boy Floyd during a booming crime wave in the 1930s.",
        "runtimeMinutes": "140"
    },
    "2009_290": {
        "plotSummary": "Two men form an unlikely friendship that will change both of their lives forever.",
        "runtimeMinutes": "91"
    },
    "2009_291": {
        "plotSummary": "Mousse and Louis are young, beautiful, rich and in love. But drugs have invaded their lives. One day, they overdose and Louis dies. Mousse survives, but soon learns she's pregnant. Feeling lost, Mousse runs away to a house far from Paris. ...See moreMousse and Louis are young, beautiful, rich and in love. But drugs have invaded their lives. One day, they overdose and Louis dies. Mousse survives, but soon learns she's pregnant. Feeling lost, Mousse runs away to a house far from Paris. Several months later, Louis' brother joins her in her refuge.  Written by American Film MarketSee less",
        "runtimeMinutes": "88"
    },
    "2009_292": {
        "plotSummary": "The dishonorably discharged Afghanistan veteran Thomas returns to his home village of Jerichow. Ali, a local Turkish-German businessman, owner of a snack-bar chain, hires him as a driver. That's when Thomas meets Laura, his Turkish boss's ...See moreThe dishonorably discharged Afghanistan veteran Thomas returns to his home village of Jerichow. Ali, a local Turkish-German businessman, owner of a snack-bar chain, hires him as a driver. That's when Thomas meets Laura, his Turkish boss's young and attractive wife. A classic love triangle is born, unfolding in desolate northeast Germany, where thick forests suddenly end on cliffs overlooking the Baltic Sea. Caught between guilt and freedom, between passion and reason, the protagonists have no hopes for fulfillment of their dreams.  Written by Warsaw Film FestivalSee less",
        "runtimeMinutes": "93"
    },
    "2009_293": {
        "plotSummary": "A young man, much to the chagrin of his father, becomes the new assistant to an illusionist in decline.",
        "runtimeMinutes": "90"
    },
    "2009_294": {
        "plotSummary": "Iranian musicians Negar and Ashkan look for band members to play at a London concert - and the visas that allow them to leave Tehran to do so.",
        "runtimeMinutes": "106"
    },
    "2009_295": {
        "plotSummary": "Werner Boote presents an up-close and personal view of the controversial and fascinating material that has found its way into every facet of our daily lives: plastic. He takes us on a journey around the globe, showing that plastics have ...See moreWerner Boote presents an up-close and personal view of the controversial and fascinating material that has found its way into every facet of our daily lives: plastic. He takes us on a journey around the globe, showing that plastics have become a threat for both environment and human health.  Written by Werner BooteSee less",
        "runtimeMinutes": "95"
    },
    "2009_296": {
        "plotSummary": "A tender story from Australia highlights the realistic ups and downs of an Australian family in the year following a parent's emergency medical procedure.",
        "runtimeMinutes": "96"
    },
    "2009_297": {
        "plotSummary": "\"I believe that this nation should commit itself to achieving the goal, before this decade is out, of landing a man on the Moon and returning him safely to the Earth.\" These words spoken by President John F. Kennedy in May 1961 changed the...See more\"I believe that this nation should commit itself to achieving the goal, before this decade is out, of landing a man on the Moon and returning him safely to the Earth.\" These words spoken by President John F. Kennedy in May 1961 changed the lives of twelve men who became known as \"Moonwalkers.\" The Wonder of it All focuses on the rarely told human side of the men behind the Apollo missions through thoughtful and candid accounts from seven Moonwalkers. Astronauts Buzz Aldrin, Alan Bean, Edgar Mitchell, John Young, Charles Duke, Eugene Cernan and Harrison Schmitt intimately reflect on the training, the tragedies, the camaraderie and the effect their space travel has had on their families. The Wonder of it All honors the men who walked on the moon and became heroes to a nation. They fulfilled the dream of humankind to set foot on another world and, in so doing, forever changed the way we view ourselves.  Written by Jeffrey RothSee less",
        "runtimeMinutes": "82"
    },
    "2009_298": {
        "plotSummary": "About the young life and loves of artist Salvador Dalí, filmmaker Luis Buñuel and writer Federico García Lorca.",
        "runtimeMinutes": "112"
    },
    "2009_299": {
        "plotSummary": "In 1968 Arthur Blessitt picked up a cross. Today, forty years later, Arthur has been on every continent and island nation with his twelve-foot cross, encountering people from diverse backgrounds, sharing a message of hope and destiny - the...See moreIn 1968 Arthur Blessitt picked up a cross. Today, forty years later, Arthur has been on every continent and island nation with his twelve-foot cross, encountering people from diverse backgrounds, sharing a message of hope and destiny - the message of the cross. This is the story of his Guinness World Record setting 38,102 mile walk across the globe.  Written by R.S.See less",
        "runtimeMinutes": "90"
    },
    "2009_3": {
        "plotSummary": "When Sid's attempt to adopt three dinosaur eggs gets him abducted by their real mother to an underground lost world, his friends attempt to rescue him.",
        "runtimeMinutes": "94"
    },
    "2009_30": {
        "plotSummary": "Violence ensues after an extraterrestrial race forced to live in slum-like conditions on Earth finds a kindred spirit in a government agent exposed to their biotechnology.",
        "runtimeMinutes": "112"
    },
    "2009_300": {
        "plotSummary": "In Manhattan, a mother of two preparing for her daughter's sixth birthday party has no idea of the challenges she's about to face in order to pull off the event.",
        "runtimeMinutes": "90"
    },
    "2009_301": {
        "plotSummary": "A young ladies' man teaches his dating tricks to his lonely, widowed grandfather, and plays his best mind games to meet the woman of his dreams.",
        "runtimeMinutes": "105"
    },
    "2009_302": {
        "plotSummary": "Collective screening of the Academy Award nominated short films from the Live Action category for 2009.",
        "runtimeMinutes": "94"
    },
    "2009_303": {
        "plotSummary": "The story revolves around two childhood friends Arjun and Munnu who find a way to get from a small village in India to Wembley as Rock stars, having overcome their personalities.",
        "runtimeMinutes": "146"
    },
    "2009_304": {
        "plotSummary": "A single mother struggles to clear her name after being wrongly accused and arrested for dealing drugs in an impoverished town in Texas.",
        "runtimeMinutes": "103"
    },
    "2009_305": {
        "plotSummary": "A washed-up trainer takes a self-destructive young boxer under his wing.",
        "runtimeMinutes": "96"
    },
    "2009_306": {
        "plotSummary": "A family unit begins to bow under the pressure of a failing marriage.",
        "runtimeMinutes": "95"
    },
    "2009_307": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2009_308": {
        "plotSummary": "Cowboy and Indian's only wish was to come up with a brilliant idea for Mr Horse's birthday, but when their plan ends up in utter disaster, they'll need to travel the world and back to make things right again.",
        "runtimeMinutes": "75"
    },
    "2009_309": {
        "plotSummary": "Two guys take their bromance to another level when they participate in an art film project.",
        "runtimeMinutes": "94"
    },
    "2009_31": {
        "plotSummary": "An uptight television producer takes control of a morning show segment on modern relationships hosted by a misogynistic man.",
        "runtimeMinutes": "96"
    },
    "2009_310": {
        "plotSummary": "Based in Cape Town, specializing in divorces, Jeet Oberoi warns his friends, Karan Malhotra and Bhavesh Patel, about the many disadvantages of being involved in a married relationship. He indicates that marriages result in divorce, if it ...See moreBased in Cape Town, specializing in divorces, Jeet Oberoi warns his friends, Karan Malhotra and Bhavesh Patel, about the many disadvantages of being involved in a married relationship. He indicates that marriages result in divorce, if it is a love marriage than the groom digs his grave; and if is an arranged marriage, it is the groom's family that dig his grave. Scoffing at this, Karan gets married with his sweetheart, Sanjana Jugran, much to the chagrin of her dad; while conservative Bhavesh travels to Vishwamitri, Gujarat, along with his entire family, and gets married to a liberal Prachi Jadeja. Incompatibility issues will soon surface, compelling the duo to retain Jeet as legal counsel to expedite their respective divorce proceedings.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "138"
    },
    "2009_311": {
        "plotSummary": "A coming of age tale of the unlikely bond between a kindly British soldier and a spirited Jewish boy set against the backdrop of the birth of the State of Israel.",
        "runtimeMinutes": "88"
    },
    "2009_312": {
        "plotSummary": "The owner of a Chinese noodle shop's scheme to murder his adulterous wife and her lover goes awry.",
        "runtimeMinutes": "95"
    },
    "2009_313": {
        "plotSummary": "An underworld kingpin recruits people endowed with 'Luck' from across the globe to take part in a series of challenges designed to test their 'Luck' factor, as gamblers around the world bet on them.",
        "runtimeMinutes": "141"
    },
    "2009_314": {
        "plotSummary": "Three teenagers live isolated, without leaving their house, because their over-protective parents say they can only leave when their dogtooth falls out.",
        "runtimeMinutes": "97"
    },
    "2009_315": {
        "plotSummary": "Radhe is a ruthless gangster who will kill anyone for money. He is attracted towards Jhanvi, a middle class girl, who does not approve of his work and wants him to change.",
        "runtimeMinutes": "147"
    },
    "2009_316": {
        "plotSummary": "When a factory is being torn down in Chengdu, China, workers reflect on their experiences and the importance of the factory in their lives.",
        "runtimeMinutes": "112"
    },
    "2009_317": {
        "plotSummary": "Spoof horror in which a group of college kids do a semester abroad in Romania and realise that if the partying doesn't kill them, the vampires just might!",
        "runtimeMinutes": "92"
    },
    "2009_318": {
        "plotSummary": "Former high school musical star, Marc Pease, finds himself still living in the past, eight years after graduating. Read more: Synopsis",
        "runtimeMinutes": "84"
    },
    "2009_319": {
        "plotSummary": "After his script is plagiarized, and he is forced to marry, an unemployed movie writer self-destructs.",
        "runtimeMinutes": "142"
    },
    "2009_32": {
        "plotSummary": "After moving into a suburban home, a couple becomes increasingly disturbed by a nightly demonic presence.",
        "runtimeMinutes": "86"
    },
    "2009_320": {
        "plotSummary": "For his French-class assignment, a high school student weaves his family history in a news story involving terrorism, and goes on to invite an Internet audience in on the resulting controversy.",
        "runtimeMinutes": "101"
    },
    "2009_321": {
        "plotSummary": "One week in L.A. in 1983, featuring movie executives, rock stars, a vampire and other morally challenged characters in adventures laced with sex, drugs and violence.",
        "runtimeMinutes": "98"
    },
    "2009_322": {
        "plotSummary": "In Nepal, a venerable monk, Geshe Lama Konchog, dies and one of his disciples, a youthful monk named Tenzin Zopa, searches for his master's reincarnation. The film follows his search to the Tsum Valley where he finds a young boy of the ...See moreIn Nepal, a venerable monk, Geshe Lama Konchog, dies and one of his disciples, a youthful monk named Tenzin Zopa, searches for his master's reincarnation. The film follows his search to the Tsum Valley where he finds a young boy of the right age who uncannily responds to Konchog's possessions. Is this the reincarnation of the master? After the boy passes several tests, Tenzin takes him to meet the Dalai Lama. Will the parents agree to let the boy go to the monastery, and, if so, how will the child respond? Central to the film is the relationship the child develops with Tenzin.  Written by See less",
        "runtimeMinutes": "102"
    },
    "2009_323": {
        "plotSummary": "The story of former UVF member Alistair Little. Twenty-five years after Little killed Joe Griffen's brother, the media arrange an auspicious meeting between the two.",
        "runtimeMinutes": "89"
    },
    "2009_324": {
        "plotSummary": "A high-powered attorney duct tapes her adulterous husband to the toilet ... right before their home is invaded by burglars.",
        "runtimeMinutes": "81"
    },
    "2009_325": {
        "plotSummary": "A woman leaves an abusive husband to start a new life in Chicago, where she befriends a man undergoing an emotional crisis, who she does not know is a professional killer, and a detective, who is investigating the hit man.",
        "runtimeMinutes": "110"
    },
    "2009_326": {
        "plotSummary": "Canada-based Meet, along with his pushy mom, Natasha, travel to Punjab, India, in order to attend the wedding of his cousin, Harman Kaur. It is here he rather dramatically meets with Harman's friend, Rajjo, who lives with her widowed ...See moreCanada-based Meet, along with his pushy mom, Natasha, travel to Punjab, India, in order to attend the wedding of his cousin, Harman Kaur. It is here he rather dramatically meets with Harman's friend, Rajjo, who lives with her widowed father, Gurniyal Singh. After a few misunderstandings both fall in love with each other - little knowing that Natasha has plans to get her son married to another girl by the name of Honey.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "166"
    },
    "2009_327": {
        "plotSummary": "A young man has only ten days to locate his soulmate as dictated by the stars, otherwise he could lose a fortune. He thus embarks on a journey through love, looking through twelve girls to find the one who fits his horoscope.",
        "runtimeMinutes": "195"
    },
    "2009_328": {
        "plotSummary": "Unable to cope with a recent personal tragedy, LA's top celebrity shrink turns into a pothead with no concern for his appearance and a creeping sense of his inability to help his patients.",
        "runtimeMinutes": "104"
    },
    "2009_329": {
        "plotSummary": "Black Dynamite is the greatest African-American action star of the 1970s. When his only brother is killed by The Man, it's up to him to find justice.",
        "runtimeMinutes": "84"
    },
    "2009_33": {
        "plotSummary": "After a young man's premonition of a deadly race-car crash helps saves the lives of his peers, Death sets out to collect those who evaded their end.",
        "runtimeMinutes": "82"
    },
    "2009_330": {
        "plotSummary": "An indictment of closeted politicians who lobby for anti-gay legislation in the U.S.",
        "runtimeMinutes": "90"
    },
    "2009_331": {
        "plotSummary": "Forced for some time to be a fighting slave, a pagan warrior escapes his captors with a boy and joins a group of Crusaders on their quest to the Holy Land.",
        "runtimeMinutes": "93"
    },
    "2009_332": {
        "plotSummary": "An aging Tennessee farmer returns to his homestead and must confront a family betrayal, the reappearance of an old enemy, and the loss of his farm.",
        "runtimeMinutes": "109"
    },
    "2009_333": {
        "plotSummary": "A married, Orthodox, Jerusalem butcher and Jewish father of four falls in love with his handsome, 22-year-old male apprentice, triggering the suspicions of his wife and the disapproval of his Orthodox community.",
        "runtimeMinutes": "91"
    },
    "2009_334": {
        "plotSummary": "Biopic based on the life of author Raymond Roussel.",
        "runtimeMinutes": "84"
    },
    "2009_335": {
        "plotSummary": "In Montana, a young girl attracts the attention of an evil stranger after she rescues a hurt wolf. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2009_336": {
        "plotSummary": "A circus woman and her husband find a two year old girl in the trailer park where they are living. With the help of another child, they search for her mother.",
        "runtimeMinutes": "100"
    },
    "2009_337": {
        "plotSummary": "A filmed account of the Zaire 74 soul music festival, originally intended to be in concert with the famous Rumble in the Jungle bout in Kinshasa, Zaire in 1974.",
        "runtimeMinutes": "92"
    },
    "2009_338": {
        "plotSummary": "Live concert footage of the Dave Matthews Band, Ben Harper and Relentless7 and Gogol Bordello, shot at the three-day Austin City Limits festival in October 2009. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2009_339": {
        "plotSummary": "A man and a woman have to pretend to be a couple in order to salvage a CEO's marriage.",
        "runtimeMinutes": "126"
    },
    "2009_34": {
        "plotSummary": "In 1985 where former superheroes exist, the murder of a colleague sends active vigilante Rorschach into his own sprawling investigation, uncovering something that could completely change the course of history as we know it.",
        "runtimeMinutes": "162"
    },
    "2009_340": {
        "plotSummary": "Troublemaking duo Andy Bichlbaum and Mike Bonanno, posing as their industrious alter-egos, expose the people profiting from Hurricane Katrina, the faces behind the environmental disaster in Bhopal, and other shocking events. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2009_341": {
        "plotSummary": "A hard-core New York Giants fan struggles to deal with the consequences when he is beaten up by his favorite player.",
        "runtimeMinutes": "88"
    },
    "2009_342": {
        "plotSummary": "A Chelsea art gallerist falls for a brooding new music composer in this comic tale about the state of contemporary art. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "2009_343": {
        "plotSummary": "A father tries to help his son cope with a rare condition that causes the young boy to age beyond his years.",
        "runtimeMinutes": "133"
    },
    "2009_344": {
        "plotSummary": "When his son's body is found in a humiliating accident, a lonely high school teacher inadvertently attracts an overwhelming amount of community and media attention after covering up the truth with a phony suicide note.",
        "runtimeMinutes": "99"
    },
    "2009_345": {
        "plotSummary": "A story of a fresh graduate trying to find a balance between the maddening demands of the 'professional' way, and the way of his heart.",
        "runtimeMinutes": "150"
    },
    "2009_346": {
        "plotSummary": "An adventure drama that tells the story of Santiago, a 22-year old from Lima. Following his father's suicide, haunted by his inner daemons and hatred for the world in general, Santiago decides to escape the crude Lima winter to take refuge...See moreAn adventure drama that tells the story of Santiago, a 22-year old from Lima. Following his father's suicide, haunted by his inner daemons and hatred for the world in general, Santiago decides to escape the crude Lima winter to take refuge in Mancora, a beach to the north of Peru where it is always summer. Upon his departure, Santiago receives the unexpected visit from his stepsister, Ximena, a young and beautiful photographer in her late twenties, accompanied by her husband Inigo, a young surgeon from Spain. The three take off on a journey escaping reality and in search of themselves. Santiago and Ximena find refuge in each other, which sparks off jealousies within Inigo, and a trip that was intended to be a simple escape turns out to be much more, when each of the three crosses limits and borders they should never have crossed. The three are placed face to face with their dreams and daemons. \"Mancora\" is a story of redemption, where a kid becomes a man and learns to forgive the world.  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "2009_347": {
        "plotSummary": "Herb and Dorothy Vogel redefine what it means to be an art collector.",
        "runtimeMinutes": "87"
    },
    "2009_348": {
        "plotSummary": "The story of lawsuit by tens of thousands of Ecuadorans against Chevron over contamination of the Ecuadorean Amazon.",
        "runtimeMinutes": "105"
    },
    "2009_349": {
        "plotSummary": "Senegalese pop sensation Youssou Ndour has spent the last 20 years in the spotlight as a world-renowned musician and the iconic representative \"voice of Africa.\" At the height of his career, Youssou became frustrated by the negative ...See moreSenegalese pop sensation Youssou Ndour has spent the last 20 years in the spotlight as a world-renowned musician and the iconic representative \"voice of Africa.\" At the height of his career, Youssou became frustrated by the negative perception of his Muslim faith and composed Egypt, a deeply spiritual album dedicated to a more tolerant view of Islam. The album's brave musical message was wholeheartedly embraced by Western audiences but ignited serious religious controversy in his homeland of Senegal. The film chronicles the difficult journey Youssou must undertake to assume his true calling.  Written by AnonymousSee less",
        "runtimeMinutes": "102"
    },
    "2009_35": {
        "plotSummary": "When a shopping mall is taken over by a gang of organized crooks, it's up to a mild-mannered security guard to save the day.",
        "runtimeMinutes": "91"
    },
    "2009_350": {
        "plotSummary": "Two best friends, Khang and Hieu, are sent from Ho Chi Minh City to study abroad in the United States. Once in America, their lives and their loves take a surprising twist.",
        "runtimeMinutes": "120"
    },
    "2009_351": {
        "plotSummary": "A mattress salesman finds his plan to adopt a Chinese baby augmented by the arrival of a young woman, who comes into his workplace, falls asleep on one of the beds, and starts to affect his life upon waking up.",
        "runtimeMinutes": "98"
    },
    "2009_352": {
        "plotSummary": "A police officer refuses to arrest a young man for offering drugs to his friends.",
        "runtimeMinutes": "115"
    },
    "2009_353": {
        "plotSummary": "The Ethiopian intellectual Anberber returns to his native country during the repressive totalitarian regime of Haile Mariam Mengistu and the recognition of his own displacement and powerlessness at the dissolution of his people's humanity ...See moreThe Ethiopian intellectual Anberber returns to his native country during the repressive totalitarian regime of Haile Mariam Mengistu and the recognition of his own displacement and powerlessness at the dissolution of his people's humanity and social values. After several years spent studying medicine in Germany, he finds the country of his youth replaced by turmoil. His dream of using his craft to improve the health of Ethiopians is squashed by a military junta that uses scientists for its own political ends. Seeking the comfort of his countryside home, Anberber finds no refuge from violence. The solace that the memories of his youth provide is quickly replaced by the competing forces of military and rebelling factions. Anberber needs to decide whether he wants to bear the strain or piece together a life from the fragments that lie around him.  Written by Venice Film FestivalSee less",
        "runtimeMinutes": "140"
    },
    "2009_354": {
        "plotSummary": "A former war photographer and her physician husband are caught up in a riot when locals in an Andean village vent their unhappiness with contamination from a nearby mine.",
        "runtimeMinutes": "109"
    },
    "2009_355": {
        "plotSummary": "A writer documents the journey his family takes to Mongolia to consult with nomadic shamans on the healing of their autistic son.",
        "runtimeMinutes": "93"
    },
    "2009_356": {
        "plotSummary": "An intimate portrait of an American family during a turbulent time. Jake Rademacher sets out to understand the experience, sacrifice, and motivation of his two brothers serving in Iraq. The film follows Jake's exploits as he risks ...See moreAn intimate portrait of an American family during a turbulent time. Jake Rademacher sets out to understand the experience, sacrifice, and motivation of his two brothers serving in Iraq. The film follows Jake's exploits as he risks everything-including his life-to tell his brothers' story. Often humorous, but sometimes downright lethal, it is a remarkable journey where Jake embeds with four combat units in Iraq. Unprecedented access to US and Iraqi combat units take him behind the camouflage curtain with secret reconnaissance troops on the Syrian border, into sniper \"hide sites\" in the Sunni Triangle, through raging machine gun battles with the Iraqi Army. Ultimately, the film follows his brothers home where separations and life-threatening work ripple through their parents, siblings, wives, and children. It is a rare look at the bonds and service of our soldiers on the front lines and the profound effects their service has on the loved ones they leave behind.  Written by Samuel Goldwyn FilmsSee less",
        "runtimeMinutes": "110"
    },
    "2009_357": {
        "plotSummary": "The unexpected arrival of his elder NRI brother and assorted characters complicates the life of a Goan male.",
        "runtimeMinutes": "144"
    },
    "2009_358": {
        "plotSummary": "Hyuk-Jin has just broken up with his girlfriend and decides to take a trip to Jeongseon in the province of Gangwon-do. The next day, his friends are too hung over to get up, so Hyuk-Jin makes his way to his destination alone. A trip of ...See moreHyuk-Jin has just broken up with his girlfriend and decides to take a trip to Jeongseon in the province of Gangwon-do. The next day, his friends are too hung over to get up, so Hyuk-Jin makes his way to his destination alone. A trip of opportunity takes a cruel and unexpected turn as misunderstanding and crossed paths occur over and over again.  Written by Jeonju International Film Festival listingSee less",
        "runtimeMinutes": "116"
    },
    "2009_359": {
        "plotSummary": "In a Tex-Mex border town, a man and his wife must face their tortured pasts in order to save their kidnapped daughter.",
        "runtimeMinutes": "96"
    },
    "2009_36": {
        "plotSummary": "This Baltimore-set movie of interconnecting story arcs deals with the challenges of reading or misreading human behavior.",
        "runtimeMinutes": "129"
    },
    "2009_360": {
        "plotSummary": "Interviews and news footage explore the rise of black metal music in Norway in the 1990s, including artists who were involved in suicide, murder and arson.",
        "runtimeMinutes": "93"
    },
    "2009_361": {
        "plotSummary": "Using smuggled footage, this documentary tells the story of the 2007 protests in Burma by thousands of monks.",
        "runtimeMinutes": "84"
    },
    "2009_362": {
        "plotSummary": "In Seoul, Korea, two sisters must look after each other when their mother leaves them to search for their estranged father.",
        "runtimeMinutes": "89"
    },
    "2009_363": {
        "plotSummary": "A high school baseball star must choose between pursuing a college sports career and staying near family and friends in his struggling rural Ozark mountains community.",
        "runtimeMinutes": "93"
    },
    "2009_364": {
        "plotSummary": "This story is based where the skateboard culture is the most foreign, the Midwest. Derrick Cabrera, like all skaters, has a dream of being sponsored and one day going pro. He is an up and coming skater with all the talent but has the world...See moreThis story is based where the skateboard culture is the most foreign, the Midwest. Derrick Cabrera, like all skaters, has a dream of being sponsored and one day going pro. He is an up and coming skater with all the talent but has the world against him. Parents, friends and schoolmates can't understand how Derrick has so much passion for something that has no future in their eyes. His crew of friends that are skaters is the only place he is truly accepted. But, as he gets better and better, the skater he looked up to the most becomes his worst enemy. In the sport of skateboarding a single trick that has never been done or conceived can bring you stardom in an instant. Derrick has that trick, if only he can make it. As he attempts to make this trick he is faced with skateproofing, a jealous friend and cops who have it in for him. Derrick finally gets arrested for skating on private property. After that his parents lay down the law and try to force him to quit skateboarding. Adding insult to injury, his girlfriend forces an ultimatum on him as well: \"The skateboard or life with her.\" At that point, Derrick gives up everything and runs away with his friends to the Tampa Am contest in Florida. This is a weekend that can turn an unknown skateboarder into a future star. He sees it as his only shot to make it in skateboarding. Derrick's rivalry comes to a head in Florida when his crew of friends abandons him because of his jealous mentor. A top amateur's sister rescues Derrick by giving him a place to stay and convincing him to believe in himself. With all the world of skateboarding watching, Derrick finally makes the trick that shocks the entire skate world and instantly thrusts him into the spotlight. His dream of being sponsored has come true.  Written by Rob DyrdekSee less",
        "runtimeMinutes": "88"
    },
    "2009_365": {
        "plotSummary": "Examined Life pulls philosophy out of academic journals and classrooms, and puts it back on the streets. In Examined Life, filmmaker Astra Taylor accompanies some of today's most influential thinkers on a series of unique excursions ...See moreExamined Life pulls philosophy out of academic journals and classrooms, and puts it back on the streets. In Examined Life, filmmaker Astra Taylor accompanies some of today's most influential thinkers on a series of unique excursions through places and spaces that hold particular resonance for them and their ideas. Peter Singer's thoughts on the ethics of consumption are amplified against the backdrop of Fifth Avenue's posh boutiques. Michael Hardt ponders the nature of revolution while surrounded by symbols of wealth and leisure. Judith Butler and a friend stroll through San Francisco's Mission District questioning our culture's fixation on individualism. And while driving through Manhattan, Cornel West - perhaps America's best-known public intellectual - compares philosophy to jazz and blues, reminding us how intense and invigorating a life of the mind can be. Offering privileged moments with great thinkers from fields ranging from moral philosophy to cultural theory, Examined Life reveals philosophy's power to transform the way we see the world around us and imagine our place in it.  Written by AnonymousSee less",
        "runtimeMinutes": "87"
    },
    "2009_366": {
        "plotSummary": "A teenager attends a fantasy writers' convention where he discovers his idea has been stolen by an established novelist.",
        "runtimeMinutes": "89"
    },
    "2009_367": {
        "plotSummary": "Follow the Manhattan-based Beavan family as they abandon their high consumption 5th Avenue lifestyle and try to live a year while making no net environmental impact.",
        "runtimeMinutes": "93"
    },
    "2009_368": {
        "plotSummary": "A look at how contestants on the a musical contest program \"Pop Idol\" in Afghanistan risk their lives to appear on the show.",
        "runtimeMinutes": "87"
    },
    "2009_369": {
        "plotSummary": "The Violas (an all girl rock band) tour van breaks down in a small mysterious southern beach community. Stuck with no money until local mechanic Hector offers them a deal - play his annual beach party and he'll fix their van for free! ...See moreThe Violas (an all girl rock band) tour van breaks down in a small mysterious southern beach community. Stuck with no money until local mechanic Hector offers them a deal - play his annual beach party and he'll fix their van for free! However, unbeknown to the girls the local police are investigating strange happenings and have brought in big shot Scientist John Patterson to help solve the mystery. Now the party is happening, a monster is on the loose and it all comes together at the biggest beach party of the year.  Written by Jasper JohnsSee less",
        "runtimeMinutes": "78"
    },
    "2009_37": {
        "plotSummary": "A comedy centered around four couples who settle into a tropical-island resort for a vacation. While one of the couples is there to work on the marriage, the others fail to realize that participation in the resort's therapy sessions is not optional.",
        "runtimeMinutes": "113"
    },
    "2009_370": {
        "plotSummary": "The story of Israel Kasztner, a Hungarian Jew who negotiated with Adolf Eichmann for the lives of thousands during the Holocaust. And a trial and verdict that stamped him as the \"man who sold his soul to the devil.\"",
        "runtimeMinutes": "120"
    },
    "2009_371": {
        "plotSummary": "Twenty-four hours in the tentative relationship of two young San Franciscans also dealing with the conundrum of being a minority in a rapidly gentrifying city. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2009_372": {
        "plotSummary": "On call 24/7 for the past six years, three senior citizens have made history by greeting nearly one million U.S. troops at a tiny airport in Maine. Filled with unexpected turns, their uplifting and emotional journey demonstrates the ...See moreOn call 24/7 for the past six years, three senior citizens have made history by greeting nearly one million U.S. troops at a tiny airport in Maine. Filled with unexpected turns, their uplifting and emotional journey demonstrates the meaning of community at a time when America needs it most.  Written by Aron GaudetSee less",
        "runtimeMinutes": "84"
    },
    "2009_373": {
        "plotSummary": "A lawyer who doesn't believe in ghosts is haunted after moving into a family mansion.",
        "runtimeMinutes": "89"
    },
    "2009_374": {
        "plotSummary": "After crash landing near a desert town, an alien enlists the help of a local waitress to re-capture a monster that escaped from the wreckage of his space ship.",
        "runtimeMinutes": "90"
    },
    "2009_375": {
        "plotSummary": "A med student, a teenage runaway, a lawyer, a drag queen, a high school basketball player, a drug dealer, and a teacher all cross paths in the Ecstasy-riddled L.A. underground party scene. Rolling is a turbulent journey that takes a tough ...See moreA med student, a teenage runaway, a lawyer, a drag queen, a high school basketball player, a drug dealer, and a teacher all cross paths in the Ecstasy-riddled L.A. underground party scene. Rolling is a turbulent journey that takes a tough yet entertaining look at this unique drug phenomenon. With the pace and style of a documentary, Rolling captures the essence of Ecstasy culture, exposing the delicate balance of relationships and responsibilities with chasing this drug-induced euphoria.  Written by Believe EntertainmentSee less",
        "runtimeMinutes": "90"
    },
    "2009_376": {
        "plotSummary": "A look at the lives and relationships among girls at an elite boarding school.",
        "runtimeMinutes": "104"
    },
    "2009_377": {
        "plotSummary": "In 1983, financially struggling college student Samantha Hughes takes a strange babysitting job that coincides with a full lunar eclipse. She slowly realizes her clients harbor a terrifying secret, putting her life in mortal danger. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2009_378": {
        "plotSummary": "Exposes the hidden epidemic of Lyme disease and reveals how our corrupt health care system is failing to address one of the most serious illnesses of our time.",
        "runtimeMinutes": "104"
    },
    "2009_379": {
        "plotSummary": "In the near future, leftist writer Paula goes from Paris to the French town of Atlantic-Cite when she learns of the death of a former colleague and lover, Richard P. Is she there to investigate? On the surface, faces are beautiful, colors ...See moreIn the near future, leftist writer Paula goes from Paris to the French town of Atlantic-Cite when she learns of the death of a former colleague and lover, Richard P. Is she there to investigate? On the surface, faces are beautiful, colors bright, clothes trendy. Beneath, little is clear: some talk to Paula as if she's Alice in Wonderland, corpses pile up, and ideological struggles insert themselves. A murder victim's nephew and a political party's hired hands hover around Paula. Is obscuring things her goal or is it life that's obscure?  Written by See less",
        "runtimeMinutes": "90"
    },
    "2009_38": {
        "plotSummary": "Ryan Bingham enjoys living out of a suitcase for his job, travelling around the country firing people, but finds that lifestyle threatened by the presence of a potential love interest, and a new hire presenting a new business model.",
        "runtimeMinutes": "109"
    },
    "2009_380": {
        "plotSummary": "The action comedy is set in 1944. Hitler appears in it as physically and mentally destroyed person who takes the advice of Goebbels in the actor-teacher of Jewish concentration camp for lessons eloquence to inspire the German people to ...See moreThe action comedy is set in 1944. Hitler appears in it as physically and mentally destroyed person who takes the advice of Goebbels in the actor-teacher of Jewish concentration camp for lessons eloquence to inspire the German people to further fight.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2009_381": {
        "plotSummary": "A film crew follows the well-known banjo player Bela Fleck on his travels to Africa, where he learns about the instrument's origins.",
        "runtimeMinutes": "97"
    },
    "2009_382": {
        "plotSummary": "A group of former Encyclopedia Brown-style child-detectives struggle to solve an adult mystery.",
        "runtimeMinutes": "97"
    },
    "2009_383": {
        "plotSummary": "Following the murder of a prominent leftist, an investigator tries to uncover the truth while government officials attempt to cover up their roles.",
        "runtimeMinutes": "127"
    },
    "2009_384": {
        "plotSummary": "Based on Michael Chabon's novel, the film chronicles the defining summer of a recent college graduate who crosses his gangster father and explores love, sexuality, and the enigmas surrounding his life and his city.",
        "runtimeMinutes": "95"
    },
    "2009_385": {
        "plotSummary": "Third part in Aleksandr Sokurov's quadrilogy of Power, following Moloch and Taurus, focuses on Japanese Emperor Hirohito and Japan's defeat in World War II when he is finally confronted by General Douglas MacArthur who offers him to accept...See moreThird part in Aleksandr Sokurov's quadrilogy of Power, following Moloch and Taurus, focuses on Japanese Emperor Hirohito and Japan's defeat in World War II when he is finally confronted by General Douglas MacArthur who offers him to accept a diplomatic defeat for survival.See less",
        "runtimeMinutes": "110"
    },
    "2009_386": {
        "plotSummary": "2002: Jake Mitchell is the defending World West Coast Swing Champion. He's got everything going for him: looks, personality, and style. He's at the top of his game when he and his partner Corinne are crowned the unexpected winners at the ...See more2002: Jake Mitchell is the defending World West Coast Swing Champion. He's got everything going for him: looks, personality, and style. He's at the top of his game when he and his partner Corinne are crowned the unexpected winners at the World Swing Dance Championships. As the crowd cheers and the celebration begins, Jake appears uneasy. Did he really deserve to win? The music blasts and the bass is thumping, and Jake hears none of it. He feels it. Jake is completely deaf, due to an ear infection when he was a teenager. He learned how to dance by feeling the vibrations of the music. Now he feels something else: that perhaps the judges gave him the win out of sympathy. Present Day: Jessica Donovan's life is boring. When she was younger, she was a dancer who had dreams of Broadway. Now she's an English teacher for disinterested, upper class middle school kids, and she's dying to let loose. Her fiancee Kent is a work-a-holic who cares more about making money than making Jessica happy. Jake's moved on with his life and he's now a dance teacher who travels around the country doing motivational speaking to students about how his disability did not hold him back. It's at a school assembly where Jake and Jessica first meet. He's up on stage telling kids that you have to believe in yourself. The spoiled rich kids show no interest at first, but Jake's charm and sense of humor gets them to laugh. Then his former partner Corinne joins him onstage and they dance. The crowd goes nuts! Jake meets Jessica and there's an instant connection; there's only one problem. Jake's still in love with Corinne and perhaps always will be. And Corinne knows exactly how to get under Jake's skin. Though she has a fiancee, she drives Jake nuts with her flirtatious ways. Jessica initially asks Jake to train both her and her fiancee in West Coast Swing for their wedding, but Jake and Jessica are drawn closer when Kent's non-stop job prevents him from going to the class. Jessica decides to take lessons from Jake... perhaps they can compete at the World Championships of Swing in the Pro-Am division? And they get better and better. They decide, at a dance party, to go for it all. Forget the Pro-Am; they want to try for the title that Jake felt he never deserved. But now the champions are all 18 year olds who can defy gravity, and Jake's in his early thirties. To make matters worse, Corinne gets word that her old partner has a new partner, and suddenly, she's interested in Jake again. Jake and Jessica must try to elude all obstacles, romantic or otherwise, to stay focused on the goal... winning the World Title and winning each other. Will they give in to the pressure or come out like champs?  Written by synbiosSee less",
        "runtimeMinutes": "91"
    },
    "2009_387": {
        "plotSummary": "With a first-person look at the notorious Crips and Bloods, this film examines the conditions that have lead to decades of devastating gang violence among young African Americans growing up in South Los Angeles.",
        "runtimeMinutes": "93"
    },
    "2009_388": {
        "plotSummary": "Forty-year-old Jimmy is growing up, or at least he's getting older. While mooching the upper bunk of his ten-year-old nephew's bed, he enjoys the never-ending generosity of his sister Aiko, and dodges the wrath of his impatient ...See moreForty-year-old Jimmy is growing up, or at least he's getting older. While mooching the upper bunk of his ten-year-old nephew's bed, he enjoys the never-ending generosity of his sister Aiko, and dodges the wrath of his impatient brother-in-law Tak. He thinks that if only he could get married all his problems would be solved. But when he falls head over heels for Tak's niece things only go from bad to worse.  Written by white on riceSee less",
        "runtimeMinutes": "83"
    },
    "2009_389": {
        "plotSummary": "Max Solomon faces the awful truth that he will never be a writer. So, in a desperate attempt to find his true calling, he turns to crime. In this inventive comedy, three friends have their lives turned upside down when one of them realizes...See moreMax Solomon faces the awful truth that he will never be a writer. So, in a desperate attempt to find his true calling, he turns to crime. In this inventive comedy, three friends have their lives turned upside down when one of them realizes that larceny might be his best skill.  Written by Monty MirandaSee less",
        "runtimeMinutes": "88"
    },
    "2009_39": {
        "plotSummary": "As Hannah Montana's popularity begins to take over her life, Miley Stewart, on the urging from her father takes a trip to her hometown of Crowley Corners, Tennessee to get some perspective on what matters in life the most.",
        "runtimeMinutes": "102"
    },
    "2009_390": {
        "plotSummary": "This is the remarkable story of a K through 12 school on Chicago's impoverished, high crime West Side, that has been sending 100% of graduating seniors to four year colleges and universities for 30 years. More than half of them are ...See moreThis is the remarkable story of a K through 12 school on Chicago's impoverished, high crime West Side, that has been sending 100% of graduating seniors to four year colleges and universities for 30 years. More than half of them are accepted by tier one schools and the class of 2008 was awarded more than $4.5 million in college scholarships. Providence St. Mel is a school that has completely escaped America's educational crisis.  Written by Rollin BinzerSee less",
        "runtimeMinutes": "92"
    },
    "2009_391": {
        "plotSummary": "In Brighton in 1935, small-time gang leader Pinkie Brown murders a journalist and later desperately tries to cover his tracks but runs into trouble with the police, a few witnesses and a rival gang.",
        "runtimeMinutes": "92"
    },
    "2009_392": {
        "plotSummary": "The owner of a Miami restaurant indebted to the mob institutes a contest to see what waiter can earn the most money in one night.",
        "runtimeMinutes": "99"
    },
    "2009_393": {
        "plotSummary": "From the darkness of Hitler's Europe to the mountains of the Catskills, Four Seasons Lodge follows a community of Holocaust survivors who come together each summer to dance, cook, fight and flirt-and celebrate their survival.",
        "runtimeMinutes": "97"
    },
    "2009_394": {
        "plotSummary": "A phenomenal discourse on why poverty exists when there is so much wealth in the world. A must see for anyone wanting to understand not only the US economic system but the foundations of today's global economy.",
        "runtimeMinutes": "106"
    },
    "2009_395": {
        "plotSummary": "Their music is unforgettable. Their name is legend. Delve into the lives and cinematic legacy of the prolific songwriting duo whose music has been featured in classic movies such as Mary Poppins and The Jungle Book.",
        "runtimeMinutes": "101"
    },
    "2009_396": {
        "plotSummary": "The story of Julia Zagar and her husband Isaiah, a renowned mosaic artist, who for the past 30 years has covered more than 40,000 square feet of Philadelphia top to bottom with tile, mirror, paint, and concrete.",
        "runtimeMinutes": "77"
    },
    "2009_397": {
        "plotSummary": "Twin 18-year-olds hitchhike to their mother's funeral in Spain. The journey changes their lives forever.",
        "runtimeMinutes": "80"
    },
    "2009_398": {
        "plotSummary": "A sheep-rancher's son aspires to win a music conservatory scholarship, but to apply he needs musicians who can play his music. Circumstances lead him to form a band out of prison inmates.",
        "runtimeMinutes": "102"
    },
    "2009_399": {
        "plotSummary": "Born with the ability to foretell the future, Chandigarh-based Nihaal Singh, re-locates to study in a Mumbai-based college. He meets with and falls in love with snobbish and rude Nisha Kapoor, who subsequently becomes a little humble after...See moreBorn with the ability to foretell the future, Chandigarh-based Nihaal Singh, re-locates to study in a Mumbai-based college. He meets with and falls in love with snobbish and rude Nisha Kapoor, who subsequently becomes a little humble after he rescues her and others by assisting ACP Pradhan to diffuse a bomb in a busy shopping mall. Nihaal will soon find his life changing after he becomes involved with his college's professor Siddharth Verma; is on the hit list of Don Kalicharan; and a terrorist group that wants to enlist his help in planting explosives in busy locales all over Mumbai.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "134"
    },
    "2009_4": {
        "plotSummary": "Sam Witwicky leaves the Autobots behind for a normal life. But when his mind is filled with cryptic symbols, the Decepticons target him and he is dragged back into the Transformers' war.",
        "runtimeMinutes": "149"
    },
    "2009_40": {
        "plotSummary": "Armed men hijack a New York City subway train, holding the passengers hostage in return for a ransom, and turning an ordinary day's work for dispatcher Walter Garber into a face-off with the mastermind behind the crime.",
        "runtimeMinutes": "106"
    },
    "2009_400": {
        "plotSummary": "While Danny's father and mother independently search for love, Danny is on his own desperate quest to find a prom date. Danny's search becomes progressively more pathetic once he and his family learn that Bart, the school's biggest dweeb, ...See moreWhile Danny's father and mother independently search for love, Danny is on his own desperate quest to find a prom date. Danny's search becomes progressively more pathetic once he and his family learn that Bart, the school's biggest dweeb, not only secured a date for the prom, but got a hotel room as well.See less",
        "runtimeMinutes": "80"
    },
    "2009_401": {
        "plotSummary": "Visual Acoustics celebrates the life and career of Julius Shulman, the world's greatest architectural photographer, whose images brought modern architecture to the American mainstream. Shulman, who passed away in 2009, captured the work of...See moreVisual Acoustics celebrates the life and career of Julius Shulman, the world's greatest architectural photographer, whose images brought modern architecture to the American mainstream. Shulman, who passed away in 2009, captured the work of nearly every modern and progressive architect since the 1930s including Frank Lloyd Wright, Richard Neutra, John Lautner and Frank Gehry. His images epitomized the singular beauty of Southern California's modernist movement and brought its iconic structures to the attention of the general public. This unique film is both a testament to the evolution of modern architecture and a joyful portrait of the magnetic, whip-smart gentleman who chronicled it with his unforgettable images.  Written by Owens/RothschildSee less",
        "runtimeMinutes": "83"
    },
    "2009_402": {
        "plotSummary": "A modern day treasure hunt for a mystical relic that turns into a love story for all time.",
        "runtimeMinutes": "100"
    },
    "2009_403": {
        "plotSummary": "A trucker, leading a life free of depth and on the way to nowhere, is forced to make a decision about her aggressive loner 11-year-old son whom she openly deserted ten years previously.",
        "runtimeMinutes": "90"
    },
    "2009_404": {
        "plotSummary": "This documentary takes a look at how the Wall Street meltdown has affected the working class. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2009_405": {
        "plotSummary": "When a female assassin is sent to the US to kill the last living heir to the modern day Himalayan Kingdom, royal solider is also sent to protect her. When he is face to face with the assassin his duty to the Kingdom becomes compromised. As...See moreWhen a female assassin is sent to the US to kill the last living heir to the modern day Himalayan Kingdom, royal solider is also sent to protect her. When he is face to face with the assassin his duty to the Kingdom becomes compromised. As they battle, secrets are uncovered and the line between good and evil is erased. Only one mission can be completed and only one person can survive.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2009_406": {
        "plotSummary": "After an unsuccessful assassination, a terrorist and his wife hide on a remote island in the house of a friend who doesn't suspect anything.",
        "runtimeMinutes": "104"
    },
    "2009_407": {
        "plotSummary": "Abu Laila used to be a judge, but because the government doesn't have the means to renew his assignment he is forced to be a taxi driver. On the day his daughter Laila becomes seven years old his wife insists that he'll be at home early ...See moreAbu Laila used to be a judge, but because the government doesn't have the means to renew his assignment he is forced to be a taxi driver. On the day his daughter Laila becomes seven years old his wife insists that he'll be at home early and bring her a present and a cake. Abu Laila's has nothing else on his mind then completing this mission. But the daily life in Palestine has other plans.  Written by AnonymousSee less",
        "runtimeMinutes": "71"
    },
    "2009_408": {
        "plotSummary": "A documentary on Michael Ruppert, a police officer turned independent reporter who predicted the current financial crisis in his self-published newsletter, From the Wilderness. Read more: Synopsis",
        "runtimeMinutes": "82"
    },
    "2009_409": {
        "plotSummary": "Four ambitious and beautiful young women. From four very different corners of Mexico. Just like hundreds of others, they are caught up in the frenzy that sweeps the nation when Alejandro Mateos (Julio Bracho), one of the country's most ...See moreFour ambitious and beautiful young women. From four very different corners of Mexico. Just like hundreds of others, they are caught up in the frenzy that sweeps the nation when Alejandro Mateos (Julio Bracho), one of the country's most powerful producers, dreams up a nationwide talent search to cast the lead in his next big movie. But all this is news to Alejandro's on-again, off-again lover, Eva Gallardo (Patricia Llaca) , a diva of epic proportions, who expected to get the part. While Eva schemes to nail down the role, our four leads begin their own journey on the road to fame.  Written by Sony Pictures EntertainmentSee less",
        "runtimeMinutes": "107"
    },
    "2009_41": {
        "plotSummary": "Flamboyant and gay Austrian Brüno looks for new fame in America.",
        "runtimeMinutes": "81"
    },
    "2009_410": {
        "plotSummary": "A pair of identical twin sisters -- one, who has been paraplegic since youth and gets around in a wheelchair, and the other -- 'same face, different bodies.'",
        "runtimeMinutes": "100"
    },
    "2009_411": {
        "plotSummary": "William Kunstler was one of the most famous lawyers of the 20th century. The New York Times called him \"the most hated and most loved lawyer in America.\" His clients included Martin Luther King Jr., Malcolm X, Phillip and Daniel Berrigan, ...See moreWilliam Kunstler was one of the most famous lawyers of the 20th century. The New York Times called him \"the most hated and most loved lawyer in America.\" His clients included Martin Luther King Jr., Malcolm X, Phillip and Daniel Berrigan, Abbie Hoffman, H. Rap Brown, Stokely Carmichael, Adam Clayton Powell, Jr., and Leonard Peltier. In Disturbing the Universe: Radical Lawyer William Kunstler, filmmakers Emily Kunstler and Sarah Kunstler explore their father's life, from middle-class family man, to movement lawyer, to \"the most hated lawyer in America.\"  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2009_412": {
        "plotSummary": "Infamously blunt, Wilma Stephenson runs a \"boot camp\" teaching Culinary Arts at Frankford High, disciplining her students into capable chefs and responsible students. But behind her tough exterior is a teacher who cares passionately about ...See moreInfamously blunt, Wilma Stephenson runs a \"boot camp\" teaching Culinary Arts at Frankford High, disciplining her students into capable chefs and responsible students. But behind her tough exterior is a teacher who cares passionately about getting the best out of her kids.See less",
        "runtimeMinutes": "99"
    },
    "2009_413": {
        "plotSummary": "A romantic comedy, set on Cape Cod in 1905, about three 70-year-old retired sea captains who try to lure an attractive middle-aged woman into marriage. Read more: Synopsis",
        "runtimeMinutes": "97"
    },
    "2009_414": {
        "plotSummary": "A documentary focusing on the life of dot-com entrepreneur Josh Harris, and his exploits over the last decade.",
        "runtimeMinutes": "91"
    },
    "2009_415": {
        "plotSummary": "When an unmarried teenage girl is believed by her family to have given up her virginity, she is ordered to be killed out of shame. But before her relative is able to complete the task, the two encounter a college professor.",
        "runtimeMinutes": "105"
    },
    "2009_416": {
        "plotSummary": "The lives of a motherless boy, who is just starting to get interested in women, and his physically abused friend, who lives in poverty, are mixed with more or less innocent childhood experiences and challenges of a number of children.",
        "runtimeMinutes": "104"
    },
    "2009_417": {
        "plotSummary": "A young couple, in love and facing a life-changing decision, find one seemingly ordinary July 4th cleaved in two by the flip of a coin on the Brooklyn Bridge.",
        "runtimeMinutes": "101"
    },
    "2009_418": {
        "plotSummary": "Filmed over the course of two years, Our City Dreams is the story of a woman's struggles and successes as an artist in New York City. Told through five women artists, from youngest to oldest, the film features Swoon, Ghada Amer, Kiki Smith...See moreFilmed over the course of two years, Our City Dreams is the story of a woman's struggles and successes as an artist in New York City. Told through five women artists, from youngest to oldest, the film features Swoon, Ghada Amer, Kiki Smith, Marina Abramovic, and Nancy Spero. From the studio to the streets of New York, from the canals of Venice to the alleys of Cairo and the beaches of Phuket, Our City Dreams takes us deep into the artists' worlds.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2009_419": {
        "plotSummary": "A graduate student (Nicholson) copes with a recent breakup by conducting interviews with various men. Read more: Synopsis",
        "runtimeMinutes": "80"
    },
    "2009_42": {
        "plotSummary": "Mike O'Donnell is ungrateful for how his life turned out. He gets a chance to rewrite his life when he tried to save a janitor near a bridge and jumped after him into a time vortex.",
        "runtimeMinutes": "102"
    },
    "2009_420": {
        "plotSummary": "A wealthy plantation owner is captivated by a mysterious woman with a shady past.",
        "runtimeMinutes": "123"
    },
    "2009_421": {
        "plotSummary": "America is addicted to oil and it is time for an intervention. Enter Josh Tickell, a man with a plan and a Veggie Van, who is taking on big oil, big government, and big soy to find solutions in places few people have looked.",
        "runtimeMinutes": "90"
    },
    "2009_422": {
        "plotSummary": "A radio host interprets the possible outbreak of a deadly virus which infects the small Ontario town he is stationed in. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2009_423": {
        "plotSummary": "Given up for adoption as a toddler, troubled teenager Thomas becomes obsessed with tracking down his birth mother. After years of searching, Thomas finds her single, with a small child, living in a nearby suburb and begins a relationship ...See moreGiven up for adoption as a toddler, troubled teenager Thomas becomes obsessed with tracking down his birth mother. After years of searching, Thomas finds her single, with a small child, living in a nearby suburb and begins a relationship with her which slowly drives him to an act of madness.  Written by AnonymousSee less",
        "runtimeMinutes": "91"
    },
    "2009_424": {
        "plotSummary": "A good guy with no powers joins a superhero team with no clue against a bad guy with no shame.",
        "runtimeMinutes": "98"
    },
    "2009_425": {
        "plotSummary": "Chronicles the rise and fall of 1970s New York City nightclub Plato's Retreat.",
        "runtimeMinutes": "81"
    },
    "2009_426": {
        "plotSummary": "Filmmaker Richard P. Rogers tried for twenty years to make a documentary about his own life. He died in 2001, leaving the project unfinished, until his widow, acclaimed photographer Susan Meiselas, commissioned his former student Alexander...See moreFilmmaker Richard P. Rogers tried for twenty years to make a documentary about his own life. He died in 2001, leaving the project unfinished, until his widow, acclaimed photographer Susan Meiselas, commissioned his former student Alexander Olch to make a film out of the pieces. Starting in the Hamptons, in the town of Wainscott, the film weaves Rogers' footage into a journey through childhood memories, a less than encouraging mother, a family background of privilege, and Rogers' persistent, dogged attempts to document his own life. Rogers' friend, actor and writer Wallace Shawn, joins in the process, as the film investigates the differences between documentary and fiction, and tells the tragic story of Rogers' life.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "2009_427": {
        "plotSummary": "A troubled junior college basketball player forges an unlikely friendship with a fellow baller through pick-up games on the streets of St. Louis.",
        "runtimeMinutes": "119"
    },
    "2009_428": {
        "plotSummary": "A drama of four interconnecting stories revolving around love, drugs and poverty in Philadelphia. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2009_429": {
        "plotSummary": "In 1963, during the swirl of glamour and intrigue that turned President John F. Kennedy's Washington into Camelot, a lonely 13-year-old Catholic school boy comes of age.",
        "runtimeMinutes": "93"
    },
    "2009_43": {
        "plotSummary": "Julia Child's story of her start in the cooking profession is intertwined with blogger Julie Powell's 2002 challenge to cook all the recipes in Child's first book.",
        "runtimeMinutes": "123"
    },
    "2009_430": {
        "plotSummary": "Set during occupied France, a faithless woman finds herself falling in love with a young priest.",
        "runtimeMinutes": "117"
    },
    "2009_431": {
        "plotSummary": "A documentary on art-scene commentator Paul Hasegawa-Overacker's relationship with enigmatic photographer Cindy Sherman.",
        "runtimeMinutes": "88"
    },
    "2009_432": {
        "plotSummary": "From the ashes of the L.A. riots arose a lush, 14-acre community garden, the largest of its kind in the United States. Now bulldozers threaten its future.",
        "runtimeMinutes": "80"
    },
    "2009_433": {
        "plotSummary": "The story of our growing awareness and understanding of the environmental crisis and emergence, during the 1960's and '70's, of popular movement to confront it. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2009_434": {
        "plotSummary": "A reclusive author of spiritual books is pursued for advice by a single mother and a man fresh out of rehab.",
        "runtimeMinutes": "97"
    },
    "2009_435": {
        "plotSummary": "A story based on the covert discussions that brought down the Apartheid regime in South Africa. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2009_436": {
        "plotSummary": "Top astrophysicist Sasha Greenberg has spent the past 17 years working in the United States. An invitation to speak at a Congress on Cosmology in his native Moscow brings him home for the first time to confront colleagues, and unanswered ...See moreTop astrophysicist Sasha Greenberg has spent the past 17 years working in the United States. An invitation to speak at a Congress on Cosmology in his native Moscow brings him home for the first time to confront colleagues, and unanswered personal questions. As Russia undergoes perestroika, public and private lives are radically re-assessed and Sasha sees the social and sexual upheavals as a crisis of civilization, and a reflection of his own obsessive studies into the nature of the Universe itself.  Written by AnonymousSee less",
        "runtimeMinutes": "116"
    },
    "2009_437": {
        "plotSummary": "Documentary about disparate NYC parents' efforts to get their children into \"feeder preschools,\" private institutions that claim to set youngsters on the track to admission into Ivy league colleges.",
        "runtimeMinutes": "90"
    },
    "2009_438": {
        "plotSummary": "Chronicles the first-ever, senior citizen hip-hop dance team for the New Jersey Nets Basketball team, 12 women and man - all dance team newbies, from auditions through to center court stardom.",
        "runtimeMinutes": "93"
    },
    "2009_439": {
        "plotSummary": "In the lonely American Southwest, life is slow for the desert inhabitants of Coyote County. Although it reflects the diversity and pride of the Coyote County residents, local talk radio station K-RAP struggles financially, withering like a...See moreIn the lonely American Southwest, life is slow for the desert inhabitants of Coyote County. Although it reflects the diversity and pride of the Coyote County residents, local talk radio station K-RAP struggles financially, withering like a tumbleweed on its way to oblivion. Meanwhile, a rising radio personality from Los Angeles reluctantly drives through the hot desert toward Coyote County. His name is Jack Proctor. Upon visiting K-RAP, Jack meets the motley crew that works to keep the place running. These odd but charming individuals are a snapshot representation of the population living in this desert region. Jack meets Mr. Sanchez, the \"maintenance engineer\" and host of a \"fix it\" show; Raymond, the former-military accountant and host of an alien and paranormal phenomena talk show; Doyle, the sound engineer and host of a technology \"geek\" show; Mrs. Hopps, host of a cooking show and owner of a local cafe where everyone loves to eat and hang out; and Lauren, the assistant station manager, who until now has been the star of K-RAP with her \"Heart Smart\" show receiving the highest ratings. She is the most respected member of the crew, constantly aiding other hosts in improving their content. Lauren is less than thrilled about the big-city hotshot coming to try and fix their problems. She feels threatened and does little to hide her dislike for Jack. The ratings begin to show that their on-air skirmishing - taking shots at one another on their respective \"relationship advice\" talk shows - is drawing interest to the radio station. During one of their off-air battles, Lauren questions Jack's ability to counsel people regarding love and romance. Jack accepts the challenge and goes a step further to prove his point, claiming that he can help the biggest loser in the county to find real love. He initiates an on-air publicity stunt, asking for applicants from all over Coyote County who think they are the biggest loser and least likely to find love. Too prove that he, not Lauren, understands what true love is, Jack will help the loser woo any woman in Coyote County. Applications pour in to K-RAP from men trying to prove that they are the biggest loser and in need of Jack's love advice to find a mate. A loser is chosen who stands out above the rest as the least likely to attract and charm a woman - Lyle Grincher. Jack then begins counseling the Loser on air and ratings increase further. The radio station is now back in the black with the highest number of listeners ever. However tension also increases between Jack and Lauren. Plot thickens, stakes rise and metaphors get mixed when the audience discovers that Jack's advice is working too well, and the woman that the Loser has chosen to woo is none other than Lauren. Before this romantic battle-of-the-sexes is over, Jack and Lauren will learn what being a winner and loser really means, and more importantly, realize that true love is selfless love.  Written by Jacob RoebuckSee less",
        "runtimeMinutes": "92"
    },
    "2009_44": {
        "plotSummary": "Based on the story of Micky Ward, a fledgling boxer who tries to escape the shadow of his more famous but troubled older boxing brother and get his own shot at greatness.",
        "runtimeMinutes": "116"
    },
    "2009_440": {
        "plotSummary": "Paul and Eddie have just begun previews for the new Off-Broadway musical \"Adam and Steve Just the Way God Made 'Em.\" Their lives strangely mirror the characters they are playing. Paul is looking for the perfect man and Eddie is dealing ...See morePaul and Eddie have just begun previews for the new Off-Broadway musical \"Adam and Steve Just the Way God Made 'Em.\" Their lives strangely mirror the characters they are playing. Paul is looking for the perfect man and Eddie is dealing with how his sexuality and faith can mix. After yet another disastrous dating experience, Paul has an epiphany. He is done dating and just wants to be a slut like the sexy chorus boys that share his dressing room. Eddie has to tell his parents that he's gay and is starring in a show that calls the bible the \"Breeder's Informational Book of Living Examples\". Eddie comes out to his family and Paul goes on Manhunt. Eddie's parents are destroyed by the news and Paul can't even have a good one-night stand. But after musical numbers with scantly clad tap dancing angels, a retelling of Genesis, tele-evangelists, a camp that attempts to turn gay kids straight, and a bunch of showtunes, everyone realizes that life gets better once they accept who they really are. And they are just the way God made 'em.  Written by Fred M. CarusoSee less",
        "runtimeMinutes": "87"
    },
    "2009_441": {
        "plotSummary": "While drinking at their local pub, three social outcasts attempt to navigate a time-travel conundrum.",
        "runtimeMinutes": "83"
    },
    "2009_442": {
        "plotSummary": "The devastating legacy of a liaison between a concentration camp inmate and a Nazi doctor reflects on the lives of her sons.",
        "runtimeMinutes": "97"
    },
    "2009_443": {
        "plotSummary": "A Seattle weather girl freaks out on-air over her cheating boyfriend, the morning show anchor, and moves in with her little brother.",
        "runtimeMinutes": "92"
    },
    "2009_444": {
        "plotSummary": "An unhappy wife orders a guy she meets over the Internet to kill her, but the two of them fall in love.",
        "runtimeMinutes": "102"
    },
    "2009_445": {
        "plotSummary": "The story of the 1941 Goodwill Tour to South America made by Walt Disney and his staff.",
        "runtimeMinutes": "106"
    },
    "2009_446": {
        "plotSummary": "\"No Justice!\" \"No Peace!\" This rising chant from the streets escalated in answer to the seemingly endless incidents of police brutality throughout this great nation. Following the shooting of Amadou Diallo by 4 members of the NY City ...See more\"No Justice!\" \"No Peace!\" This rising chant from the streets escalated in answer to the seemingly endless incidents of police brutality throughout this great nation. Following the shooting of Amadou Diallo by 4 members of the NY City Police Department these chants rose from the streets by heartbroken and enraged voices. However, there are two sides to every story and the truth is often found where you least expect it. \"If I Die Tonight\" reflects on the lives and stories of those who survive on both sides of an impenetrable divide.  Written by Randolph KretSee less",
        "runtimeMinutes": "94"
    },
    "2009_447": {
        "plotSummary": "Ten ordinary women learn the art of the striptease when they dive into the glamorous world of burlesque in this musical documentary of diva proportions.",
        "runtimeMinutes": "91"
    },
    "2009_448": {
        "plotSummary": "A physical comedy about yearning",
        "runtimeMinutes": "75"
    },
    "2009_449": {
        "plotSummary": "Movie centers on the adult son of a baseball legend who, together with his girlfriend, embarks on a road trip with his estranged father.",
        "runtimeMinutes": "90"
    },
    "2009_45": {
        "plotSummary": "A frustrated man decides to take justice into his own hands after a plea bargain sets one of his family's killers free.",
        "runtimeMinutes": "109"
    },
    "2009_450": {
        "plotSummary": "Wealthy Goa-based Income Tax Officer Douglas Lazarus passes away after exercising on his treadmill at a speed of 10.5. A funeral is arranged, relatives are notified, and his eldest hen-pecked son, Steven, prepares a farewell speech while ...See moreWealthy Goa-based Income Tax Officer Douglas Lazarus passes away after exercising on his treadmill at a speed of 10.5. A funeral is arranged, relatives are notified, and his eldest hen-pecked son, Steven, prepares a farewell speech while most attendees would have preferred the second son, Brian, a successful Mumbai-based writer, to do so. At the funeral, things hilariously spiral out of control when Michael, the fiance of Douglas' gorgeous niece, Maria, notices movement within the coffin.  Written by rAjOo (gunwanti@hotmail.com)See less",
        "runtimeMinutes": "102"
    },
    "2009_451": {
        "plotSummary": "On the coast of North America in AD 1007, two Norsemen are stranded when their expedition is attacked and they are left for dead. As they struggle to survive in the vast forests of the New World, their paths diverge as one pursues a ...See moreOn the coast of North America in AD 1007, two Norsemen are stranded when their expedition is attacked and they are left for dead. As they struggle to survive in the vast forests of the New World, their paths diverge as one pursues a spiritual quest and the other reverts to his primal instincts  Written by AnonymousSee less",
        "runtimeMinutes": "107"
    },
    "2009_452": {
        "plotSummary": "The story of Hannah Senesh, a Hungarian poet who was captured by the Nazis, while trying to rescue Jews in WWII.",
        "runtimeMinutes": "86"
    },
    "2009_453": {
        "plotSummary": "A modern gay drama about falling in and out of love, and the rocky road in between.",
        "runtimeMinutes": "97"
    },
    "2009_454": {
        "plotSummary": "A drama centered around three high school seniors - an aspiring actress, her misfit best friend, and a loner - who become engaged in an intimate and complicated relationship.",
        "runtimeMinutes": "100"
    },
    "2009_455": {
        "plotSummary": "A serpentine day in the life of ten seemingly disparate women: a porn star, a flight attendant, a psychiatrist, a masseuse, a bartender, a pair of call girls, etc. All of them with one crucial thing in common. Trouble.",
        "runtimeMinutes": "92"
    },
    "2009_456": {
        "plotSummary": "Private detective John Rosow is hired to tail a man on a train from Chicago to Los Angeles. Rosow gradually uncovers the man's identity as a missing person; one of the thousands presumed dead after the 9/11 terrorist attacks on the World ...See morePrivate detective John Rosow is hired to tail a man on a train from Chicago to Los Angeles. Rosow gradually uncovers the man's identity as a missing person; one of the thousands presumed dead after the 9/11 terrorist attacks on the World Trade Center. Persuaded by a large reward, Rosow is charged with bringing the missing person back to his wife in New York City.  Written by AnonymousSee less",
        "runtimeMinutes": "95"
    },
    "2009_457": {
        "plotSummary": "Five best friends in their late 20's discover new truths about themselves and the friendships they thought would last forever.",
        "runtimeMinutes": "92"
    },
    "2009_458": {
        "plotSummary": "In his quest to become the world's greatest air-drummer, a small-town dreamer must overcome obstacles and ridicule to save the day.",
        "runtimeMinutes": "89"
    },
    "2009_459": {
        "plotSummary": "Intent on shaking up the ultimate 'sacred cow' for Jews, Israeli director Yoav Shamir embarks on a provocative - and at times irreverent - quest to answer the question, \"What is anti-Semitism today?\"",
        "runtimeMinutes": "91"
    },
    "2009_46": {
        "plotSummary": "An adventurous 11-year-old girl finds another world that is a strangely idealized version of her frustrating home, but it has sinister secrets.",
        "runtimeMinutes": "100"
    },
    "2009_460": {
        "plotSummary": "Inga is a poet. She wants to buy and restore a house she is drawn to that reminds her of her childhood home, but her distant husband Hermann sees little value in it or many of the things Inga loves.",
        "runtimeMinutes": "84"
    },
    "2009_461": {
        "plotSummary": "After a school shooting leaves 14 people dead, survivor Sean Ryan is forced to come to terms with loss.",
        "runtimeMinutes": "94"
    },
    "2009_462": {
        "plotSummary": "When a traveling carnival comes to a small town, a lifelong slacker meets the girl of his dreams (Rachael Taylor) and wakes up to the life he has yet to begin living. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2009_463": {
        "plotSummary": "The story of three people who strive to realize their dreams. Brothers Carter and Ellis set out on a road trip to their childhood home in a desperate search for their estranged father, who may hold the key to their future. Read more: Synopsis",
        "runtimeMinutes": "99"
    },
    "2009_464": {
        "plotSummary": "J.R. is a typical Italian-American on the streets of New York. When he gets involved with a local girl, he decides to get married and settle down, but when he learns that she was once raped, he cannot handle it. More explicitly linked with...See moreJ.R. is a typical Italian-American on the streets of New York. When he gets involved with a local girl, he decides to get married and settle down, but when he learns that she was once raped, he cannot handle it. More explicitly linked with Catholic guilt than Scorsese's later work, we see what happens to J.R. when his religious guilt catches up with him.  Written by David Gibson See less",
        "runtimeMinutes": "90"
    },
    "2009_465": {
        "plotSummary": "Chelsea on the Rocks celebrates the personalities and artistic voices that have emerged from the legendary residence, the Chelsea Hotel, in the heart of New York. Once considered an untouchable, impenetrable tower for writers, artists, ...See moreChelsea on the Rocks celebrates the personalities and artistic voices that have emerged from the legendary residence, the Chelsea Hotel, in the heart of New York. Once considered an untouchable, impenetrable tower for writers, artists, musicians and mavericks, it has recently been claimed as a boutique hotel venture for a management company that shows blatant disregard for its formidable history.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2009_466": {
        "plotSummary": "College student Charlie Banks has to face old problems when the bully he had an unpleasant encounter with back in high school shows up on his campus.",
        "runtimeMinutes": "100"
    },
    "2009_467": {
        "plotSummary": "Would you be shocked to find out that the greatest moment of our recent history in space may not have happened at all?",
        "runtimeMinutes": "90"
    },
    "2009_468": {
        "plotSummary": "Lindeman, 25-year-old art student, struggles to find his inspiration, finding himself in one ridiculous situation after the other. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2009_469": {
        "plotSummary": "This intimate documentary follows careers of two remarkable personalities: Carmen de Lavallade, a dynamic dancer and choreographer from California who moved to New York with Alvin Ailey and began a legacy of modern dance in America, and ...See moreThis intimate documentary follows careers of two remarkable personalities: Carmen de Lavallade, a dynamic dancer and choreographer from California who moved to New York with Alvin Ailey and began a legacy of modern dance in America, and her husband Geoffrey Holder, a Trinidad-born choreographer, set and costume designer, painter and man about town with productions such as The Wiz. Features interviews and performance footage of friends and colleagues: dancers Judith Jamison, Gus Solomons, Jr., Dudley Williams, Ulysses Dove and Alvin Ailey.  Written by Scott PSee less",
        "runtimeMinutes": "80"
    },
    "2009_47": {
        "plotSummary": "Set in a futuristic world where humans live in isolation and interact through surrogate robots, a cop is forced to leave his home for the first time in years in order to investigate the murders of others' surrogates.",
        "runtimeMinutes": "89"
    },
    "2009_470": {
        "plotSummary": "An odd couple take to the open road. Having followed his girlfriend out to California's Wine Country for the summer, Yale law student Sherman finds himself dumped, and cut off from his high-society mother's money. A stranger stranded in a ...See moreAn odd couple take to the open road. Having followed his girlfriend out to California's Wine Country for the summer, Yale law student Sherman finds himself dumped, and cut off from his high-society mother's money. A stranger stranded in a strange land, he hitches a ride with Palmer, a washed-up, unapologetically eccentric Olympic athlete. There are detours along the way, including the possibility of an enlightening girlfriend, an encounter with a gun-wielding gourmet chef and a chance for the former athlete to be on top again. A comedy about absent fathers and damaged sons striving to find balance between responsibility and recklessness.  Written by AnonymousSee less",
        "runtimeMinutes": "97"
    },
    "2009_471": {
        "plotSummary": "A lackadaisical handyman and aspiring novelist tries to support his younger girlfriend as she slowly succumbs to madness.",
        "runtimeMinutes": "120"
    },
    "2009_472": {
        "plotSummary": "A sexy, comedic drama about two college friends questioning their careers and sexuality in east Los Angeles.",
        "runtimeMinutes": "67"
    },
    "2009_473": {
        "plotSummary": "Explores the life of Richard Berkowitz, a revolutionary gay S&M sex worker turned AIDS activist in the 1980s, whose incomparable contribution to the invention of safe sex has has never been aptly credited.",
        "runtimeMinutes": "75"
    },
    "2009_474": {
        "plotSummary": "Filmed in 20 countries, with the insights of Nobel Laureates: Muhammad Yunus (Nobel Peace Prize), Steve Chu (Nobel Prize Physics and President Obama's Secretary of Energy) & Desmond Tutu (Nobel Peace Prize) with Helene Gayle (CEO of CARE, ...See moreFilmed in 20 countries, with the insights of Nobel Laureates: Muhammad Yunus (Nobel Peace Prize), Steve Chu (Nobel Prize Physics and President Obama's Secretary of Energy) & Desmond Tutu (Nobel Peace Prize) with Helene Gayle (CEO of CARE, International) & special appearance by American legend Willie Nelson  Written by monterey mediaSee less",
        "runtimeMinutes": "83"
    },
    "2009_475": {
        "plotSummary": "'Peter and Vandy' is a love story told out of order. Set in Manhattan, the story shifts back and forth in time, juxtaposing Peter and Vandy's romantic beginnings with the twisted, manipulative, regular couple they become. The film explores...See more'Peter and Vandy' is a love story told out of order. Set in Manhattan, the story shifts back and forth in time, juxtaposing Peter and Vandy's romantic beginnings with the twisted, manipulative, regular couple they become. The film explores the question most couples ask themselves... 'How the hell did we get this way?'  Written by AnonymousSee less",
        "runtimeMinutes": "95"
    },
    "2009_476": {
        "plotSummary": "Three generations of men, including a pervert that constantly seeks for new kinds of satisfaction, an obese speed eater and a passionate embalmer. Read more: Synopsis",
        "runtimeMinutes": "91"
    },
    "2009_477": {
        "plotSummary": "A young Hollywood player is drawn into a remote place looking for a quick deal and instead finds a sanctuary, a community, and ultimately himself.",
        "runtimeMinutes": "115"
    },
    "2009_478": {
        "plotSummary": "The film's story takes place in Moscow in the 1970s. Its plot unfolds around the love triangle between two young men and a girl who study at the same university. They argue, make up, and face their first disappointments and victories. ...See moreThe film's story takes place in Moscow in the 1970s. Its plot unfolds around the love triangle between two young men and a girl who study at the same university. They argue, make up, and face their first disappointments and victories. While busy with personal lives and loves, they miss foreseeing that the country in which they were born and live will soon disappear from the map.  Written by hashan15See less",
        "runtimeMinutes": "105"
    },
    "2009_479": {
        "plotSummary": "A look at the metaphysical effects of being struck by lightning.",
        "runtimeMinutes": "75"
    },
    "2009_48": {
        "plotSummary": "Nelson Mandela, in his first term as President of South Africa, initiates a unique venture to unite the Apartheid-torn land: enlist the national rugby team on a mission to win the 1995 Rugby World Cup.",
        "runtimeMinutes": "134"
    },
    "2009_480": {
        "plotSummary": "FIX takes you from Beverly Hills to Watts, and places in between, in one day, as documentary filmmakers Bella and Milo race to get Milo's brother Leo from jail to rehab before 8pm, or Leo goes to prison for three years. Inspired by true ...See moreFIX takes you from Beverly Hills to Watts, and places in between, in one day, as documentary filmmakers Bella and Milo race to get Milo's brother Leo from jail to rehab before 8pm, or Leo goes to prison for three years. Inspired by true events, we follow the trio as they document their trip from a suburban police station in Calabasas through mansions in Beverly Hills, East LA chop-shops, rural wastelands, and housing projects in Watts as they attempt to raise the $5,000 required to get Leo into the rehab clinic. Along the way the audience meets dozens of colorful characters, each with their own anomalous perspective on Leo's larger than life personality and style, and each with their own excuse for why they cannot help out. In the end, it may take a drug deal to get the necessary funds for rehab.  Written by AnonymousSee less",
        "runtimeMinutes": "93"
    },
    "2009_481": {
        "plotSummary": "Jason returns home to study for the bar exam, but instead finds that his purpose in life was not what he'd originally thought.",
        "runtimeMinutes": "102"
    },
    "2009_482": {
        "plotSummary": "Tells the story of the unlikely friendship between a pro-capital punishment crusader and a death-row inmate.",
        "runtimeMinutes": "94"
    },
    "2009_483": {
        "plotSummary": "Two shady concert promoters (Cube and Epps) get into hot water when their chance to book a superstar rapper goes awry.",
        "runtimeMinutes": "85"
    },
    "2009_484": {
        "plotSummary": "Affected by tragedy, a married couple decide to role play a blind date.",
        "runtimeMinutes": "80"
    },
    "2009_485": {
        "plotSummary": "Barbara Hoffman is a University of Wisconsin science student. She is a part-time employee at a local massage parlor. She is also a killer. Now all Detective Lulling has to do is prove it. Read more: Synopsis",
        "runtimeMinutes": "92"
    },
    "2009_486": {
        "plotSummary": "After losing her unborn child, Madeline Matheson insists on carrying the baby to term. Following the delivery, the child miraculously returns to life with an appetite for human blood. Madeline is faced with a mother's ultimate decision.",
        "runtimeMinutes": "85"
    },
    "2009_487": {
        "plotSummary": "Family life gets in the way of a con man's search for the perfect scam.",
        "runtimeMinutes": "101"
    },
    "2009_488": {
        "plotSummary": "Adolescents come to terms with their lives after the rebellions of 1996 St. Petersburg.",
        "runtimeMinutes": "83"
    },
    "2009_489": {
        "plotSummary": "A hate crime on the campus of a New England college puts the school's dean in a position where she has to examine her own feelings about race and prejudice, while maintaining her administration's politically correct policies.",
        "runtimeMinutes": "86"
    },
    "2009_49": {
        "plotSummary": "Two kids secretly take in stray dogs at a vacant hotel.",
        "runtimeMinutes": "100"
    },
    "2009_490": {
        "plotSummary": "A grave robber reflects on his life of crime.",
        "runtimeMinutes": "85"
    },
    "2009_491": {
        "plotSummary": "A group of friends unites on the 10 year anniversary of the death of a friend and member of their secret society from college.",
        "runtimeMinutes": "90"
    },
    "2009_492": {
        "plotSummary": "Feature documentary following fashion designer, Jay McCarroll's year-long journey preparing his first independent runway show and selling his clothing line to stores.",
        "runtimeMinutes": "103"
    },
    "2009_493": {
        "plotSummary": "When Jasmine \"Jazz\" Morgan loses her mother to a long-time battle with lung cancer, she can only focus on one thing - becoming a famous singer. Ignoring the wishes of her father, Blair Morgan a strict doctor who prefers that she return to ...See moreWhen Jasmine \"Jazz\" Morgan loses her mother to a long-time battle with lung cancer, she can only focus on one thing - becoming a famous singer. Ignoring the wishes of her father, Blair Morgan a strict doctor who prefers that she return to college, Jazz spends the summer entrenched in the hyper-sexualized, drug-influenced DC music scene, dragging along her younger, more naive, sister Leah). One night, after an impromptu audition, Jazz is invited to join a popular go-go band managed by a charismatic barber, Gabe and supported with drug money provided by the lead MC, Flight. With ease, she falls in line with the band and in love with the stage and together they all reach new heights of popularity. But just as quickly as her success rises, so does the pressure and Jazz recklessly tries to maintain control.  Written by anonymousSee less",
        "runtimeMinutes": "79"
    },
    "2009_494": {
        "plotSummary": "Lucy has always used food to escape life's problems, but when this self-titled \"fat friend\" lures her group of old college buddies to the Montana wilderness, she reveals a new self - skinny, beautiful and still flawed.",
        "runtimeMinutes": "99"
    },
    "2009_495": {
        "plotSummary": "Romantic comedy about a woman who accidentally gets engaged to four men at the same time.",
        "runtimeMinutes": "99"
    },
    "2009_496": {
        "plotSummary": "On New Year's Eve 1944, American pilot Mike Clarke inadvertently bets Al Capone's nephew $10,000.00 that he can shoot down five enemy aircraft. Later, forced to land near a remote village in Ireland after running out of fuel, Mike learns ...See moreOn New Year's Eve 1944, American pilot Mike Clarke inadvertently bets Al Capone's nephew $10,000.00 that he can shoot down five enemy aircraft. Later, forced to land near a remote village in Ireland after running out of fuel, Mike learns that he is cut off from the rest of the world with no way to rejoin the war and shoot down his fifth plane, which is the only way he can win the bet and save his own life. With nowhere to go, he eventually befriends the colorful villagers and meets a fiery red-head named Maggie who shows this pilot that combat can take place on the ground just as well as in the air. It doesn't take long for Mike and Maggie to grow close as she helps him figure out how to win his bet while winning her heart in the process.  Written by Cinema LibreSee less",
        "runtimeMinutes": "83"
    },
    "2009_497": {
        "plotSummary": "A behind-the-scenes look at the gypsy punk band Gogol Bordello and their charismatic front man Eugene Hütz.",
        "runtimeMinutes": "90"
    },
    "2009_498": {
        "plotSummary": "The employees of a low-end electronics store find creative ways to stave off boredom and their impending adulthood, but when one of them gets married they all must face the realities of growing up.",
        "runtimeMinutes": "91"
    },
    "2009_499": {
        "plotSummary": "\"Death Factory: Bloodletting\" ('Saw' meets 'Hostel') is a horror film about a group of online deviants who are invited to an abandoned factory to witness a \"bloodletting\", an event displaying the torture and murder of an innocent person. ...See more\"Death Factory: Bloodletting\" ('Saw' meets 'Hostel') is a horror film about a group of online deviants who are invited to an abandoned factory to witness a \"bloodletting\", an event displaying the torture and murder of an innocent person. Once inside, they soon realize that they have been lured into a trap by a self-righteous madman who uses the factory and its bloodthirsty inhabitant as his own personal version of Hell.  Written by Sean TrettaSee less",
        "runtimeMinutes": "87"
    },
    "2009_5": {
        "plotSummary": "A frustrated writer struggles to keep his family alive when a series of global catastrophes threatens to annihilate mankind.",
        "runtimeMinutes": "158"
    },
    "2009_50": {
        "plotSummary": "Two best friends become rivals when they schedule their respective weddings on the same day.",
        "runtimeMinutes": "89"
    },
    "2009_500": {
        "plotSummary": "A NYPD detective attempts to avenge the death of her father, but unwittingly becomes involved with one of his killers.",
        "runtimeMinutes": "89"
    },
    "2009_501": {
        "plotSummary": "\"CORKED\" ...is a hilarious tale told by documentary filmmakers of four distinctly different wineries and their intertwined fate in Northern California wine country. A prestigious celebrity wine critic is coming to the area and everyone is ...See more\"CORKED\" ...is a hilarious tale told by documentary filmmakers of four distinctly different wineries and their intertwined fate in Northern California wine country. A prestigious celebrity wine critic is coming to the area and everyone is trying to make sure their wine ends up on his golden palate. A diverse group of characters inhabits this region, ranging from a fiercely independent \"one man show\" to an established 'family' winery where the word family is a registered trademark. An eccentric \"rich kid\" attempts to make his mark in his fathers newly acquired vineyard and \"two marketing\" executives are determined to tap into new markets with an edgy high-concept label. We follow this group through the toils of harvest, and their quest for recognition leading to the Golden Harvest Gala!  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2009_502": {
        "plotSummary": "Renowned \"ghost hunter\", Carter Simms is paid to conduct a paranormal investigation of a supposedly haunted house. Along with a cameraman, a reporter, and a spiritual advocate, she embarks on a three night journey into terror.",
        "runtimeMinutes": "107"
    },
    "2009_504": {
        "plotSummary": "Fay is a small town girl on a cross country road trip, trying to escape her own reality after the death of her father. When her muscle car breaks down during a drag race she finds herself stranded along route 66 in an isolated desert town....See moreFay is a small town girl on a cross country road trip, trying to escape her own reality after the death of her father. When her muscle car breaks down during a drag race she finds herself stranded along route 66 in an isolated desert town. Short on cash, she makes a series of choices to make enough money to repair her car. After encountering a neurotic, drug abusing clown she finds herself sliding down a dark spiral. Soon thereafter, her road trip starts to devolve into a living nightmare. Trapped and desperate, she fights to regain her identity while navigating through a host of locals; a creepy motel clerk, an overzealous preacher, and a sexy temptress with horns and a tail.  Written by Tracy Wilcox & Howie AskinsSee less",
        "runtimeMinutes": "83"
    },
    "2009_505": {
        "plotSummary": "Eleven year old Willy's childhood toy, Gooby, comes to life as a real, live, six-foot tall monster who helps Willy through rough times, with hair-raising and hilarious adventures. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2009_506": {
        "plotSummary": "Two writers must face a dilemma that is common to anyone who has ever had an artistic friend: what happens when you have to give feedback, and the news isn't good? Sam, an aspiring screenwriter, and David, a successful magazine editor, ...See moreTwo writers must face a dilemma that is common to anyone who has ever had an artistic friend: what happens when you have to give feedback, and the news isn't good? Sam, an aspiring screenwriter, and David, a successful magazine editor, have been pals for years. When David doesn't appreciate Sam's latest attempt, it opens a fissure in their friendship, one that spreads through the rest of their lives. Ultimately, both men must reevaluate their motivations to write, their need for praise and validation, and what it means to see yourself as you actually are.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2009_507": {
        "plotSummary": "A fading smalltime barber is forced to hire the last person on earth he'd want working in his shop - a woman.",
        "runtimeMinutes": "99"
    },
    "2009_508": {
        "plotSummary": "An unscrupulous movie producer uses an actress, a director and a writer to achieve success.",
        "runtimeMinutes": "118"
    },
    "2009_509": {
        "plotSummary": "14-year-old Sikandar Raza has been living with his uncle and aunt in Kashmir, ever since his parents were killed by militants 10 years ago. The young boy, who dreams of a better life for his family by realizing his football talent, is a ...See more14-year-old Sikandar Raza has been living with his uncle and aunt in Kashmir, ever since his parents were killed by militants 10 years ago. The young boy, who dreams of a better life for his family by realizing his football talent, is a bit of a loner at school and an easy target for the school bullies. One day on his way home from a school football match, Sikandar finds a pistol lying on the path. Despite being warned against it by his new friend Nasreen, Sikandar picks up the pistol believing it to be the answer to his problems. When playing with the pistol alone in the woods, Sikandar meets a young man who teaches him how to be a great shot, but the young man is not who he seems and Sikandar innocently becomes caught up in political warfare. Although the quiet Nasreen acts as Sikandar's conscience, Sikandar gets further embroiled in situations beyond his control, and innocent people get killed. As the story unfolds we see that Sikandar is an innocent victim in a game being played out between the militants, the army, the peace-bartering Politians and religious heads of the little Kashmiri town.  Written by AnonymousSee less",
        "runtimeMinutes": "110"
    },
    "2009_51": {
        "plotSummary": "A college grad lands a job as a financial journalist in New York City to support where she nurtures her shopping addiction and falls for a wealthy entrepreneur.",
        "runtimeMinutes": "104"
    },
    "2009_510": {
        "plotSummary": "A late night airport shuttle ride home descends into darkness.",
        "runtimeMinutes": "107"
    },
    "2009_511": {
        "plotSummary": "A survival story about a honeymooning couple who get lost in the wide expanse of the Grand Canyon.",
        "runtimeMinutes": "102"
    },
    "2009_512": {
        "plotSummary": "Still grieving and off balance due to the death of her love, a German lesbian artist discovers she has attracted a mysterious, but sexy Taiwanese journalist.",
        "runtimeMinutes": "89"
    },
    "2009_513": {
        "plotSummary": "One of America's proudest achievements, our national infrastructure, is now its most dangerous embarrassment. Our bridges, dams, levees and highways are crumbling, toppling, being washed away, and putting us all at risk.",
        "runtimeMinutes": "95"
    },
    "2009_514": {
        "plotSummary": "A semi-autobiographical story about an adventurer whose journeys take him from Harlem to the high seas and back again.",
        "runtimeMinutes": "99"
    },
    "2009_515": {
        "plotSummary": "A serial killer decides to teach the secrets of his satisfying career to a video store clerk. Read more: Synopsis",
        "runtimeMinutes": "91"
    },
    "2009_516": {
        "plotSummary": "An upper-class widow falls in love with a much younger, down-to-earth nurseryman, much to the disapproval of her children and criticism of her country club peers.",
        "runtimeMinutes": "89"
    },
    "2009_517": {
        "plotSummary": "A military special operations team, led by a CIA case officer, are on a mission in the harsh and hostile terrain of Afghanistan where they find themselves in a Middle Eastern \"Bermuda Triangle\" of ancient evil. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2009_518": {
        "plotSummary": "In the crime world of Colombia, there is an unwritten code. When Víctor and Eusebio, two hoods who bungle a shake-down job, break that code, they unwittingly sign their own death sentence.",
        "runtimeMinutes": "106"
    },
    "2009_52": {
        "plotSummary": "A Las Vegas cabbie enlists the help of a UFO expert to protect two siblings with paranormal powers from the clutches of an organization that wants to use the kids for their nefarious plans.",
        "runtimeMinutes": "98"
    },
    "2009_53": {
        "plotSummary": "An alien civilization is invaded by Astronaut Chuck Baker, who believes that the planet was uninhabited. Wanted by the military, Baker must get back to his ship before it goes into orbit without him.",
        "runtimeMinutes": "91"
    },
    "2009_54": {
        "plotSummary": "A journalist is aided by a young female hacker in his search for the killer of a woman who has been dead for forty years.",
        "runtimeMinutes": "152"
    },
    "2009_55": {
        "plotSummary": "A shy student trying to reach his family in Ohio, a gun-toting tough guy trying to find the last Twinkie, and a pair of sisters trying to get to an amusement park join forces to travel across a zombie-filled America.",
        "runtimeMinutes": "88"
    },
    "2009_56": {
        "plotSummary": "While attending his brother's wedding, a serial womanizer is haunted by the ghosts of his past girlfriends.",
        "runtimeMinutes": "115"
    },
    "2009_57": {
        "plotSummary": "A Chicago librarian has a gene that causes him to involuntarily time travel, creating complications in his marriage.",
        "runtimeMinutes": "107"
    },
    "2009_58": {
        "plotSummary": "Tom returns to his hometown on the tenth anniversary of the Valentine's night massacre that claimed the lives of 22 people. Instead of a homecoming, Tom finds himself suspected of committing the murders, and it seems like his old flame is ...See moreTom returns to his hometown on the tenth anniversary of the Valentine's night massacre that claimed the lives of 22 people. Instead of a homecoming, Tom finds himself suspected of committing the murders, and it seems like his old flame is the only one that believes he's innocent.See less",
        "runtimeMinutes": "101"
    },
    "2009_59": {
        "plotSummary": "Yearning for escape and adventure, a young boy runs away from home and sails to an island filled with creatures that take him in as their king.",
        "runtimeMinutes": "101"
    },
    "2009_6": {
        "plotSummary": "78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.",
        "runtimeMinutes": "96"
    },
    "2009_60": {
        "plotSummary": "Two friends and business partners find their lives turned upside down when strange circumstances lead them to be the temporary guardians of seven year-old twins.",
        "runtimeMinutes": "88"
    },
    "2009_61": {
        "plotSummary": "Anna Fitzgerald looks to earn medical emancipation from her parents who until now have relied on their youngest child to help their leukemia-stricken daughter Kate remain alive.",
        "runtimeMinutes": "109"
    },
    "2009_62": {
        "plotSummary": "Discovering covert and faulty intelligence causes a U.S. Army officer to go rogue as he hunts for Weapons of Mass Destruction in an unstable region.",
        "runtimeMinutes": "115"
    },
    "2009_63": {
        "plotSummary": "Centers on a young girl who has been murdered and watches over her family - and her killer - from purgatory. She must weigh her desire for vengeance against her desire for her family to heal.",
        "runtimeMinutes": "135"
    },
    "2009_64": {
        "plotSummary": "An origins story centered on the centuries-old feud between the race of aristocratic vampires and their onetime slaves, the Lycans.",
        "runtimeMinutes": "92"
    },
    "2009_65": {
        "plotSummary": "Friendless Peter Klaven goes on a series of man-dates to find a Best Man for his wedding. But, when his insta-bond with his new B.F.F. puts a strain on his relationship with his fiancee, can the trio learn to live happily ever after?",
        "runtimeMinutes": "105"
    },
    "2009_66": {
        "plotSummary": "A group of young adults visit a boarded up campsite named Crystal Lake where they soon encounter the mysterious Jason Voorhees and his deadly intentions.",
        "runtimeMinutes": "97"
    },
    "2009_67": {
        "plotSummary": "A loan officer who evicts an old woman from her home finds herself the recipient of a supernatural curse. Desperate, she turns to a seer to try and save her soul, while evil forces work to push her to a breaking point.",
        "runtimeMinutes": "99"
    },
    "2009_68": {
        "plotSummary": "Mischievous grandma Madea lands in jail, where she meets a variety of mixed-up characters. Read more: Synopsis",
        "runtimeMinutes": "103"
    },
    "2009_69": {
        "plotSummary": "When a congressional aide is killed, a Washington, D.C. journalist starts investigating the case involving the Representative, his old college friend.",
        "runtimeMinutes": "127"
    },
    "2009_7": {
        "plotSummary": "Edward leaves Bella after an attack that nearly claimed her life, and, in her depression, she falls into yet another difficult relationship - this time with her close friend, Jacob Black.",
        "runtimeMinutes": "130"
    },
    "2009_70": {
        "plotSummary": "In New York City, an estranged couple who witness a murder are relocated to small town Wyoming as part of the Witness Protection Program.",
        "runtimeMinutes": "103"
    },
    "2009_71": {
        "plotSummary": "Two ex-government agents turned rival industrial spies have to be at the top of their game when one of their companies prepares to launch a major product. However, they distract each other in more ways than one.",
        "runtimeMinutes": "125"
    },
    "2009_72": {
        "plotSummary": "A husband and wife who recently lost their baby adopt a 9 year-old girl who is not nearly as innocent as she claims to be.",
        "runtimeMinutes": "123"
    },
    "2009_73": {
        "plotSummary": "After a family is forced to relocate for their son's health, they begin experiencing supernatural behavior in their new home, and uncover a sinister history.",
        "runtimeMinutes": "92"
    },
    "2009_74": {
        "plotSummary": "An updated version of the musical Fame, which centered on the students of the New York Academy of Performing Arts. The name of the school in 1980 was Fiorello Laguardia High School. Read more: Synopsis",
        "runtimeMinutes": "107"
    },
    "2009_75": {
        "plotSummary": "A young woman fights the spirit that is slowly taking possession of her.",
        "runtimeMinutes": "88"
    },
    "2009_76": {
        "plotSummary": "Insp. Jacques Clouseau teams up with a squad of International detectives who are just as bumbling as he is. Their mission: Stop a globe-trotting thief who specializes in stealing historical artifacts.",
        "runtimeMinutes": "92"
    },
    "2009_77": {
        "plotSummary": "A successful asset manager, who has just received a huge promotion, is blissfully happy in his career and in his marriage. But when a temp worker starts stalking him, all the things he's worked so hard for are placed in jeopardy.",
        "runtimeMinutes": "108"
    },
    "2009_78": {
        "plotSummary": "When seasoned comedian George Simmons learns of his terminal, inoperable health condition, his desire to form a genuine friendship causes him to take a relatively green performer under his wing as his opening act.",
        "runtimeMinutes": "146"
    },
    "2009_79": {
        "plotSummary": "A reporter in Iraq might just have the story of a lifetime when he meets Lyn Cassady, a guy who claims to be a former member of the U.S. Army's New Earth Army, a unit that employs paranormal powers in their missions.",
        "runtimeMinutes": "94"
    },
    "2009_8": {
        "plotSummary": "Detective Sherlock Holmes and his stalwart partner Watson engage in a battle of wits and brawn with a nemesis whose plot is a threat to all of England.",
        "runtimeMinutes": "128"
    },
    "2009_80": {
        "plotSummary": "A space-time vortex sucks scientist Rick Marshall, his assistant Holly (Anna Friel) and a survivalist Will into a world populated by dinosaurs and painfully slow creatures called Sleestaks.",
        "runtimeMinutes": "102"
    },
    "2009_81": {
        "plotSummary": "Agent Strahm is dead, and FBI agent Erickson draws nearer to Hoffman. Meanwhile, a pair of insurance executives find themselves in another game set by Jigsaw.",
        "runtimeMinutes": "90"
    },
    "2009_82": {
        "plotSummary": "As computer hacker Lisbeth and journalist Mikael investigate a sex-trafficking ring, Lisbeth is accused of three murders, causing her to go on the run while Mikael works to clear her name.",
        "runtimeMinutes": "129"
    },
    "2009_83": {
        "plotSummary": "In New York City's Harlem circa 1987, an overweight, abused, illiterate teen who is pregnant with her second child is invited to enroll in an alternative school in hopes that her life can head in a new direction.",
        "runtimeMinutes": "110"
    },
    "2009_84": {
        "plotSummary": "After being banished from their tribe, two hunter-gatherers encounter Biblical characters and eventually wind up in the city of Sodom.",
        "runtimeMinutes": "97"
    },
    "2009_85": {
        "plotSummary": "A traveling theater company gives its audience much more than they were expecting.",
        "runtimeMinutes": "123"
    },
    "2009_86": {
        "plotSummary": "A young ninja turns his back on the orphanage that raised him, leading to a confrontation with a fellow ninja from the clan.",
        "runtimeMinutes": "99"
    },
    "2009_87": {
        "plotSummary": "An offbeat romantic comedy about a woman who doesn't believe true love exists, and the young man who falls for her.",
        "runtimeMinutes": "95"
    },
    "2009_88": {
        "plotSummary": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\".",
        "runtimeMinutes": "170"
    },
    "2009_89": {
        "plotSummary": "An Interpol agent attempts to expose a high-profile financial institution's role in an international arms dealing ring.",
        "runtimeMinutes": "118"
    },
    "2009_9": {
        "plotSummary": "Harvard symbologist Robert Langdon works with a nuclear physicist to solve a murder and prevent a terrorist act against the Vatican during one of the significant events within the church.",
        "runtimeMinutes": "138"
    },
    "2009_90": {
        "plotSummary": "A group of kids must protect their vacation home from invading aliens.",
        "runtimeMinutes": "86"
    },
    "2009_91": {
        "plotSummary": "An underwater look at the diverse coastal regions of Southern Australia, New Guinea and the Indo-Pacific areas and the impact of global warming on the oceans. Read more: Synopsis",
        "runtimeMinutes": "41"
    },
    "2009_92": {
        "plotSummary": "The young warrior Son Goku sets out on a quest, racing against time and the vengeful King Piccolo, to collect a set of seven magical orbs that will grant their wielder unlimited power.",
        "runtimeMinutes": "85"
    },
    "2009_93": {
        "plotSummary": "Famous film director Guido Contini struggles to find harmony in his professional and personal lives, as he engages in dramatic relationships with his wife, his mistress, his muse, his agent, and his mother.",
        "runtimeMinutes": "118"
    },
    "2009_94": {
        "plotSummary": "When Madea catches sixteen-year-old Jennifer and her two younger brothers looting her home, she decides to take matters into her own hands.",
        "runtimeMinutes": "113"
    },
    "2009_95": {
        "plotSummary": "The story of Coco Chanel's rise from obscure beginnings to the heights of the fashion world.",
        "runtimeMinutes": "105"
    },
    "2009_96": {
        "plotSummary": "Two young Americans with special abilities must race to find a girl in Hong Kong before a shadowy government organization called Division does.",
        "runtimeMinutes": "111"
    },
    "2009_97": {
        "plotSummary": "A rag doll that awakens in a postapocalyptic future holds the key to humanity's salvation.",
        "runtimeMinutes": "79"
    },
    "2009_98": {
        "plotSummary": "A thriller involving an ongoing unsolved mystery in Alaska, where one town has seen an extraordinary number of unexplained disappearances during the past 40 years and there are accusations of a federal cover up.",
        "runtimeMinutes": "98"
    },
    "2009_99": {
        "plotSummary": "A faded country music musician is forced to reassess his dysfunctional life during a doomed romance that also inspires him.",
        "runtimeMinutes": "112"
    }
}