{
    "2010_1": "The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home.",
    "2010_10": "A hapless young Viking who aspires to hunt dragons becomes the unlikely friend of a young dragon himself, and learns there may be more to the creatures than he assumed.",
    "2010_100": "After a strange and insecure plane crash, an unusual toxic virus enters a quaint farming town. A young couple are quarantined, but they fight for survival along with help from a couple of people.",
    "2010_101": "A near-fatal accident leaves one friend in the hospital while the rest go on their annual vacation. But their secrets and personal grief threaten to drive them apart.",
    "2010_102": "In Paris, a young employee in the office of the US Ambassador hooks up with an American spy looking to stop a terrorist attack in the city.",
    "2010_103": "An exiled detective is recruited to solve a series of mysterious deaths that threaten to delay the inauguration of Empress Wu.",
    "2010_104": "In the year 2019, a plague has transformed almost every human into vampires. Faced with a dwindling blood supply, the fractured dominant race plots their survival; meanwhile, a researcher works with a covert band of vamps on a way to save humankind.",
    "2010_105": "Two young wolves at opposite ends of their pack's social order are thrown together into a foreign land and need each other to return home, but love complicates everything.",
    "2010_106": "Seven years after the fact, a man comes to the realization that he was the sperm donor for his best friend's boy.",
    "2010_107": "An average Joe meets the perfect woman, but his lack of confidence and the influence of his friends and family begin to pick away at the relationship.",
    "2010_108": "A funeral ceremony turns into a debacle of exposed family secrets and misplaced bodies.",
    "2010_109": "After being cut from the U.S.A. softball team and feeling a bit past her prime, Lisa finds herself evaluating her life and in the middle of a love triangle, as a corporate guy in crisis competes with her current, baseball-playing beau.",
    "2010_11": "Perseus, demigod, son of Zeus, battles the minions of the underworld to stop them from conquering heaven and earth.",
    "2010_110": "Charlie's brother, Sam, dies in a car crash that Charlie survives. Charlie is given the gift of seeing his dead brother and others who he has lost such as his friend who died in the military, but when the girl he falls in love with's life ...See moreCharlie's brother, Sam, dies in a car crash that Charlie survives. Charlie is given the gift of seeing his dead brother and others who he has lost such as his friend who died in the military, but when the girl he falls in love with's life is at risk, he must choose between his girlfriend and his brother.See less",
    "2010_111": "Alex and his sister run a business designed to break up relationships. They are hired by a rich man to break up the wedding of his daughter. The only problem is that they only have one week to do so.",
    "2010_112": "In a magically realistic version of Toronto, a young man must defeat his new girlfriend's seven evil exes one by one in order to win her heart.",
    "2010_113": "A paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.",
    "2010_114": "After being set-up and betrayed by the man who hired him to assassinate a Texas Senator, an ex-Federale launches a brutal rampage of revenge against his former boss.",
    "2010_115": "A quiet pawnshop keeper with a violent past takes on a drug-and-organ trafficking ring in hope of saving the child who is his only friend.",
    "2010_116": "Under threat by fundamentalist terrorists, a group of Trappist monks stationed with an impoverished Algerian community must decide whether to leave or stay.",
    "2010_117": "Set on the east coast of New Zealand in 1984, Boy, an 11-year-old child and devout Michael Jackson fan, gets a chance to know his absentee criminal father, who has returned to find a bag of money he buried years ago.",
    "2010_118": "Beth is a young, ambitious New Yorker who is completely unlucky in love. However, on a whirlwind trip to Rome, she impulsively steals some coins from a reputed fountain of love, and is then aggressively pursued by a band of suitors.",
    "2010_119": "An Indian Muslim man with Asperger's syndrome takes a challenge to speak to the President of the United States seriously and embarks on a cross-country journey.",
    "2010_12": "The story of King George VI, his impromptu ascension to the throne of the British Empire in 1936, and the speech therapist who helped the unsure monarch overcome his stammer.",
    "2010_120": "A romantic comedy centered on a guy and a gal who try to keep their love alive as they shuttle back and forth between New York and San Francisco to see one another.",
    "2010_121": "Each of the women portray one of the characters represented in the collection of twenty poems, revealing different issues that impact women in general and women of color in particular.",
    "2010_122": "In the Oregon wilderness, a real-estate developer's new housing subdivision faces a unique group of protestors: local woodland creatures who don't want their homes disturbed.",
    "2010_123": "Sally's parents' marriage breaks up when her father undergoes a mid-life crisis and impulsively weds a prostitute. Meanwhile, Sally's own marriage also begins to disintegrate.",
    "2010_124": "An ex-con gets on a series of apparently unrelated killings. He gets tracked by a veteran cop with secrets of his own and an egocentric hit man.",
    "2010_125": "Two children conceived by artificial insemination bring their biological father into their non-traditional family life.",
    "2010_126": "Anna Brady plans to travel to Dublin, Ireland to propose marriage to her boyfriend Jeremy on Leap Day, because, according to Irish tradition, a man who receives a marriage proposal on a leap day must accept it.",
    "2010_127": "A housewife and grandma takes over the family business 1977, after her husband is hurt during a strike.",
    "2010_128": "When a young woman realizes her brother is about to marry the girl who bullied her in high school, she sets out to expose the fiancee's true colors.",
    "2010_129": "When the American-educated scion of a powerful Indian family returns to the subcontinent, his first taste of power starts him down a corrupt path.",
    "2010_13": "Lucy and Edmund Pevensie return to Narnia with their cousin Eustace where they meet up with Prince Caspian for a trip across the sea aboard the royal ship The Dawn Treader. Along the way they encounter dragons, dwarves, merfolk, and a band...See moreLucy and Edmund Pevensie return to Narnia with their cousin Eustace where they meet up with Prince Caspian for a trip across the sea aboard the royal ship The Dawn Treader. Along the way they encounter dragons, dwarves, merfolk, and a band of lost warriors before reaching the edge of the world.See less",
    "2010_130": "A CIA special forces team are betrayed and left for dead by their superiors, galvanizing them to mount an offensive on the CIA.",
    "2010_131": "To save the only child of the Zhao Family, whose entire clan was massacred at the hands of a nefarious minister, a doctor sacrifices his own son; after the Zhao child grows up, the doctor becomes intent on seeking his vengeance.",
    "2010_132": "Chen Zhen, believed dead, returns to 1930s Shanghai under a false name. He joins a mob boss for info on the Japanese incl. a long kill list and at night fights the Japanese masked.",
    "2010_133": "An adventurous young girl uses her imagination to escape her reality, that is quickly spinning out of reach.",
    "2010_134": "Genetic engineers Clive Nicoli and Elsa Kast hope to achieve fame by successfully splicing together the DNA of different animals to create new hybrid animals for medical use.",
    "2010_135": "A bullied young boy befriends a young female vampire who lives in secrecy with her guardian.",
    "2010_136": "CIA operative Valerie Plame discovers her identity is allegedly leaked by the government as payback for an op-ed article her husband wrote criticizing the Bush administration.",
    "2010_137": "A man dying of cancer tries his best to leave the world on his own terms.",
    "2010_138": "In modern-day Paris, a journalist finds her life becoming entwined with a young girl whose family was torn apart during the notorious Vel' d'Hiv Roundup in 1942.",
    "2010_139": "Kevin Carson is a young man living in the projects who has to survive a three-day weekend after his opportunistic neighbors find out he's holding a winning lottery ticket worth $370 million.",
    "2010_14": "The son of a virtual world designer goes looking for his father and ends up inside the digital world that his father designed. He meets his father's corrupted creation and a unique ally who was born inside the digital world.",
    "2010_140": "Siberian gulag escapees travel four thousand miles by foot to freedom in India.",
    "2010_141": "After stretching the truth on a deal with a spiritual guru, literary agent Jack McCall finds a Bodhi tree on his property. Its appearance holds a valuable lesson on the consequences of every word he speaks.",
    "2010_142": "A retired mobster goes on a revenge spree after being left for dead with 22 bullets in his body by his former childhood friend.",
    "2010_143": "A physical therapist falls for the basketball player she is helping recover from a career-threatening injury.",
    "2010_144": "A serial killer returns to his hometown to stalk seven children who share the same birthday as the date he was allegedly put to rest.",
    "2010_145": "The weeks leading up to a young couple's wedding are comic and stressful, especially as their respective fathers try to lay their long standing feud to rest.",
    "2010_146": "The story of student-soldiers trying to protect a middle school during the early days of the Korean War. Read more: Synopsis",
    "2010_147": "A rising country-music songwriter works with a fallen star to work their way to fame, causing romantic complications along the way.",
    "2010_148": "A look at four seasons in the lives of a happily married couple and their relationships with their family and friends.",
    "2010_149": "While his trailer trash parents teeter on the edge of divorce, Nick Twisp sets his sights on dream girl Sheeni Saunders, hoping that she'll be the one to take away his virginity.",
    "2010_15": "Work causes a single mother to move to China with her young son; in his new home, the boy embraces kung fu, taught to him by a master.",
    "2010_150": "Paul is a U.S. truck driver working in Iraq. After an attack by a group of Iraqis he wakes to find he is buried alive inside a coffin. With only a lighter and a cell phone it's a race against time to escape this claustrophobic death trap.",
    "2010_151": "Toru recalls his life in the 1960s, when his friend Kizuki killed himself and he grew close to Naoko, Kizuki's girlfriend, and another woman, the outgoing, lively Midori.",
    "2010_152": "A group of assassins come together for a suicide mission to kill an evil lord.",
    "2010_153": "Set in the near future when artificial organs can be bought on credit, it revolves around a man who struggles to make the payments on a heart he has purchased. He must therefore go on the run before said ticker is repossessed.",
    "2010_154": "A semi-literate and lonely odd-job man bonds with a much older and well-read woman.",
    "2010_155": "In 1920s Vienna, a young girl receives a magical doll on Christmas Eve.",
    "2010_156": "A Mafia boss trains his mentally impaired son as his successor.",
    "2010_157": "When their country is invaded and their families are taken, eight unlikely teenagers band together to fight.",
    "2010_158": "The T-Rex of the Seas come alive.",
    "2010_159": "Jay doesn't believe in love Stories, and Simran, is a girl who's in love with the idea of Love itself.",
    "2010_16": "A committed dancer struggles to maintain her sanity after winning the lead role in a production of Tchaikovsky's \"Swan Lake\".",
    "2010_160": "A drama centered on the efforts of John and Aileen Crowley to find a researcher who might have a cure for their two children's rare genetic disorder.",
    "2010_161": "Centering on Ip Man's migration to Hong Kong in 1949 as he attempts to propagate his discipline of Wing Chun martial arts.",
    "2010_162": "A man's affair with his family's housemaid leads to dark consequences.",
    "2010_163": "The relationship of a contemporary married couple, charting their evolution over a span of years by cross-cutting between time periods.",
    "2010_164": "After withdrawing to the Chateau Marmont, a passionless Hollywood actor reexamines his life when his eleven-year-old daughter surprises him with a visit.",
    "2010_165": "An unflinching Ozark Mountain girl hacks through dangerous social terrain as she hunts down her drug-dealing father while trying to keep her family intact.",
    "2010_166": "Posing as a movie producer, a conman attempts to trick an entire village into helping him rob a treasure-laden train.",
    "2010_167": "Suspecting her husband of infidelity, gynecologist Dr. Catherine Stewart hires an escort named Chloe in order to test his faithfulness. Soon, the relationships between all three intensify.",
    "2010_168": "The lives of two Danish families cross each other, and an extraordinary but risky friendship comes into bud. But loneliness, frailty and sorrow lie in wait.",
    "2010_169": "A secret agent exacts revenge on a serial killer through a series of captures and releases.",
    "2010_17": "The supervillain Megamind finally defeats his nemesis, the superhero Metro Man. But without a hero, he loses all purpose and must find new meaning to his life.",
    "2010_170": "A dramatization of the 1968 strike at the Ford Dagenham car plant, where female workers walked out in protest against sexual discrimination.",
    "2010_171": "A glimpse at the life of French singer Serge Gainsbourg, from growing up in 1940s Nazi-occupied Paris through his successful song-writing years in the 1960s to his death in 1991 at the age of 62.",
    "2010_172": "A young newspaper writer returns to her hometown in the English countryside, where her childhood home is being prepped for sale.",
    "2010_173": "Emma left Russia to live with her husband in Italy. Now a member of a powerful industrial family, she is the respected mother of three, but feels unfulfilled. One day, Antonio, a talented chef and her son's friend, makes her senses kindle.",
    "2010_175": "Javier is crushed after his new bride leaves him. When his psychiatrist has no answers, he turns to the arms of his ex-girlfriends. Read more: Synopsis",
    "2010_176": "Los Angeles screenwriter David Sumner relocates with his wife to her hometown in the deep South. There, while tensions build between them, a brewing conflict with locals becomes a threat to them both.",
    "2010_177": "A working mother puts herself through law school in an effort to represent her brother, who has been wrongfully convicted of murder and has exhausted his chances to appeal his conviction through public defenders.",
    "2010_178": "A warrior-assassin is forced to hide in a small town in the American Badlands after refusing a mission.",
    "2010_179": "The story follows a married couple, apart for a night while the husband takes a business trip with a colleague to whom he's attracted. While he's resisting temptation, his wife encounters her past love.",
    "2010_18": "In twelfth-century England, Robin Longstride and his band of marauders confront corruption in a local village and lead an uprising against the crown that will forever alter the balance of world power.",
    "2010_180": "The U.S. military makes a scarred bounty hunter with warrants on his own head an offer he cannot refuse: in exchange for his freedom, he must stop a terrorist who is ready to unleash Hell on Earth.",
    "2010_181": "A movie spun out of equal parts folk tale, fable and real-life legend about the mysterious, 1930s Tennessee hermit who famously threw his own rollicking funeral party... while he was still alive.",
    "2010_182": "A convicted arsonist looks to manipulate a parole officer into a plan to secure his parole by placing his beautiful wife in the lawman's path.",
    "2010_183": "A look at one year in the life of four babies from around the world, from Mongolia to Namibia to San Francisco to Tokyo.",
    "2010_184": "A documentary on Brazilian Formula One racing driver Ayrton Senna, who won the F1 world championship three times before his death at age 34.",
    "2010_185": "John and Molly, a divorced middle aged man and a single mother meet at a friends party and start up a small relationship, all John has to do now is meet Molly's son... Cyrus",
    "2010_186": "The lives of three friends, from their early school days into young adulthood, when the reality of the world they live in comes knocking.",
    "2010_187": "Samuel, a male nurse, saves the life of a thief whose henchmen take Samuel's wife hostage and force him to spring their boss.",
    "2010_188": "An impoverished farmer's threat to end his life invites attention from politicians and media.",
    "2010_189": "Former special operative MacGruber is called back into action to take down his arch-enemy, Dieter Von Cunth, who's in possession of a nuclear warhead and bent on destroying Washington, D.C.",
    "2010_19": "Follows the adventures of Aang, a young successor to a long line of Avatars, who must master all four elements and stop the Fire Nation from enslaving the Water Tribes and the Earth Kingdom.",
    "2010_190": "After numerous attempts at suicide fail, a couple decide to live it up and then kill themselves on New Year's Day.",
    "2010_191": "Schoolbooks say that Belka and Strelka were first space dogs. But the dogs say that people dissemble a lot.",
    "2010_192": "The boss of a major crime syndicate orders his lieutenant to bring a rogue gang of drug traffickers in line, a job that gets passed on to his long-suffering subordinate.",
    "2010_193": "A father heads overseas to recover the body of his estranged son who died while traveling the \"El camino de Santiago,\" and decides to take the pilgrimage himself.",
    "2010_194": "When JW becomes a drug runner in order to maintain his double life, his fate becomes tied to two other men: Jorge, a fugitive on the run from both the Serbian mafia and the police, and mafia enforcer Mrado, who is on the hunt for Jorge.",
    "2010_195": "A seemingly corrupt petty contractor faces challenges from the local municipality, his family, his employees, as well as a former girlfriend and her family.",
    "2010_196": "An ex-con with a reputation tries to go straight by working as a handy man for a reclusive actress but this is unfortunately not the wish of London's underground crime lord.",
    "2010_197": "Takes a closer look at what brought about the 2008 financial meltdown.",
    "2010_198": "In Tuscany to promote his latest book, a middle-aged British writer meets a French woman who leads him to the village of Lucignano. While there, a chance question reveals something deeper.",
    "2010_199": "A paralyzed Magician-turned-RJ files a Petition in Court seeking permission to end his life.",
    "2010_2": "Nineteen-year-old Alice returns to the magical world from her childhood adventure, where she reunites with her old friends and learns of her true destiny: to end the Red Queen's reign of terror.",
    "2010_20": "Family-patriarch Jack Byrnes wants to appoint a successor. Does his son-in-law, the male nurse Greg Focker, have what it takes?",
    "2010_200": "Boog's friends rally to bring him home from a Russian traveling circus. Read more: Synopsis",
    "2010_201": "A seventeen-year-old navigates his survival amongst an explosive criminal family and the detective who thinks he can save him.",
    "2010_202": "A seemingly perfect family moves into a suburban neighborhood, but when it comes to the truth as to why they're living there, they don't exactly come clean with their neighbors.",
    "2010_203": "Bertrand Tavernier is in top form with this gripping, superbly mounted drama set against the savage Catholic/Protestant wars that ripped France apart in the 16th century. Based on a novella by the celebrated Madame de Lafayette, the action...See moreBertrand Tavernier is in top form with this gripping, superbly mounted drama set against the savage Catholic/Protestant wars that ripped France apart in the 16th century. Based on a novella by the celebrated Madame de Lafayette, the action centers on the love of Marie de Mezières for her dashing cousin Henri de Guise, thwarted when her father's political ambitions force her into marriage with the well-connected Philippe de Montpensier, whom she has never met. When Philippe is called away to fight, she is left in the care of Count Chabannes, an aging nobleman with a disdain for warfare, and soon becomes exposed to the sexual and political intrigues of court.  Written by Palm Springs Internation Film FestivalSee less",
    "2010_204": "A splinter group of Roman soldiers fight for their lives behind enemy lines after their legion is devastated in a guerrilla attack.",
    "2010_205": "An Aboriginal student on the west coast of Australia in the late '60s runs away from a Catholic boarding school with his cruel headmaster in hot pursuit, meeting eccentric characters along the journey back to his home town.",
    "2010_206": "A young, extroverted left-wing activist who sleeps with her political opponents to convert them to her cause is successful until she meets her match.",
    "2010_207": "A clinically depressed teenager gets a new start after he checks himself into an adult psychiatric ward.",
    "2010_208": "An examination of the current state of education in America today.",
    "2010_209": "A man from Los Angeles, who moved to New York years ago, returns to L.A. to figure out his life while he house-sits for his brother. He soon sparks with his brother's assistant.",
    "2010_21": "While still out to destroy the evil Umbrella Corporation, Alice joins a group of survivors living in a prison surrounded by the infected who also want to relocate to the mysterious but supposedly unharmed safe haven known only as Arcadia.",
    "2010_210": "Four incompetent British terrorists set out to train for and commit an act of terror.",
    "2010_211": "A French illusionist finds himself out of work and travels to Scotland, where he meets a young woman. Their ensuing adventure changes both their lives forever.",
    "2010_212": "After aspiring poet Johann Wolfgang von Goethe fails his law exams, he's sent to a sleepy provincial court to reform. Instead, he falls for Lotte, a young woman who is promised to another man.",
    "2010_213": "A drama centered around three women: A fifty-year-old woman, the daughter she gave up for adoption thirty-five years ago, and a woman looking to adopt a child of her own.",
    "2010_214": "A car magnate watches his personal and professional life hit the skids because of his business and romantic indiscretions.",
    "2010_215": "Following the style of some of the world's most prolific street artists, an amateur filmmaker makes a foray into the art world.",
    "2010_216": "A group of students investigates a series of mysterious bear killings, but learns that there are much more dangerous things going on. They start to follow a mysterious hunter, learning that he is actually a troll hunter.",
    "2010_217": "Affable hillbillies Tucker and Dale are on vacation at their dilapidated mountain cabin when they are mistaken for murderers by a group of preppy college students.",
    "2010_218": "Life for a happy couple is turned upside down after their young son dies in an accident.",
    "2010_219": "Six years after Earth has suffered an alien invasion, a cynical journalist agrees to escort a shaken American tourist through an infected zone in Mexico to the safety of the U.S. border.",
    "2010_22": "In 1954, a U.S. Marshal investigates the disappearance of a murderer who escaped from a hospital for the criminally insane.",
    "2010_220": "A black comedy about two nineteenth century grave robbers, who find a lucrative business providing cadavers for an Edinburgh medical school.",
    "2010_221": "A coming-of-age biographical film about the 1970s teenage all-girl rock band The Runaways. The relationship between band members Cherie Currie and Joan Jett is also explored.",
    "2010_222": "Norwegian winter, early 20th century. On the boys home Bastoy, a new inmate leads the boys to a violent uprising against a brutal regime. How far is he willing to go to attain freedom?",
    "2010_223": "In New York City, a husband and wife butt heads with the granddaughters of the elderly woman who lives in the apartment the couple owns.",
    "2010_224": "An ambulance chaser/carancho falls for an ER/ambulance doctor, he meets one night \"at work\" in Buenos Aires.",
    "2010_225": "A West Texas Deputy Sheriff is slowly unmasked as a psychotic killer.",
    "2010_226": "In the depths of the Korvatunturi mountains, 486 meters deep, lies the closest ever guarded secret of Christmas. The time has come to dig it up. This Christmas everyone will believe in Santa Claus.",
    "2010_227": "Childhood friends Abhay and Aaliya experience plenty of obstacles in their paths as they find their way in the world and back to each other.",
    "2010_228": "Based on a true story, a group of boys from Monterrey, Mexico who became the first non-U.S. team to win the Little League World Series.",
    "2010_229": "Three skiers stranded on a chairlift are forced to make life-or-death choices, which prove more perilous than staying put and freezing to death.",
    "2010_23": "A CIA agent goes on the run after a defector accuses her of being a Russian spy.",
    "2010_230": "After a childhood friend's death, Jake Taylor, an all-star athlete must change his life - and sacrifice his dreams to save the lives of others.",
    "2010_231": "Ruthless executive Christine brings on young Isabelle as her assistant taking delight in toying with her innocence. But when Christine starts passing on her protege's ideas as her own, things take a dark turn.",
    "2010_232": "Unlucky in love and bullied at work, an office drone is resigned to his dead-end life until it's transformed by mysterious calls from - himself.",
    "2010_233": "A young trapeze artist must decide between her lust for Sergio, the Happy Clown, or her affection for Javier, the Sad Clown, both of whom are deeply disturbed.",
    "2010_234": "Young filmmakers document their colleague's budding online friendship with a young woman and her family which leads to an unexpected series of discoveries.",
    "2010_235": "A hitman tries to retire, but a beautiful thief may change his plans.",
    "2010_236": "A Berlin-set drama centered on a 40-something couple who, separately, fall in love with the same man.",
    "2010_237": "A drama about the Algerian struggle for independence from France after WWII.",
    "2010_238": "A forensic psychiatrist discovers that all but one of her patient's multiple personalities are murder victims. She will have to find out what's happening before her time is finished.",
    "2010_239": "One day at a colleague's going away party, Anna meets Domenico, a virile, slightly older chap who's married with two small kids. Passion's flames are rapidly kindled and result in steamy encounters.",
    "2010_24": "While wrestling with the pressures of life, love, and work in Manhattan, Carrie, Miranda, and Charlotte join Samantha for a trip to Abu Dhabi (United Arab Emirates), where Samantha's ex is filming a new movie.",
    "2010_240": "A corrupt police officer faces challenges from his family, gangsters and politicians.",
    "2010_241": "A documentary on the life and career of Joan Rivers, made as the comedienne turns 75 years old.",
    "2010_242": "A young boy fighting cancer writes letters to God, touching lives in his neighborhood and community and inspiring hope among everyone he encounters. An unsuspecting substitute postman with his own troubled life becomes entangled in the ...See moreA young boy fighting cancer writes letters to God, touching lives in his neighborhood and community and inspiring hope among everyone he encounters. An unsuspecting substitute postman with his own troubled life becomes entangled in the boy's journey and family by reading the letters. They inspire him to seek a better life for himself and his own son he's lost through his alcohol addiction.  Written by AnonymousSee less",
    "2010_243": "A young drug dealer watches as his high-rolling life is dismantled in the wake of his cousin's murder, which sees his best friend arrested for the crime.",
    "2010_244": "N-Secure is a no holds-barred thrilling drama mixed with murder, mayhem, and manipulation among affluent professionals. This film sheds light on a man's downfall from the pinnacles of success into the depths of his damaged character. His ...See moreN-Secure is a no holds-barred thrilling drama mixed with murder, mayhem, and manipulation among affluent professionals. This film sheds light on a man's downfall from the pinnacles of success into the depths of his damaged character. His insecurities lead him into a series of troubled romantic relationships and eventually a web of events that include betrayal and murder.  Written by N-Secure FilmsSee less",
    "2010_245": "A sixty-something woman, faced with the discovery of a heinous family crime and in the early stages of Alzheimer's disease, finds strength and purpose when she enrolls in a poetry class.",
    "2010_246": "A romantic drama about a brief, unexpected love affair that catches two people completely off-guard.",
    "2010_247": "After the death of her father, an 8-year-old girl becomes convinced that he is whispering to her through the leaves of the gargantuan tree that towers over her house.",
    "2010_248": "After a car accident, a young woman caught between life and death meets a funeral director who claims to have the gift of transitioning the dead into the afterlife.",
    "2010_249": "Bella Swan moves to Forks and encounters Edward Cullen, a gorgeous boy with a secret.",
    "2010_25": "Revolves around Frank, an American tourist visiting Italy to mend a broken heart. Elise is an extraordinary woman who deliberately crosses his path.",
    "2010_250": "Chico is a young piano player with big dreams. Rita is a beautiful singer with an extraordinary voice. Music and romantic desire unites them, but their journey - in the tradition of the Latin ballad, the bolero - brings heartache and torment.",
    "2010_251": "Believing himself to be jinxed, a man attempts to find true love, but instead gets caught in a web of lies.",
    "2010_252": "Continuing from Ong Bak 2's 1440s, Prince Tien fails to revenge his parents' murder by the evil new ruler. The beaten Tien is rescued. Can he bring peace to the kingdom?",
    "2010_253": "In Paris, a cat who lives a secret life as a cat burglar's aide must come to the rescue of Zoe, the little girl he lives with, after she falls into a gangster's clutches.",
    "2010_254": "In Goa, Pritam meets his love Geeta after many years. They decide to get married but the feud between their respective children creates tension in their marriage.",
    "2010_255": "Danish soldiers are sent to Afghanistan in 2009 for 6 months, to help stabilize the country against the Taliban. They're stationed on Armadillo military base in Helman province. Unlike other war movies, this is the real deal - no actors.",
    "2010_256": "Ulrik's released from prison after 12 years for murder. Will he go straight? He gets a room and a job as mechanic. He hooks up with his old gang. His son introduces him as uncle to his pregnant fiancee.",
    "2010_257": "A reimagined account of the early life of Maria Anna 'Nannerl' Mozart, five years older than Wolfgang, and a musical prodigy in her own right.",
    "2010_258": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2010_259": "An Irish fisherman discovers a woman in his fishing net whom his precocious daughter believes to be a selkie.",
    "2010_26": "A CIA operative hires a team of mercenaries to eliminate a Latin dictator and a renegade CIA agent.",
    "2010_260": "Two eighth-graders start to have feelings for each other despite being total opposites.",
    "2010_261": "Jin Kazama witnesses the death of his mother Jun by Tekken in the slums known as Anvil. After finding a Tekken ID he decides to seek out vengeance for his mother's death.",
    "2010_262": "Mr. David Marks was suspected but never tried for killing his wife Katie who disappeared in 1982, but the truth is eventually revealed.",
    "2010_263": "The story of a woman dealing with her daughter's death while trying to keep her marriage and her relationship with her stepson. Read more: Synopsis",
    "2010_264": "Twenty-eight-year-old Kansas University doctoral student Omar Razaghi (Omar Metwally) wins a grant to write a biography of Latin American writer Jules Gund. Omar must get through to three people who were close to Gund; his brother, widow, ...See moreTwenty-eight-year-old Kansas University doctoral student Omar Razaghi (Omar Metwally) wins a grant to write a biography of Latin American writer Jules Gund. Omar must get through to three people who were close to Gund; his brother, widow, and younger mistress, so he can get authorization to write the biography.  Written by Marisa_Gabriella, edited by Krystal FrauendienstSee less",
    "2010_265": "A year with one platoon in the deadliest valley in Afghanistan.",
    "2010_266": "Amidst turmoil and racial conflict in a Francophone African state, a white French woman fights for her coffee crop, her family and ultimately for her life.",
    "2010_267": "A bandit leader kidnaps the wife of the policeman who killed his sister, but later falls in love with her.",
    "2010_268": "Ajami is the religiously mixed community of Muslims and Christians in Tel Aviv. These are five stories about the everyday life in Ajami.",
    "2010_269": "A comedy centered on an Indian mother who takes her obsession with marriage into the world of serial murder.",
    "2010_27": "After their high school basketball coach passes away, five good friends and former teammates reunite for a Fourth of July holiday weekend.",
    "2010_270": "A writer who is brutalized during her cabin retreat seeks revenge on her attackers, who left her for dead.",
    "2010_271": "As Allen Ginsberg talks about his life and art, his most famous poem is illustrated in animation while the obscenity trial of the work is dramatized.",
    "2010_272": "Umay is a young woman of Turkish descent, fighting for an independent and self-determined life in Germany against the resistance of her family. Her struggle initiates a dynamic, which results in a life-threatening situation.",
    "2010_273": "Dying of kidney disease, a man spends his last, somber days with family, including the ghost of his wife and a forest spirit who used to be his son, on a rural northern Thailand farm.",
    "2010_274": "A hot shot Washington DC lobbyist and his protege go down hard as their schemes to peddle influence lead to corruption and murder.",
    "2010_275": "A look at the late '60s and early '70s rock band The Doors, including rare exclusive footage.",
    "2010_276": "A drama centered on an orphaned Palestinian girl growing up in the wake of Arab-Israeli war who finds herself drawn into the conflict. Read more: Synopsis",
    "2010_277": "A single-parent ex-con in a tough, minority neighborhood finds his personal values challenged when he discovers his son is gay.",
    "2010_278": "The story of Venezuelan revolutionary Ilich Ramírez Sánchez, who founded a worldwide terrorist organization and raided the 1975 OPEC meeting.",
    "2010_279": "A divorced mother of three children runs a happy household - until her former husband brings his new career-oriented girlfriend into the picture.",
    "2010_28": "A young woman gets mixed up with a disgraced spy who is trying to clear his name.",
    "2010_280": "An Ivy League professor is lured back to his Oklahoma hometown, where his twin brother, a small-time pot grower, has concocted a scheme to take down a local drug lord.",
    "2010_281": "Collective screening of the Academy Award nominated short films from the Live Action category for 2010.",
    "2010_282": "A drama that is centered around a troubled teenage girl, and a family that is trying to get over the loss of their son.",
    "2010_283": "Uses astonishing visuals to tell the intersecting stories of George Mallory, the first man to attempt a summit of Mount Everest, and Conrad Anker, the mountaineer who finds Mallory's frozen remains 75 years later. Read more: Synopsis",
    "2010_284": "A rich man's daughter is held captive in an abandoned apartment by two former convicts who abducted her and hold her ransom in exchange for her father's money.",
    "2010_285": "The true story of a Hawaiian princess' attempts to maintain the independence of the island against the threat of American colonization.",
    "2010_286": "In early twentieth-century British India, the Pindari leader Prithvi Singh narrates his story to a reporter from the London Times - a story of betrayal and deceit at the hands of the British and Madhavgarh's Raja Gyanendra Singh, which led...See moreIn early twentieth-century British India, the Pindari leader Prithvi Singh narrates his story to a reporter from the London Times - a story of betrayal and deceit at the hands of the British and Madhavgarh's Raja Gyanendra Singh, which led to the massacre of 4500 Pindaris.See less",
    "2010_287": "A maniac murders teens when they refuse to forward chain mail. Read more: Synopsis",
    "2010_288": "The story of three close friends who are involved in a love-triangle.",
    "2010_289": "15 years ago, Ben Walker left his girlfriend, his hometown, and his ministry calling for a business opportunity. Now he has a high-paying career and a trophy fiancee. One day he's visited by an angel who lets him see what his life would ...See more15 years ago, Ben Walker left his girlfriend, his hometown, and his ministry calling for a business opportunity. Now he has a high-paying career and a trophy fiancee. One day he's visited by an angel who lets him see what his life would look like if he had followed his calling.  Written by AnonymousSee less",
    "2010_29": "A stubborn teenager enlists the help of a tough U.S. Marshal to track down her father's murderer.",
    "2010_290": "Pat Tillman never thought of himself as a hero. His choice to leave a multimillion-dollar football contract and join the military wasn't done for any reason other than he felt it was the right thing to do. The fact that the military ...See morePat Tillman never thought of himself as a hero. His choice to leave a multimillion-dollar football contract and join the military wasn't done for any reason other than he felt it was the right thing to do. The fact that the military manipulated his tragic death in the line of duty into a propaganda tool is unfathomable and thoroughly explored in Amir Bar-Lev's riveting and enraging documentary.  Written by Sundance Film FestivalSee less",
    "2010_291": "Friends, family, and lovers struggle to find love, forgiveness, and meaning in an almost war-torn world riddled with comedy and pathos.",
    "2010_292": "An American drug dealer living in Tokyo is betrayed by his best friend and killed in a drug deal. His soul, observing the repercussions of his death, seeks resurrection.",
    "2010_293": "Chronicles Jack Harris, one of the pioneers of internet commerce, as he wrestles with his morals, and struggles not to drown in a sea of con men, mobsters, drug addicts, and porn stars.",
    "2010_294": "In Brooklyn, a youth from an Orthodox Jewish community is lured into becoming an Ecstasy dealer by his pal who has ties to an Israeli drug cartel.",
    "2010_295": "One place. One day. Two men. The place is a polar research station on an island in the Arctic Ocean, inhabited now only by Sergei and Pavel. One day when Sergei is out angling, Pavel picks up a radio message that he daren't communicate.",
    "2010_296": "A look at the musical roots and traditions of Naples, Italy, as well as its influence on the rest of the world.",
    "2010_297": "An old shepherd lives his last days in a quiet medieval village perched high on the hills of Calabria, at the southernmost tip of Italy. He herds goats under skies that most villagers have deserted long ago. He is sick, and believes to ...See moreAn old shepherd lives his last days in a quiet medieval village perched high on the hills of Calabria, at the southernmost tip of Italy. He herds goats under skies that most villagers have deserted long ago. He is sick, and believes to find his medicine in the dust he collects on the church floor, which he drinks in his water every day.  Written by AnonymousSee less",
    "2010_298": "Bank robbers, diamond thieves, the homicide of a minister, a hyper wife are just some of the challenges faced by a bumbling senior police officer.",
    "2010_299": "A man who escorts wealthy widows in New York's Upper East Side takes a young aspiring playwright under his wing.",
    "2010_3": "As Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) race against time and evil to destroy the Horcruxes, they uncover the existence of the three most powerful objects in the wizarding world: the Deathly Hallows.",
    "2010_30": "Travel writer Lemuel Gulliver takes an assignment in Bermuda but ends up on the island of Lilliput, where he towers over its tiny citizens.",
    "2010_300": "A limo driver's blind date sparks a tale of love, betrayal, friendship, and grace centered around two working-class New York City couples.",
    "2010_301": "Four guys, one camera, and their experience chronicling the exhilarating and terrifying rite of passage: losing your virginity. As these guys help their buddy get laid, they'll have to survive friends with benefits, Internet hookups, even ...See moreFour guys, one camera, and their experience chronicling the exhilarating and terrifying rite of passage: losing your virginity. As these guys help their buddy get laid, they'll have to survive friends with benefits, Internet hookups, even porn stars during an adventure that proves why you will always remember your first.  Written by Columbia PicturesSee less",
    "2010_302": "A sexually \"undeclared\" college freshman's clairvoyant/prophetic dreams are the first sign that something very strange is going on involving his class-mates -- with him at the center.",
    "2010_303": "A Gypsy family travels the French roads during the Second World War, followed by Little Claude, a young boy seeking a new family after his parents \"left and never returned\". Upon reaching a town where they traditionally stop for a few ...See moreA Gypsy family travels the French roads during the Second World War, followed by Little Claude, a young boy seeking a new family after his parents \"left and never returned\". Upon reaching a town where they traditionally stop for a few months and work in vineyards, they learn that a new law forbids them from being nomadic. Theodore, the town's mayor, and Miss Lundi, the schoolteacher, protect and help the Gypsies. Despite this, They are arrested and placed in an internment camp. Theodore manages to rescue them and gives them a piece of property where they must settle. But the Gypsies' deeply ingrained thirst for freedom makes this sedentary lifestyle difficult to bear. After Theodore and Miss Lundi are arrested for resistance, the Gypsies decide they must get back on the move in order to remain free.  Written by AnonymousSee less",
    "2010_304": "Documents Joaquin Phoenix's transition from the acting world to a career as an aspiring rapper.",
    "2010_305": "In the Nazi-occupied Netherlands, a teenage boy gets involved in the Dutch Resistance after coming to the aid of a wounded RAF pilot.",
    "2010_306": "Family is the most important thing in the world to Kaja. She is an eternal optimist in spite of living with a man who would rather go hunting with the boys, and who refuses to have sex with her because she isn't particularly attractive ...See moreFamily is the most important thing in the world to Kaja. She is an eternal optimist in spite of living with a man who would rather go hunting with the boys, and who refuses to have sex with her because she isn't particularly attractive anymore. Whatever. That's life. But when the perfect couple moves in next door, Kaja struggles to keep her emotions in check. Not only do these successful, beautiful, exciting people sing in a choir; they have also adopted a child - from Ethiopia. These new neighbors open a new world to Kaja, with consequences for everyone involved. And when Christmas comes around, it becomes evident that nothing will ever be like before - even if Kaja tries her very best.  Written by Official siteSee less",
    "2010_307": "An unusual ghost story set on the Peruvian seaside; a married fisherman struggles to reconcile his devotion to his male lover within his town's rigid traditions.",
    "2010_308": "A tragi-comedy centered on the HR manager of Israel's largest industrial bakery, who sets out to save the reputation of his business and prevent the publication of a defamatory article.",
    "2010_309": "Concert footage and offstage documentary of singer Elvis Presley.",
    "2010_31": "A teenager discovers he's the descendant of a Greek god and sets out on an adventure to settle an on-going battle between the gods.",
    "2010_310": "The story of the notorious French gangster Jacques Mesrine, with the focus on his life before the early 1970s and the events that led to him being declared Public Enemy No. 1 in France.",
    "2010_311": "Documentary that follows the struggle for control of Dr. Albert C. Barnes' 25 billion dollar collection of modern and post-impressionist art.",
    "2010_312": "About a group of friends competing in a national tween music video contest. Enter a world of hilarious adventures, original songs and never before seen dance routines. You will be left believing in the power of childhood dreams. Read more: Synopsis",
    "2010_313": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.",
    "2010_314": "Tired of being a Preacher's daughter and longing to experience more of life, 20-something ANGIE KING strikes out on her own for the very first time and joins a traveling gospel show.",
    "2010_315": "A documentary on the relationship between fashion designer Yves Saint-Laurent and his lover, Pierre Berge.",
    "2010_316": "A film producer struggles with suicidal despair.",
    "2010_317": "A tone-deaf cop works to track down a group of guerilla percussionists whose anarchic public performances are terrorizing the city.",
    "2010_318": "\"The Most Dangerous Man in America\" is the story of what happens when a former Pentagon insider, armed only with his conscience, steadfast determination, and a file cabinet full of classified documents, decides to challenge an \"Imperial\" ...See more\"The Most Dangerous Man in America\" is the story of what happens when a former Pentagon insider, armed only with his conscience, steadfast determination, and a file cabinet full of classified documents, decides to challenge an \"Imperial\" Presidency-answerable to neither Congress, the press, nor the people-in order to help end the Vietnam War. In 1971, Daniel Ellsberg shook America to its foundations when he smuggled a top-secret Pentagon study to the New York Times that showed how five Presidents consistently lied to the American people about the Vietnam War that was killing millions and tearing America apart. President Nixon's National Security Advisor Henry Kissinger called Ellsberg \"the most dangerous man in America,\" who \"had to be stopped at all costs.\" But Ellsberg wasn't stopped. Facing 115 years in prison on espionage and conspiracy charges, he fought back. Ensuing events surrounding the so-called Pentagon Papers led directly to Watergate and the downfall of President Nixon, and hastened the end of the Vietnam War. Ellsberg's relentless telling of truth to power, which exposed the secret deeds of an \"Imperial Presidency,\" inspired Americans of all walks of life to forever question the previously-unchallenged pronouncements of its leaders. \"The Most Dangerous Man in America\" tells the inside story, for the first time on film, of this pivotal event that changed history and transformed our nation's political discourse. It is told largely by the players of that dramatic episode-Ellsberg, his colleagues, family and critics; Pentagon Papers authors and government officials; Vietnam veterans and anti-war activists; Watergate principals, attorneys and the journalists who both covered the story and were an integral part of it; and finally-through White House audiotapes-President Nixon and his inner circle of advisors.  Written by AnonymousSee less",
    "2010_319": "Three bad girls travel to a remote desert hideaway to steal $200 million in diamonds from a ruthless underworld kingpin.",
    "2010_32": "As Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, he is sued by the twins who claimed he stole their idea, and by the co-founder who was later squeezed out of the business.",
    "2010_320": "The film contrasts two views of role that the federal government should play in our daily lives using the words and actions of Ronald Reagan and Barack Obama.",
    "2010_321": "A romantic thriller about a construction worker in hiding for killing his foreman who hides in the mansion where his girlfriend works as a maid.",
    "2010_322": "A man's life begins to unravel when his mistress brings him a bag of cash.",
    "2010_323": "Shakespeare's epic play is translated from page to screen, with the gender of the main character, Prospero, changed from male to female.",
    "2010_324": "About a recent college grad who returns home while she tries to figure out what to do with her life.",
    "2010_325": "Good girl Sandy Olsson and greaser Danny Zuko fell in love over the summer. When they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance?",
    "2010_326": "A small-time thief steals a car and impulsively murders a motorcycle policeman. Wanted by the authorities, he reunites with a hip American journalism student and attempts to persuade her to run away with him to Italy.",
    "2010_327": "On a business trip to New Orleans, a damaged man seeks salvation by caring for a wayward young woman.",
    "2010_328": "A compelling drama that explores the different meanings of being a parent through the gritty, realistic lives of the struggling, blue-collar Porters, and the privileged Campbell family. Their lives intersect, intertwine and collide, all ...See moreA compelling drama that explores the different meanings of being a parent through the gritty, realistic lives of the struggling, blue-collar Porters, and the privileged Campbell family. Their lives intersect, intertwine and collide, all for the love of a little boy. This film bravely exposes the humanity in each character reminding us that we each have the potential to be the best and worst versions of ourselves at any time.  Written by Karen KingsburySee less",
    "2010_329": "A cantankerous but ailing bartender takes a kindly young homeless man in under his wing.",
    "2010_33": "Intertwining couples and singles in Los Angeles break-up and make-up based on the pressures and expectations of Valentine's Day.",
    "2010_330": "The collar awarded to the winners of the Meilleur Ouvrier de France (Best Craftsman in France) is more than the ultimate recognition for every pastry chef - it is a dream and an obsession. The 3-day competition includes everything from ...See moreThe collar awarded to the winners of the Meilleur Ouvrier de France (Best Craftsman in France) is more than the ultimate recognition for every pastry chef - it is a dream and an obsession. The 3-day competition includes everything from delicate chocolates to precarious six foot sugar sculptures and requires that the chefs have extraordinary skill, nerves of steel and luck. The film follows Jacquy Pfeiffer, founder of The French Pastry School in Chicago, as he returns to France to compete against 15 of France's leading pastry chefs. The filmmakers were given first time/exclusive access to this high-stakes drama of passion, sacrifice, disappointment and joy in the quest to have President Sarkozy declare them one of the best in France.  Written by AnonymousSee less",
    "2010_331": "While unveiling a series of international conspiracies, an FBI agent is embroiled in a set of political intrigues.",
    "2010_332": "A young police officer must survive his first day's duty in a small country town. Read more: Synopsis",
    "2010_333": "A film about an unfinished film which portrays the people behind and before the camera in the Warsaw Ghetto, exposing the extent of the cinematic manipulation forever changing the way we look at historic images.",
    "2010_334": "A road trip through Louisiana transforms three strangers who were originally brought together by their respective feelings of loneliness.",
    "2010_335": "In this super-feel-good foodie comedy, young Manhattan chef Samir rediscovers his heritage and his passion for life through the enchanting art of cooking Indian food.",
    "2010_336": "Before their inevitable farewell, Jorge, a young man of Mayan roots, and Natan, his half-Italian son, spend time together living off the Banco Chinchorro coral reef.",
    "2010_337": "Drawing some intriguing parallels between the work of the prostitute and that of the psychiatrist-both have clients, both charge for sessions, both take on roles that serve the needs, psychological or otherwise, of those they serve, like ...See moreDrawing some intriguing parallels between the work of the prostitute and that of the psychiatrist-both have clients, both charge for sessions, both take on roles that serve the needs, psychological or otherwise, of those they serve, like Alice, a disaffected call girl and Xavier, a shrink with a crumbling domestic situation. With sex more talked about than shown, the film is filled with pointed dialogue and double entendres.  Written by Palm Springs Internation Film FestivalSee less",
    "2010_338": "A jealous husband and his friends plot the kidnapping of his wife's lover with the intention of restoring his wounded ego.",
    "2010_339": "Pianomania follows Stefan Knüpfer, a piano tuner from Steinway and his famous clients Lang Lang, Brendel, Buchbinder and Pierre-Laurent Aimard as they search for the perfect pitch. Truly an unusual and entertaining peek behind the curtain ...See morePianomania follows Stefan Knüpfer, a piano tuner from Steinway and his famous clients Lang Lang, Brendel, Buchbinder and Pierre-Laurent Aimard as they search for the perfect pitch. Truly an unusual and entertaining peek behind the curtain at the world's great concert halls.  Written by Cibis & FranckSee less",
    "2010_34": "Master sorcerer Balthazar Blake must find and train Merlin's descendant to defeat dark sorceress Morgana la Fee.",
    "2010_340": "The story of the notorious French gangster Jacques Mesrine, with the focus on his life and death as France's Public Enemy No. 1 in the 1970s.",
    "2010_341": "On the outskirts of Rio de Janeiro is Jardim Gramacho, the world's largest landfill, where men and women sift through garbage for a living. Artist Vik Muniz produces portraits of the workers and learns about their lives.",
    "2010_342": "A single mother of a thirteen-year-old boy from Belarus seeks refuge in Belgium with dreams of a better life, but instead, she will be incarcerated and separated from her son, risking deportation.",
    "2010_343": "A couple embarks on a journey home for Chinese new year along with 130 million other migrant workers, to reunite with their children and struggle for a future. Their unseen story plays out as China soars towards being a world superpower.",
    "2010_344": "A documentary about how the likelihood of nuclear weapons (or fissile materials) usage has increased due to the rise of terrorism and lack of safeguards and verification.",
    "2010_345": "In Chile, 1973, during the last days of Salvador Allende's presidency, an employee at a Morgue's recording office falls for a burlesque dancer who mysteriously disappears.",
    "2010_346": "A road trip across five countries to explore the social and political movements as well as the mainstream media's misperception of South America while interviewing seven of its elected presidents.",
    "2010_347": "Two weeks before his release, a teenage prisoner learns that his mother has returned home. Meanwhile, he finds himself in love with a student working in the penitentiary as an intern.",
    "2010_348": "A holiday fable that tells the story of an elderly man discovering love for the first time. Read more: Synopsis",
    "2010_349": "Set during the time of the first outbreak of bubonic plague in England, a young monk is given the task of learning the truth about reports of people being brought back to life in a small village.",
    "2010_35": "High-strung father-to-be Peter Highman is forced to hitch a ride with aspiring actor Ethan Tremblay on a road trip in order to make it to his child's birth on time.",
    "2010_350": "Follows a jealous countess, a wealthy businessman, and a young orphaned boy across Portugal, France, Italy and Brazil where they connect with a variety of mysterious individuals.",
    "2010_351": "Director Tamra Davis pays homage to her friend in this definitive documentary but also delves into Basquiat as an iconoclast. His dense, bebop-influenced neoexpressionist work emerged while minimalist, conceptual art was the fad; as a ...See moreDirector Tamra Davis pays homage to her friend in this definitive documentary but also delves into Basquiat as an iconoclast. His dense, bebop-influenced neoexpressionist work emerged while minimalist, conceptual art was the fad; as a successful black artist, he was constantly confronted by racism and misconceptions. Much can be gleaned from insider interviews and archival footage, but it is Basquiat's own words and work that powerfully convey the mystique and allure of both the artist and the man.  Written by Sundance Film FestivalSee less",
    "2010_352": "A story based on Johann Rettenberger, an Austrian marathon runner and a bank robber. Read more: Synopsis",
    "2010_353": "A mad scientist kidnaps and mutilates a trio of tourists in order to reassemble them into a human centipede, created by stitching their mouths to each others' rectums.",
    "2010_354": "During the Second Sino-Japanese War, in 1940, Lieutenant Kurokawa returns home as a honored and decorated soldier... but deprived of his arms and legs lost in battle in mainland China. All hopes, from the village men and women to close ...See moreDuring the Second Sino-Japanese War, in 1940, Lieutenant Kurokawa returns home as a honored and decorated soldier... but deprived of his arms and legs lost in battle in mainland China. All hopes, from the village men and women to close family members, turn to Shigeko, the Lieutenant's wife: she must honor the Emperor and the country in setting an example for all by fulfilling her duty and taking care of the 'god soldier'...  Written by Dissidenz InternationalSee less",
    "2010_355": "The story of a man who rescues a German shepherd and how the two become fast friends.",
    "2010_356": "Paul Hanganu loves two women. Adriana his wife and the mother of their daughter, the woman with whom he's shared the thrills of the past ten years, and Raluca the woman who has made him redefine himself. He has to leave one of them before Christmas.",
    "2010_357": "Former Danish servicemen Lars and Jimmy are thrown together while training in a neo-Nazi group. Moving from hostility through to friendship and finally passion, events take a darker turn when it's discovered.",
    "2010_358": "When a 12-year-old girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her.",
    "2010_359": "Nine friends take a holiday at a Victorian home on a private island and uncover a game that when played brings out the worst in each of them. Jealously, greed, hatred, lust, all of the things they keep buried deep inside themselves rise to...See moreNine friends take a holiday at a Victorian home on a private island and uncover a game that when played brings out the worst in each of them. Jealously, greed, hatred, lust, all of the things they keep buried deep inside themselves rise to the surface and come to a boil.See less",
    "2010_36": "A married woman realizes how unhappy her marriage really is, and that her life needs to go in a different direction. After a painful divorce, she takes off on a round-the-world journey to \"find herself\".",
    "2010_360": "New love convinces a struggling actor and dancer to enter a talent competition that could make him a superstar.",
    "2010_361": "More than 20 years ago, Dr. Jane Goodall, now 75, decided to give up her career as a primatologist, as well as her private life, in order to devote all her energy to saving our endangered planet. Since then she's been spending 300 days a ...See moreMore than 20 years ago, Dr. Jane Goodall, now 75, decided to give up her career as a primatologist, as well as her private life, in order to devote all her energy to saving our endangered planet. Since then she's been spending 300 days a year scouring the globe on her mission to spread hope for future generations. She has taken on the responsibilities of a UN Messenger of Peace, and has been honored with countless awards. In Jane's Journey, we accompany her on her travels across several continents, and receive unprecedented access to her intense and exciting past. From her childhood home in Bournemouth, England, we embark to Gombe National Park on the shores of Lake Tanganyika, in Tanzania, her second home. It's where she began her groundbreaking research nearly half a century ago, and she still returns every year to enjoy the company of the chimpanzees that made her the internationally recognized activist so loved and deeply respected.This documentary offers an intimate portrait of the private person behind the world-famous icon, possibly the most fascinating woman of our time, whose scientific breakthroughs are considered to be among the most important of the past 100 years.  Written by Palm Springs Internation Film FestivalSee less",
    "2010_362": "A cop works against his country's corrupt government in order to find justice on a case. Read more: Synopsis",
    "2010_363": "A schoolgirl and six of her classmates travel to her aunt's country home, which turns out to be haunted.",
    "2010_364": "In the summer of 2003, a group of shepherds took a herd of sheep one final time through the Beartooth Mountains of Montana, in the extreme north-west of the United States. It was a journey of almost three hundred kilometres through ...See moreIn the summer of 2003, a group of shepherds took a herd of sheep one final time through the Beartooth Mountains of Montana, in the extreme north-west of the United States. It was a journey of almost three hundred kilometres through expansive green valleys, by fields of snow, and across hazardous, narrow ridges - a journey brimming with challenges. The aging shepherds do their very best to keep the hundreds of sheep together; the panoramic high mountains are teeming with hungry wolves and grizzly bears.  Written by International Documentary Film Festival AmsterdamSee less",
    "2010_365": "A book-smart teenager joins his school's wrestling team as a way to reunite his surviving family members, who split apart after the death of his father, a college wrestling legend, 10 years ago.",
    "2010_366": "Present-day Chad. Adam, fifty-five, a former swimming champion, is pool attendant at a smart N'Djamena hotel. When the hotel gets taken over by new Chinese owners, he is forced to give up his job to his son Abdel. Terribly resentful, he ...See morePresent-day Chad. Adam, fifty-five, a former swimming champion, is pool attendant at a smart N'Djamena hotel. When the hotel gets taken over by new Chinese owners, he is forced to give up his job to his son Abdel. Terribly resentful, he feels socially humiliated. The country is in the throes of a civil war. Rebel forces are attacking the government. The authorities demand that the population contribute to the \"war effort\", giving money or volunteers old enough to fight off the assailants. The District Chief constantly harasses Adam for his contribution. But Adam is penniless; he only has his son....  Written by Pyramide InternationalSee less",
    "2010_367": "An in-depth look at the rise and fall of New York Governor Eliot Spitzer, including interviews with the scandalized, former politician.",
    "2010_368": "Seven close friends reunite for the wedding of two of their friends. Problems arise because the bride and the maid of honor have had a long rivalry over the groom.",
    "2010_369": "An authorized biographical film of the man who led high profile football programs at Michigan State, LSU, and - most recently Alabama from hard times to good times and the only coach to lead two different college programs to national ...See moreAn authorized biographical film of the man who led high profile football programs at Michigan State, LSU, and - most recently Alabama from hard times to good times and the only coach to lead two different college programs to national championships in the modern era.  Written by AnonymousSee less",
    "2010_37": "A documentary filmmaker travels to Jellystone Park to shoot a project and soon crosses paths with Yogi Bear, his sidekick Boo-Boo and Ranger Smith.",
    "2010_370": "Laura's personal life consists of one affair after another. She meets Arturo and the pair enter into an intense, violent sexual relationship. As days go by, Laura crosses out the days on a calendar, revealing her secret past to her lover.",
    "2010_371": "A romantic drama about a working-class woman and her experiences traveling back home.",
    "2010_372": "Jack Rebney is the most famous man you've never heard of - after cursing his way through a Winnebago sales video, Rebney's outrageously funny outtakes became an underground sensation and made him an internet superstar. Filmmaker Ben ...See moreJack Rebney is the most famous man you've never heard of - after cursing his way through a Winnebago sales video, Rebney's outrageously funny outtakes became an underground sensation and made him an internet superstar. Filmmaker Ben Steinbauer journeys to the top of a mountain to find the recluse who unwittingly became the \"Winnebago Man.\"  Written by AnonymousSee less",
    "2010_373": "A documentary about two different searches conducted in the Chilean Atacama Desert: one by astronomers looking for answers about the history of the cosmos, and one by women looking for the remains of loved ones killed by Pinochet's regime.",
    "2010_374": "A probing investigation into the lies, greed and corruption surrounding D.C. super-lobbyist Jack Abramoff and his cronies.",
    "2010_375": "Anchor Baby is a tale of an illegal immigrant couple from Nigeria on a quest to create a better life for their unborn child. Their dream is to have their baby in the United States in order for the baby to become a US citizen.",
    "2010_376": "A gangster named Perrier looks to exact his revenge on a trio of fugitives responsible for the accidental death of one of his cronies.",
    "2010_377": "A documentary on the mysterious and influential pianist.",
    "2010_378": "Earnest bathroom clerk Dung falls in love with lounge singer Mai, but she's being pursued by a tycoon who offers her a job in exchange for dating him",
    "2010_379": "Hired to spy on a philandering husband, Luo Haitao soon becomes entangled in a clandestine affair with the other man. Along with Luo's girlfriend, they succumb to the delirium of drunken nights, but how long can their tryst last?",
    "2010_38": "When his peaceful life is threatened by a high-tech assassin, former black-ops agent Frank Moses reassembles his old team in a last-ditch effort to survive and uncover his assailants.",
    "2010_380": "In a seaside Irish town, a widower sparks with a visiting horror novelist while he also begins to believe he is seeing ghosts.",
    "2010_381": "Marybeth escapes the clutches of the bayou-butcher Victor Crowley and returns to the swamp with an army of hunters and gunmen, determined to end Crowley's reign of horror once and for all.",
    "2010_382": "A rookie Yorkshire journalist sets out to solve the case of a child murderer.",
    "2010_383": "The Cremaster Cycle is a series of five feature-length films, together with related sculptures, photographs, drawings, and artist's books, created by American visual artist and filmmaker Matthew Barney.",
    "2010_384": "A searing portrait of war and prejudice, 'Only the Brave' takes you on a haunting journey into the hearts and minds of the forgotten heroes of WWII - the Japanese-American 100th/442nd. In 1941, when Japan attacked Pearl Harbor, overnight ...See moreA searing portrait of war and prejudice, 'Only the Brave' takes you on a haunting journey into the hearts and minds of the forgotten heroes of WWII - the Japanese-American 100th/442nd. In 1941, when Japan attacked Pearl Harbor, overnight Japanese Americans were put into internment camps for the duration of the war. Determined to prove their loyalty, 1400 Japanese Americans successfully petitioned the government to serve becoming the 100th Infantry Battalion. They were sent to North Africa, Italy and finally France were they performed an impossibly-dangerous rescue of the Texas 36th Division. During their two years of combat these men received an unparalleled 21 Medals of Honor, 9,486 Purple Hearts, 8 Presidential Citations, 53 Distinguished Service Crosses, 588 Silver Stars and 5,200 Bronze stars - making them the most decorated unit of their size in American military history. This is their story.  Written by Randolph KretSee less",
    "2010_386": "A photographer is asked by hotel owners to take portraits of their recently deceased daughter.",
    "2010_387": "On an island off the coast of North America, local residents simultaneously fight a zombie epidemic while hoping for a cure to return their un-dead relatives back to their human state.",
    "2010_388": "A Groundbreaking interactive DVD that plays like a video version of the \"Choose Your Own Adventure Books\" as the story follows 21 Year old Eric (the character whom the audience makes choices for) as he deals with a skull crunching breakup....See moreA Groundbreaking interactive DVD that plays like a video version of the \"Choose Your Own Adventure Books\" as the story follows 21 Year old Eric (the character whom the audience makes choices for) as he deals with a skull crunching breakup. Eric is a struggling musician who works a side job and just broke up with the greatest love of his life, the somewhat insane yet adorable Liz. Now you, the viewer, must guide Eric through one insane evening with Criminals, Drugs and Damsels while deciding whether Eric will win back the love of his life or crumble into Moral Decay... his fate is now in your hands. The Weathered Underground allows the viewer via remote control or mouse (online) to control the story ultimately choosing a story of redemption or debauchery. Featuring over 30 different endings and 1,000 choices.  Written by Randolph KretSee less",
    "2010_389": "A drama centered around a married couple who opened the first legal brothel in Nevada.",
    "2010_39": "After experiencing what they think are a series of \"break-ins\", a family sets up security cameras around their home, only to realize that the events unfolding before them are more sinister than they seem.",
    "2010_390": "Stuck in her boring factory town, twenty-three-year-old Marina is at the mercy of both her father's impending death and her distaste for other humans.",
    "2010_391": "Three angels bestow the gift of song to a young girl, who must follow a series of rules in order hold on to it during her rise to fame and fortune.",
    "2010_392": "Clemente, a moneylender of few words, is a new hope for Sofía, his single neighbor, devoted to the October worship of Our Lord of the Miracles. They're brought together over a new-born baby, fruit of Clemente's relationship with a ...See moreClemente, a moneylender of few words, is a new hope for Sofía, his single neighbor, devoted to the October worship of Our Lord of the Miracles. They're brought together over a new-born baby, fruit of Clemente's relationship with a prostitute who's nowhere to be found. While Clemente is looking for the girl's mother, Sofía cares for the baby and looks after the moneylender's house. With the arrival of these beings in his life, Clemente has the opportunity to reconsider his emotional relations with people.  Written by AnonymousSee less",
    "2010_393": "This film tells the story of the massive police raid of Stonewall in June 1969.",
    "2010_394": "Kinshasa, DRCongo, 2005: Benda Bilili, poor paraplegic street musicians, get noticed by a French film team. Studio recordings get their music out on album and 2009, they have concerts in Europe.",
    "2010_395": "Portrayal of the late Bradford playwright Andrea Dunbar.",
    "2010_396": "In Medieval Japan, an elderly warlord retires, handing over his empire to his three sons. However, he vastly underestimates how the new-found power will corrupt them and cause them to turn on each other...and him.",
    "2010_397": "The passengers on a Mediterranean cruise enjoy their luxuries as a small family struggles with overbearing media attention.",
    "2010_398": "When a fatal kidnapping ignites a firestorm of suspicion and rage in idyllic 1933 San Jose, California, a hard-nosed young reporter takes on the powers-that-be to prevent the lynching of two men he believes are innocent. Read more: Synopsis",
    "2010_399": "A documentary on Celine Dion's 2008-2009 Taking Chances world tour.",
    "2010_4": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.",
    "2010_40": "A group of Iraq War veterans look to clear their name with the U.S. Military, who suspect the four men of committing a crime for which they were framed.",
    "2010_400": "This inspirational documentary follows four deaf entertainers: a comic, drummer, actor and a singer as they attempt to cross over to mainstream audiences. These uniquely talented entertainers overcome great challenges to celebrate success.",
    "2010_401": "A collection of documentaries that explores the hidden side of human nature through the use of the science of economics.",
    "2010_402": "The true story about a father struggling to make amends with his twin sons as they pursue their dreams of professional baseball.",
    "2010_403": "After a vicious attack leaves him brain-damaged and broke, Mark Hogancamp seeks recovery in \"Marwencol\", a 1/6th scale World War II-era town he creates in his backyard.",
    "2010_404": "An ex-gambler is lured back into the game by a veteran insurance-fraud investigator.",
    "2010_405": "A look at the making of the film Troll 2 and its journey from being crowned the \"worst film of all time\" to a cherished cult classic.",
    "2010_406": "A drama based on a true story, in which a black Vietnam-era veteran is allegedly murdered by a local white businessman, who is later exonerated. The plot focuses on the role of a local high school teacher, and the civil unrest that followed the acquittal.",
    "2010_407": "Shruti and Bittoo become partners in their very own \"Wedding planning ka bijness\" in Delhi and in the process discover friendship, love and one another.",
    "2010_408": "Follows the journey of Joe Peterson, a burned out children's book writer who's approaching a midlife crisis.",
    "2010_409": "Calm and quiet Daniel starts on Wall Street. His womanizing colleague, Tommy, encourages him to meet women. He unknowingly meets Tommy's girlfriend, Beth, and ends up in her 5 women book club. Will he find the woman?",
    "2010_41": "Johnny Knoxville and company return for the third installment of their TV show spin-off, where dangerous stunts and explicit public displays rule.",
    "2010_410": "A scorching indictment of the Mormon Church's historic involvement in the promotion & passage of California's Proposition 8 and the Mormon religion's secretive, decades-long campaign against LGBT human rights.",
    "2010_411": "A riveting documentary of the recently assassinated Benazir Bhutto, a polarizing figure in the Muslim world. Following in her father's footsteps as a pillar for democracy, Bhutto was expected to dominate Pakistan's 2008 elections but the ...See moreA riveting documentary of the recently assassinated Benazir Bhutto, a polarizing figure in the Muslim world. Following in her father's footsteps as a pillar for democracy, Bhutto was expected to dominate Pakistan's 2008 elections but the assassination sent Pakistan politics into turmoil. This major event sent shock waves throughout the world and transformed her from political messiah into a martyr for the common man.  Written by AnonymousSee less",
    "2010_412": "According to the legend of the Shangaan, white lions are the messengers of the gods, but it has been years since one has been seen in their remote African valley. When a white lion is miraculously born into that valley, a young Shangaan ...See moreAccording to the legend of the Shangaan, white lions are the messengers of the gods, but it has been years since one has been seen in their remote African valley. When a white lion is miraculously born into that valley, a young Shangaan named Gisani, finds himself destined to protect this rare and magnificent creature at all costs. This young lion, whom will be known as Letsatsi, is cast from his pride and forced to embark upon a perilous journey of survival. Close to starvation, Letsatsi befriends Nkulu, an older lion and together they learn how to survive in the harsh African wilderness. Gisani, who is watching over Letsatsi, takes a job as a tracker with a local hunter, who has his sights set on leading the hunt for this rare and magnificent white lion. Gisani, guided by fate, believes that he must find a way to prevent this tragedy from happening. When Nkulu is killed by a farmer, Letsatsi is forced once again to survive on his own. After many trials and tribulations he finally learns to hunt by himself and grows into a magnificent adult. But before he can take over a pride of his own, Letsatsi and Gisani must face their greatest challenge - the trophy hunter- for whom legends are worthless and rare skins priceless.See less",
    "2010_413": "Homer Hobbs, home after two years in jail, discovers that life on the outside can be crueler than the back-breaking injustice of the chain gang. He returns to a bleak urban town caught in the depths of the Great Depression - no jobs, no ...See moreHomer Hobbs, home after two years in jail, discovers that life on the outside can be crueler than the back-breaking injustice of the chain gang. He returns to a bleak urban town caught in the depths of the Great Depression - no jobs, no prospects, no hope - where he is thrown together with four strangers, each struggling to survive as they scratch and scheme to dig their way out of poverty. Life is grim. But on Sunday nights, in a dingy hall in a forlorn neighborhood, the men of the ghetto piece together the finest attire their meager lives can beg, borrow or steal to compete in an underground contest like no other. The big winner will go home with the five dollar prize. The real prize - far less tangible, yet priceless - is the chance to feel like a king, if just for an evening. To men like these, the touch of a woman, the adulation of the crowd, the feel of a fine-looking suit are proof enough that a man might yet escape the debasement of the ghetto. And only one can emerge - King of the Evening.  Written by Robert Page JonesSee less",
    "2010_414": "Two kids, Dylan and Kylie, run away from home at Christmas and spend a night of magic and terror on the streets of inner-city Dublin. Read more: Synopsis",
    "2010_415": "Every Friday night Shirley invites another \"perfect\" woman for Shabbat dinner in hopes that her son, Nelson, will marry a nice Jewish girl. Nelson, however, has something to tell them...he's gay.",
    "2010_416": "A recently paroled ex-con who has trouble adjusting to the wacky normalcy of life outside of prison. He has spent the last three years behind bars after getting caught committing a crime and taking the rap for his much more dangerous pal.",
    "2010_417": "American public schools have been growing progressively worse. According to the U.S. Department of Education national testing, only 35% of American high school seniors are proficient in reading, based on 2006 data. And fewer than ...See moreAmerican public schools have been growing progressively worse. According to the U.S. Department of Education national testing, only 35% of American high school seniors are proficient in reading, based on 2006 data. And fewer than one-in-four, 23%, are proficient in math. On the global stage, America ranks last in educational effectiveness among large industrialized countries despite the highest spending per student in the world. It presents a conundrum: How has the richest and most innovative society on earth suddenly lost the ability to teach its children at a level that other modern countries consider \"basic\"? If the problem is that we're not spending enough on schools, which many people believe, it's instructive to study the U.S. state that spends more than any other per student: New Jersey With spending as high as $483,000 per classroom (confirmed by NJ Education Department records for 2005-06), New Jersey students fare only slightly better than the national average in reading and math, and rank 37th in average SAT scores. And not even half of NJ's high school freshmen, despite the state's enormous \"investment,\" are academically ready for college four years later. The fact is much of the public considers teacher salaries and overall education budgets to be the same thing -- if you're for raising one, you must be for raising the other. But as the film shows, in many cases 80-90% of the spending goes somewhere besides teacher salaries. In fact billions of dollars, as confirmed by independent audits, are wasted. \"The Cartel\" investigates what is causing this vast underachievement and what can be done to turn things around.  Written by AnonymousSee less",
    "2010_418": "The story of the Disney Renaissance, an incredibly prolific, successful and prestigious decade lasting from 1984 to 1994 that saw the fallen Walt Disney Animation Studios' unexpected progressive triumphant return to excellence. Read more: Synopsis",
    "2010_419": "The Khmer Rouge slaughtered nearly two million people in the late 1970s. Yet the Killing Fields of Cambodia remain unexplained. Until now. Enter Thet Sambath, an unassuming, yet cunning, investigative journalist who spends a decade of his ...See moreThe Khmer Rouge slaughtered nearly two million people in the late 1970s. Yet the Killing Fields of Cambodia remain unexplained. Until now. Enter Thet Sambath, an unassuming, yet cunning, investigative journalist who spends a decade of his life gaining the trust of the men and women who perpetrated the massacres. From the foot soldiers who slit the throats to Pol Pot's right-hand man Nuon Chea, the notorious Brother Number Two, Sambath records shocking testimony never before seen or heard. Having neglected his own family for years, Sambath's work comes at a price. But his is a personal mission. He lost his parents and his siblings in the Killing Fields. Amidst his journey to discover why his family died, we come to understand for the first time the real story of Cambodia's tragedy.  Written by Sundance Film FestivalSee less",
    "2010_42": "Two mismatched New York City detectives seize an opportunity to step up like the city's top cops, whom they idolize, only things don't quite go as planned.",
    "2010_420": "A couple goes to dangerous lengths to find a lung donor for their daughter. Read more: Synopsis",
    "2010_421": "A young New York couple intricately strategize their own break up.",
    "2010_422": "In 1976, complex political and emotional forces are set in motion when a young man returns to the race-torn Philadelphia neighborhood where he came of age during the Black Power movement.",
    "2010_423": "The aspirant nun Celine van Hadewijch is invited to leave the convent where she studies and she returns to the house of her parents in Paris. Celine meets her outcast Muslim teenage friend Yassine Chikh in a cafe and they hang around ...See moreThe aspirant nun Celine van Hadewijch is invited to leave the convent where she studies and she returns to the house of her parents in Paris. Celine meets her outcast Muslim teenage friend Yassine Chikh in a cafe and they hang around together. Celine tells that he is only her friend since she is committed with God and will stay virgin since her body belongs to God. Yassine introduces Celine to his older brother and religious leader Nassir Chikh and he invites the teenage girl to participate in his religious seminars. However, Nassir is actually a terrorist and the confused Celine is the perfect tool for his cell.  Written by Claudio Carvalho, Rio de Janeiro, BrazilSee less",
    "2010_424": "Filmmaker Kimberly Reed returns home for her high school reunion, ready to reintroduce herself to the small town as a transgender woman and hoping for reconciliation with her long estranged adopted brother Marc. Things are complicated by ...See moreFilmmaker Kimberly Reed returns home for her high school reunion, ready to reintroduce herself to the small town as a transgender woman and hoping for reconciliation with her long estranged adopted brother Marc. Things are complicated by the shocking revelation that Marc may be the grandson of Orson Wells and Rita Hayworth, forcing Kim and her family to explore questions of sexual orientation, identity, severe trauma and love.  Written by AnonymousSee less",
    "2010_425": "The true story of 17-year-old Sicilian Rita Atria (Veronica D'Agostino) -- who broke the Sicilian Mafia's code of silence and testified against the \"family business\" after both her father and then her brother are both murdered -- is ...See moreThe true story of 17-year-old Sicilian Rita Atria (Veronica D'Agostino) -- who broke the Sicilian Mafia's code of silence and testified against the \"family business\" after both her father and then her brother are both murdered -- is brought to vivid life in Marco Amenta's hard-hitting and wonderfully acted drama.  Written by AnonymousSee less",
    "2010_426": "Julian Marsh is an out of work ladies' man who lands a job directing a bizarre adaptation of Hamlet. After casting his best friend and his ex-girlfriend in the show, Julian finds himself in the middle of a two thousand year old conspiracy ...See moreJulian Marsh is an out of work ladies' man who lands a job directing a bizarre adaptation of Hamlet. After casting his best friend and his ex-girlfriend in the show, Julian finds himself in the middle of a two thousand year old conspiracy that explains the connection between Shakespeare, the Holy Grail and some seriously sexy vampires. It turns out that the play was actually written by a master vampire name Theo Horace and it's up to Julian to recover the Grail in order to reverse the vampire's curse...If only being undead wasn't so much God-damned fun!  Written by Mike LandrySee less",
    "2010_427": "The film bears witness to German artist Anselm Kiefer's alchemical creative processes and renders in film, as a cinematic journey, the personal universe he has built at his hill-studio estate in the South of France.See moreThe film bears witness to German artist Anselm Kiefer's alchemical creative processes and renders in film, as a cinematic journey, the personal universe he has built at his hill-studio estate in the South of France.  Written by Sophie FiennesSee less",
    "2010_428": "At a Catholic high school, a sophomore newspaper reporter investigates a case of stolen SAT exams. He thinks he's nailed the suspect and managed to get the popular girl when he realises a larger conspiracy is afoot.",
    "2010_429": "Songwriter Stephin Merritt is known as \"the Cole Porter of his generation\" for his memorable melodies, lovelorn lyrics and wry musical stylings. Shot over a period of 10 years, \"Strange Powers: Stephin Merritt and the Magnetic Fields\" ...See moreSongwriter Stephin Merritt is known as \"the Cole Porter of his generation\" for his memorable melodies, lovelorn lyrics and wry musical stylings. Shot over a period of 10 years, \"Strange Powers: Stephin Merritt and the Magnetic Fields\" explores his friendship with his longtime bandmate and manager Claudia Gonson. Through his recording and songwriting process, the film traces a 20-year career that has yielded one of the most engaging bodies of work in the contemporary American songbook.  Written by Kerthy Fix, co-directorSee less",
    "2010_43": "With an unmanned, half-mile-long freight train barreling toward a city, a veteran engineer and a young conductor race against the clock to prevent a catastrophe.",
    "2010_430": "Follows a Palestinian leader who unites Fatah, Hamas and Israelis in an unarmed movement to save his village from destruction. Success eludes them until his 15-year-old daughter jumps into the fray. Read more: Synopsis",
    "2010_431": "2012: Time For Change is a documentary feature that presents ways to transform our unsustainable society into a regenerative planetary culture. This can be achieved through a personal and global change of consciousness and the systemic ...See more2012: Time For Change is a documentary feature that presents ways to transform our unsustainable society into a regenerative planetary culture. This can be achieved through a personal and global change of consciousness and the systemic implementation of ecological design.  Written by AnonymousSee less",
    "2010_432": "A young woman returns to her hometown of Turin to set up a new fashion salon and gets involved with a troubled woman and her three wealthy friends.",
    "2010_433": "Fifty years after the fall of his country, can the Dalai Lama make a breakthrough in his efforts to find a solution to the Tibet question?",
    "2010_434": "The film explores the image of the Romanian dictator Nicolae Ceausescu using unknown official footage from the Romanian National Television and National Film Archives.",
    "2010_435": "On a trip to Angkor Wat in Siem Reap, Cambodia in January 2000, filmmaker Anne Bass came across a 16 year old boy who moved her immensely with his amazing and seemingly natural charms and grace as a dancer. Having been a longtime devotee ...See moreOn a trip to Angkor Wat in Siem Reap, Cambodia in January 2000, filmmaker Anne Bass came across a 16 year old boy who moved her immensely with his amazing and seemingly natural charms and grace as a dancer. Having been a longtime devotee to the world of dance herself back in the United States, Anne felt compelled to give this young boy the opportunity to leave his home and follow a dream that she felt he hadn't even yet seen for himself. From the serene countryside of Southeast Asia to the halls of the New York's School of American Ballet to the stage of the Pacific Northwest Ballet in Seattle, DANCING ACROSS BORDERS peeks behind the scenes into the world of dance and chronicles the intimate and triumphant story of a boy who was discovered, and who only much later discovered all that he had in himself.  Written by AnonymousSee less",
    "2010_436": "A feature documentary following three young racers as they compete in the World Karting Association's National Pavement Series. Clocking speeds up to 70 mph, these kids chase the National Championship title and take one step closer toward ...See moreA feature documentary following three young racers as they compete in the World Karting Association's National Pavement Series. Clocking speeds up to 70 mph, these kids chase the National Championship title and take one step closer toward their dream of someday racing in the big show... NASCAR.  Written by AnonymousSee less",
    "2010_437": "Four youngsters grow rich together with a big idea in 90's middle-class Bombay. All is hunky dory till they are forced to shut shop until a plan comes up.",
    "2010_438": "A documentary that takes an alternative approach to dealing with the global warming crisis.",
    "2010_439": "A wounded man searches for his sweetheart in the Mexican desert while on the run from the police, bounty hunters, and others.",
    "2010_44": "A tight-knit group of New York City street dancers find themselves pitted against the world's best hip hop dancers in a high-stakes showdown.",
    "2010_440": "After Queen Elizabeth I commands him not to grow old, a young nobleman struggles with love and his place in the world.",
    "2010_441": "Seeking revenge for the murder of their religious leader, fundamental loyalists kidnap and torture the man they believe responsible, but the ensuing clash of right vs. left ideologies quickly reveals that they may have the wrong man, which...See moreSeeking revenge for the murder of their religious leader, fundamental loyalists kidnap and torture the man they believe responsible, but the ensuing clash of right vs. left ideologies quickly reveals that they may have the wrong man, which puts them on a path toward a shocking twist.  Written by AGADSee less",
    "2010_442": "Filmmaker Roger Nygard roams the globe to the source of each of the world's philosophies, religions, and belief systems. He interviews spiritual leaders, scholars, scientists, artists, pizza chefs, and others who have influenced, inspired,...See moreFilmmaker Roger Nygard roams the globe to the source of each of the world's philosophies, religions, and belief systems. He interviews spiritual leaders, scholars, scientists, artists, pizza chefs, and others who have influenced, inspired, or freaked out humanity.  Written by AnonymousSee less",
    "2010_443": "Four children enter a high-stakes lottery. If they win, they can attend one of the best schools in New York. A look at the crisis in public education, The Lottery makes the case than any child can succeed.",
    "2010_444": "After the sudden death of his estranged son in rural Japan, an American man must go there to claim some important family items. While there, he discovers some secrets his son left behind.",
    "2010_445": "Though almost forgotten today, Veit Harlan was one of Nazi Germany's most notorious filmmakers. His most perfidious film was the treacherous anti-Semitic propaganda film Jud Süß - required viewing for all SS members. An unrepentant and ...See moreThough almost forgotten today, Veit Harlan was one of Nazi Germany's most notorious filmmakers. His most perfidious film was the treacherous anti-Semitic propaganda film Jud Süß - required viewing for all SS members. An unrepentant and blindly obsessive craftsman, no figure - save for Leni Riefenstahl - is as closely associated with the cinema of the Holocaust years. (Harlan's epic Burning Hearts was the basis for Inglourious Basterds's pivotal film-within-a-film Stolz Der Nation.) This documentary is an eye-opening examination of World War II film history as well as the story of a German family from the Third Reich to the present; one that is marked by reckoning, denial and liberation.  Written by Zeitgeist Films and Jeffrey Prawdiuk-SpurrSee less",
    "2010_446": "Professional killer, Frank Ng, contracted to murder a Chinese crime lord, discovers the crime boss is a Chinese vampire. Frank strikes out in a final battle against the Kiang-Shi and his minions of the dark.",
    "2010_447": "One night Mia has a premonition. So after saying a few words of parting at her mother's grave, she sets out on a journey across mountains and jungles to search for her father, who is trapped in a landslide at a remote construction site.",
    "2010_448": "Realizing the urban legend of their youth has actually come true; two filmmakers delve into the mystery surrounding five missing children and the real-life boogeyman linked to their disappearances. Read more: Synopsis",
    "2010_449": "BREATH MADE VISIBLE is the first feature length film about the life and career of Anna Halprin, the American dance pioneer who has helped redefine our notion of modern art with her belief in dance's power to teach, heal, and transform at ...See moreBREATH MADE VISIBLE is the first feature length film about the life and career of Anna Halprin, the American dance pioneer who has helped redefine our notion of modern art with her belief in dance's power to teach, heal, and transform at all ages of life. This cinematic portrait blends recent interviews with counterparts such as the late Merce Cunningham, archival footage, including her establishment of the first multiracial dance company in the U.S., and excerpts of current performances such as \"Parades and Changes\" at the Georges Pompidou Center in Paris, to weave a stunning, inspiring account of one of the most important cultural icons in modern dance.  Written by ZAS Film AGSee less",
    "2010_45": "A post-apocalyptic tale, in which a lone man fights his way across America in order to protect a sacred book that holds the secrets to saving humankind.",
    "2010_450": "In two interconnected stories Robert, a jaded middle-aged New Yorker, goes to Serbia to make quick cash by marrying someone for U.S. immigration papers. The plan goes awry when the promised cash never arrives. At the same time, a young ...See moreIn two interconnected stories Robert, a jaded middle-aged New Yorker, goes to Serbia to make quick cash by marrying someone for U.S. immigration papers. The plan goes awry when the promised cash never arrives. At the same time, a young Serbian immigrant named Branko struggles in a never forgiving New York, desperately trying to bring his girlfriend from Serbia to the USA.  Written by AnonymousSee less",
    "2010_451": "The story of a band of brothers who travel the world in search of the answers to the burning questions: Who am I? Who is Man? Why do we search for meaning? Their journey brings them into the middle of the lives of the homeless on the ...See moreThe story of a band of brothers who travel the world in search of the answers to the burning questions: Who am I? Who is Man? Why do we search for meaning? Their journey brings them into the middle of the lives of the homeless on the streets of New York City, the orphans and disabled children of Peru, and the abandoned lepers in the forests of Ghana, Africa. What the young men discover changes them forever. Through one on one interviews and real life encounters, the brothers are awakened to the beauty of the human person and the resilience of the human spirit.  Written by Simon FungSee less",
    "2010_452": "Henri-Georges Clouzot's unfinished masterpiece, Inferno, is reconstructed in this film which is part drama and part documentary.",
    "2010_453": "An exploration of the fracking petroleum extraction industry and the serious environmental consequences involved.",
    "2010_454": "In a mythical land, a man and a young boy investigate a series of unusual occurrences.",
    "2010_455": "A comedy of manners set against the backdrop of contemporary London and the international art scene.",
    "2010_456": "An examination of sexual relationships, in which three protagonists interact in different combinations. Read more: Synopsis",
    "2010_457": "A man meets up with two \"good guys\" to recover what is unlawfully his, taking them on his whirlwind ride, doing things they never would have imagined, just to survive.",
    "2010_458": "William S. Burroughs: featuring never before seen footage as well as exclusive interviews with his closest friends and colleagues. Born the heir of the Burroughs' adding machine estate, he struggled throughout his life with addiction, ...See moreWilliam S. Burroughs: featuring never before seen footage as well as exclusive interviews with his closest friends and colleagues. Born the heir of the Burroughs' adding machine estate, he struggled throughout his life with addiction, control systems, and self. He was forced to deal with the tragedy of killing his wife and the repercussions of neglecting his son. His novel, Naked Lunch, was one of the last books to be banned by the U.S. government. Allen Ginsberg and Norman Mailer testified on behalf of the book. The courts eventually overturned their decision in 1966, ruling that the book had an important social value. It remains one of the most recognized literary works of the 20th century. William Burroughs was one of the first to cross the dangerous boundaries of queer and drug culture in the 1950s, and write about his experiences. Eventually he was hailed the godfather of the beat generation and influenced artists for generations to come. However, his friends were left wondering, did William ever find happiness? This extremely personal documentary breaks the surface of the troubled and brilliant world of one of the greatest authors of all time. \"William S. Burroughs: A Man Within\" is the first and only posthumous documentary about this legendary figure.  Written by Yony LeyserSee less",
    "2010_459": "Arthur Poppington, a regular man who adopts a superhero persona, known as \"Defendor\", combs the city streets at night, in search of his archenemy, Captain Industry.",
    "2010_46": "A longtime thief, planning his next job, tries to balance his feelings for a bank manager connected to an earlier heist, and a hell-bent F.B.I Agent looking to bring him and his crew down.",
    "2010_460": "Tells the story of two men whose fateful encounter in 1996 set them on a course of events that led them to Afghanistan, Osama bin Laden, 9/11, Guantanamo, and the U.S. Supreme Court.",
    "2010_461": "At the time of this film, the Bowery was a neighborhood in New York City populated largely by the down and out, and largely by transients. Those that can work generally can only find short term employment on a day to day basis, their daily...See moreAt the time of this film, the Bowery was a neighborhood in New York City populated largely by the down and out, and largely by transients. Those that can work generally can only find short term employment on a day to day basis, their daily earnings which primarily go into booze. Those that can't or won't work generally sponge off whoever they can, especially for that next drink. New to the neighborhood is Ray, who most recently had been working the rails in New Jersey. He is one of those who can and still does work, but like the others spends what little money he has on booze, which means he usually sleeps on the streets in a drunken stupor. The only person he would probably consider a friend in the neighborhood is the elderly Gorman, who in turn takes advantage of his new friend at whatever opportunity. When he's sober, Ray understands that alcohol is ruining his life, and as such states that he will try to stop drinking. The questions become whether Ray has either the will or the support necessary to fulfill this goal, or whether he is destined to become another Gorman and the legions like Gorman in the Bowery.  Written by HuggoSee less",
    "2010_462": "Terkel is an average teenager whose life takes a turn for the worse when a girl who had a crush on him kills herself and an unknown maniac starts stalking him.",
    "2010_463": "German biopic loosely based on the World War I fighter ace Manfred Von Richthofen, nicknamed the Red Baron by friend and foe alike.",
    "2010_464": "An adaptation of the classic tale of a wealthy aristocrat with a blue beard.",
    "2010_465": "",
    "2010_466": "This is the true account of one of the most surprising and remarkable love stories in the history of New York. It begins in 1993, when a young man from Belgium looking to change his life has an unexpected encounter in Central Park. He ...See moreThis is the true account of one of the most surprising and remarkable love stories in the history of New York. It begins in 1993, when a young man from Belgium looking to change his life has an unexpected encounter in Central Park. He meets a hawk. Not just any hawk, but a wild Redtail, a fierce predator that has not lived in the City for almost a hundred years. Compelled to follow this extraordinary creature, he buys a video camera and sets out to track the hawk. Little does he know that the journey will take him almost twenty years and lead him down many trails of life, death, birth, hope, and redemption. Affectionately known to New Yorkers as Pale Male, the hawk becomes a magnificent obsession and a metaphor for triumph against all odds. His nest, perched on a posh 5th Avenue co-op, starts out as a novel curiosity to a handful of avid birdwatchers but becomes an international tourist destination - a place of pilgrimage. Then, on a December afternoon without warning, in the space of half an hour, the building dismantles Pale Male's beloved nest. In a wingbeat, media from around the world assemble on 5th Avenue to cover the unprecedented protest. Gathering behind Pale Male is an army of birdwatchers, movie stars, poets, children, dogs, and late night comedy show hosts. What unfolds next, as they say, could only happen in New York.  Written by Balcony ReleasingSee less",
    "2010_467": "An Ivy League freshman gets an unexpected education when he falls for an older woman and her 14 year-old daughter develops a crush on him.",
    "2010_468": "After connecting with the shy Madeline, a jazz trumpeter embarks on a quest for a more gregarious paramour, but through a series of twists and turns punctuated by an original score, the two lovers seem destined to be together.",
    "2010_469": "A father juggling his kids with the rest of his responsibilities is ultimately faced with the choice of being their father or their friend.",
    "2010_47": "In New York City, a case of mistaken identity turns a bored married couple's attempt at a glamorous and romantic evening into something more thrilling and dangerous.",
    "2010_470": "A documentary on the remarkable life of Ruth Gruber. At 97 years old, Brooklyn-born Ruth still has that same sharp intellect and moxie that propelled her to become the world's youngest PhD at age 20. At age 24, she became a New York Herald...See moreA documentary on the remarkable life of Ruth Gruber. At 97 years old, Brooklyn-born Ruth still has that same sharp intellect and moxie that propelled her to become the world's youngest PhD at age 20. At age 24, she became a New York Herald Tribune reporter and photographer and the same year was the first journalist to enter the Soviet Arctic. A trusted member of the Roosevelt Administration during WWII, she was given a dangerous secret mission. A feminist before feminism, Ruth was never just an observer, she was a participant in the making of history. Ruth covered the turbulent Middle East throughout the 1940's, and the film combines verite footage of Ruth traveling back to Israel, with interviews and archival material.  Written by AnonymousSee less",
    "2010_471": "A San Francisco spoken word artist returns to New Mexico to be with his dying father, only to find he loses his \"voice\" as he is sucked back in to the dysfunctional life of drugs and violence he left behind.",
    "2010_472": "Explores the world of a boxing gym in Austin, Texas, dwelling on the discipline of training as people from all walks of life aspire to reach their personal best. Read more: Synopsis",
    "2010_473": "Adam Buckley finds himself in the middle of a convenience store robbery during his last night as a pledge for a college fraternity. When the initiation ritual goes horribly wrong, and every move proves disastrous, Adam is forced to ...See moreAdam Buckley finds himself in the middle of a convenience store robbery during his last night as a pledge for a college fraternity. When the initiation ritual goes horribly wrong, and every move proves disastrous, Adam is forced to confront a new challenge all together, and he has to take a stand.  Written by AnonymousSee less",
    "2010_474": "Untangling the web of cultural and historical ties underlying Japan's deep fascination with insects.",
    "2010_475": "In the war-zones of Liberia and Congo, four volunteers with Doctors Without Borders struggle to provide emergency medical care under extreme conditions.",
    "2010_476": "The film follows adventurer Jeff Johnson as he retraces the epic 1968 journey of his heroes Yvon Chouinard and Doug Tompkins to Patagonia.",
    "2010_477": "The life and work of the enigmatic folk rock singer-songwriter.",
    "2010_478": "A murder mystery set in contemporary Shanghai about a beautiful woman caught in a web of vengeance and deceit.",
    "2010_479": "A sleepwalking, sexaholic masseur wakes up, covered in blood next to a bloody knife, when cops ring the doorbell.",
    "2010_48": "The Clock family are four-inch-tall people who live anonymously in another family's residence, borrowing simple items to make their home. Life changes for the Clocks when their teenage daughter, Arrietty, is discovered.",
    "2010_480": "Wavy Gravy is known as the MC of the Woodstock festival, a hippie icon, activist, clown, and even a Ben & Jerry's ice cream flavor. In SAINT MISBEHAVIN' we meet a true servant to humanity who carries his message through humor, compassion ...See moreWavy Gravy is known as the MC of the Woodstock festival, a hippie icon, activist, clown, and even a Ben & Jerry's ice cream flavor. In SAINT MISBEHAVIN' we meet a true servant to humanity who carries his message through humor, compassion and a song he wrote called \"Basic Human Needs\". SAINT MISBEHAVIN' weaves together intimate verite footage, reflections from an array of cultural and counter-cultural peers, and a rich collection of never-before-seen archival footage to tell a story that is bigger than the man himself.  Written by AnonymousSee less",
    "2010_481": "A 315-pound man decides to kick his food addiction by moving to the country.",
    "2010_482": "NYC, 1979: Gabriel and Annie's marriage is falling apart with only their daughter holding it together. Gabriel quits his architect job to become a playwright, writing about his life. Annie and Liz leave.",
    "2010_483": "Jean-Luc Godard and François Truffaut, their careers, their friendship and their impact on the French New Wave of the 1960s.",
    "2010_484": "A documentary on a 40-year-old orangutan that is locked behind bars.",
    "2010_485": "October Country is a beautifully filmed portrait of an American family struggling for stability while haunted by the ghosts of war, teen pregnancy, foster care and child abuse. With rarely seen intimacy, sensitivity and respect, this ...See moreOctober Country is a beautifully filmed portrait of an American family struggling for stability while haunted by the ghosts of war, teen pregnancy, foster care and child abuse. With rarely seen intimacy, sensitivity and respect, this vibrant documentary examines the forces that unsettle the working poor and the violence that lurks beneath the surface of American life.  Written by Palmieri, Michael (II)See less",
    "2010_486": "On a summer break from college, a young epileptic woman struggles to balance her feelings for her fledgling boyfriend while her friend Al crashes with her for the season.",
    "2010_487": "There are still efficient ways to produce healthy fresh organic food in a time where most food is being mass produced by corporations in less than hygienic ways. Country farmers and urban farmers explain.",
    "2010_488": "An impressive number of veteran strippers are interviewed here, offering their memories. Also on hand are Lou Costello's daughter, and Alan Alda. He's introduced here as \"son of Robert Alda\", and only later is it established that the ...See moreAn impressive number of veteran strippers are interviewed here, offering their memories. Also on hand are Lou Costello's daughter, and Alan Alda. He's introduced here as \"son of Robert Alda\", and only later is it established that the senior Alda was a small-time burlesque comedian and singer. I wish that this documentary had mentioned that Robert Alda later had a more prestigious career in Hollywood films and Broadway musicals. Alan Alda offers some candid memories of his childhood as the son of a burlesque performer.  Written by AnonymousBSee less",
    "2010_489": "Not far from the White House, the Capitol, and the National Mall lies a part of Washington, DC that the tourists never see and the mainstream media virtually ignores. At least three percent of DC is HIV positive, a staggering rate higher ...See moreNot far from the White House, the Capitol, and the National Mall lies a part of Washington, DC that the tourists never see and the mainstream media virtually ignores. At least three percent of DC is HIV positive, a staggering rate higher than parts of Africa. Behind all the stories of heartbreak, loss, and struggle there are also the incredible, encouraging stories of the people behind grassroots movements to extend education, combat stigmas, and spread hope.  Written by Tribeca Film FestivalSee less",
    "2010_49": "When a young owl is abducted by an evil Owl army, he must escape with new-found friends and seek the legendary Guardians to stop the menace.",
    "2010_490": "Two sisters return home to deal with their ailing father, only to face some surprising situations.",
    "2010_491": "A look at the inner world of modeling.",
    "2010_492": "A young American writer completes his service in WWI and travels across Europe with his wife and her attractive Italian girlfriend. Based on the novel by Ernest Hemingway.",
    "2010_493": "A look at the art of Spalding Gray who drew from real life experience to create a compelling and deeply personal series of monologues.",
    "2010_494": "A story about two lacrosse teammates from opposite sides of the track.",
    "2010_495": "On the verge of getting married, Sam Nussbaum insists he escort his younger brother, Tom, on a wild goose chase of a journey to find Tom's fifth grade girlfriend.",
    "2010_496": "A big city crime lord has been betrayed by four associates. With only hours until his immanent arrest, he calls in his deadliest cleaner to track down those responsible and get revenge. Will these four criminals, with interwoven pasts, be ...See moreA big city crime lord has been betrayed by four associates. With only hours until his immanent arrest, he calls in his deadliest cleaner to track down those responsible and get revenge. Will these four criminals, with interwoven pasts, be able to survive with their money and their lives as they are hunted down by.. the Korean  Written by Thomas DixonSee less",
    "2010_497": "Director Johan Grimonprez casts Alfred Hitchcock as a paranoid history professor, unwittingly caught up in a double take on the cold war period. Subverting a meticulous array of TV footage and using 'The Birds' as an essential metaphor, ...See moreDirector Johan Grimonprez casts Alfred Hitchcock as a paranoid history professor, unwittingly caught up in a double take on the cold war period. Subverting a meticulous array of TV footage and using 'The Birds' as an essential metaphor, DOUBLE TAKE traces catastrophe culture's relentless assault on the home, from moving images' inception to the present day.  Written by AnonymousSee less",
    "2010_498": "Claude Lanzmann's epic documentary recounts the story of the Holocaust through interviews with witnesses - perpetrators as well as survivors.",
    "2010_499": "After the horrific death of his wife and two sons, suicide seems to be the only escape for a small town attorney, until he's assigned a capital punishment case that begins to transform his life.",
    "2010_5": "Rumpelstiltskin tricks a mid-life crisis burdened Shrek into allowing himself to be erased from existence and cast in a dark alternate timeline where Rumpelstiltskin rules supreme.",
    "2010_50": "Upon his return to his ancestral homeland, an American man is bitten, and subsequently cursed by, a werewolf.",
    "2010_500": "NESHOBA tells the story of a Mississippi town still divided about the meaning of justice, 40 years after the murders of civil rights workers James Chaney, Andrew Goodman and Michael Schwerner. Although Klansmen bragged openly about what ...See moreNESHOBA tells the story of a Mississippi town still divided about the meaning of justice, 40 years after the murders of civil rights workers James Chaney, Andrew Goodman and Michael Schwerner. Although Klansmen bragged openly about what they did in 1964, no one was held accountable until 2005, when the State indicted preacher Edgar Ray Killen, an 80-year-old notorious racist and alleged mastermind of the killings. Through intimate interviews with the families of the victims, candid interviews with black and white Neshoba County Citizens, and exclusive, first time interviews with Killen, the film explores whether healing and reconciliation are possible without telling the unvarnished truth.  Written by MDSee less",
    "2010_501": "The People I've Slept With - a promiscuous woman who finds herself with an unplanned pregnancy and needs to figure out who the baby daddy is...NOW. Angela Yang loves sex. She loves it so much she needs to make baseball cards of her lovers ...See moreThe People I've Slept With - a promiscuous woman who finds herself with an unplanned pregnancy and needs to figure out who the baby daddy is...NOW. Angela Yang loves sex. She loves it so much she needs to make baseball cards of her lovers to help her remember where she's been. She doesn't think twice about her lifestyle until she finds out that she's pregnant. Her gay best friend, Gabriel Lugo tells her to \"take care of it,\" but her conservative sister, Juliet persuades Angela to get married to the baby's father and lead a \"normal\" life like her. Angela listens to her sister, chooses to keep the baby, and goes on a quest to find the identity of the father by any means necessary.  Written by AnonymousSee less",
    "2010_502": "With white Jewish lesbians for parents and two adopted brothers - one mixed-race and one Korean-Brooklyn teen Avery grew up in a unique and loving household. But when her curiosity about her African-American roots grows, she decides to ...See moreWith white Jewish lesbians for parents and two adopted brothers - one mixed-race and one Korean-Brooklyn teen Avery grew up in a unique and loving household. But when her curiosity about her African-American roots grows, she decides to contact her birth mother. This choice propels Avery into her own complicated exploration of race, identity, and family that threatens to distance her from the parents she's always known. She begins staying away from home, starts skipping school, and risks losing her shot at the college track career she had always dreamed of. But when Avery decides to pick up the pieces of her life and make sense of her identity, the results are inspiring. OFF AND RUNNING follows Avery to the brink of adulthood, exploring the strength of family bonds and the lengths people must go to become themselves.  Written by Off and RunningSee less",
    "2010_503": "Great Directors, directed by Angela Ismailos, features conversations with ten of the world's greatest living directors: Bernardo Bertolucci, David Lynch, Liliana Cavani, Stephen Frears, Agnes Varda, Ken Loach, Todd Haynes, Catherine ...See moreGreat Directors, directed by Angela Ismailos, features conversations with ten of the world's greatest living directors: Bernardo Bertolucci, David Lynch, Liliana Cavani, Stephen Frears, Agnes Varda, Ken Loach, Todd Haynes, Catherine Breillat, Richard Linklater and John Sayles. The film documents Ismailos' voyage of discovering the creative personalities behind the camera. She explores the filmmakers' artistic evolution and personal identity, the role of politics and history on their work, and the agony and dilemmas in the creative process. It also examines the challenges of being an artist in an age of commercialism and globalization. The film traces the influence of cinematic movements and iconic directors on these directors' work-from the role of Neo-Realism in Bertolucci's evolution to the influence of Federico Fellini on David Lynch, Ingmar Bergman on Catherine Breillat and Rainer Werner Fassbinder on Todd Haynes.  Written by AnonymousSee less",
    "2010_504": "Michel Gondry chronicles the life of Gondry family matriarch, his aunt Suzette Gondry, and her relationship with her son, Jean-Yves.",
    "2010_505": "Illicit passions pervade an Italian town, where men gather nightly for the cynical \"game of the law.\"",
    "2010_506": "An optimistic (and witty) discovery of what people are already doing, what we as a nation could be doing and what the world needs to do to prevent (or at least slow down) the impending climate crisis.",
    "2010_507": "A young couple decides to give each other a night off, no questions asked.",
    "2010_508": "It's 1983 and Brad Roberts is the best high school quarterback in the country. He dates the sexiest girl in town and is extremely popular, but Brad is not satisfied. He wants to prove that he's more than just a hot-shot quarterback; Brad ...See moreIt's 1983 and Brad Roberts is the best high school quarterback in the country. He dates the sexiest girl in town and is extremely popular, but Brad is not satisfied. He wants to prove that he's more than just a hot-shot quarterback; Brad tries to turn his heavy metal band into the first ever boy band, and they reject him. So Brad, the jock, teams up with a stoner, and an ex-figure skater, and a couple of reject break-dancers from the Bronx to make their mark in this sweet film.  Written by Betsy T.See less",
    "2010_509": "A young doctor is linked to a series of mysterious and brutally executed murders while performing a controversial medical experiment with mysterious origins.",
    "2010_51": "A bounty hunter learns that his next target is his ex-wife, a reporter working on a murder cover-up. Soon after their reunion, the always-at-odds duo find themselves on a run-for-their-lives adventure.",
    "2010_510": "Pablo Escobar was the richest, most powerful drug kingpin in the world, ruling the Medelli­n Cartel with an iron fist. Andres Escobar was the biggest soccer star in Colombia. The two were not related, but their fates were inextricably - ...See morePablo Escobar was the richest, most powerful drug kingpin in the world, ruling the Medelli­n Cartel with an iron fist. Andres Escobar was the biggest soccer star in Colombia. The two were not related, but their fates were inextricably - and fatally - intertwined. Pablo's drug money had turned Andres' national team into South American champions, favored to win the 1994 World Cup in Los Angeles. It was there, in a game against the U.S., that Andres committed one of the most shocking mistakes in soccer history, scoring an \"own goal\" that eliminated his team from the competition and ultimately cost him his life. THE TWO ESCOBARS is a riveting examination of the intersection of sports, crime, and politics. For Colombians, soccer was far more than a game: their entire national identity rode on the success or failure of their team. Jeff and Michael Zimbalist's fast and furious documentary plays out on an ever-expanding canvas, painting a fascinating portrait of Pablo, Andres, and a country in the grips of a violent, escalating civil war.  Written by David Ansen, Los Angeles Film FestivalSee less",
    "2010_511": "A blend of documentary, satire, and narrative filmmaking examines the power dynamic that exists in social, political, and corporate relationships. Read more: Synopsis",
    "2010_512": "Don McKay, a high school janitor who leaves his hometown after a tragedy, returns 25 years later to rekindle a romance with his old flame, who is dying, but this homecoming brings McKay more than he bargained for.",
    "2010_513": "A washed-up writer forms an unlikely friendship with a teenager from Long Island.",
    "2010_514": "An ex-Navy man carrying out the last wish of a dying shipmate renews contact with old friends to break the code of silence around a mysterious, long-buried crime.",
    "2010_515": "A woman tries to distance herself from her gay friends in an effort to land a straight boyfriend. Read more: Synopsis",
    "2010_516": "Being steadily crushed under the weight of debt, unemployment, and increasing isolation, Jim reaches a breaking point. Over a game of solitary Russian roulette he contemplates an unspeakable act of violence as a way of leaving his mark. He...See moreBeing steadily crushed under the weight of debt, unemployment, and increasing isolation, Jim reaches a breaking point. Over a game of solitary Russian roulette he contemplates an unspeakable act of violence as a way of leaving his mark. He is stopped short by a vision of his deceased wife who convinces him that he should instead focus his remaining resources into an act of creation. Armed with his wife's frozen eggs and a new resolve, Jim secures the services of a large biotech firm to help him create an heir who will be engineered to overcome the obstacles of common men. Meanwhile in the distant future Niskaa, the leader of a group of genetically modified beings, controls a race of worker clones in a super-industrialized, post-human Earth. As he tries to restore his decrepit empire he comes face to face with a young clone that shows an unprecedented capacity for reason and empathy. Somehow connected to Jim via dreams, the clone manifests secrets of Nature that Niskaa has not accounted for...  Written by Tinmouth FilmsSee less",
    "2010_517": "Yusef, a first-generation Pakistani engineering student, moves off-campus with a group of Muslim punks in Buffalo, New York. His new \"un-orthodox\" house mates soon introduce him to Taqwacore- a hardcore, Muslim punk rock scene that only ...See moreYusef, a first-generation Pakistani engineering student, moves off-campus with a group of Muslim punks in Buffalo, New York. His new \"un-orthodox\" house mates soon introduce him to Taqwacore- a hardcore, Muslim punk rock scene that only exists out west. As the seasons change, Taqwacore influences the house more and more. The living room becomes a mosque during the day, while it continues to host punk parties at night. Ultimately, Yusef is influenced by Taqwacore too, as he begins to challenge his own faith and ideologies. The Taqwacores deals with the complexities of being young and Muslim in modern-day America.  Written by Eyad ZahraSee less",
    "2010_518": "A dark comedy which chronicles the final day in the life of self-proclaimed artist and genius, K. Roth Binew. Binew is a dreamer who elevates his drab and somewhat pitiful existence into a personal mythology. For his final day K. Roth ...See moreA dark comedy which chronicles the final day in the life of self-proclaimed artist and genius, K. Roth Binew. Binew is a dreamer who elevates his drab and somewhat pitiful existence into a personal mythology. For his final day K. Roth Binew enlists his best friend, the unrecognized poet and biographer Mills Joquin to chronicle his final hours. Mills Joquin drives Binew around town on a bicycle-powered rickshaw. As the eccentric duo go about their day, Binew hands out invitations to his final party, a living wake, where Binew will do a short performance before dropping dead on the spot.  Written by AnonymousSee less",
    "2010_519": "A humorous and deeply moving look at father-daughter relationships, modern-day parenting, marriage and the looming empty nest.",
    "2010_52": "As a deadly battle rages over Jigsaw's brutal legacy, a group of Jigsaw survivors gathers to seek the support of self-help guru and fellow survivor Bobby Dagen, a man whose own dark secrets unleash a new wave of terror.",
    "2010_520": "A U.S. soldier returning home from war struggles to reconcile his experiences abroad with the life and family he left in Texas.",
    "2010_521": "A young groom and his best man lost on the road trip to the wedding, run into a young English doctor.",
    "2010_522": "Tells the story of the first team from an Arab town to win the Israeli Cup and represent Israel in European competition.",
    "2010_523": "Two young children living illegally in a model apartment outside Boston are left to fend for themselves when their hardworking mother disappears.",
    "2010_524": "Inspired by a true story about a young German woman prepares to leave her war-ravaged city to begin a new life in America with her G.I. fiance. But standing between her and a hopeful future is a relentless police inspector, determined to ...See moreInspired by a true story about a young German woman prepares to leave her war-ravaged city to begin a new life in America with her G.I. fiance. But standing between her and a hopeful future is a relentless police inspector, determined to prevent her from escaping her past. He pushes her to face the truth about a child, whose secret the woman has kept all this time. Before she can leave for her new life, she will be forced to confront the past she has been trying to leave behind.  Written by AnonymousSee less",
    "2010_526": "A drama centered on a go-go dancer with multiple personality disorder who struggles to remain her true self and begins working with a psychotherapist to uncover the mystery of the inner ghosts that haunt her.",
    "2010_527": "America's 50-million strong Evangelical community is convinced that the world's future is foretold in Biblical prophecy - from the Rapture to the Battle of Armageddon. This astonishing documentary explores their world - in their homes, at ...See moreAmerica's 50-million strong Evangelical community is convinced that the world's future is foretold in Biblical prophecy - from the Rapture to the Battle of Armageddon. This astonishing documentary explores their world - in their homes, at conferences, and on a wide-ranging tour of Israel. By interweaving Christian, Zionist, Jewish and critical perspectives along with telling archival materials, the filmmakers probe the politically powerful - and potentially explosive - alliance between Evangelical Christians and Israel...an alliance that may set the stage for what one prominent Evangelical leader calls \"World War III.\"  Written by FRFSee less",
    "2010_528": "Eighteen years after a mass murder, John Bennett escapes captivity, and returns to his childhood house, where a group of unsuspecting college psychology majors are studying his psyche by staying in the house for a few nights.",
    "2010_529": "A look at the battles Hugh Hefner fought over the years against the U.S. government, the religious right, and militant feminists.",
    "2010_53": "Now out of prison but still disgraced by his peers, Gordon Gekko works his future son-in-law, an idealistic stock broker, when he sees an opportunity to take down a Wall Street enemy and rebuild his empire.",
    "2010_530": "A crime family looks to unmask the police informant in their midst who threatens to take down their business.",
    "2010_531": "A documentary devoted to the story of Portland, Oregon's Rose City Rollers roller derby league. The project attempts to answer the question why this revival of the 1970's sport has become a staple in Portland.",
    "2010_532": "Ben Singer has his cynical worldview darkened by his roommate Ibu's sudden medical situation, though the arrival of Ibu's sister, Khadi, might remedy both men's ills.",
    "2010_533": "Two young kids try to dance their way out of the favelas of Rio.",
    "2010_534": "A mousy librarian inherits her father's beloved but failing old movie house. In order to save the family business she discovers her inner serial killer - and a legion of rabid gore fans - when she starts turning out a series of grisly ...See moreA mousy librarian inherits her father's beloved but failing old movie house. In order to save the family business she discovers her inner serial killer - and a legion of rabid gore fans - when she starts turning out a series of grisly shorts. What her fans don't realize yet is that the murders in the movies are all too real.  Written by AnonymousSee less",
    "2010_535": "A detective deals with the loss of his own son while trying to uncover the identity of a boy whose mummified remains are found in a box buried for fifty years. Read more: Synopsis",
    "2010_536": "An intimate and moving account of one family's extraordinary courage in the face of overwhelming injustice and brutality.",
    "2010_537": "A retro-futuristic steam-punk thriller, about two men in two time periods, whose search for the same grand conspiracy leads them to question their own humanity.",
    "2010_538": "War stories and life lessons from the industry's top writers.",
    "2010_539": "Expelled from his school, a 16-year old boy returns home to his abusive and oppressive father.",
    "2010_54": "The affair between a politician and a contemporary dancer is affected by mysterious forces keeping the lovers apart.",
    "2010_540": "A young hoodlum's rise from a small-time criminal to a powerful crime entrepreneur during the turbulent years before and after the fall of apartheid.",
    "2010_541": "A young man named Victor (Mark L. Young) realizes the shortcomings of the Utopian ideals on the hippie commune where he was raised. Victor's mother (Andie MacDowell) is funding the commune where the guru Insley (Rutger Hauer) hypnotizes ...See moreA young man named Victor (Mark L. Young) realizes the shortcomings of the Utopian ideals on the hippie commune where he was raised. Victor's mother (Andie MacDowell) is funding the commune where the guru Insley (Rutger Hauer) hypnotizes and seduces women with a technique he calls \"running\". Insley manipulates the minds of these women so that they give him their bodies and all of their worldly possessions. Victor's childhood love, Becky (Hanna Hall), returns to take care of her deathly ill father. Victor, haunted by visions of Becky's death, is desperate to save her and himself by escaping from the cult. Preoccupied with Insley's free love philosophy, the adults of the community overlook the painful reality that the self destructive behavior of their children is most certainly due to early exposure to sex and drugs. To afford an escape, Victor tries to sell marijuana, but is cut out by rivals competing for Becky's affection. Finally, Victor is torn between getting money from his mother, who is entirely under Insley's influence, dealing with the violent drama of his drug-addled friends, and staying to save Becky as she spins out of control.  Written by Strand ReleasingSee less",
    "2010_542": "\"Logan\" is a story about two teenage brothers, Tyler and Logan. Logan, the younger of the two, has got his mind set on a seemingly impossible project which turns out to be much harder than he could ever imagine. At the turn of an ...See more\"Logan\" is a story about two teenage brothers, Tyler and Logan. Logan, the younger of the two, has got his mind set on a seemingly impossible project which turns out to be much harder than he could ever imagine. At the turn of an unexpected tragedy, the brothers' relationship is altered forever and Tyler is challenged to do whatever it takes to see his little brother's project succeed, even if that means risking it all.  Written by AnonymousSee less",
    "2010_543": "The story centers on a religiously conservative, married southern woman who receives a message from God instructing her to act as a surrogate mother and carry a child for two married gay men who live in Boston - a Jewish doctor and and ...See moreThe story centers on a religiously conservative, married southern woman who receives a message from God instructing her to act as a surrogate mother and carry a child for two married gay men who live in Boston - a Jewish doctor and and African-American dance choreographer. All Hell breaks loose when the African American man comes to her home down south to micro-manage her pregnancy, and he won't leave.  Written by Ira Pearlstein & Ron Satlof , writers and producersSee less",
    "2010_544": "A romantic comedy that explores the adult film industry through the eyes of an idealistic 25 year-old award winning film school grad.",
    "2010_545": "A young novelist tries to write about love, but realizes he will first need some real-life experience before taking on the subject.",
    "2010_546": "Live In London, the first live recording and concert film from acclaimed artist Regina Spektor. Captured mainly at London's famed Hammersmith Apollo Theatre, Live In London features 22 remarkable performances that span Spektor's brilliant ...See moreLive In London, the first live recording and concert film from acclaimed artist Regina Spektor. Captured mainly at London's famed Hammersmith Apollo Theatre, Live In London features 22 remarkable performances that span Spektor's brilliant catalog of music with such fan favorites as \"Us,\" \"Fidelity,\" \"Samson\" and \"Eet\" plus three new songs that have only been performed live.  Written by AnonymousSee less",
    "2010_547": "Chronicles the relationship between two gay teenagers in the rural south in the late '70s.",
    "2010_548": "A story about two classmates - one smart and openly gay and the other school swimming star. They grow as friends and discover their attraction to each other. This story has been told many times but the characters in this version are very endearing.",
    "2010_549": "Two Danish comedians join the director on a trip to North Korea, where they have been allowed access under the pretext of wanting to perform a vaudeville act.",
    "2010_55": "A group of elite warriors parachute into an unfamiliar jungle and are hunted by members of a merciless alien race.",
    "2010_550": "Set in New York's gay \"bear\" scene and taking a cue from the popular HBO franchise \"Sex and the City,\" BearCity follows a tight-knit pack of friends experiencing comical mishaps, emotionally sweet yet lusty romantic encounters and a cast ...See moreSet in New York's gay \"bear\" scene and taking a cue from the popular HBO franchise \"Sex and the City,\" BearCity follows a tight-knit pack of friends experiencing comical mishaps, emotionally sweet yet lusty romantic encounters and a cast of colorful, diverse characters as they gear up for a big party weekend.  Written by Lawrence FerberSee less",
    "2010_551": "'Sweethearts of the Prison Rodeo' goes behind prison walls to follow convict cowgirls on their journey to the 2007 Oklahoma State Penitentiary Rodeo. In 2006, female inmates were allowed to participate for the first time. In a state with ...See more'Sweethearts of the Prison Rodeo' goes behind prison walls to follow convict cowgirls on their journey to the 2007 Oklahoma State Penitentiary Rodeo. In 2006, female inmates were allowed to participate for the first time. In a state with the highest female incarceration rate in the country, these women share common experiences such as broken homes, drug abuse and alienation from their children. Since 1940, the Oklahoma State Penitentiary has held an annual 'Prison Rodeo'. Part Wild West show and part coliseum-esque spectacle, it's one of the last of its kind - a relic of the American penal system. Prisoners compete on wild-broncs and bucking bulls, risking life-long injuries. For inmates like Danny Liles, a 14-year veteran of the rodeo, the chance to battle livestock offers a brief respite from prison life. Within this strange arena the prisoners become the heroes while the public and guards applaud.  Written by Sweethearts of The Prison RodeoSee less",
    "2010_552": "While trapped in a Twilight Zonish high desert environment, a hunted rock musician is forced to confront his whole past life when an eccentric, prophet tells him his has one night left to live.",
    "2010_553": "A documentary about the history of exploitation movies, from the silent movie era to the 1970s.",
    "2010_554": "WHIZ KIDS is a coming-of-age story that follows three high school seniors from diverse backgrounds as they prepare for the nation's most prestigious science competition. These passionate, highly ambitious students embark on an ...See moreWHIZ KIDS is a coming-of-age story that follows three high school seniors from diverse backgrounds as they prepare for the nation's most prestigious science competition. These passionate, highly ambitious students embark on an unpredictable journey of discovery where they must overcome scientific and personal challenges in order to fulfill their dreams. Forging their path as the next generation of scientists, the teens learn as much about themselves as they do about science.  Written by AnonymousSee less",
    "2010_555": "A high-energy romantic comedy that follows three bachelors, speeding through life and scheming on women.",
    "2010_556": "When a gang of terrorists invade a campus building, it's up to English professor Joe McCann to save the day.",
    "2010_557": "A Czech journalist joins a Prague radio station that broadcasts Nazi propaganda in order to protect his Jewish wife. However, as the Nazi rule over Czechoslovakia calls for more and more collaboration, his relationship with his wife ...See moreA Czech journalist joins a Prague radio station that broadcasts Nazi propaganda in order to protect his Jewish wife. However, as the Nazi rule over Czechoslovakia calls for more and more collaboration, his relationship with his wife spirals downward.  Written by IMDbSee less",
    "2010_558": "This is Susan Sontag's documentary about Israel, shot during the Yom Kippur war. Much of it is strictly observational.",
    "2010_559": "North Korean defectors tell their stories of repression, escape and hope.",
    "2010_56": "The spectre of a disfigured man haunts the children of the parents who murdered him, stalking and killing them in their dreams.",
    "2010_560": "Newlyweds Alex and Alice host a New Year's Eve party for their closest friends at a remote cabin in the mountains. An unexpected addition arrives and the group's facades begin to crumble.",
    "2010_561": "After what is supposed to be a no-strings hook up, two men discuss their dreams, what ideal happiness might be like, and maybe a future together.",
    "2010_562": "A man meets with assorted characters in a nursing home after being diagnosed with cancer.",
    "2010_563": "A multi-narrative drama that navigates through the different lives of one city's residents, each of whom is connected to the same local homicide investigation. This ensemble cast of characters includes an Iraq War vet returned home to an ...See moreA multi-narrative drama that navigates through the different lives of one city's residents, each of whom is connected to the same local homicide investigation. This ensemble cast of characters includes an Iraq War vet returned home to an emotionally disturbed wife, a new father living in the shadow of a successful older brother, a sister caught up in a web of addiction, and a cameraman who attempts to exploit the reality behind all of their stories, or at least his version of them. The search for truth becomes a life and death struggle as the subtle manipulation of all relationships is exposed.  Written by AnonymousSee less",
    "2010_564": "Jamie Morgan, a young man with a large heart-shaped birthmark on his face, discovers that there are demons on the streets of East London.",
    "2010_565": "A film centering on the life and work of Ron Galella that examines the nature and effect of paparazzi.",
    "2010_566": "A funeral parlor employee looks to unravel a 10-year-old mystery.",
    "2010_567": "A musical comedy covering three decades in the life of Sage Negadeth, an encyclopedic headbanging hero determined to form the heaviest band of his scene. Everything seems to work out as he forms a thrash band with his best friend and two ...See moreA musical comedy covering three decades in the life of Sage Negadeth, an encyclopedic headbanging hero determined to form the heaviest band of his scene. Everything seems to work out as he forms a thrash band with his best friend and two Nigerian exchange students. When a school counselor threatens institutionalization, the Nigerians are deported and he's still stuck working at a gas station, Sage must choose between making a deal with the Devil or the salvation offered by a mysterious Christian girl. Packed with original Metal music and headbanging humor that may offend just about anyone, 'Metal Messiah' is ultra low budget and yet plenty of eye candy and laughs ensure a fast paced, super fun ride.  Written by AnonymousSee less",
    "2010_568": "Like many guys, Mark Foster struggles with commitment, but given his past, he has good reason. Fifteen years ago, his parents' scandalous divorce grabbed the public's attention and shattered Mark's ideas about marriage. Even worse, Mark ...See moreLike many guys, Mark Foster struggles with commitment, but given his past, he has good reason. Fifteen years ago, his parents' scandalous divorce grabbed the public's attention and shattered Mark's ideas about marriage. Even worse, Mark and his charismatic brother, Hal, were forced to pick sides and to this day, disagree over whom to fault. Unfortunately, Mark has never shared any of this with his unsuspecting girlfriend, Erika, who is about to meet Mark's embittered, camera-happy mother, Gretchen, for the first time. As Mark desperately struggles to keep his family's sordid history under wraps, during a long, awkward weekend, past issues resurface that force Mark to confront the thing he fears the most...his own lies.  Written by Jon BowdenSee less",
    "2010_569": "The story of Andrew Cunanan, the aging gay hustler who killed fashion icon Gianni Versace, comes to the screen in this fact-based drama from director Ben Waller. An emotionally unstable party boy who was growing too old for the nightclub ...See moreThe story of Andrew Cunanan, the aging gay hustler who killed fashion icon Gianni Versace, comes to the screen in this fact-based drama from director Ben Waller. An emotionally unstable party boy who was growing too old for the nightclub scene, Cunanan (Jonathon Trent) fell into petty theft and drug dealing before embarking on a brutal killing spree that began in late April of 1997.See less",
    "2010_57": "A romantic drama about a soldier who falls for a conservative college student while he's home on leave.",
    "2010_570": "Born Jonathan French in Beverly Hills, California and orphaned at 3 months old, this young boy was adopted by his Mexican nanny (Lupe Ontiveros) and step-father (Danny Trejo) and raised to be a good, God-fearing Mexican with a love for ...See moreBorn Jonathan French in Beverly Hills, California and orphaned at 3 months old, this young boy was adopted by his Mexican nanny (Lupe Ontiveros) and step-father (Danny Trejo) and raised to be a good, God-fearing Mexican with a love for ranchero music. At age 33, in his \"Jesus Year,\" and now known as Juan FranceÌ\u0081s, he is a gardener/janitor-by-day but has been blessed by the Virgin of Guadalupe with the talent to sing like the angels. He takes his ranchero act from the small, half-empty soccer bars in East L.A., to a larger music festival audience where he is discovered and quickly swept into Mexican pop stardom. Caught in the whirlwind of fame, Juan's everyman appearance and musical style undergo a celebrity make-over. He changes his name to \"El Guero\" and his songs for the working man are transformed into heartless Reggaeton. When the dark truth about Juan's history is revealed to him, he must ask himself: Will he choose the Mexican man in his heart, or the bald pink guy in the mirror?  Written by AnonymousSee less",
    "2010_571": "A young couple moves into an old schoolhouse on a desolate stretch of farm country. Hoping for a new beginning, their lives are instead drawn toward dark and unforeseen ends.",
    "2010_572": "Based upon the final confession of Adolf Eichmann, made before his execution in Israel as he accounts to Captain Avner Less, a young Israeli police officer, of his past as the architect of Hitler's plan for the fFnal Solution. Captured by ...See moreBased upon the final confession of Adolf Eichmann, made before his execution in Israel as he accounts to Captain Avner Less, a young Israeli police officer, of his past as the architect of Hitler's plan for the fFnal Solution. Captured by intelligence operatives in Argentina, 15 years after World War II, Eichmann (Kretschmann), the world's most wanted man, must be broken down and the truth unveiled. As the world waits, 2 men must confront each other in a battle of wills- the result of which will change a nation forever.See less",
    "2010_573": "Daniel and Ana, siblings and best friends are forced to deal with unimaginable trauma after they are kidnapped and forced to have sex on camera.",
    "2010_574": "Story of a nine-and-a-half year old girl left alone in Sweden while her family is in Africa during the summer of 1981.",
    "2010_575": "A kaleidoscopic film portrait of Shelly Brown, a twenty-three year-old alienated urban misfit recently released from a psychiatric hospital. Read more: Synopsis",
    "2010_576": "NOBODY'S PERFECT is a documentary which shows Niko von Glasow's search for eleven people who, like him, were born disabled due to the side effects of the drug thalidomide. These eleven people are also prepared to be photographed for a ...See moreNOBODY'S PERFECT is a documentary which shows Niko von Glasow's search for eleven people who, like him, were born disabled due to the side effects of the drug thalidomide. These eleven people are also prepared to be photographed for a calendar, and photographed naked, allowing people who would otherwise glance furtively at thalidomiders to take a good, long look. In the process Niko discovers a range of fascinating characters who have learned to lead an impressively \"normal\" life, which incorporates their disability. With black humour, and paying no heed to political correctness, NOBODY'S PERFECT gives a portrait of twelve extraordinary personalities who react with curiosity, enthusiasm or horror (like Niko himself) to the project.  Written by MDTVSee less",
    "2010_577": "A story about survival beyond one's class and condition, and the profound changes that occur when a young musician awakens the magic, the music and the possibilities for romance in the world outside the poverty and violence that are his ...See moreA story about survival beyond one's class and condition, and the profound changes that occur when a young musician awakens the magic, the music and the possibilities for romance in the world outside the poverty and violence that are his life in the Bronx, NY.  Written by A AdelsonSee less",
    "2010_578": "A mid-level manager who develops an aversion to being \"good\" finds himself confronting the mysteries of middle-age and morality as he loses grasp of what was once his quiet life.",
    "2010_579": "The mother of an autistic child is determined not to accept the pessimistic prognosis for her son.",
    "2010_58": "The on-going war between the canine and feline species is put on hold when they join forces to thwart a rogue cat spy with her own sinister plans for conquest.",
    "2010_580": "Deep inside, Manuel has always been Manuela. Amidst her worst love crisis, Manuela reinvents herself as Manuel in order to pass as the fiance of her best friend Coca - who is pregnant from a one-night stand and must face her conservative ...See moreDeep inside, Manuel has always been Manuela. Amidst her worst love crisis, Manuela reinvents herself as Manuel in order to pass as the fiance of her best friend Coca - who is pregnant from a one-night stand and must face her conservative family. Hidden identities, misunderstandings, and the tension between two friends pretending to be what they are not, stage a colorful and up-beat story. Manuela y Manuel is a visually-captivating comedy about two friends performing in the melodrama of Latin America life.  Written by Frances LausellSee less",
    "2010_581": "Marco is a lonely handicapped Spanish smuggler, driving through Brazil to sell out his cheap goods. When two bandits assault him and steal his load, he is miraculously saved by Carmo, a beautiful local girl who would rather die than spend ...See moreMarco is a lonely handicapped Spanish smuggler, driving through Brazil to sell out his cheap goods. When two bandits assault him and steal his load, he is miraculously saved by Carmo, a beautiful local girl who would rather die than spend another day in the hellhole where she lives. Carmo and Marco will start a lawless, reckless journey, and an intense romance through a breathtaking South American border landscape.  Written by Imagina International SalesSee less",
    "2010_582": "An abused wife's plan to escape her husband goes awry when she accidentally kills him, causing her to split on a cross-country drive with her best friend and his corpse in tow. Read more: Synopsis",
    "2010_583": "45365 explores the congruities of daily life in an American town. From the patrol car to the courtroom, the playground to the nursing home, the parade to the prayer service, it explores relationships and interactions - with people and ...See more45365 explores the congruities of daily life in an American town. From the patrol car to the courtroom, the playground to the nursing home, the parade to the prayer service, it explores relationships and interactions - with people and their environment. The stories of a father and son, a young relationship, cops and criminals, officials and their electorate coalesce into a mosaic of faces, places, and events. 45365 is a portrait of a city and its people.  Written by AnonymousSee less",
    "2010_584": "The story of General Romeo Dallaire's frustrated efforts to stop the madness of the Rwandan Genocide, despite the complete indifference of his superiors.",
    "2010_585": "A mockumentary that follows Ray Shoesmith, a Melbourne hitman who is simultaneously ruthless and caring, likeable and volatile. 'Filmed' by his media student neighbour for a university assignment, Ray is under contract to kill a low life ...See moreA mockumentary that follows Ray Shoesmith, a Melbourne hitman who is simultaneously ruthless and caring, likeable and volatile. 'Filmed' by his media student neighbour for a university assignment, Ray is under contract to kill a low life of the Melbourne underworld when a more tempting offer is made...  Written by Danny SilverSee less",
    "2010_59": "A bad deed on the part of a tough minor-league hockey player results in an unusual sentence: He must serve one week as a real-life tooth fairy.",
    "2010_6": "As a string of mysterious killings grips Seattle, Bella, whose high school graduation is fast approaching, is forced to choose between her love for vampire Edward and her friendship with werewolf Jacob.",
    "2010_60": "An underwater cave diving team experiences a life-threatening crisis during an expedition to the unexplored and least accessible cave system in the world.",
    "2010_61": "A drama centered on three people - a blue-collar American, a French journalist and a London school boy - who are touched by death in different ways.",
    "2010_62": "Two single adults become caregivers to an orphaned girl when their mutual best friends die in an accident.",
    "2010_63": "In 1920s China, a bandit arrives in a remote provincial town posing as its new mayor, where he faces off against a tyrannical local nobleman.",
    "2010_64": "In 1990s Pittsburgh, a medicine peddler starts a relationship with a young woman suffering from Parkinson's disease.",
    "2010_65": "The epic story of a family separated as a result of the Great Tangshan Earthquake of 1976.",
    "2010_66": "A vacationing woman meets her ideal man, leading to a swift marriage. Back at home, however, their idyllic life is upset when they discover their neighbors could be assassins who have been contracted to kill the couple.",
    "2010_67": "Dave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a superhero, even though he has no powers, training or meaningful reason to do so.",
    "2010_68": "Nanny McPhee arrives to help a harried young mother who is trying to run the family farm while her husband is away at war, though she uses her magic to teach the woman's children and their two spoiled cousins five new lessons.",
    "2010_69": "A record company intern is hired to accompany out-of-control British rock star Aldous Snow to a concert at L.A.'s Greek Theater.",
    "2010_7": "With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy.",
    "2010_70": "A small-town girl ventures to Los Angeles and finds her place in a neo-burlesque club run by a former dancer.",
    "2010_71": "A rebellious girl is sent to a Southern beach town for the summer to stay with her father. Through their mutual love of music, the estranged duo learn to reconnect.",
    "2010_72": "When he finds out that his work superiors host a dinner celebrating the idiocy of their guests, a rising executive questions it when he's invited, just as he befriends a man who would be the perfect guest.",
    "2010_73": "A suburban family moves to a new neighborhood with their large, yet lovable Great Dane, who has a tendency to wreak havoc in his own oblivious way.",
    "2010_74": "After a sudden underwater tremor sets free scores of the prehistoric man-eating fish, an unlikely group of strangers must band together to stop themselves from becoming fish food for the area's new razor-toothed residents.",
    "2010_75": "An ecological drama/documentary, filmed throughout the globe. Part thriller, part meditation on the vanishing wonders of the sub-aquatic world.",
    "2010_76": "As homicide detective Thomas Craven investigates the murder of his activist daughter, he uncovers a corporate cover-up and government conspiracy that attracts an agent tasked with cleaning up the evidence.",
    "2010_77": "A spoof of vampire-themed movies. Teenager, Becca finds herself torn between 2 boys. As she and her friends wrestle with a number of different dramas, everything comes to a head at their prom.",
    "2010_78": "Sophie dreams of becoming a writer and travels to Verona, Italy where she meets the \"Secretaries of Juliet\".",
    "2010_79": "A woman conceives twins through artificial insemination, then meets the man of her dreams on the very same day.",
    "2010_8": "The magically long-haired Rapunzel has spent her entire life in a tower, but now that a runaway thief has stumbled upon her, she is about to discover the world for the first time, and who she really is.",
    "2010_80": "The adventures of a 12 year old who is fresh out of elementary and transitions to middle school, where he has to learn the consequences and responsibility to survive the year.",
    "2010_81": "Wealthy middle-aged entrepreneur Qin and beautiful flight attendant Xiaoxiao Liang question their relationship after presiding over good friends Mang Guo and Shan Li's lavish \"divorce ceremony.\"",
    "2010_82": "A clean-cut high school student relies on the school's rumor mill to advance her social and financial standing.",
    "2010_83": "An IMAX 3D camera chronicles the effort of 7 astronauts aboard the Space Shuttle Atlantis to repair the Hubble Space Telescope.",
    "2010_84": "A troubled evangelical minister agrees to let his last exorcism be filmed by a documentary crew.",
    "2010_85": "A group of bank robbers find their multi-million dollar plan interrupted by a hard-boiled detective.",
    "2010_86": "When a group of strangers at a dusty roadside diner come under attack by demonic forces, their only chance for survival lies with an archangel named Michael, who informs a pregnant waitress that her unborn child is humanity's last hope.",
    "2010_87": "An assassin hides out in Italy for one last assignment.",
    "2010_88": "A married couple's life is turned upside down when the wife is accused of a murder.",
    "2010_89": "Strange lights descend on the city of Los Angeles, drawing people outside like moths to a flame where an extraterrestrial force threatens to swallow the entire human population off the face of the Earth.",
    "2010_9": "When a criminal mastermind uses a trio of orphan girls as pawns for a grand scheme, he finds their love is profoundly changing him for the better.",
    "2010_90": "A malfunctioning time machine at a ski resort takes a man back to 1986 with his two friends and nephew, where they must relive a fateful night and not change anything to make sure the nephew is born.",
    "2010_91": "After a prison riot, former-Captain Nascimento, now a high ranking security officer in Rio de Janeiro, is swept into a bloody political dispute that involves government officials and paramilitary groups.",
    "2010_92": "A group of people are trapped in an elevator and the Devil is mysteriously amongst them.",
    "2010_93": "A mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive.",
    "2010_94": "Four couples find themselves struggling to save their marriages once again on their annual marriage retreat, while each of them battle through financial, physical, mental, and emotional issues.",
    "2010_95": "A ghost writer, hired to complete the memoirs of a former British Prime Minister, uncovers secrets that put his own life in jeopardy.",
    "2010_96": "Penny Chenery Tweedy and colleagues guide her long-shot but precocious stallion to set, in 1973, the unbeaten record for winning the Triple Crown.",
    "2010_97": "An upstart television producer accepts the challenge of reviving a struggling morning show program with warring co-hosts.",
    "2010_98": "A romantic drama centered on two new lovers: Tyler, whose parents have split in the wake of his brother's suicide, and Ally, who lives each day to the fullest since witnessing her mother's murder.",
    "2010_99": "Jimmy's rare baseball card is robbed. Since it's his only hope to pay for his daughter's upcoming wedding, he recruits his cop partner Paul to track down the robber, a memorabilia-obsessed gangster."
}