{
    "2011_1": "Harry, Ron, and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.",
    "2011_10": "Star race car Lightning McQueen and his pal Mater head overseas to compete in the World Grand Prix race. But the road to the championship becomes rocky as Mater gets caught up in an intriguing adventure of his own: international espionage.",
    "2011_100": "A group of Yokohama teens look to save their school's clubhouse from the wrecking ball in preparations for the 1964 Tokyo Olympics.",
    "2011_101": "After spending the night together on the night of their college graduation Dexter and Emma are shown each year on the same date to see where they are in their lives. They are sometimes together, sometimes not, on that day.",
    "2011_102": "The story of a family in Waco, Texas in 1956. The eldest son witnesses the loss of innocence and struggles with his parents' conflicting teachings.",
    "2011_103": "A chronicle of the events that led to the founding of the Chinese Communist Party.",
    "2011_104": "When his mentor is taken captive by a disgraced Arab sheik, a killer-for-hire is forced into action. His mission: kill three members of Britain's elite Special Air Service responsible for the death of his sons.",
    "2011_105": "When her adoptive father disappears, Sharon Da Silva is drawn into a strange and terrifying alternate reality that holds answers to the horrific nightmares that have plagued her since childhood.",
    "2011_106": "A nine-year-old amateur inventor, Francophile, and pacifist searches New York City for the lock that matches a mysterious key left behind by his father, who died in the World Trade Center on September 11, 2001.",
    "2011_107": "The crazy and comical Mabel Simmons, otherwise known as Madea, tries to wrangle her fighting family together for a family dinner regarding the health of her niece Shirley.",
    "2011_108": "A skilled Korean archer goes up against the mighty force of Manchus with the sole purpose of rescuing his kidnapped sister.",
    "2011_109": "While searching for honey, Pooh and his friends embark on an adventure to find Eeyore's missing tail and rescue Christopher Robin from an unknown monster called The Backson.",
    "2011_11": "An outlaw cat, his childhood egg-friend and a seductive thief kitty set out in search for the eggs of the fabled Golden Goose to clear his name, restore his lost honor and regain the trust of his mother and town.",
    "2011_110": "A drunken playboy stands to lose a wealthy inheritance when he falls for a woman his family doesn't like.",
    "2011_111": "Teenage surfer Bethany Hamilton overcomes the odds and her own fears of returning to the water after losing her left arm in a shark attack.",
    "2011_112": "In 1965, three Mossad Agents cross into East Berlin to apprehend a notorious Nazi war criminal. Thirty years later, the secrets the Agents share come back to haunt them.",
    "2011_113": "A modern-day take on the \"Beauty and the Beast\" tale where a New York teen is transformed into a hideous monster in order to find true love.",
    "2011_114": "After ambushing and killing his rival, losing everything in the process, dispirited warlord Hou Jie turns to a Shaolin monastery seeking salvation.",
    "2011_115": "This heartwarming film documents orphaned orangutans and elephants and the extraordinary people who rescue and raise them-saving endangered species one life at a time.",
    "2011_116": "A weekend at a lake house in the Louisiana Gulf turns into a nightmare for seven vacationers as they are subjected to shark attacks.",
    "2011_117": "Inspired by a true story, a comedy centered on a 27-year-old guy who learns of his cancer diagnosis and his subsequent struggle to beat the disease.",
    "2011_118": "When a nice new neighbor moves in next door, Charley discovers that he is an ancient vampire who preys on the community. Can he save his neighborhood from the creature with the help of the famous \"vampire killer\", Peter Vincent?",
    "2011_119": "A vengeful father escapes from hell and chases after the men who killed his daughter and kidnapped his granddaughter.",
    "2011_12": "Detective Sherlock Holmes is on the trail of criminal mastermind Professor Moriarty, who is carrying out a string of random crimes across Europe.",
    "2011_120": "Two fledgling criminals kidnap a pizza delivery guy, strap a bomb to his chest, and inform him that he has mere hours to rob a bank or else...",
    "2011_121": "When college freshman Sara arrives on campus for the first time, she befriends her roommate, Rebecca, unaware that the girl is becoming dangerously obsessed with her.",
    "2011_122": "Soon after moving into their seemingly idyllic new home, a family learns of a brutal crime committed against former residents of the dwelling.",
    "2011_123": "Three young women vacationing in Paris find themselves whisked away to Monte Carlo after one of the girls is mistaken for a British heiress.",
    "2011_124": "A young boy named Milo gains a deeper appreciation for his mom after Martians come to Earth to take her away.",
    "2011_125": "A young girl sent to live with her father and his new girlfriend believes that she has released creatures from a sealed ash pit in the basement of her new home.",
    "2011_126": "Two very different families converge on Martha's Vineyard one weekend for a wedding.",
    "2011_127": "Unemployed and newly-divorced Stephanie Plum lands a job at her cousin's bail-bond business, where her first assignment puts her on the trail of a wanted local cop from her romantic past.",
    "2011_128": "In Roman-ruled Britain, a young Roman soldier endeavors to honor his father's memory by finding his lost legion's golden emblem.",
    "2011_129": "Six years after their Guantanamo Bay adventure, stoner buds Harold Lee and Kumar Patel cause a holiday fracas by inadvertently burning down Harold's father-in-law's prize Christmas tree.",
    "2011_13": "When Blu, a domesticated macaw from small-town Minnesota, meets the fiercely independent Jewel, he takes off on an adventure to Rio de Janeiro with the bird of his dreams.",
    "2011_130": "When the titular antagonist of an action game takes on physical form, it's only the game's less powerful protagonist who can save his creator's family.",
    "2011_131": "When a tragedy strikes close to home, four police officers struggle with their faith and their roles as husbands and fathers; together they make a decision that will change all of their lives.",
    "2011_132": "Colin Clark, an employee of Sir Laurence Olivier, documents the tense interaction between Olivier and Marilyn Monroe during the production of The Prince and the Showgirl.",
    "2011_133": "A college student on suspension is coaxed into babysitting the kids next door, though he is fully unprepared for the wild night ahead of him.",
    "2011_134": "A mousy governess who softens the heart of her employer soon discovers that he's hiding a terrible secret.",
    "2011_135": "A brilliant plastic surgeon, haunted by past tragedies, creates a type of synthetic skin that withstands any kind of damage. His guinea pig: a mysterious and volatile woman who holds the key to his obsession.",
    "2011_136": "The daughter of a wealthy nobleman secretly falls in love with her bodyguard.",
    "2011_137": "At an Antarctica research site, the discovery of an alien craft leads to a confrontation between graduate student Kate Lloyd and scientist Dr. Sander Halvorson.",
    "2011_138": "A comedy centered on the life of Kate Reddy, a finance executive who is the breadwinner for her husband and two kids.",
    "2011_139": "Meet Mara, an endearing lion cub striving to be like her mother; Sita, a cheetah and single mother of five; and Fang, a proud leader of the pride who must defend his family from a rival lion.",
    "2011_14": "A substance designed to help the brain repair itself gives advanced intelligence to a chimpanzee who leads an ape uprising.",
    "2011_140": "Two pairs of parents hold a cordial meeting after their sons are involved in a fight, though as their time together progresses, increasingly childish behavior throws the discussion into chaos.",
    "2011_141": "A look at how the intense relationship between Carl Jung and Sigmund Freud gives birth to psychoanalysis.",
    "2011_142": "A woman looks back at the past nineteen men she's had relationships with in her life and wonders if one of them might be her one true love.",
    "2011_143": "American journalist Paul Kemp takes on a freelance job in Puerto Rico for a local newspaper during the 1960s and struggles to find a balance between island culture and the expatriates who live there.",
    "2011_144": "When Prince Fabious's bride is kidnapped, he goes on a quest to rescue her... accompanied by his lazy useless brother Thadeous.",
    "2011_145": "In 1960s Paris, a conservative couple's lives are turned upside down by a group of Spanish maids that live in the same building.",
    "2011_146": "Decades-old found footage from NASA's abandoned Apollo 18 mission, where three American astronauts were sent on a secret expedition, reveals the reason the U.S. has never returned to the moon.",
    "2011_147": "A comedy centered on an idealist who barges into the lives of his three sisters.",
    "2011_148": "Set in Thailand and India, a case of mistaken identity leads to love; and a man and his family concoct a grand scheme to win over the hearts of a woman and her greedy conniving uncles.",
    "2011_149": "The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother.",
    "2011_15": "The powerful but arrogant god Thor is cast out of Asgard to live amongst humans in Midgard (Earth), where he soon becomes one of their finest defenders.",
    "2011_150": "Red Riding Hood is training in the group of Sister Hoods, when she and the Wolf are called to examine the sudden mysterious disappearance of Hansel and Gretel.",
    "2011_151": "Soon after her divorce, a fiction writer returns to her home in small-town Minnesota, looking to rekindle a romance with her ex-boyfriend, who is now happily married and has a newborn daughter.",
    "2011_152": "A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease.",
    "2011_153": "A drama centered on the Korean War's final battle that will determine the border between north and south.",
    "2011_154": "A journalist covering police assigned to a juvenile division enters an affair with one of her subjects.",
    "2011_155": "An unorthodox Irish policeman with a confrontational personality is partnered with an up-tight F.B.I. agent to investigate an international drug-smuggling ring.",
    "2011_156": "Follows the key people at an investment bank, over a 24-hour period, during the early stages of the 2008 financial crisis.",
    "2011_157": "A sex addict's carefully cultivated private life falls apart after his sister arrives for an indefinite stay.",
    "2011_158": "An accomplished headhunter risks everything to obtain a valuable painting owned by a former mercenary.",
    "2011_159": "A tribute to the late German choreographer, Pina Bausch, as her dancers perform her most famous creations.",
    "2011_16": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.",
    "2011_160": "A concert documentary shot during the Glee Live! In Concert! summer 2011 tour, featuring song performances and Glee fans' life stories and how the show influenced them. Read more: Synopsis",
    "2011_161": "A story centered on the relationship between the newly elected Pope and his therapist.",
    "2011_162": "Two sisters find their already strained relationship challenged as a mysterious new planet threatens to collide with Earth.",
    "2011_163": "Three struggling room-mates unknowingly become potential prey of a ruthless gangster.",
    "2011_164": "In World War II-era Korea, rival runners, one Korean (Jang Dong-gun) and one Japanese (Joe Odagiri), go to war together against the Soviets.",
    "2011_165": "Third grader Judy Moody sets out to have the most thrilling summer of her life.",
    "2011_166": "Mary Surratt is the lone female charged as a co-conspirator in the assassination trial of Abraham Lincoln. As the whole nation turns against her, she is forced to rely on her reluctant lawyer to uncover the truth and save her life.",
    "2011_167": "The theory that it was in fact Edward De Vere, Earl of Oxford, who penned Shakespeare's plays. Set against the backdrop of the succession of Queen Elizabeth I and the Essex rebellion against her.",
    "2011_168": "Occupied France; Lebrac leads a play war between two rival kid gangs, but a girl he likes, who's Jewish, is in danger of being discovered by local Nazi sympathisers. Lebrac and the village must now respond to the reality of what's happening.",
    "2011_169": "A young man is rocked by two announcements from his elderly father: that he has terminal cancer and that he has a young male lover.",
    "2011_17": "Intrepid reporter Tintin and Captain Haddock set off on a treasure hunt for a sunken ship commanded by Haddock's ancestor.",
    "2011_170": "After his wife is assaulted, a husband enlists the services of a vigilante group to help him settle the score. Then he discovers they want a 'favor' from him in return.",
    "2011_171": "In 1930s southern France, a father is torn between his sense of honor and his deep love for his daughter when she gets in trouble with the wealthy son of a shopkeeper.",
    "2011_172": "When an African boy arrives by cargo ship in the port city of Le Havre, an aging shoe shiner takes pity on the child and welcomes him into his home.",
    "2011_173": "The picaresque and touching story of the politically incorrect, fully lived life of the impulsive, irascible and fearlessly blunt Barney Panofsky.",
    "2011_174": "A quirky rom-com where Kush finds the ideal Indian bride Dimple for his brother Luv and a series of comical and unpredictable events follow.",
    "2011_175": "Cheyenne, a retired rock star living off his royalties in Dublin, returns to New York City to find the man responsible for a humiliation suffered by his recently deceased father during W.W.II.",
    "2011_176": "Rival Chinese military strategists Sun Bin (Sun Hong-lei) and Pang Juan (Francis Ng) clash in this historic war adventure set during the Era of Warring States.",
    "2011_177": "After an accident, a chauvinistic executive gains the ability to hear what women are really thinking.",
    "2011_178": "A struggling lawyer and volunteer wrestling coach's chicanery comes back to haunt him when the teenage grandson of the client he has double-crossed comes into his life.",
    "2011_179": "A French woman mourning over the death of her husband three years prior is courted by a Swedish co-worker.",
    "2011_18": "Steve Rogers, a rejected military soldier, transforms into Captain America after taking a dose of a \"Super-Soldier serum\". But being Captain America comes at a price as he attempts to take down a war monger and a terrorist organization.",
    "2011_180": "Four slackers decide to avenge their humiliation at the hands of a con-man.",
    "2011_181": "A story set in nineteenth-century China and focusing on the life-long friendship between two girls who develop their own secret code as a way to contend with the rigid social norms imposed on women.",
    "2011_182": "Famous naturalist David Attenborough explains the rise and fall of pterosaurs, mistakenly known as flying dinosaurs. He also flies a glider to show how big the Quetzalcoatlus, at the time the largest known pterosaur species, really was. Read more: Synopsis",
    "2011_183": "A group of teenagers get ready for their high school prom.",
    "2011_184": "As a conceited scholar of the Ming Dynasty, Wei Yangsheng believes that since life is short, one should pursue the ultimate sexual pleasure as time allows.",
    "2011_185": "As they're held for ransom, a husband and wife's predicament grows more dire amid the discovery of betrayal and deception.",
    "2011_186": "Explores the psyche of a new mother as she confronts the gnawing sense that her long-awaited newborn son is not her own.",
    "2011_187": "A Mexican crime lord is forced by his mother to plan a suicidal rescue mission to find his lost brother in the most unexpected place on Earth...",
    "2011_188": "Kevin's mother struggles to love her strange child, despite the increasingly dangerous things he says and does as he grows up. But Kevin is just getting started, and his final act will be beyond anything anyone imagined.",
    "2011_189": "After losing her job at a local factory, a single mother enrolls in a housekeeper training program, soon landing work cleaning the Paris apartment of handsome but cocky power broker.",
    "2011_19": "In the 1960s, superpowered humans Charles Xavier and Erik Lensherr work together to find others like them, but Erik's vengeful pursuit of an ambitious mutant who ruined his life causes a schism to divide them.",
    "2011_190": "An ex-cop is hired by a pimp to find missing call girls and the man responsible behind their abduction.",
    "2011_191": "The decision by India's supreme court to establish caste-based reservations for jobs in education causes conflict between a teacher and his mentor.",
    "2011_192": "Agathe lives with her husband and son in a posh apartment in front of the Jardin du Luxembourg. Patrick lives with his son in the back of a van. She is the head of an important contemporary art foundation. He lives thanks to social ...See moreAgathe lives with her husband and son in a posh apartment in front of the Jardin du Luxembourg. Patrick lives with his son in the back of a van. She is the head of an important contemporary art foundation. He lives thanks to social security and odd jobs. She has graduated after studying for 7 years. He has spent almost 7 years behind bars. She has a good relationship with the Minister of Culture and Arts. He has a good relationship with alcoholic beverages of all kinds. She loves intellectual discussions. He loves occasional sex with big-breasted women. They should have never met, but their sons are inseparable. They will see why in the end.  Written by AnonymousSee less",
    "2011_193": "Werner Herzog gains exclusive access to film inside the Chauvet caves of Southern France and captures the oldest known pictorial creations of humanity.",
    "2011_194": "Two bird enthusiasts try to defeat the cocky, cutthroat world record holder in a year-long bird-spotting competition.",
    "2011_195": "The story centers on a year in the life of three men trying to survive a round of corporate downsizing at a major company - and how that affects them, their families, and their communities.",
    "2011_196": "The story of Aung San Suu Kyi as she becomes the core of Burma's democracy movement, and her relationship with her husband, writer Michael Aris.",
    "2011_197": "Tim Lippe has no idea what he's in for when he's sent to Cedar Rapids, Iowa to represent his company at an annual insurance convention, where he soon finds himself under the \"guidance\" of three convention veterans.",
    "2011_198": "Experience the show that quickly became a national phenomenon, and get an up close and personal look at Kevin Hart back in Philly, where he began his journey to become one of the funniest comedians of all time. You will laugh 'til it hurts. Read more: Synopsis",
    "2011_199": "When their young son is diagnosed with a brain tumor, young parents Romeo and Juliette unite in the fight for his survival.",
    "2011_2": "The Autobots learn of a Cybertronian spacecraft hidden on the moon, and race against the Decepticons to reach it and to learn its secrets.",
    "2011_20": "Playing around while aboard a cruise ship, the Chipmunks and Chipettes accidentally go overboard and end up marooned in a tropical paradise. They discover their new turf is not as deserted as it seems.",
    "2011_200": "In the lost holy land of Milos, the Elrics search for the truth behind an unknown form of alchemy. What secrets are hidden in Milos? Riddles must be solved and dangers faced before the truth can be found.",
    "2011_201": "Four years after graduation, an awkward high school genius uses his sister's boyfriend's Labor Day party as the perfect opportunity to make his move on his high school crush.",
    "2011_202": "Albert Nobbs struggles to survive in late 19th-century Ireland, where women aren't encouraged to be independent. Posing as a man so she can work as a butler in Dublin's most elegant hotel, Albert meets a handsome painter and looks to ...See moreAlbert Nobbs struggles to survive in late 19th-century Ireland, where women aren't encouraged to be independent. Posing as a man so she can work as a butler in Dublin's most elegant hotel, Albert meets a handsome painter and looks to escape the lie she has been living.See less",
    "2011_203": "A group of Lebanese women try to ease religious tensions between Christians and Muslims in their village.",
    "2011_204": "As a director and his crew shoot a controversial film about Christopher Columbus in Cochabamba, Bolivia, local people rise up against plans to privatize the water supply.",
    "2011_205": "A troubled husband and executive adopts a beaver hand-puppet as his sole means of communication.",
    "2011_206": "Twins journey to the Middle East to discover their family history and fulfill their mother's last wishes.",
    "2011_207": "Abandoned by his father, a young boy is left in a state-run youth farm. In a random act of kindness, the town hair-dresser agrees to foster him on week-ends.",
    "2011_208": "After the death of his wife and child, an author travels to Barcelona to see his estranged brother and dying father, where he learns that his life is plagued by events that occur on 11/11/11.",
    "2011_209": "Don turns himself in and escapes with Vardhaan from prison, following which he recruits a team to steal currency printing plates from a bank in Berlin.",
    "2011_21": "In the near future, robot boxing is a top sport. A struggling ex-boxer feels he's found a champion in a discarded robot.",
    "2011_210": "In 1921, England is overwhelmed by the loss and grief of World War I. Hoax exposer Florence Cathcart visits a boarding school to explain sightings of a child ghost. Everything she believes unravels as the 'missing' begin to show themselves.",
    "2011_211": "An irreverent young woman who uses her humor to prevent matters from getting serious has a life-changing visit with her doctor. Read more: Synopsis",
    "2011_212": "A look at French president Nicolas Sarkozy's rise to power.",
    "2011_213": "A teen gang in South London defend their block from an alien invasion.",
    "2011_214": "The adventures of supernatural private investigator, Dylan Dog, who seeks out the monsters of the Louisiana bayou in his signature red shirt, black jacket, and blue jeans.",
    "2011_215": "A chilling vision of the House of Saddam Hussein comes to life through the eyes of the man who was forced to become the double of Hussein's sadistic son.",
    "2011_216": "Former skateboard champion Kim wants to make more money after her mother's tragic death. She joins the elite posh servicing company, which sends her off to Austria.",
    "2011_217": "Three wives engage the services of a private investigator after they suspect their respective husbands of infidelity.",
    "2011_218": "A tale of revenge, honor and disgrace, centering on a poverty-stricken samurai who discovers the fate of his ronin son-in-law, setting in motion a tense showdown of vengeance against the house of a feudal lord.",
    "2011_219": "Two children living in different countries are visited nightly by a faceless being who wants to take possession of them.",
    "2011_22": "Competition between the maid of honor and a bridesmaid, over who is the bride's best friend, threatens to upend the life of an out-of-work pastry chef.",
    "2011_220": "A vengeful gangster targets and terrorizes an entire police unit and their families.",
    "2011_221": "Three friends decide to turn their fantasy vacation into reality after one of their friends gets engaged. Read more: Synopsis",
    "2011_222": "Set in 1980s Nottingham, social worker Margaret Humphreys holds the British government accountable for child migration schemes and reunites the children involved -- now adults living mostly in Australia -- with their parents in Britain. Read more: Synopsis",
    "2011_223": "Haunted by painful memories and increasing paranoia, a damaged woman struggles to re-assimilate with her family after fleeing an abusive cult.",
    "2011_224": "A retired CIA operative is paired with a young FBI agent to unravel the mystery of a senator's murder, with all signs pointing to a Soviet assassin.",
    "2011_225": "An indigenous clan-based people living in harmony with nature find their way of life threatened when violent interlopers from another culture arrive, intent on seizing their natural resources and enslaving them.",
    "2011_226": "Railroad executive Dagny Taggart and steel mogul Henry Rearden form an alliance to fight the increasingly authoritarian government of the United States.",
    "2011_227": "Two boys come of age in Sweden during World War II.",
    "2011_228": "Sint-Truiden, Belgium. Jacky, a young cattle farmer who is constantly pumped on steroids and hormones, is approached by a veterinarian to make a deal with a notorious beef trader.",
    "2011_229": "A man caught in the middle of two simultaneous robberies at the same bank desperately tries to protect the teller with whom he's secretly in love.",
    "2011_23": "During the summer of 1979, a group of friends witness a train crash and investigate subsequent unexplained events in their small town.",
    "2011_230": "An examination of the life of acclaimed 'horse whisperer' Buck Brannaman, who recovered from years of child abuse to become a well-known expert in the interactions between horses and people.",
    "2011_231": "After a disastrous debut on the pro circuit, a young golfer finds himself unexpectedly stranded in Utopia, Texas and welcomed by an eccentric rancher.",
    "2011_232": "Arising out of the horror of the Spanish Civil War, a candidate for canonization is investigated by a journalist who discovers his own estranged father had a deep, dark and devastating connection to the saint's life.",
    "2011_233": "Set in Algeria in the 1920s, a rabbi's cat who learns how to speak after swallowing the family parrot expresses his desire to convert to Judaism.",
    "2011_234": "A Latina spin on Jane Austen's \"Sense and Sensibility,\" where two spoiled sisters who have been left penniless after their father's sudden death are forced to move in with their estranged aunt in East Los Angeles.",
    "2011_235": "Susanna's quest for love leads to a series of marriages, each ending in the mysterious death of her latest husband.",
    "2011_236": "15-year-old Oliver Tate has two objectives: To lose his virginity before his next birthday, and to extinguish the flame between his mother and an ex-lover who has resurfaced in her life.",
    "2011_237": "Steve Coogan has been asked by The Observer to tour the country's finest restaurants, but after his girlfriend backs out on him he must take his best friend and source of eternal aggravation, Rob Brydon.",
    "2011_238": "Plagued by a series of apocalyptic visions, a young husband and father questions whether to shelter his family from a coming storm, or from himself.",
    "2011_239": "A British college student falls for an American student, only to be separated from him when she's banned from the U.S. after overstaying her visa.",
    "2011_24": "Rango is an ordinary chameleon who accidentally winds up in the town of Dirt, a lawless outpost in the Wild West in desperate need of a new sheriff.",
    "2011_240": "A historical drama based on the founding of the Republic of China when nationalist forces led by Sun Yat-sen overthrew the Qing Dynasty.",
    "2011_241": "A French journalist in Afghanistan is kidnapped by the Taliban.",
    "2011_242": "The story of King George VI, his impromptu ascension to the throne of the British Empire in 1936, and the speech therapist who helped the unsure monarch overcome his stammer.",
    "2011_243": "Sam Childers is a former drug-dealing biker tough guy who found God and became a crusader for hundreds of Sudanese children who've been forced to become soldiers.",
    "2011_244": "Set three years after Dragon Inn, innkeeper Jade has disappeared and a new inn has risen from the ashes - one that's staffed by marauders masquerading as law-abiding citizens, who hope to unearth the fabled lost city buried in the desert.",
    "2011_245": "Since his beloved violin was broken, Nasser Ali Khan, one of the most renowned musicians of his day, has lost all taste for life. Finding no instrument worthy of replacing it, he decides to confine himself to bed to await death.",
    "2011_246": "Agent Jesus Juarez (aka Chucho) has always played the Devil in his town's Nativity Play. This Christmas, when the new pastor of the church recasts the role, the two men engage in a battle between good and evil.",
    "2011_247": "The wife of a British Judge is caught in a self-destructive love affair with a Royal Air Force pilot. Read more: Synopsis",
    "2011_248": "The lives of four people intersect in Mumbai: a washer-man who wants to become an actor, a banker-turned-photographer, a painter looking for inspiration, and a newly-married immigrant who journals her experiences on home video.",
    "2011_249": "A beautiful, animated story about the impact of God's grace, and of unseen spiritual influences in our daily lives, especially during our participation in the Holy Mass.",
    "2011_25": "Journalist Mikael Blomkvist is aided in his search for a woman who has been missing for forty years by Lisbeth Salander, a young computer hacker.",
    "2011_250": "Charts the headlong fall of Pinkie, a razor-wielding disadvantaged teenager with a religious death wish.",
    "2011_251": "As his lover announces her pregnancy, a fortysomething slacker receives other life-changing news: 142 people, all of them the result of artificial insemination, have filed a class action lawsuit against him, their biological father.",
    "2011_252": "Gianni is a retiree who has become invisible to most everyone around him. In response, he tries his best to generate some kind of extracurricular love life.",
    "2011_253": "When an alcoholic relapses, causing him to lose his wife and his job, he holds a yard sale on his front lawn in an attempt to start over. A new neighbor might be the key to his return to form.",
    "2011_254": "The 2002 Melbourne Cup horse race, brotherly love and the triumph of the human spirit. A true story.",
    "2011_255": "A kid from the Midwest moves out to Hollywood in order to follow in his parents footsteps, and become a porn star.",
    "2011_256": "The story of a terminally ill teenage girl who falls for a boy who likes to attend funerals and their encounters with the ghost of a Japanese kamikaze pilot from WWII.",
    "2011_257": "Eliezer and Uriel Shkolnik are father and son as well as rival professors in Talmudic Studies. When both men learn that Eliezer will be lauded for his work, their complicated relationship reaches a new peak.",
    "2011_258": "Everything can change in an instant, and take a lifetime to unravel. Every day, we have the opportunity to rebuild relationships by extending and receiving God's grace. Offer The Grace Card, and never underestimate the power of God's love.",
    "2011_259": "Twelve-year-old Koichi, who has been separated from his brother Ryunosuke due to his parents' divorce, hears a rumor that the new bullet trains will precipitate a wish-granting miracle when they pass each other at top speed.",
    "2011_26": "Following the death of his father, Britt Reid, heir to his father's large company, teams up with his late dad's assistant Kato to become a masked crime fighting team.",
    "2011_260": "Two friends lose their jobs, then part bitterly after they get exposed as male strippers.",
    "2011_261": "A Sicilian family deals with the arrival of a group of immigrants on their island.",
    "2011_262": "When a sudden illness and an unexpected reunion threaten dutiful housewife Elena's potential inheritance, she must hatch a desperate plan ...",
    "2011_263": "A profile of the noted and extraordinarily cheerful veteran New York City fashion photographer.",
    "2011_264": "Released from prison for a crime he didn't commit, an ex-con targets the same bank he was sent away for robbing. Read more: Synopsis",
    "2011_265": "Elizabeth Hunter controls all in her life - society, her staff, her children; but the once great beauty will now determine her most defiant act as she chooses her time to die.",
    "2011_266": "A group of men set out in search of a dead body in the Anatolian steppes.",
    "2011_267": "A tale of revenge, honor and greed follows a group of misfits that gets involved with a kitchen cleaver made from the top five swords of the martial arts world in this wild and brash action comedy.",
    "2011_268": "In London, a mother and daughter navigate their respective romances: Madeline rekindles an affair from thirty years earlier, while her daughter Vera is caught between a musician who cannot commit and her ex, who still pines for her.",
    "2011_269": "On the night of the discovery of a duplicate Earth in the Solar system, an ambitious young student and an accomplished composer cross paths in a tragic accident.",
    "2011_27": "Theseus is a mortal man chosen by Zeus to lead the fight against the ruthless King Hyperion, who is on a rampage across Greece to obtain a weapon that can destroy humanity.",
    "2011_270": "George, a lonely and fatalistic teen who has made it all the way to his senior year without ever having done a real day of work, is befriended by Sally, a popular but complicated girl who recognizes in him a kindred spirit.",
    "2011_271": "In the early 70s, Cathy Rush becomes the head basketball coach at a tiny, all-girls Catholic college. Though her team has no gym and no uniforms -- and the school itself is in danger of being sold -- Coach Rush looks to steer her girls to ...See moreIn the early 70s, Cathy Rush becomes the head basketball coach at a tiny, all-girls Catholic college. Though her team has no gym and no uniforms -- and the school itself is in danger of being sold -- Coach Rush looks to steer her girls to their first national championship.See less",
    "2011_272": "Ricardo, a hard-working family man, gets an unexpected promotion, but the pressures of a top- level management position reward him with the ultimate let-down: erectile dysfunction.",
    "2011_273": "Set in Middle America, a group of teens receive an online invitation for sex, though they soon encounter fundamentalists with a much more sinister agenda.",
    "2011_274": "A drama based on the experiences of Kathryn Bolkovac, a Nebraska cop who served as a peacekeeper in post-war Bosnia and outed the U.N. for covering up a sex trafficking scandal.",
    "2011_275": "A gardener in East L.A. struggles to keep his son away from gangs and immigration agents while trying to give his son the opportunities he never had.",
    "2011_276": "Madrid, in the seventeenth century. Abandoned at the doorstep of a monastery, Ambrosio has been brought up by the Capucin Friars. After becoming a friar himself, he becomes an unrivaled preacher whose sermons draw crowds and earn him the ...See moreMadrid, in the seventeenth century. Abandoned at the doorstep of a monastery, Ambrosio has been brought up by the Capucin Friars. After becoming a friar himself, he becomes an unrivaled preacher whose sermons draw crowds and earn him the admiration of all. Admired for his extreme rigor and absolute virtue, Ambrosio is certain he is safe from any temptation. But Satan has not said his final word...  Written by Guy BellingerSee less",
    "2011_277": "A wealthy man invites four people to his private island to blame three of them for his daughter's sudden death. The next morning, the wealthy man is found murdered.",
    "2011_278": "Tales of the Night weaves together six exotic fables each unfolding in a unique locale, from Tibet, to medieval Europe, to the Land of the Dead. From the imagination of internationally renowned animator Michel Ocelot.",
    "2011_279": "In Skoddeheimen, Norway, 15-year-old Alma is consumed by her hormones and fantasies that range from sweetly romantic images of Artur, the boyfriend she yearns for, to daydreams about practically everybody she lays eyes on.",
    "2011_28": "Reckless test pilot Hal Jordan is granted an alien ring that bestows him with otherworldly powers that inducts him into an intergalactic police force, the Green Lantern Corps.",
    "2011_280": "A poor boy of unknown origins is rescued from poverty and taken in by the Earnshaw family where he develops an intense relationship with his young foster sister, Cathy.",
    "2011_281": "Martin, a mercenary, is sent from Europe by a mysterious biotech company to the Tasmanian wilderness on a hunt for the last Tasmanian tiger.",
    "2011_282": "The population of Detroit has almost completely disappeared, but a few remain. As daylight disappears they realize that the Dark is coming for them.",
    "2011_283": "Janardhan Jakhar chases his dreams of becoming a big Rock star, during which he falls in love with Heer.",
    "2011_284": "A married Canadian travels to India to re-unite with his estranged father and brother but faces obstacles and challenges.",
    "2011_285": "Director Tom Shadyac speaks with intellectual and spiritual leaders about what's wrong with our world and how we can improve both it and the way we live in it.",
    "2011_286": "A corrupt police officer is entrusted the task of apprehending drug-dealers.",
    "2011_287": "A war, religious conflicts, and misunderstandings create obstacles for a couple of different faiths.",
    "2011_288": "A portrait of famed Chilean singer and folklorist Violeta Parra filled with her musical work, her memories, her loves and her hopes.",
    "2011_289": "A family moves into a new neighborhood, and a 10-year-old named Laure deliberately presents as a boy named Mikhael to the neighborhood children.",
    "2011_29": "An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African American maids' point of view on the white families for which they work, and the hardships they go through on a daily basis.",
    "2011_290": "In Apartheid-torn South Africa, poet Ingrid Jonker (Carice van Houten) struggles tragically in search of love and a sense of home.",
    "2011_291": "One day in the life of Anders, a young recovering drug addict, who takes a brief leave from his treatment center to interview for a job and catch up with old friends in Oslo.",
    "2011_293": "A group of 30-year-olds who have been friends since high school attempt to throw an end-of-summer orgy. Read more: Synopsis",
    "2011_294": "Collective screening of the Academy Award nominated short films from the Live Action category for 2011.",
    "2011_295": "A crime writer living in Venice while working on his new novel meets and soon marries his real-estate agent. Relocated to a remote house on Sant'Erasmo Island, his obsession with his wife's daily whereabouts takes a dark turn.",
    "2011_296": "Based on true events, 16 year-old Jamie falls in with his mother's new boyfriend and his crowd of self-appointed neighborhood watchmen, a relationship that leads to a spree of torture and murder.",
    "2011_297": "In the Texas bayous, a local homicide detective teams up with a cop from New York City to investigate a series of unsolved murders.",
    "2011_298": "A police officer looks to talk down a young man lured by his lover's husband to the ledge of a high rise, where he has one hour to contemplate a fateful decision.",
    "2011_299": "A cynical American expatriate struggles to decide whether or not he should help his former lover and her fugitive husband escape French Morocco.",
    "2011_3": "Jack Sparrow and Barbossa embark on a quest to find the elusive fountain of youth, only to discover that Blackbeard and his daughter are after it too.",
    "2011_30": "A lazy, incompetent middle school teacher who hates her job, her students, and her co-workers is forced to return to teaching to make enough money for breast implants after her wealthy fiance dumps her.",
    "2011_300": "Settlers traveling through the Oregon desert in 1845 find themselves stranded in harsh conditions.",
    "2011_301": "During the Bosnian War, Danijel, a soldier fighting for the Serbs, re-encounters Ajla, a Bosnian who's now a captive in his camp he oversees. Their once promising connection has become ambiguous as their motives have changed.",
    "2011_302": "Michael Rapaport documents the inner workings and behind the scenes drama that follows this innovative and influential band to this day.",
    "2011_303": "The story of an 84 year-old Kenyan villager and ex Mau Mau veteran who fights for his right to go to school for the first time to get the education he could never afford.",
    "2011_304": "In Paris during WWII, an Algerian immigrant is inspired to join the resistance by his unexpected friendship with a Jewish man.",
    "2011_305": "The true story of Danny Greene, a tough Irish thug working for mobsters in Cleveland during the 1970's.",
    "2011_306": "After a drunken house party with his straight mates, Russell heads out to a gay club. Just before closing time he picks up Glen but what's expected to be just a one-night stand becomes something else, something special.",
    "2011_307": "This movie focuses on a dozen of the five hundred characters depicted in Bruegel's painting. The theme of Christ's suffering is set against religious persecution in Flanders in 1564.",
    "2011_308": "Suave Harvard Medical School grad Ray Howard seems destined to specialize in womanizing. That is, until he heads to Florida to intern under the tutelage of chief resident Dr. Sidney Zachary. With help from his girlfriend, \"Dr. Z\" sets out ...See moreSuave Harvard Medical School grad Ray Howard seems destined to specialize in womanizing. That is, until he heads to Florida to intern under the tutelage of chief resident Dr. Sidney Zachary. With help from his girlfriend, \"Dr. Z\" sets out to mold Ray into a caring, responsible doctor. Along the way, he shares some important truths and a whole lot of humor in this sexy romantic comedy.  Written by AnonymousSee less",
    "2011_309": "A young cop is assigned to a precinct in the working class neighborhood where he grew up, and an old secret threatens to destroy his life and his family.",
    "2011_31": "On a weekend trip to Hawaii, a plastic surgeon convinces his loyal assistant to pose as his soon-to-be-divorced wife in order to cover up a careless lie he told to his much-younger girlfriend.",
    "2011_310": "Unprecedented access to the New York Times newsroom yields a complex view of the transformation of a media landscape fraught with both peril and opportunity.",
    "2011_311": "Martín and Mariana are slightly damaged people who live in buildings just opposite one another. While they often don't notice each other, separation might be the very thing that brings them together.",
    "2011_312": "In Bolivia, Butch Cassidy (now calling himself James Blackthorn) pines for one last sight of home, an adventure that aligns him with a young robber and makes the duo a target for gangs and lawmen alike.",
    "2011_313": "A 12 year old cold case is reopened when three teens are missing in an old abandoned road where a gruesome murder is left undiscovered for three decades.",
    "2011_314": "A chef and a scientist fall in love as an epidemic begins to rob people of their sensory perceptions.",
    "2011_315": "A riveting portrait of the great writer whose stories became the basis of the Broadway musical Fiddler on the Roof. Sholem Aleichem: Laughing in the Darkness tells the tale of the rebellious genius who created an entirely new literature. ...See moreA riveting portrait of the great writer whose stories became the basis of the Broadway musical Fiddler on the Roof. Sholem Aleichem: Laughing in the Darkness tells the tale of the rebellious genius who created an entirely new literature. Plumbing the depths of a Jewish world locked in crisis and on the cusp of profound change, he captured that world with brilliant humor. Sholem Aleichem was not just a witness to the creation of a new modern Jewish identity, but one of the very men who forged it.  Written by AnonymousSee less",
    "2011_316": "When a couple decides to adopt a stray cat their perspective on life changes radically, literally altering the course of time and space and testing their faith in each other and themselves.",
    "2011_317": "A story centered on four students coming of age during a year at their school, St. Marks.",
    "2011_318": "Captures a generational moment - young people on the cusp of truly growing up, tiring of their reflexive cynicism, each in their own ways struggling to connect and define what it means to love and be loved.",
    "2011_319": "A chronicle of one woman's lifelong struggle with her faith.",
    "2011_32": "A squad of U.S. Marines becomes the last line of defense against a global invasion.",
    "2011_320": "A gang of innocent but feisty kids who lead carefree lives in Chandan Nagar colony takes on the big bad world of politics when one of their friend's life is endangered.",
    "2011_321": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
    "2011_322": "Through his work at a morgue, an incarcerated young man trying to build a new life starts to come to terms with the crime he committed.",
    "2011_323": "A Brooklyn teenager juggles conflicting identities and risks friendship, heartbreak, and family in a desperate search for sexual expression.",
    "2011_324": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
    "2011_325": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
    "2011_326": "A homeless vigilante blows away crooked cops, pedophile Santas, and other scumbags with his trusty pump-action shotgun.",
    "2011_327": "Examines the profound claim that most, if not all, of the degenerative diseases that afflict us can be controlled, or even reversed, by rejecting our present menu of animal-based and processed foods.",
    "2011_328": "A documentary on a former Miss Wyoming who is charged with abducting and imprisoning a young Mormon Missionary.",
    "2011_329": "A truly honest police officer is transferred to a town controlled by a gangster he has humiliated. The gangster believes he can use good power to bring down this officer who made him look foolish and weak.",
    "2011_33": "Three friends conspire to murder their awful bosses when they realize they are standing in the way of their happiness.",
    "2011_330": "A documentary on the German artist that includes glimpses at his studio, which has not been seen in decades.",
    "2011_331": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2011_332": "A documentary about branding, advertising and product placement that is financed and made possible by brands, advertising and product placement. Read more: Synopsis",
    "2011_333": "Joseph, a man plagued by violence and a rage that is driving him to self-destruction, earns a chance of redemption that appears in the form of Hannah, a Christian charity shop worker.",
    "2011_334": "A wedding at her parents' Annapolis estate hurls high-strung Lynn into the center of touchy family dynamics.",
    "2011_335": "A college lecturer flees to Paris after a scandal costs him his job. In the City of Light, he meets a widow who might be involved in a series of murders.",
    "2011_336": "The story of a bullied fifteen-year-old boy in a small town as he struggles to adjust to his difficult life.",
    "2011_337": "Two rival con-men attempt to outdo each other to woo a wealthy woman.",
    "2011_338": "Fifty years ago there were close to half-a-million lions in Africa. Today there are around 20,000. To make matters worse, lions, unlike elephants, which are far more numerous, have virtually no protection under government mandate or ...See moreFifty years ago there were close to half-a-million lions in Africa. Today there are around 20,000. To make matters worse, lions, unlike elephants, which are far more numerous, have virtually no protection under government mandate or through international accords. This is the jumping-off point for a disturbing, well-researched and beautifully made cri de coeur from husband and wife team Dereck and Beverly Joubert, award-winning filmmakers from Botswana who have been Explorers-in-Residence at National Geographic for more than four years. Pointing to poaching as a primary threat while noting the lion's pride of place on the list for eco-tourists-an industry that brings in 200 billion dollars per year worldwide-the Jouberts build a solid case for both the moral duty we have to protect lions (as well as other threatened \"big cats,\" tigers among them) and the economic sense such protection would make. And when one takes into account the fact that big cats are at the very top of the food chain-and that their elimination would wreak havoc on all species below them, causing a complete ecosystem collapse-the need takes on a supreme urgency.  Written by Palm Springs Internation Film FestivalSee less",
    "2011_339": "A beautiful real-estate agent (Peiru) gets drunk at a karaoke bar and throws up on a principled, lonely cop (Zhendong). Zhendong quickly falls for the flirtatious Peiru despite the fact that she's having a tortuous affair with a married ...See moreA beautiful real-estate agent (Peiru) gets drunk at a karaoke bar and throws up on a principled, lonely cop (Zhendong). Zhendong quickly falls for the flirtatious Peiru despite the fact that she's having a tortuous affair with a married man. As Peiru gradually abandons her materialistic values and falls in love with the good hearted Zhendong, it becomes apparent that he is suffering from a disease that is robbing him of his mental faculties.  Written by AnonymousSee less",
    "2011_34": "In 1988, young sisters Katie and Kristi befriend an invisible entity who resides in their home.",
    "2011_340": "A journalist, who is more of an activist teams up with the sister of a murdered model, as she gets interested in the case and wants to bring justice to her case.",
    "2011_341": "A cop with a connection to the criminal underworld finds his secret life exposed when he and his partner are caught stealing cocaine from a powerful drug dealer, a move that puts his son's life in jeopardy.",
    "2011_342": "Tells the story of a chimpanzee taken from its mother at birth and raised like a human child by a family in a brownstone on the upper West Side in the 1970s.",
    "2011_343": "A documentary shot by film-makers all over the world that serves as a time capsule to show future generations what it was like to be alive on the twenty-fourth of July, 2010.",
    "2011_344": "A teenage girl is targeted by an online sexual predator.",
    "2011_345": "12-year-old Mei grew up with her grandparents in the mountains, but now lives with her parents in the city. Her parents constantly fight and she ignored at home. Mei withdraws into her own world and imagination.",
    "2011_346": "A young woman witnesses a bus accident, and is caught up in the aftermath, where the question of whether or not it was intentional affects many people's lives.",
    "2011_347": "A wealthy Iranian family struggles to contain a teenager's growing sexual rebellion and her brother's dangerous obsession.",
    "2011_348": "In the back country of Louisiana, a group of friends unearth a terrible secret that unleashes a monster from the depths of the swamp.",
    "2011_349": "A happy newlywed marriage counselor's views on wedded bliss get thrown for a loop when she finds out her parents are getting divorced.",
    "2011_35": "Separated by a garden fence and a feud, are blue gnomes on one side and red gnomes on the other. This doesn't stop blue Gnomeo and red Juliet from falling in love with each other. Do they have a future together?",
    "2011_350": "A chronicle of the romance between Camille and Sullivan, which begins during their adolescence and picks up after Sullivan's 8-year absence from exploring the world.",
    "2011_351": "A female convict on death row, her last wish is to tell her story to the media.",
    "2011_352": "A romantic drama that charts the lives of three women from different backgrounds, forever changed when they emigrate to New Zealand as war brides.",
    "2011_353": "A documentary on the band Pearl Jam that marks their 20th anniversary in the year 2011.",
    "2011_354": "An on-the-run convict looking for temporary cover finds it at the house of a very colorful character.",
    "2011_355": "Nearly a year after a botched job, a hitman takes a new assignment with the promise of a big payoff for three killings. What starts off as an easy task soon unravels, sending the killer into the heart of darkness. Read more: Synopsis",
    "2011_356": "A young boy has lost his mother and is losing touch with his father and the world around him. Then he meets Hesher who manages to make his life even more chaotic.",
    "2011_357": "When a rebellious teenager finds out that she is already eight weeks pregnant, she forms a pact with sixteen of her classmates to get pregnant simultaneously, raise their children together, and most of all, be in charge of their lives.",
    "2011_358": "A young princess is the subject of a tug-of-war among witches, as each struggles to find the suitable antidote to a death sentence inculcated by an evil sister.",
    "2011_359": "The story of two brothers' quest for fame, love and revenge in the heyday of Shanghai opera.",
    "2011_36": "The life of a businessman begins to change after he inherits six penguins, and as he transforms his apartment into a winter wonderland, his professional side starts to unravel.",
    "2011_360": "After his wife falls under the influence of a drug dealer, an everyday guy transforms himself into Crimson Bolt, a superhero with the best intentions, but lacking in heroic skills.",
    "2011_361": "A haunting portrait of Lucy, a young university student drawn into a mysterious hidden world of unspoken desires.",
    "2011_362": "Driven by the tragic and fatal car crash that took the life of his fifteen year old brother Luke, and wearing Luke's number 5 jersey, Jon Abbate helps to lead the Wake Forest Demon Deacons to the most successful season in school history.",
    "2011_363": "In a world of vampires, an expert vampire hunter and his young protege travel toward sanctuary.",
    "2011_364": "Mastering the magical elements of Wind, Fire, Water and Earth, a down-on-her-luck college student finds herself caught up in a battle among wizards holding the key to prevent the destruction of the universe.",
    "2011_365": "Conversations with death row inmate Michael Perry and those affected by his crime serve as an examination of why people - and the state - kill.",
    "2011_366": "Amid a strict Muslim rearing and a social life he's never had, Tariq enters college confused. New peers, family and mentors help him find his place, but the 9-11 attacks force him to face his past and make the biggest decisions of his life.",
    "2011_367": "Documentary telling the compelling story of the 40th Irish Dancing World Championships.",
    "2011_368": "A mother and her three grown daughters juggle are successful in everything except love - until they unexpectedly encounter new romances in Beijing, Sydney and even on the moon.",
    "2011_369": "Reluctantly, a dour long-distance truck driver agrees to give a lift to a Paraguayan single mother and her five-month-old daughter to Buenos Aires. Can the palpable silence soften up the taciturn trucker's sullen heart?",
    "2011_37": "In 1931 Paris, an orphan living in the walls of a train station gets wrapped up in a mystery involving his late father and an automaton.",
    "2011_370": "Chef Ferran Adrià spends half the year making new culinary creations for his restaurant.",
    "2011_371": "A smooth and charming conman, Ricky Bahl, cons girls for a living but finally meets his match is this fun-filled \"ROM-CON.\"",
    "2011_372": "A professor in the film department at a provincial university goes to Seoul to meet his senior, who works as a film critic, and stays in a northern Seoul village for three days.",
    "2011_373": "A drama set centered around the war between Russia and Georgia, and focused on an American journalist, his cameraman, and a Georgian native who become caught in the crossfire. Read more: Synopsis",
    "2011_374": "Thirteen year-old Marta has recently moved back to southern Italy with her mother and older sister and struggles to find her place, restlessly testing the boundaries of an unfamiliar city and the catechism of the Catholic church.",
    "2011_375": "The Muppet Elmo is one of the most beloved characters among children across the globe. Meet the unlikely man behind the puppet - the heart and soul of Elmo - Kevin Clash.",
    "2011_376": "Khodorkovsky, the richest Russian, challenges President Putin. A fight of the titans begins. Putin warns him. But Khodorkovsky comes back to Russia knowing that he will be imprisoned, once he returns. When I heard about it, I asked myself:...See moreKhodorkovsky, the richest Russian, challenges President Putin. A fight of the titans begins. Putin warns him. But Khodorkovsky comes back to Russia knowing that he will be imprisoned, once he returns. When I heard about it, I asked myself: why didn't he stay in exile with a couple of billions? Why did he do that? A personal journey to Khodorkovsky.  Written by AnonymousSee less",
    "2011_377": "A filmmaker sets out to discover the life of Joyce Vincent, who died in her bedsit in North London in 2003. Her body wasn't discovered for three years, and newspaper reports offered few details of her life - not even a photograph. Read more: Synopsis",
    "2011_378": "A year in the life of a city grappling with urban violence.",
    "2011_379": "Footage shot by a group of Swedish journalists documenting the Black Power Movement in the United States is edited together by a contemporary Swedish filmmaker.",
    "2011_38": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.",
    "2011_380": "A documentary on Conan O'Brien's comedy tour of the U.S. and Canada after leaving his post at \"The Tonight Show\" and severing his relationship with NBC.",
    "2011_381": "On the eve of the annual Scarecrow Festival, two St. Charles police officers search for a return killer the same night four teenagers go missing on Munger Road.",
    "2011_382": "From civil rights to the anti-war movement to the struggles of workers, folksinger Phil Ochs wrote topical songs that engaged his audiences in the issues of the 1960s and 70s. In this biographical documentary, veteran director Kenneth ...See moreFrom civil rights to the anti-war movement to the struggles of workers, folksinger Phil Ochs wrote topical songs that engaged his audiences in the issues of the 1960s and 70s. In this biographical documentary, veteran director Kenneth Bowser shows how Phil's music and his fascinating life story and eventual decline into depression and suicide were intertwined with the history-making events that defined a generation. Even as his contemporaries moved into folk-rock and pop music, Phil followed his own vision, challenging himself and his listeners. Not one to pull punches, Ochs never achieved the commercial success he desperately desired. But his music remains relevant, reaching new audiences in a generation that finds his themes all too familiar.  Written by AnonymousSee less",
    "2011_383": "Tale of a father who struggles to bond with his estranged son Gabriel, after Gabriel suffers from a brain tumor that prevents him from forming new memories. With Gabriel unable to shed the beliefs and interests that caused their physical ...See moreTale of a father who struggles to bond with his estranged son Gabriel, after Gabriel suffers from a brain tumor that prevents him from forming new memories. With Gabriel unable to shed the beliefs and interests that caused their physical and emotional distance, Henry must learn to embrace his son's choices and try to connect with him through music.  Written by AnonymousSee less",
    "2011_384": "Tells the story of five people from the last generation of Soviet children who were brought up behind the Iron Curtain. Just coming of age when the USSR collapsed, they witnessed the world of their childhood crumble and change beyond ...See moreTells the story of five people from the last generation of Soviet children who were brought up behind the Iron Curtain. Just coming of age when the USSR collapsed, they witnessed the world of their childhood crumble and change beyond recognition. Through the lives of these former schoolmates, this intimate film reveals how they have adjusted to their post-Soviet reality in today's Moscow.  Written by AnonymousSee less",
    "2011_385": "A touching mother-daughter relationship that reflects the modern South Africa.",
    "2011_386": "A man wakes in a car wreck at the bottom of a ravine must overcome incredible odds to survive.",
    "2011_387": "A story of incomprehensible abuse delivered by an explosively violent mother of four. Journey through the mind of a child that experiences a living hell, defined and defended by the twisted religious beliefs of her mother.",
    "2011_388": "Purge: To put to death, eliminate what is undesirable. The serial killer known as Purge lived and died by this code. But is he dead? Driving home from a road trip, ERIC and SHELLY take a back road to avoid a traffic jam. They encounter the...See morePurge: To put to death, eliminate what is undesirable. The serial killer known as Purge lived and died by this code. But is he dead? Driving home from a road trip, ERIC and SHELLY take a back road to avoid a traffic jam. They encounter the serial killer Purge. Eric survives but Shelly is murdered. A year later, a group of adventure-seeking high school grads venture to purge's lair. Among them is Eric's brother JUAN. Eric sets out to save his brother, and get revenge on Purge. For the six teens, their imperfections will be the deciding factor if Purge shows them mercy. But if everyone is imperfect, will any of them survive?  Written by Armont CasalleSee less",
    "2011_389": "A college freshman's world is rocked when she learns she is the adopted survivor of a failed abortion.",
    "2011_39": "E.B., the Easter Bunny's teenage son, heads to Hollywood, determined to become a drummer in a rock 'n' roll band. In LA, he's taken in by Fred after the out-of-work slacker hits E.B. with his car.",
    "2011_390": "An examination of the lives, needs, troubles and hopes of prostitutes in Thailand, Bangladesh and Mexico.",
    "2011_391": "Enroute to her destination via plane, a busy executive gets stranded with a middle-classed fast-talking male.",
    "2011_392": "A fictional account of events during the Philippine-American War.",
    "2011_393": "A son's riveting look at a father whose life seemed straight out of a spy thriller. The secret world of a legendary CIA spymaster. Told by William Colby's son Carl, the story is at once a probing history of the CIA, a personal memoir of a ...See moreA son's riveting look at a father whose life seemed straight out of a spy thriller. The secret world of a legendary CIA spymaster. Told by William Colby's son Carl, the story is at once a probing history of the CIA, a personal memoir of a family living in clandestine shadows, and an inquiry into the hard costs of a nation's most cloaked actions.  Written by Act 4 EntertainmentSee less",
    "2011_394": "A student must decide between follwing her dream to become a dancer, or to follow the wishes of her family.",
    "2011_395": "A story set in the former Yugoslavia and centered on a guy who returns to Herzegovina from Germany with plenty of cash and hopes for a good new life.",
    "2011_396": "Two friends spend all their free time building flame-throwers and weapons of mass destruction in hopes that a global apocalypse will occur and clear the runway for their imaginary gang \"Mother Medusa\".",
    "2011_397": "Inspired by the fictional Dr. Heiter, disturbed loner Martin dreams of creating a 12-person centipede and sets out to realize his sick fantasy.",
    "2011_398": "Riva is an operator, a man with charm and ambition in equal measure. Kinshasa is an inviting place. With petrol in short supply in DRC's capital, he and his sidekick pursue a plot to get hold of a secret cache - barrels of fuel they can ...See moreRiva is an operator, a man with charm and ambition in equal measure. Kinshasa is an inviting place. With petrol in short supply in DRC's capital, he and his sidekick pursue a plot to get hold of a secret cache - barrels of fuel they can sell for a huge profit. Of course they're not the only ones who want the stuff. Cesar is a ruthless, sharply dressed foreigner thriving in Kinshasa's lawless streets. A female military officer joins the fray. Even the church will betray its tenets for a piece of the action. But Riva's main nemesis is Azor, a crime boss in the classic style: big, decadent and brutal. He's not a man to mess with, but his girlfriend, Nora, may just be the most seductive woman in all of DRC. Riva catches sight of her dancing at a nightclub and it's not long before Nora matches the fuel cache as a coveted object of his lust.  Written by AnonymousSee less",
    "2011_399": "A rural farmer is forced to confront the mortality of his faithful horse.",
    "2011_4": "The Quileutes close in on expecting parents Edward and Bella, whose unborn child poses a threat to the Wolf Pack and the towns people of Forks.",
    "2011_40": "Young Albert enlists to serve in World War I after his beloved horse is sold to the cavalry. Albert's hopeful journey takes him out of England and to the front lines as the war rages on.",
    "2011_400": "A young filmmaker gets wrapped up in a crime while shooting his new project on location.",
    "2011_401": "The husband-and-wife team of Charles and Ray Eames were America's most influential and important industrial designers. Admired for their creations and fascinating as individuals, they have risen to iconic status in American culture. 'Eames...See moreThe husband-and-wife team of Charles and Ray Eames were America's most influential and important industrial designers. Admired for their creations and fascinating as individuals, they have risen to iconic status in American culture. 'Eames: The Architect & The Painter' draws from a treasure trove of archival material, as well as new interviews with friends, colleague, and experts to capture the personal story of Charles and Ray while placing them firmly in the context of their fascinating times.  Written by AnonymousSee less",
    "2011_402": "A look at how one investigator spent ten years trying to expose Bernie Madoff's massive Ponzi scheme that scammed an estimated $18 billion from investors.",
    "2011_403": "A freewheeling portrait of Ken Kesey and the Merry Pranksters' fabled road trip across America.",
    "2011_404": "Director Chris Paine takes his film crew behind the closed doors of Nissan, GM, and the Silicon Valley start-up Tesla Motors to chronicle the story of the global resurgence of electric cars.",
    "2011_405": "A bestselling crime novelist who is desperately looking for a new story hones his focus on the apparent suicide of a small-town woman, an aspiring model who thought she was the reincarnation of Marilyn Monroe.",
    "2011_406": "An ex-con returns home to the Bronx after three years in prison to discover his wife estranged and his child exploring a gender transformation that will put the fragile bonds of their family to the test. Read more: Synopsis",
    "2011_407": "A guy who moves back to Portland, Oregon becomes involved in the mystery of his ex-girlfriend's disappearance.",
    "2011_408": "Alumni from Houston's storied Kashmere High School Stage Band return home after 35 years to play a tribute concert for their beloved band leader who turned the struggling jazz band into a world-class funk powerhouse in the early 1970s.",
    "2011_409": "It's 1987 and Danielle, the high school 'Dirty Girl', is running away. With her is chubby, gay Clarke, a bag of flour called Joan and a Walkman full of glorious '80s tunes.",
    "2011_41": "A land baron tries to reconnect with his two daughters after his wife is seriously injured in a boating accident.",
    "2011_410": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.",
    "2011_411": "A married couple on the verge of separation are leveled by the news their 18-year-old son committed a mass shooting at his college, then took his own life.",
    "2011_412": "Chronicles a day in the life of a grieving woman, and the twelve visitors who help her move forward.",
    "2011_413": "Two feuding rock stars get handcuffed together for 24 hours at a music festival where they are both due to perform.",
    "2011_414": "A hotel clerk searches all over Le Havre for the fairy who made two of his three wishes come true before disappearing.",
    "2011_415": "A conversation with Steve Jobs as he was running NeXT, the company he had founded after leaving Apple.",
    "2011_416": "Vidal Sassoon is more than just a hairdresser-he's a rock star, an artist, a craftsman who \"changed the world with a pair of scissors.\" With the geometric, Bauhaus-inspired hairdos he pioneered in the 1960s and his \"wash and wear\" ...See moreVidal Sassoon is more than just a hairdresser-he's a rock star, an artist, a craftsman who \"changed the world with a pair of scissors.\" With the geometric, Bauhaus-inspired hairdos he pioneered in the 1960s and his \"wash and wear\" philosophy that liberated generations of women from the tyranny of the salon, Sassoon revolutionized the art of hairstyling and left an indelible mark on popular culture. This documentary traces with visual gusto the life of a self-made man whose passion and perseverance took him from a Jewish orphanage in London to the absolute pinnacle of his craft.  Written by Tribeca Film FestivalSee less",
    "2011_417": "A David and Goliath law drama about a drug-addicted lawyer who takes on a health supply corporation while battling his own personal demons.",
    "2011_418": "Icelandic post-rock band Sigur Rós melds its sonic landscape with visuals in this concert film/documentary.",
    "2011_419": "A coal mining corporation and a tiny community vie for the last great mountain in Appalachia in a battle for the future of energy that affects us all.",
    "2011_42": "A spaceship arrives in Arizona, 1873, to take over the Earth, starting with the Wild West region. A posse of cowboys and natives are all that stand in their way.",
    "2011_420": "Five months in the life of a pedophile who keeps a 10-year-old boy locked in his basement.",
    "2011_421": "During the punk rock stage in the late '70s, downtown New York experienced a wave of \"Do it yourself\" independent filmmaking.",
    "2011_422": "When the world's media descend on the remote Scottish island where a Hollywood actress is attempting to get married, a local girl is hired as a decoy bride to put the paparazzi off the scent.",
    "2011_423": "A documentary that chronicles Sarah Palin's pre-political life; her tenure as Governor of Alaska, and her time spent as John McCain's running mate.",
    "2011_424": "A cop who becomes a hitman for a group aimed at eliminating those who are above the law finds his world turned upside down by a single a devastating blow.",
    "2011_425": "A romantic comedy which looks at a group of thirty-somethings trying to figure out life, love and marriage.",
    "2011_426": "When his partner Cody dies in a car accident, Joey learns that their son, Chip, has been willed to Cody's sister. In his now solitary home life, Joey searches for a solution. The law is not on his side, but friends are.",
    "2011_427": "A homicidal car tire, discovering it has destructive psionic power, sets its sights on a desert town once a mysterious woman becomes its obsession. Read more: Synopsis",
    "2011_428": "An alien must pose as a human to save his dying planet, but a woman and greed of other men create complications.",
    "2011_429": "A documentary on Gospel music's 200-year history.",
    "2011_43": "In a future where people stop aging at 25, but are engineered to live only one more year, having the means to buy your way out of the situation is a shot at immortal youth. Here, Will Salas finds himself accused of murder and on the run ...See moreIn a future where people stop aging at 25, but are engineered to live only one more year, having the means to buy your way out of the situation is a shot at immortal youth. Here, Will Salas finds himself accused of murder and on the run with a hostage - a connection that becomes an important part of the way against the system.See less",
    "2011_430": "A woman gets entangled in a series of bizarre lies in order to take care of herself and her 12 year old son.",
    "2011_431": "Tibetan Buddhist Master Choogyal Namkhai Norbu watches as his western-born son, Yeshi, who was recognized at birth as the reincarnation of a famous spiritual master, considers departing from tradition to embrace the modern world.",
    "2011_432": "Photo-animated feature documentary, uniquely narrated by the 10 people who knew Bill best. Read more: Synopsis",
    "2011_433": "An evil alien bong crashes on earth. Its intent: world domination. Our stoner heroes are sent to the alien bong planet and held captive by nude alien beauties. Their only hope to escape and save planet earth: Eebee, the original Evil Bong.",
    "2011_434": "Set in the world of mega-churches in which a former Deadhead-turned-born again-Christian finds himself on the run from fundamentalist members of his mega-church who will do anything to protect their larger-than-life pastor.",
    "2011_435": "A documentary on Phil Rosenthal's experiences during the making of \"Voroniny,\" the Russian-language version of \"Everybody Loves Raymond\".",
    "2011_436": "Crazy Wisdom is the long-awaited feature documentary to explore the life, teachings, and \"crazy wisdom\" of Chogyam Trungpa, Rinpoche, a pivotal figure in bringing Tibetan Buddhism to the West. Called a genius, rascal, and social visionary;...See moreCrazy Wisdom is the long-awaited feature documentary to explore the life, teachings, and \"crazy wisdom\" of Chogyam Trungpa, Rinpoche, a pivotal figure in bringing Tibetan Buddhism to the West. Called a genius, rascal, and social visionary; 'one of the greatest spiritual teachers of the 20th century,' and 'the bad boy of Buddhism,' Trungpa defied categorization. Raised and trained in the rigorous Tibetan monastic tradition, Trungpa came to the West and shattered our preconceived notions about how an enlightened teacher should behave - he openly smoked, drank, and had intimate relations with students - yet his teachings are recognized as authentic, vast, and influential. Twenty years after his death, with unprecedented access and exclusive archival material, Crazy Wisdom looks at the man and the myths about him, and attempts to set the record straight.  Written by Lisa Leeman, ProducerSee less",
    "2011_437": "A rich industrialist is brutally kidnapped. While he physically and mentally degenerates in imprisonment, the kidnappers, police and the board of the company of which he is director negotiate about the ransom of 50 million euro.",
    "2011_438": "In 'Wretches & Jabberers and Stories from the Road', two men with autism embark on a global quest to change prevailing attitudes about disability and intelligence. With limited speech, Tracy Thresher, 42, and Larry Bissonnette, 52, both ...See moreIn 'Wretches & Jabberers and Stories from the Road', two men with autism embark on a global quest to change prevailing attitudes about disability and intelligence. With limited speech, Tracy Thresher, 42, and Larry Bissonnette, 52, both faced lives of mute isolation in mental institutions or adult disability centers. When they learned as adults to communicate by typing, their lives changed dramatically. Their world tour message is that the same possibility exists for others like themselves. At each stop, they dissect public attitudes about autism and issue a hopeful challenge to reconsider competency and the future. Along the way, they reunite with old friends from the USA, expand the isolated world of a talented young painter and make new allies in their cause.  Written by AnonymousSee less",
    "2011_439": "CHARLOTTE RAMPLING: THE LOOK features Charlotte Rampling in a series of reflective conversations with artists, friends, and one-time collaborators such as novelist Paul Auster and photographers Peter Lindbergh and Juergen Teller, revealing...See moreCHARLOTTE RAMPLING: THE LOOK features Charlotte Rampling in a series of reflective conversations with artists, friends, and one-time collaborators such as novelist Paul Auster and photographers Peter Lindbergh and Juergen Teller, revealing the personality and philosophies of one of our most iconic screen stars.  Written by AnonymousSee less",
    "2011_44": "A group of zoo animals decide to break their code of silence in order to help their lovable zookeeper find love, without opting to leave his current job for something more illustrious.",
    "2011_440": "The true story of Luna, a young, wild killer whale who tries to befriend people on the rugged west coast of Vancouver Island.",
    "2011_441": "This movie tells the story of a skeleton crew working the final shift at a soon to be demolished police station. The night takes a gruesome turn when the demon, Inkubus, calmly walks into the station holding the severed head of a murdered ...See moreThis movie tells the story of a skeleton crew working the final shift at a soon to be demolished police station. The night takes a gruesome turn when the demon, Inkubus, calmly walks into the station holding the severed head of a murdered girl. Inkubus toys with the crew, allowing himself to be restrained, and begins to proudly confess to his litany of crimes, some dating back to the Middle Ages. Why? Inkubus has a score to settle with the one detective that almost put him away around thirteen years ago. To their dismay, the cops quickly become pawns in Inkubus' brutal crowning achievement of murder, gore, and mayhem. They ultimately realize it's his world, they only die in it.See less",
    "2011_442": "A hardscrabble traveling Mexican circus troupe has lived and performed on the road since the 19th Century, but will their art survive into the 21st?",
    "2011_443": "For 30 years, Muhammad Yunus helped 7.5 million Bangladeshi move out of poverty. Can he help women in Queens NY to achieve their American Dream?",
    "2011_444": "A documentary on Iran's 2010 Green Revolution.",
    "2011_445": "The Taylor family is devastated by an accident that takes place on the day their matriarch is due to graduate from college -- decades after leaving to raise her children.",
    "2011_446": "In the heart of Saigon, Thai and Linh are getting married. But the wedding is suddenly cut short when four other brides show up - threatening to take the groom's life. It turns out that Thai is the biggest player in the city, and has been ...See moreIn the heart of Saigon, Thai and Linh are getting married. But the wedding is suddenly cut short when four other brides show up - threatening to take the groom's life. It turns out that Thai is the biggest player in the city, and has been dating all five women at the same time up until the day of his wedding. Trang is an overly jealous flight attendant, Mai Chau is a doctor who loves to party, Quyen is a sexually aggressive chef while Huynh Phuong is one fiery actress. As Thai confesses and desperately tries to explain himself to Linh, his multiple lovers unleash their furious vengeance to teach him a lesson he will never forget.See less",
    "2011_447": "A feature-length documentary starring Fran Lebowitz, a writer known for her unique take on modern life. The film weaves together extemporaneous monologues with archival footage and the effect is a portrait of Fran's worldview and ...See moreA feature-length documentary starring Fran Lebowitz, a writer known for her unique take on modern life. The film weaves together extemporaneous monologues with archival footage and the effect is a portrait of Fran's worldview and experiences.  Written by AnonymousSee less",
    "2011_448": "A gunfighter with a strict no-kill policy, Vash the Stampede arrives in a town full of bounty hunters competing to collect the reward for catching a robber he saved 20 years ago.",
    "2011_449": "A rare behind-the-curtain look at the Earth Liberation Front, the radical environmental group that the FBI calls America's 'number one domestic terrorist threat.'",
    "2011_45": "A Muppet fanatic with some help from his 2 human compatriots must regroup the Muppet gang to stop an avaricious oil mogul from taking down one of their precious life-longing treasures.",
    "2011_450": "The only daughter of a wealthy businessman falls in love with a middle-classed underemployed artist.",
    "2011_451": "Baby boomer Mark Wexler travels the world searching for the secrets of long life.",
    "2011_452": "A documentary on former New York City club owner Peter Gatien. Read more: Synopsis",
    "2011_453": "The story of the battle to free Debbie Peagler, an incarcerated survivor of brutal domestic violence. Over 26 years in prison cannot crush the spirit of this determined African-American woman, despite the injustices she has experienced, ...See moreThe story of the battle to free Debbie Peagler, an incarcerated survivor of brutal domestic violence. Over 26 years in prison cannot crush the spirit of this determined African-American woman, despite the injustices she has experienced, first at the hands of a duplicitous boyfriend who beat her and forced her into prostitution, and later by prosecutors who cornered her into a life behind bars for her connection to the murder of her abuser. Her story takes an unexpected turn two decades later when a pair of rookie land-use attorneys cut their teeth on her case -- and attract global attention to the troubled intersection of domestic violence and criminal justice.  Written by AnonymousSee less",
    "2011_454": "A young man's untimely death unites a fractured family and their community through shared memory and loss.",
    "2011_455": "In the midst of the Russian Revolution of 1905, the crew of the battleship Potemkin mutiny against the brutal, tyrannical regime of the vessel's officers. The resulting street demonstration in Odessa brings on a police massacre.",
    "2011_456": "A few days in the life of truck driver Georgi, which seems to be a never-ending nightmare, a spiral of violence and abuses of power.",
    "2011_457": "Farmageddon is the story of a mom whose son healed from all allergies and asthma after consuming raw milk, and real food from farms. It depicts people all over the country who formed food co-ops and private clubs to get these foods, and ...See moreFarmageddon is the story of a mom whose son healed from all allergies and asthma after consuming raw milk, and real food from farms. It depicts people all over the country who formed food co-ops and private clubs to get these foods, and how they were raided by state and local governments.  Written by AnonymousSee less",
    "2011_458": "After finishing a successful meeting with his movie producers in Bangalore, Nanda, a jingles composer catches the highway to Chennai. On his way his car breaks down and he hitchhikes with Arjun, a businessman's son on his way to the same ...See moreAfter finishing a successful meeting with his movie producers in Bangalore, Nanda, a jingles composer catches the highway to Chennai. On his way his car breaks down and he hitchhikes with Arjun, a businessman's son on his way to the same destination. During their journey together they discuss their personal lives till Arjun proposes a deal; a deal that is marked with murder but promises to better their personal lives. However this deal does not work in Nanda's favor and he soon finds himself in deeper complications.  Written by UTV Motion PicturesSee less",
    "2011_459": "A truly inspirational film, Finding Joe explores the studies of famed mythologist Joseph Campbell. Take a journey through the human psyche and discover the pattern hidden in every story.",
    "2011_46": "With the help of a mysterious pill that enables the user to access 100% of his brain abilities, a struggling writer becomes a financial wizard, but it also puts him in a new world with lots of dangers.",
    "2011_460": "A documentary on the safety of nuclear storage.",
    "2011_461": "This is a humorous and heartfelt coming-of-age story about three unlikely heroes and the winter that changed their lives forever. After a surprising discovery in the snow catapults three small-town boys into the spotlight, the best friends...See moreThis is a humorous and heartfelt coming-of-age story about three unlikely heroes and the winter that changed their lives forever. After a surprising discovery in the snow catapults three small-town boys into the spotlight, the best friends hatch a plan to be remembered forever by setting a Guinness World Records title. Along the way, the trio battles schoolyard bullies, unites their community and discovers that, while fame may be fleeting, true friendship lasts forever. The film stars Bobby Coleman (The Last Song (2010)), Ray Liotta (Wild Hogs (2007)), Bobb'e J. Thompson (Role Models (2008)), Josh Flitter (Ace Ventura: Pet Detective, Jr. (2009)) and Christopher Lloyd (the Back to the Future trilogy).See less",
    "2011_462": "After a powerful billionaire is murdered, his secret adoptive son must race to prove his legitimacy, find his father's killers, and stop them from taking over his financial empire.",
    "2011_463": "What happens when a generation's ultimate anti-authoritarians -- punk rockers-- become society's ultimate authorities -- dads? With a large chorus of Punk Rock's leading men - Blink-182's Mark Hoppus, Red Hot Chili Peppers' Flea, Rise ...See moreWhat happens when a generation's ultimate anti-authoritarians -- punk rockers-- become society's ultimate authorities -- dads? With a large chorus of Punk Rock's leading men - Blink-182's Mark Hoppus, Red Hot Chili Peppers' Flea, Rise Against's Tim McIlrath - The Other F Word follow, Jim Lindberg, 20-year veteran of skate punk band Pennywise, on his hysterical and moving journey from belting his band's anthem, 'Fuck Authority', to embracing his ultimately pivotal authoritarian role in mid-life, fatherhood.  Written by Andrea Blaugrund NevinsSee less",
    "2011_464": "Through intimate interviews, provocative art, and rare, historical film and video footage, this feature documentary reveals how art addressing political consequences of discrimination and violence, the Feminist Art Revolution radically ...See moreThrough intimate interviews, provocative art, and rare, historical film and video footage, this feature documentary reveals how art addressing political consequences of discrimination and violence, the Feminist Art Revolution radically transformed the art and culture of our times.  Written by AnonymousSee less",
    "2011_465": "Mona Gray is a 20-year-old loner who, as a child, turned to math for salvation after her father became ill. As an adult, Mona now teaches the subject and must help her students through their own crises.",
    "2011_466": "Extraordinary behind-the-scenes access reveals a drug company's fevered race to develop the first FDA-approved Viagra for women - and offers a humorous but sobering look inside the cash-fueled pharmaceutical industry.",
    "2011_467": "Will (Josh Hopkins), a charming 35-year-old Philadelphia ad man, heads to Lebanon, Pa. to bury his recently deceased father. He forms an unexpected friendship with CJ (Rachel Kitson), his bright, newly pregnant 17-year-old cousin. As Will ...See moreWill (Josh Hopkins), a charming 35-year-old Philadelphia ad man, heads to Lebanon, Pa. to bury his recently deceased father. He forms an unexpected friendship with CJ (Rachel Kitson), his bright, newly pregnant 17-year-old cousin. As Will becomes interested in CJ's married teacher (Samantha Mathis) and CJ confronts her conflicted father, both struggle with formidable decisions about the path their lives will take. Can we vault our differences and meet in the middle? This bittersweet comic drama tenderly explores the cultural divide in America through the lives of one extended family.  Written by lebanonpamovie.comSee less",
    "2011_468": "Two friends are off on a weekend outing. Marshall thinks the trip is to re-establish their friendship, but Sam has ulterior motives in mind as he crashes the wedding of a woman he still loves.",
    "2011_469": "After the unexpected death of his survivalist father, an eleven-year-old boy raised in the Alabama wilderness must learn how to make a home in the modern world.",
    "2011_47": "Johnny English goes up against international assassins hunting down Chinese Premier Xiang Ping.",
    "2011_470": "An English village is occupied by disguised German paratroopers as an advance post for a planned invasion.",
    "2011_471": "A young priest taking over the parish at Ambricourt tries to fulfill his duties even as he fights a mysterious stomach ailment.",
    "2011_472": "Filmmaker and Founder of the Webby Awards, Tiffany Shlain, investigates the interconnections between the major issues of the 21st century and her own experience of these issues during a family crisis.",
    "2011_473": "The story of a family that suffers a tragedy, but perseveres and finds redemption through each other and their work - making art.",
    "2011_474": "A comedy about a New York City couple (Schreiber and Hunt) in romantic and family crisis.",
    "2011_475": "Chronicles a day-in-the-life of a Detroit liquor store. Read more: Synopsis",
    "2011_476": "Julie Kohler is prevented from suicide by her mother. She leaves the town. She will track down, charm and kill five men who do not know her. What is her goal? What is her purpose?",
    "2011_477": "A story of destinies joined by Guatemala's past, and how a documentary film intertwined with a nation's turbulent history emerges as an active player in the present.",
    "2011_478": "It's July, and Delphine has nowhere to go for the summer. She feels very bored and \"empty\", but this won't last; one day she accidently meets someone who seems to be totally made for her...",
    "2011_479": "The horrific account of 6 year old Martin Bristol, abducted from his backyard swing and forced to witness the brutal crimes of a deranged madman.",
    "2011_48": "Mumble's son, Erik, is struggling to realize his talents in the Emperor Penguin world. Meanwhile, Mumble and his family and friends discover a new threat their home -- one that will take everyone working together to save them.",
    "2011_480": "A documentary on a group of diverse couples, each in different stages of their relationships in New York City. Read more: Synopsis",
    "2011_481": "The story of three people from the same suburban town during the course of one curious autumn day.",
    "2011_482": "Based on a true story depicting a single dramatic day in the life of a Latina gang leader in South Central Los Angeles.",
    "2011_483": "Four young people navigate the suburban wonderland of metro-Detroit looking for love and adventure on the last weekend of summer.",
    "2011_484": "What does it mean to lead men in war? What does it mean to come home? Hell and Back Again is a cinematically revolutionary film that asks and answers these questions with a power and intimacy no previous film about the conflict in ...See moreWhat does it mean to lead men in war? What does it mean to come home? Hell and Back Again is a cinematically revolutionary film that asks and answers these questions with a power and intimacy no previous film about the conflict in Afghanistan has been able to achieve. It is a masterpiece in the cinema of war.  Written by Danfung DennisSee less",
    "2011_485": "When a young drug researcher is hired by a tobacco company, Victor DeNoble unexpectedly discovers the ingredients of addiction and fuels a national campaign to have it regulated.",
    "2011_486": "By turns hopeful and heartbreaking, Louder Than a Bomb follows the fortunes of four Chicago-area high school poetry teams as they prepare for and compete in the world's largest youth slam.",
    "2011_487": "A documentary that chronicles four years in the lives of childhood friends as they enter a faraway war.",
    "2011_488": "Paul Goodman, whose best-selling 'Growing Up Absurd' made him the philosopher of the New Left in the 1960s, was also a brilliant poet, out queer (and family man) in the 1940s, radical pacifist and visionary. His ideas and stubborn ...See morePaul Goodman, whose best-selling 'Growing Up Absurd' made him the philosopher of the New Left in the 1960s, was also a brilliant poet, out queer (and family man) in the 1940s, radical pacifist and visionary. His ideas and stubborn integrity helped many find a moral compass in the '60's -- and can do so again today.  Written by AnonymousSee less",
    "2011_489": "A young Tutsi woman and a young Hutu man fall in love amidst chaos; a soldier struggles to foster a greater good while absent from her family; and a priest grapples with his faith in the face of unspeakable horror.",
    "2011_49": "Survivors of a suspension-bridge collapse learn there's no way you can cheat Death.",
    "2011_490": "An Indian-American guy surprises his family when he announces his desire for an arranged marriage with an Indian woman, though his affection for a longtime American friend complicates his plan.",
    "2011_491": "A documentary on Candy Darling, The Life and Times of the Andy Warhol Superstar.",
    "2011_492": "On the eve of the 40th anniversary of the Gay Rights Movement, the film explores the drama, struggle and enduring legacy of the first-ever gay play and subsequent Hollywood movie to successfully reach a mainstream audience. Beloved by some...See moreOn the eve of the 40th anniversary of the Gay Rights Movement, the film explores the drama, struggle and enduring legacy of the first-ever gay play and subsequent Hollywood movie to successfully reach a mainstream audience. Beloved by some for breaking new ground, and condemned by others for reinforcing gay stereotypes, The Boys in the Band sparked heated controversy that still exists four decades later.  Written by Miguel CamnitzerSee less",
    "2011_493": "Weaving interviews of policy experts and startling facts with the lives and careers of four teachers, American Teacher tells the collective story by and about those closest to the issues in our educational system -- the 3.2 million ...See moreWeaving interviews of policy experts and startling facts with the lives and careers of four teachers, American Teacher tells the collective story by and about those closest to the issues in our educational system -- the 3.2 million teachers who spend every day in classrooms across our country.  Written by AnonymousSee less",
    "2011_494": "When an awkward teen meets his favorite porn star, whose career peaked in the '80s, an unexpected friendship follows as the young man gets a glimpse inside Monica Velour's current life as a single mom struggling to make ends meet.",
    "2011_495": "Beth, a bookish teenager, befriends Emilia, an aspiring novelist who has just arrived in town. Emilia soon begins an affair with Beth's father that threatens to have devastating consequences.",
    "2011_496": "Viorel a 42 year old man troubled by obscure thoughts drives across the city to a destination known only to him.",
    "2011_497": "It is our national novel. Reading to Kill a Mockingbird is something we all have in common. Harper Lee's first and only novel turns 50 this summer and the author hasn't given an interview since 1964 or published a second book. In ...See moreIt is our national novel. Reading to Kill a Mockingbird is something we all have in common. Harper Lee's first and only novel turns 50 this summer and the author hasn't given an interview since 1964 or published a second book. In compelling interviews with Scott Turow, James McBride, Wally Lamb, Rosanne Cash, Anna Quindlen, Oprah Winfrey,Tom Brokaw, among others, and with rare cooperation from Harper Lee's sister and friends, Mary Murphy traces the history of this astonishing phenomenon.  Written by AnonymousSee less",
    "2011_498": "A modern, gothic tale of crime and redemption about an aging police officer from a small Ontario Mennonite town who hides a violent past until a local murder upsets the calm of his newly reformed life.",
    "2011_499": "Brooklyn, 1975: two brothers looking for a way out of their working-class neighborhood make a pact to rob a local theater on the night of a Rolling Stones concert.",
    "2011_5": "The IMF is shut down when it's implicated in the bombing of the Kremlin, causing Ethan Hunt and his new team to go rogue to clear their organization's name.",
    "2011_50": "While on a trip to Paris with his fiancee's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight.",
    "2011_500": "An ex-con on the run from his criminal past hides out from those he ratted on by chaperoning a field trip to New Orleans.",
    "2011_501": "When a sexy, high-end escort holds the key evidence to a scandalous government cover-up, two bumbling young detectives become her unlikely protectors from a ruthless assassin hired to silence her.",
    "2011_502": "Ghost hunters shoot a reality show fight for their lives in tunnels beneath an old Texas college.",
    "2011_503": "Two men embark on a music-steeped journey through the American South.",
    "2011_504": "Fun, disarming and musically provocative, the Topp Twins are New Zealand's finest lesbian country and western singers and the country's greatest export since rack of lamb and the Lord of the Rings movie trilogy.",
    "2011_505": "A compelling account of Juan Pujol, an extraordinary Spanish double agent during WWII who helped change the course of history.",
    "2011_506": "Two mercenaries have the same goal but different motives. When Trinh's daughter is kidnapped, she's forced to recover a stolen hard drive with codes to Vietnam's first satellite in order to save her.",
    "2011_507": "At the end of 1952, with the best years of Hank Williams's career behind him, he hires a local kid to drive him through the Appalachian countryside for a pair of New Years shows in West Virginia and Ohio.",
    "2011_508": "Durham is slowly dying like the tobacco business, it once depended on. Leroy comes to Durham with a business plan. He rents an old warehouse from a cash-strapped old tobacco heiress.",
    "2011_509": "Caesar, an effete tough guy and his slovenly half brother, Otto, have signed up as summer camp counselors. But when the mysterious Carrie shows up, the other counselors start disappearing one by one.",
    "2011_51": "When a group of hard-working guys find out they've fallen victim to their wealthy employer's Ponzi scheme, they conspire to rob his high-rise residence.",
    "2011_510": "An angel under the thumb of a ruthless gangster is saved by a trumpet player down on his luck.",
    "2011_511": "A Hollywood-set romantic tale of a guy who is content to live his life without a job yet with the love of his life, a young actress.",
    "2011_512": "A robot alien. Angst-ridden teens. Cleavage-wielding soul takers. A dark overlord. A cross-dressing retard. A pregnant 14-year-old cougar. Macho scientists. Santa Claus. Yeah, this movie has it all.",
    "2011_513": "After a heist goes wrong, outlaw couple Bonnie and Clyde crash a mansion inhabited by the recently revived Dracula. When gangsters meet vampires, there's bloody hell to pay.",
    "2011_514": "A college kid comes of age one summer amidst family conflict unleashed by the eventual passing of its patriarch.",
    "2011_515": "An epic 12-year journey into the brutal and secretive world of Irish Traveler bare-knuckle fighting. This film follows a history of violent feuding between rival clans.",
    "2011_516": "An American couple and a foreign couple test the limits of friendship and love when they switch partners and get married for green cards.",
    "2011_517": "A story centered around the Valentinos, a struggling family whose delicate balance is threatened by a carefully concealed secret that, if revealed, will change their lives forever.",
    "2011_518": "A former ranch hand (Roger Gutierrez) confronts the realities of drug addiction and runs afoul of a local gangster after he moves to Los Angeles. Read more: Synopsis",
    "2011_519": "When two friends tape-recorded the fights of their violently noisy neighbors, they accidentally created one of the world's first 'viral' pop-culture sensations.",
    "2011_52": "Aliens and their Guardians are hiding on Earth from intergalactic bounty hunters. They can only be killed in numerical order, and Number Four is next on the list. This is his story.",
    "2011_520": "This surprisingly open and revealing documentary follows two years in the private life of a minister. Marilyn Sewell is successful and beloved in the pulpit, but behind the scenes she is lonely and yearning for change. As she considers ...See moreThis surprisingly open and revealing documentary follows two years in the private life of a minister. Marilyn Sewell is successful and beloved in the pulpit, but behind the scenes she is lonely and yearning for change. As she considers leaving the ministry, she realizes she will be leaving her only social network. Yet when she falls in love for the first time, she realizes she does not trust intimacy. A study in contrasts, Marilyn must rely on raw faith as she questions her future, her difficult past, her God, and most importantly... her ability to love.  Written by Wm. Peter WiedensmithSee less",
    "2011_521": "For over a century, Carnegie Hall rented affordable studio apartments atop the famous music hall to artistic tenants such as Marlon Brando, Paddy Chayefsky and Isadora Duncan. As a privileged tenant, director Josef Birdman Astor began to ...See moreFor over a century, Carnegie Hall rented affordable studio apartments atop the famous music hall to artistic tenants such as Marlon Brando, Paddy Chayefsky and Isadora Duncan. As a privileged tenant, director Josef Birdman Astor began to videotape his neighbors whose lives intersected with decades of artistic history, but his project changed when the landlord served everyone with eviction notices for a conversion to offices. Astor chronicles the protracted battle to save the apartments and pays homage to their rich heritage.  Written by AnonymousSee less",
    "2011_522": "Two female kidnappers find themselves dragged further and further into a complex mystery, fuelled by paranoia. Everything starts to spiral out of control, as one of them suspects there is something wrong in paradise.",
    "2011_523": "Two rival Medieval shows vie for supremacy in the world of Renaissance Faires. Read more: Synopsis",
    "2011_524": "Reinette and Mirabelle are two young girls. Reinette lives in the countryside, Mirabelle in Paris. They meet during a holiday of Mirabelle in the country, when Reinette helps her to repair the tube of her bicycle and shows her the beauties...See moreReinette and Mirabelle are two young girls. Reinette lives in the countryside, Mirabelle in Paris. They meet during a holiday of Mirabelle in the country, when Reinette helps her to repair the tube of her bicycle and shows her the beauties of nature and in particular the 'blue hour'. They like each other and decide to take a flat together in Paris, where they'll attend at the University. But isn't so easy to live together when the characters are so different: as Reinette is simple and enthusiastic, as Mirabelle is obscure and lazy.  Written by Maurizio Semolic See less",
    "2011_525": "Against the backdrop of a missing girl case, lost souls throughout Los Angeles search for meaning and redemption and affect each other in ways they don't always see.",
    "2011_526": "Deep Gold follows Amy Sanchez, a champion free diver who, along with her sister Jess, find themselves thrown into the middle of a deadly conspiracy. After a government plane carrying a fortune in gold goes missing over Philippine waters, ...See moreDeep Gold follows Amy Sanchez, a champion free diver who, along with her sister Jess, find themselves thrown into the middle of a deadly conspiracy. After a government plane carrying a fortune in gold goes missing over Philippine waters, Amy and Jess struggle to investigate the disappearance with help from Lulu and the mysterious Benny Simpson. Soon, the girls learn they are in over their heads.  Written by AnonymousSee less",
    "2011_527": "A photographer feels his commitment to his girlfriend beginning to fade when he becomes obsessed with an enigmatic client.",
    "2011_528": "An urban mystery unfurls as one man pieces together the surreal meaning of hundreds of cryptic tiled messages that have been appearing in city streets across the U.S. and South America.",
    "2011_529": "In 2001 Jack Cardiff (1914-2009) became the first director of photography in the history of the Academy Awards to win an Honorary Oscar. But the first time he clasped the famous statuette in his hand was a half-century earlier when his ...See moreIn 2001 Jack Cardiff (1914-2009) became the first director of photography in the history of the Academy Awards to win an Honorary Oscar. But the first time he clasped the famous statuette in his hand was a half-century earlier when his Technicolor camerawork was awarded for Powell and Pressburger's Black Narcissus. Beyond John Huston's The African Queen and King Vidor's War and Peace, the films of the British-Hungarian creative duo (The Red Shoes and A Matter of Life and Death too) guaranteed immortality for the renowned cameraman whose career spanned seventy years.  Written by Karlovy Vary International Film FestivalSee less",
    "2011_53": "Family guy Jack Sadelstein prepares for the annual event he dreads: the Thanksgiving visit of his fraternal twin sister, the needy and passive-aggressive Jill, who then refuses to leave.",
    "2011_530": "In the early 1980s, in small-town Texas, dramatic events force a 19-year-old skating rink manager to look at his life in a very new way.",
    "2011_531": "One man's mission to follow his dream is comically halted in its tracks at the request of his dear, but difficult, aged Jewish mother who is hell-bent on seeing her warring dysfunctional grown up grandchildren together one last time before she dies.",
    "2011_532": "A drama centered on the relationship between a two young men, as one of them navigates the difficulties of life as a transgender man.",
    "2011_533": "Six of the world's best young magicians battle for the title of Teen World Champion.",
    "2011_534": "The story of Louis Sarno, an American ethno-musicologist who lived among the Bayaka Pygmies in Central Africa for 25 years.",
    "2011_535": "'Battle for Brooklyn' follows the story of reluctant activist Daniel Goldstein as he struggles to save his home and community from being demolished to make way for the densest real estate development in U.S. history. Along the way, he ...See more'Battle for Brooklyn' follows the story of reluctant activist Daniel Goldstein as he struggles to save his home and community from being demolished to make way for the densest real estate development in U.S. history. Along the way, he falls in love, gets married and starts a family while living in an abandoned building located at the heart of the project site. Over the course of seven years, Daniel and his community fight tenaciously in the courts, the streets, and the media to stop the abuse of eminent domain and reveal the corruption at the heart of the plan.  Written by AnonymousSee less",
    "2011_536": "After a stint in prison, Sonny returns to his home in East Texas, determined to repair his relationship with his son. Standing in his way is his brother, who has turned the home into a crumbling meth lab. Read more: Synopsis",
    "2011_537": "A powerfully intimate drama that captures the fears and desires of a young Japanese woman lost in the U.S., 'Littlerock' is an affectingly authentic portrait of the bitter-sweet pain of young love and the cruel reality of cultural ...See moreA powerfully intimate drama that captures the fears and desires of a young Japanese woman lost in the U.S., 'Littlerock' is an affectingly authentic portrait of the bitter-sweet pain of young love and the cruel reality of cultural miscommunication, making it one of the most moving independent U.S. films in recent memory.  Written by AnonymousSee less",
    "2011_538": "A teen coming-of-age romantic dramedy about a media-obsessed geek and the most beautiful and twisted girl in school.",
    "2011_539": "When four 40-something college friends meet up for their annual reunion, things start to spiral out of control, and a pact they made as young men is revisited.",
    "2011_54": "A young man and woman decide to take their friendship to the next level without becoming a couple, but soon discover that adding sex only leads to complications.",
    "2011_540": "At the annual Vent Haven Convention in Ft. Mitchell, Kentucky, ventriloquism capital of the world, director Mark Goffman discovers five extraordinary characters straight out of a Christopher Guest mockumentary. But in this delightful, ...See moreAt the annual Vent Haven Convention in Ft. Mitchell, Kentucky, ventriloquism capital of the world, director Mark Goffman discovers five extraordinary characters straight out of a Christopher Guest mockumentary. But in this delightful, it's-all-true documentary, the characters are real, and so are the emotional attachments that they have with their \"dummies.\"  Written by Palm Springs International Film FestivalSee less",
    "2011_541": "Kimberly would stop at nothing to have a child of her own. After recovering from cancer her possibilities seemed slim. However, the world's first successful human cloning project brings an unthinkable solution and a son named David. Seven ...See moreKimberly would stop at nothing to have a child of her own. After recovering from cancer her possibilities seemed slim. However, the world's first successful human cloning project brings an unthinkable solution and a son named David. Seven years after David's birth, wars, famine and natural disasters of every kinds have plagued the Earth. As Kimberly struggles to survive her biggest challenge is raising her son. Strange occurrences surrounding the young boy are only becoming worse and more mysterious. Roger, the head researcher of the cloning project returns to reveal that David was cloned from DNA taken from the Shroud of Turin...from blood of Christ. Has cloning made it possible to bring Christ back? Is David the Second Coming of Christ or something else?  Written by AnonymousSee less",
    "2011_542": "A simple man, Dr. Walter Newman, has high aspirations to cure all disease through genetic manipulation. His obsession with his mission draws him deeper into his own dark world, distracting him from his wife Olivia and from his ...See moreA simple man, Dr. Walter Newman, has high aspirations to cure all disease through genetic manipulation. His obsession with his mission draws him deeper into his own dark world, distracting him from his wife Olivia and from his responsibilities to his patients at the Edgewood Asylum. The doctors loyal but diabolical nurse, Ms. Tinsley, decides to take matters into her own hands and in secret she conducts her own experiment. When Dr. Newman realizes what has been done, a deformed creature that defies nature is created. Part human, part nightmare. Dr. Newman knows what he must do, but is it already too late?  Written by Joseph R. McConnellSee less",
    "2011_543": "Four siblings implode after the release of a book written about them.",
    "2011_544": "Hired to kill a nobleman, the assassin instead falls for the former's unstable wife.",
    "2011_545": "A newly paralyzed DJ gets more than he bargained for when he seeks out the world of faith healing.",
    "2011_546": "Shows how the classic board game has become a worldwide cultural phenomenon, and follows the colorful players who come together to compete for the coveted title of Monopoly World Champion.",
    "2011_547": "A man who left home 40 years earlier to become a country singer returns home to the tattered remains of his broken family and a grandson who is desperately trying to escape the family curse.",
    "2011_548": "Award-winning filmmaker Darryl Roberts' takes us into America's dieting craze and its insidious use of BMI and into the lives of industry leaders and icons like Deepak Chopra.",
    "2011_549": "Filmed over the ensuing years after the attack on New York's World Trade Center, this documentary takes a look a the physical and emotional healing process involved in the aftermath of such a tragedy. Read more: Synopsis",
    "2011_55": "A guy and girl try to keep their relationship strictly physical, but it's not long before they learn that they want something more.",
    "2011_550": "About the interplay between the official government channels and the men who acted largely behind the scenes during the course of peace process between Israel and Egypt. The film posits that while some of the men, such as Carter, Begin and...See moreAbout the interplay between the official government channels and the men who acted largely behind the scenes during the course of peace process between Israel and Egypt. The film posits that while some of the men, such as Carter, Begin and Sadat, were driven by deeply held faith and conviction, others were military men hawks who in their later years came to see pace as the only viable option. Still others saw peace and stability in business terms. In any case, together, these heroes found a way to come together and drive the peace process. The film traces the confluence of factors that made the 1979 Peace Treaty between Israel and Egypt possible. The term 'back door channels' has been in use since the early 1950s and used by government and foreign policy officials as well as intelligence operatives in referring to alternative methods for communicating across borders, using lines of communication not available to traditional official governmental and diplomatic entities nor to covert international intelligence agents.  Written by AnonymousSee less",
    "2011_551": "A scathing black comedy of embarrassment, RID OF ME charts the emotional breakdown and rebirth of a woman ripe for self-discovery.",
    "2011_552": "Life for porn actress Elektra Luxx gets turned upside down when she finds out she's pregnant.",
    "2011_553": "Kaitlyn, an emergency room nurse, who is tending to a young stabbing victim, is accidentally electrocuted by the defibrillator that is used in an effort to save the woman's life. Almost immediately, Kaitlyn starts to experience the ...See moreKaitlyn, an emergency room nurse, who is tending to a young stabbing victim, is accidentally electrocuted by the defibrillator that is used in an effort to save the woman's life. Almost immediately, Kaitlyn starts to experience the victim's memories. She turns to family, friends, and the police, but no one takes her seriously. She decides that she must take it upon herself to try to solve the crime, or risk the terrifying visions ending in her own sanity being at stake. Ultimately, Kaitlyn teams up with the detective on the case and weaves her way through the victim's past, to discover not only the brutal truth, but also some very unexpected lessons about life, love, sorrow, and forgiveness along the way.See less",
    "2011_554": "First her father ends up in one of Stalin's prison camps, then young Svetlana herself experiences the German invasion. In order to survive she learns German at home in Kiev. She is good and gets work as a translator before ending up in a ...See moreFirst her father ends up in one of Stalin's prison camps, then young Svetlana herself experiences the German invasion. In order to survive she learns German at home in Kiev. She is good and gets work as a translator before ending up in a German camp in 1943. Now, 65 years later, she is a renowned translator who in her twilight years has translated the great works of Dostoevsky. For the first time in all these years, she returns to Kiev together with her granddaughter.  Written by Göteborg International Film FestivalSee less",
    "2011_555": "Nick Broomfield goes in pursuit of Sarah Palin, interviewing her family and friends, for a decidedly unauthorized perspective on this growing force in American politics.",
    "2011_556": "The rich man Domenico and Filumena, a penniless prostitute, share great part of their lives in the immediate post WWII Italy.",
    "2011_557": "A chance encounter between a teen pickpocket and one of his victims changes his plans to escape his dreary life.",
    "2011_558": "An adaptation of Shakespeare's Hamlet set in ancient Tibet.",
    "2011_559": "A cat who turns into a young woman helps a journalist protect their town from a factory boss with an evil plan.",
    "2011_56": "Santa's (Jim Broadbent's) clumsy son Arthur (James McAvoy) sets out on a mission with Grandsanta (Bill Nighy) to give out a present they misplaced to a young girl in less than two hours.",
    "2011_560": "A man in search of his past, and a woman who lives in the moment, are brought together when they pursue the origins of a stray parrot in this comedic and romantic drama.",
    "2011_561": "Vito has a fatal heart attack as he is exiting the front gate of his stately home. Upon death his mom confronts him, making it clear, via a lengthy diatribe, that his existence was one of the material realm of sensual gratification - money...See moreVito has a fatal heart attack as he is exiting the front gate of his stately home. Upon death his mom confronts him, making it clear, via a lengthy diatribe, that his existence was one of the material realm of sensual gratification - money, power, status and pleasure seeking- rather than that which is transcendent, thus he has been condemned to eternal death. Eventually we discover that this death experience was a dream, which greatly unsettled Vito, precipitating him to seek the truth relative to life's purpose, and the afterlife. Vto has periods of contemplation and dialogue with the housekeeper, barber, gardener, and his wife in search of answers - Is there such a place as heaven? Does Hell exist? Am I a good person? etc. Vito's soul searching includes a flashback to his youth listening to his grandfather speaking to him about eternity. In the midst of this quest for truth, as Vito is driving down the driveway about to exit the front gate, it occurs to him that his day is repeating itself as in the dream. Certain events of the morning...such as him making a demeaning comment to Mike, who is washing Vito's Porsche, were precisely as they were in the dream - \"his dream was becoming his realty.\" Frightened that if he continued to go through the gate he would, like the dream, have a fatal heart attack, and be condemned to eternal death. Frantically he returns to his house, prays and has an edifying flashback to his youth, in which death, which is currently crippling with fear, is being discussed. In a state of angst he calls for his friend, Father Dellos, asking him to come to his home. Upon arrival the the priest counsels him about the events of this \"strange\" morning, and hears his confession. Finally, Vito makes a third and final journey down the driveway.  Written by John MartocciaSee less",
    "2011_562": "A wannabe serial killer wins the lottery and pursues his lifelong crush.",
    "2011_563": "Two strangers come to discover the fate of their respective children in the 2005 terrorist attacks on London.",
    "2011_564": "Victor is new to Montreal and attempts to make friends with the wheelchair-bound Spencer and the cat-loving Louise, but everybody is on edge with a serial killer terrorizing the neighborhood.",
    "2011_565": "A documentary on DIY producer/director Roger Corman and his alternative approach to making movies in Hollywood.",
    "2011_566": "A young girl who has been abandoned by her former-groupie mother informs a fading rock star that she is his daughter. Read more: Synopsis",
    "2011_567": "The story of a hitman for the drug cartels in Ciudad Juarez, Mexico.",
    "2011_568": "A mother and wife stricken with memory loss allows a dysfunctional family a second chance at harmony and happiness.",
    "2011_569": "Juggling the sudden abduction of her childhood sweetheart as well as a blooming love affair, a French Manhattanite makes her way as an artist in an indifferent, sometimes hostile world.",
    "2011_57": "A soldier wakes up in someone else's body and discovers he's part of an experimental government program to find the bomber of a commuter train within 8 minutes.",
    "2011_570": "In 1899, a care-free young man must prepare to take over his family's Chinese banking empire.",
    "2011_571": "From a basketball academy in Senegal, to the high-pressure world of American prep schools, the film documents the extraordinary personal journeys of four particularly tall West African Muslim teenage boys with NBA dreams.",
    "2011_572": "A comedy centered on a failed horse trainer who desperately wants to be back in the winner's circle.",
    "2011_573": "Tanner Hall is a vivid peek into the private world of an all-girls boarding school. In a cozy, but run-down New England, the knot of adolescent complexity is unraveled through the coming-of-age stories of four teenage girls.",
    "2011_574": "A transsexual woman tries to erase any past history of herself as a male. Struggling with a young male lover and a problematic son. Read more: Synopsis",
    "2011_575": "Father William Smoortser drops his bible into a toilet at a rest stop just before embarking on a day-long canoe trip, breaking loose all glorious hell.",
    "2011_576": "A harrowing psychological thriller from a widely acclaimed filmmaker, Daylight pits a couple lost in America against a conniving gang of kidnappers, in David Barker's rigorous and personal re-imagining of the genre film.",
    "2011_577": "When a campus radio DJ, and indie-rock band manager, discovers the lead singer of his band, has quit - he thinks he has troubles. But when a sexy young girl named Tommy, comes to audition as the new lead singer - his real troubles begin.",
    "2011_578": "Filmmaker Turk Pipkin promises to help build the first high school for a remote African community and connects Americans and Kenyans in a true story of Building Hope.",
    "2011_579": "The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.",
    "2011_58": "A middle-aged husband's life changes dramatically when his wife asks him for a divorce. He seeks to rediscover his manhood with the help of a newfound friend, Jacob, learning to pick up girls at bars.",
    "2011_580": "THE SONS OF TENNESSEE WILLIAMS, tells the story of the gay men of New Orleans who created a vast and fantastic culture of wildly popular 'drag balls' starting in the late 1950s. These men worked with the traditions of Mardi Gras to bring ...See moreTHE SONS OF TENNESSEE WILLIAMS, tells the story of the gay men of New Orleans who created a vast and fantastic culture of wildly popular 'drag balls' starting in the late 1950s. These men worked with the traditions of Mardi Gras to bring gay culture into public settings in the early 1960s. By 1969, there were four gay Mardi Gras clubs legally chartered by the state of Louisiana, throwing yearly extravaganzas at civic venues around the city. 'Society matrons begged for ball tickets from their hairdressers'. They succeeded in bringing down the 'Jim Crow' type laws that targeted gay people during this period, staging a flamboyant, costumed revolution without politics and won freedoms during a time, as now, when laws and people fought against them.  Written by AnonymousSee less",
    "2011_581": "An engaged guy is forced by his future father-in-law to take a side job moonlighting as an exotic dancer in order to pay extravagant wedding neither of them can afford.",
    "2011_582": "Clarence Reid is a musician who wrote and produced romantic and spiritual songs for some of the greatest Southern soul and R&B acts of the 1960s and '70s. He is also the gonzo performer Blowfly, Clarence's freaky alter ego and the original...See moreClarence Reid is a musician who wrote and produced romantic and spiritual songs for some of the greatest Southern soul and R&B acts of the 1960s and '70s. He is also the gonzo performer Blowfly, Clarence's freaky alter ego and the original X-rated rapper. \"The Weird World of Blowfly\" explores both sides of this hilarious and controversial artist, providing a rare, inside peek at the infamous linguist's daily life. Now 69-years-old, with a gold-spangled superhero costume and a catalog of the world's raunchiest tunes, Blowfly tours the world, still struggling for success and recognition after 50 years of making music. The film highlights both Clarence's and Blowfly's unique contributions to music history, including Top-10 R&B hits and what might be the world's first rap song, recorded in 1965. Shot over the course of two years, the film follows Clarence at home and around the world, featuring dozens of classic Blowfly songs as well as new hits. A revealing portrait of an unheralded man, \"The Weird World of Blowfly\" celebrates his musical and cultural significance as a rapper and soul music legend.  Written by Blowfly FilmSee less",
    "2011_583": "An orphan is abused and abandoned, believed to be dead, and upon his return is first feared as a ghost, and then projected as a superhero.",
    "2011_584": "A man's life is altered unexpectedly after telling a lie to get out of work.",
    "2011_585": "Ex Governmental Operative Jack Davis is being manipulated in a life and death struggle by warring factions within the covert arms of the Homeland Security Agency in a fight for congressional funding. When his brother is kidnapped while ...See moreEx Governmental Operative Jack Davis is being manipulated in a life and death struggle by warring factions within the covert arms of the Homeland Security Agency in a fight for congressional funding. When his brother is kidnapped while working for a foreign embassy, Jack pulls out all stops in a race to save his brother that takes him from the desolate mountains of Virginia to Miami, Washington DC, and then into the exotic lands of Thailand and Cambodia.  Written by Kely McClungSee less",
    "2011_586": "A true crime writer investigating a small town murder spree uncovers the devastating truth that changes the town forever. Read more: Synopsis",
    "2011_587": "A story about the rise and fall of United Red Army, a real life 70s short-lived Japanese armed revolutionary communist movement similar to more famous Red Brigades in Italy or Baader-Meinhof Group (a.k.a. Red Army Faction) in West Germany.See moreA story about the rise and fall of United Red Army, a real life 70s short-lived Japanese armed revolutionary communist movement similar to more famous Red Brigades in Italy or Baader-Meinhof Group (a.k.a. Red Army Faction) in West Germany.  Written by AnonymousSee less",
    "2011_588": "A pool boy and a gardener turn an empty mansion into a home for women who belong to the world's oldest profession.",
    "2011_589": "A deep and reflective look at the arrival and impact of AIDS in San Francisco and how individuals rose to the occasion during the first years of this unimaginable crisis.",
    "2011_59": "The lives of several couples and singles in New York City intertwine over the course of New Year's Eve.",
    "2011_590": "Angela an illegal immigrant living in Los Angeles stumbles across Bill, a disgraced banker on the run.Through sex, conversation ranging from politics to philosophy, and other worldly pleasures, Angela introduces Bill to another worldview.",
    "2011_591": "A decade and a half after their seminal indie film launched meteoric filmmaking careers, Splick and Jason find themselves staring at their own individual, pre-midlife crises. Having not spoken to one another since a late-nineties falling ...See moreA decade and a half after their seminal indie film launched meteoric filmmaking careers, Splick and Jason find themselves staring at their own individual, pre-midlife crises. Having not spoken to one another since a late-nineties falling out, they're each grappling with the challenges of stalled careers and relationships, as the hands of time creep ominously past forty-o'clock. Splick's most recent TV show, centered around his character's perverse relationship with dessert foods, is unceremoniously cancelled by the network, forcing a return to his childhood bedroom at his mother's apartment in New York. Frustrated by a barrage of comments about the \"good,\" \"funny,\" movies he used to make with his old partner, Jason, Splick determines to seek him out and attempt a reunion.  Written by AnonymousSee less",
    "2011_592": "An investigation into a government cover-up leads to a network of abandoned train tunnels deep beneath the heart of Sydney. As a journalist and her crew hunt for the story it quickly becomes clear the story is hunting them. Read more: Synopsis",
    "2011_593": "Hollis Parker hosts a nightly web show that brings together sexual misfits from across the World Wide Web. A new intern at the studio shows romantic interest in Hollis, and what begins as a seemingly innocent crush turns into an unhealthy obsession.",
    "2011_594": "The disappearance of a 3-year-old boy divides a tightly knit community and culls out its secrets.",
    "2011_595": "Redneck Carnage is a story about a group of misfits who must join forces for a struggle for survival while seeking to find the cause of a disastrous series of events. In the process they strive to get word to the only entities who can save...See moreRedneck Carnage is a story about a group of misfits who must join forces for a struggle for survival while seeking to find the cause of a disastrous series of events. In the process they strive to get word to the only entities who can save them and a small town from total annihilation.  Written by Johnno ZeeSee less",
    "2011_596": "AIM leader Dennis Banks looks back at his early life and the rise of the American Indian Movement.",
    "2011_6": "Po and his friends fight to stop a peacock villain from conquering China with a deadly new weapon, but first the Dragon Warrior must come to terms with his past.",
    "2011_60": "Healthcare professionals, government officials and everyday people find themselves in the midst of a pandemic as the CDC works to find a cure.",
    "2011_61": "A man awakens from a coma, only to discover that someone has taken on his identity and that no one, (not even his wife), believes him. With the help of a young woman, he sets out to prove who he is.",
    "2011_62": "An egomaniacal film star develops a relationship with a young dancer against the backdrop of Hollywood's silent era.",
    "2011_63": "The hot-headed young D'Artagnan along with three former legendary but now down on their luck Musketeers must unite and defeat a beautiful double agent and her villainous employer from seizing the French throne and engulfing Europe in war.",
    "2011_64": "Set in Southern California, a father moves his young family to the countryside to renovate and re-open a struggling zoo.",
    "2011_65": "Set in the 1930s, a former veterinary student takes a job in a travelling circus and falls in love with the ringmaster's wife.",
    "2011_66": "An elderly Margaret Thatcher talks to the imagined presence of her recently deceased husband as she struggles to come to terms with his death while scenes from her past life, from girlhood to British prime minister, intervene.",
    "2011_67": "Oakland A's general manager Billy Beane's successful attempt to assemble a baseball team on a lean budget by employing computer-generated analysis to acquire new players.",
    "2011_68": "A family looks to prevent evil spirits from trapping their comatose child in a realm called The Further.",
    "2011_69": "This documentary follows Justin Bieber with some footage of performances from his 2010 concert tour.",
    "2011_7": "Dominic Toretto and his crew of street racers plan a massive heist to buy their freedom while in the sights of a powerful Brazilian drug lord and a dangerous federal agent.",
    "2011_70": "Two English comic book geeks traveling across the U.S. encounter an alien outside Area 51.",
    "2011_71": "Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.",
    "2011_72": "American seminary student Michael Kovak (Colin O'Donaghue) travels to Italy to take an exorcism course.",
    "2011_73": "A story centered on the friendship between a boy and a dolphin whose tail was lost in a crab trap.",
    "2011_74": "A Belge-Francophobe customs officer is forced to team up with a Frenchman during the elimination of the Franco-Belge borders in the 90s.",
    "2011_75": "Fourteenth century knights transport a suspected witch to a monastery, where monks deduce her powers could be the source of the Black Plague.",
    "2011_76": "Set in a medieval village that is haunted by a werewolf, a young girl falls for an orphaned woodcutter, much to her family's displeasure.",
    "2011_77": "A young girl institutionalized by her abusive stepfather retreats to an alternative reality as a coping strategy and envisions a plan to help her escape.",
    "2011_78": "Four socially troubled 18-year-olds from the south of England go on holiday to Malia.",
    "2011_79": "A lawyer defending a wealthy man begins to believe his client is guilty of more than just one crime.",
    "2011_8": "Two years after the bachelor party in Las Vegas, Phil, Stu, Alan, and Doug jet to Thailand for Stu's wedding. Stu's plan for a subdued pre-wedding brunch, however, goes seriously awry.",
    "2011_80": "Rick and Fred, two husbands who are having difficulty in their marriages, are given a Hall Pass by their wives: for one week, they can do whatever they want.",
    "2011_81": "A retired spy is called back into action, and to bond with her new step-children, she invites them along for the adventure to stop the evil Timekeeper from taking over the world. Read more: Synopsis",
    "2011_82": "J. Edgar Hoover, powerful head of the F.B.I. for nearly fifty years, looks back on his professional and personal life.",
    "2011_83": "Malcolm Turner and his stepson Trent go undercover at an all-girls school to flush out a killer.",
    "2011_84": "A young man sets out to uncover the truth about his life after finding his baby photo on a missing persons website.",
    "2011_85": "In the bleak days of the Cold War, espionage veteran George Smiley is forced from semi-retirement to uncover a Soviet Agent within MI6.",
    "2011_86": "A priest disobeys church law to track down the vampires who kidnapped his niece.",
    "2011_87": "A mysterious Hollywood stuntman and mechanic moonlights as a getaway driver and finds himself in trouble when he helps out his neighbor.",
    "2011_88": "An idealistic staffer for a new presidential candidate gets a crash course on dirty politics during his stint on the campaign trail.",
    "2011_89": "An elite hitman teaches his trade to an apprentice who has a connection to one of his previous victims.",
    "2011_9": "When the evil wizard Gargamel chases the tiny blue Smurfs out of their village, they tumble from their magical world into New York City.",
    "2011_90": "Dave is a married man with three kids and a loving wife, and Mitch is a single man who is at the prime of his sexual life. One fateful night while Mitch and Dave are peeing in a fountain, lightning strikes and they switch bodies.",
    "2011_91": "After losing his job, a middle-aged man reinvents himself by going back to college.",
    "2011_92": "Back in middle school after summer vacation, Greg Heffley and his older brother Rodrick must deal with their parents' misguided attempts to have them bond.",
    "2011_93": "A man discovers that his best friend's wife is having an affair.",
    "2011_94": "Friendships are tested and secrets come to the surface when terminally single Rachel falls for Dex, her best friend Darcy's fiance.",
    "2011_95": "In Moscow, five young people lead the charge against an alien race who have attacked Earth via our power supply.",
    "2011_96": "A sixteen-year-old girl who was raised by her father to be the perfect assassin is dispatched on a mission across Europe, tracked by a ruthless intelligence agent and her operatives.",
    "2011_97": "City teenager Ren MacCormack moves to a small town where rock music and dancing have been banned, and his rebellious spirit shakes up the populace.",
    "2011_98": "A vengeful barbarian warrior sets off to get his revenge on the evil warlord who attacked his village and murdered his father when he was a boy.",
    "2011_99": "A young woman, after witnessing her parents' murder as a child in Bogota, grows up to be a stone-cold assassin."
}