{
    "2012_1": {
        "plotSummary": "Earth's mightiest heroes must come together and learn to fight as a team if they are going to stop the mischievous Loki and his alien army from enslaving humanity.",
        "runtimeMinutes": "143"
    },
    "2012_10": {
        "plotSummary": "Agent J travels in time to M.I.B.'s early days in 1969 to stop an alien from assassinating his friend Agent K and changing history.",
        "runtimeMinutes": "106"
    },
    "2012_100": {
        "plotSummary": "Set in Depression-era Franklin County, Virginia, a trio of bootlegging brothers are threatened by a new special deputy and other authorities angling for a cut of their profits.",
        "runtimeMinutes": "116"
    },
    "2012_101": {
        "plotSummary": "Shot documentary-style, this film follows the daily grind of two young police officers in LA who are partners and friends, and what happens when they meet criminal forces greater than themselves.",
        "runtimeMinutes": "109"
    },
    "2012_102": {
        "plotSummary": "While trying to save their childhood orphanage, Moe, Larry and Curly inadvertently stumble into a murder plot and wind up starring in a reality television show.",
        "runtimeMinutes": "92"
    },
    "2012_103": {
        "plotSummary": "One year after meeting, Tom proposes to his girlfriend, Violet, but unexpected events keep tripping them up as they look to walk down the aisle together.",
        "runtimeMinutes": "124"
    },
    "2012_104": {
        "plotSummary": "A group of teenagers look to save their town from an invasion of North Korean soldiers.",
        "runtimeMinutes": "93"
    },
    "2012_105": {
        "plotSummary": "A crew of African American pilots in the Tuskegee training program, having faced segregation while kept mostly on the ground during World War II, are called into duty under the guidance of Col. A.J. Bullard.",
        "runtimeMinutes": "125"
    },
    "2012_106": {
        "plotSummary": "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, 2 monsters realize things may not be what they think.",
        "runtimeMinutes": "92"
    },
    "2012_107": {
        "plotSummary": "A daughter tries to remedy her dysfunctional relationship with her ailing father, a decorated baseball scout by helping him in a recruiting trip which could be his last.",
        "runtimeMinutes": "111"
    },
    "2012_108": {
        "plotSummary": "As a police psychologist works to talk down an ex-con who is threatening to jump from a Manhattan hotel rooftop, the biggest diamond heist ever committed is in motion.",
        "runtimeMinutes": "102"
    },
    "2012_109": {
        "plotSummary": "Summoned by an unexpected phone call, an elderly woman visits the country cottage she lived in as a child. Memories of an orphan boy she knew 47 years ago come flooding back to her.",
        "runtimeMinutes": "122"
    },
    "2012_11": {
        "plotSummary": "A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger.",
        "runtimeMinutes": "127"
    },
    "2012_110": {
        "plotSummary": "After moving with her mother to a small town, a teenager finds that an accident happened in the house at the end of the street. Things get more complicated when she befriends a boy. A double murder is not an accident.",
        "runtimeMinutes": "101"
    },
    "2012_111": {
        "plotSummary": "As inventor Andy Brewster is about to embark on the road trip of a lifetime, a quick stop at his mom's house turns into an unexpected cross-country voyage with her along for the ride.",
        "runtimeMinutes": "95"
    },
    "2012_112": {
        "plotSummary": "Mei, a young girl whose memory holds a priceless numerical code, finds herself pursued by the Triads, the Russian mob, and corrupt NYC cops. Coming to her aid is an ex-cage fighter whose life was destroyed by the gangsters on Mei's trail.",
        "runtimeMinutes": "94"
    },
    "2012_113": {
        "plotSummary": "In a violent, futuristic city where the police have the authority to act as judge, jury and executioner, a cop teams with a trainee to take down a gang that deals the reality-altering drug, SLO-MO.",
        "runtimeMinutes": "95"
    },
    "2012_114": {
        "plotSummary": "Six tourists hire an extreme tour guide who takes them to the abandoned city Pripyat, the former home to the workers of the Chernobyl nuclear reactor. During their exploration, they soon discover they are not alone.",
        "runtimeMinutes": "86"
    },
    "2012_115": {
        "plotSummary": "Jackie Cogan is an enforcer hired to restore order after three dumb guys rob a Mob protected card game, causing the local criminal economy to collapse.",
        "runtimeMinutes": "97"
    },
    "2012_116": {
        "plotSummary": "After the death of his father Murat II, Mehmet II ascends to the Ottoman throne. After braving internal and external enemies, he decides to complete what he was destined to do - conquer Constantinople.",
        "runtimeMinutes": "162"
    },
    "2012_117": {
        "plotSummary": "Businessman Wesley Deeds is jolted out of his scripted life when he meets Lindsey, a single mother who works on the cleaning crew in his office building.",
        "runtimeMinutes": "129"
    },
    "2012_118": {
        "plotSummary": "A troubled hedge fund magnate desperate to complete the sale of his trading empire makes an error that forces him to turn to an unlikely person for help.",
        "runtimeMinutes": "107"
    },
    "2012_119": {
        "plotSummary": "Meet adorable young chimp Oscar and his fellow mayhem-creating buddies, who see the world as their playground. Full of curiosity, joy and a love for mimicking others, these are some of the most extraordinary personalities in the jungle.",
        "runtimeMinutes": "78"
    },
    "2012_12": {
        "plotSummary": "John Bennett, a man whose childhood wish of bringing his teddy bear to life came true, now must decide between keeping the relationship with the bear, Ted or his girlfriend, Lori.",
        "runtimeMinutes": "106"
    },
    "2012_120": {
        "plotSummary": "A homicide detective is pushed to the brink of his moral and physical limits as he tangles with a ferociously skilled hired killer who specializes in torture and pain.",
        "runtimeMinutes": "101"
    },
    "2012_121": {
        "plotSummary": "A fisheries expert is approached by a consultant to help realize a sheik's vision of bringing the sport of fly-fishing to the desert and embarks on an upstream journey of faith and fish to prove the impossible possible.",
        "runtimeMinutes": "107"
    },
    "2012_122": {
        "plotSummary": "A black ops super soldier seeks payback after she is betrayed and set up during a mission.",
        "runtimeMinutes": "93"
    },
    "2012_123": {
        "plotSummary": "A young woman is entranced by an Aerialist. When they fall into the dreamlike world of Cirque du Soleil and are separated, they travel through the different tent worlds trying to find each other.",
        "runtimeMinutes": "91"
    },
    "2012_124": {
        "plotSummary": "A documentary that examines the question, \"If Barack Obama wins a second term, where will we be in 2016?\" Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2012_125": {
        "plotSummary": "An introvert freshman is taken under the wings of two seniors who welcome him to the real world.",
        "runtimeMinutes": "103"
    },
    "2012_126": {
        "plotSummary": "A man wrongly convicted of conspiracy to commit espionage against the U.S. is offered his freedom if he can rescue the president's daughter from an outer space prison taken over by violent inmates.",
        "runtimeMinutes": "95"
    },
    "2012_127": {
        "plotSummary": "A look at the life, career and music of singer Katy Perry as we follow her on the California Dreams World Tour. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2012_128": {
        "plotSummary": "A series of interconnected short films follows a washed-up producer as he pitches insane story lines featuring some of the biggest stars in Hollywood.",
        "runtimeMinutes": "94"
    },
    "2012_129": {
        "plotSummary": "A struggling screenwriter inadvertently becomes entangled in the Los Angeles criminal underworld after his oddball friends kidnap a gangster's beloved Shih Tzu.",
        "runtimeMinutes": "110"
    },
    "2012_13": {
        "plotSummary": "Determined to make her own path in life, Princess Merida (Kelly Macdonald) defies a custom that brings chaos to her kingdom. Granted one wish, Merida must rely on her bravery and her archery skills to undo a beastly curse.",
        "runtimeMinutes": "93"
    },
    "2012_130": {
        "plotSummary": "Vincent is about to become a father. At a meeting with childhood friends he announces the name for his future son. The scandalous name ignites a discussion which surfaces unpleasant matters from the past of the group.",
        "runtimeMinutes": "109"
    },
    "2012_131": {
        "plotSummary": "G.G. Sparrow faces off with her choir's newly appointed director, Vi Rose Hill, over the group's direction as they head into a national competition.",
        "runtimeMinutes": "118"
    },
    "2012_132": {
        "plotSummary": "In Manhattan, a bike messenger picks up an envelope that attracts the interest of a dirty cop, who pursues the cyclist throughout the city.",
        "runtimeMinutes": "91"
    },
    "2012_133": {
        "plotSummary": "A former sports star who's fallen on hard times starts coaching his son's football team as a way to get his life together. His attempts to become an adult are met with challenges from the attractive football moms who pursue him at every turn.",
        "runtimeMinutes": "105"
    },
    "2012_134": {
        "plotSummary": "When a madman begins committing horrific murders inspired by Edgar Allan Poe's works, a young Baltimore detective joins forces with Poe to stop him from making his stories a reality.",
        "runtimeMinutes": "110"
    },
    "2012_135": {
        "plotSummary": "Georges and Anne are an octogenarian couple. They are cultivated, retired music teachers. Their daughter, also a musician, lives in Britain with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
        "runtimeMinutes": "127"
    },
    "2012_136": {
        "plotSummary": "A con man uncovers a deadly secret and must save his lady love, the small-town locals and the little girl who insists she's his daughter, from the mob.",
        "runtimeMinutes": "140"
    },
    "2012_137": {
        "plotSummary": "All hell breaks loose when a Muslim man breaks a temple lock to save a little child, thus for his safety keeps a Hindu name, where he starts making web of lies.",
        "runtimeMinutes": "155"
    },
    "2012_138": {
        "plotSummary": "A Naval veteran arrives home from war unsettled and uncertain of his future - until he is tantalized by the Cause and its charismatic leader.",
        "runtimeMinutes": "138"
    },
    "2012_139": {
        "plotSummary": "The relationship between Alfred Hitchcock and his wife Alma Reville during the filming of Psycho in 1959 is explored.",
        "runtimeMinutes": "98"
    },
    "2012_14": {
        "plotSummary": "A video game villain wants to be a hero and sets out to fulfill his dream, but his quest brings havoc to the whole arcade where he lives.",
        "runtimeMinutes": "101"
    },
    "2012_140": {
        "plotSummary": "A young boy's father is lynched before his eyes; fifteen years later he returns home for revenge.",
        "runtimeMinutes": "174"
    },
    "2012_141": {
        "plotSummary": "Put in charge of his young son, Alain leaves Belgium for Antibes to live with his sister and her husband as a family. Alain's bond with Stephanie, a killer whale trainer, grows deeper after Stephanie suffers a horrible accident.",
        "runtimeMinutes": "120"
    },
    "2012_142": {
        "plotSummary": "Two mismatched cops team up to investigate the murder of a business mogul's wife.",
        "runtimeMinutes": "96"
    },
    "2012_143": {
        "plotSummary": "A comedy of errors wherein four men help each other to fool their prospective father-in-laws creating a cascade of confusion and mayhem.",
        "runtimeMinutes": "145"
    },
    "2012_144": {
        "plotSummary": "In small-town Alaska, a news reporter recruits his ex-girlfriend - a Greenpeace volunteer - on a campaign to save a family of gray whales trapped by rapidly forming ice in the Arctic Circle.",
        "runtimeMinutes": "107"
    },
    "2012_145": {
        "plotSummary": "In the 1960s, three sisters form a girl group and soon become local sensations with major label interest, but fame becomes a challenge as the close-knit family begins to fall apart.",
        "runtimeMinutes": "116"
    },
    "2012_146": {
        "plotSummary": "A series of short films set around the theme of infidelity.",
        "runtimeMinutes": "109"
    },
    "2012_147": {
        "plotSummary": "Rattled by sudden unemployment, a Manhattan couple surveys alternative living options, ultimately deciding to experiment with living on a rural commune where free love rules.",
        "runtimeMinutes": "98"
    },
    "2012_148": {
        "plotSummary": "A journey into the lives of a mother polar bear and her two seven-month-old cubs as they navigate the changing Arctic wilderness they call home.",
        "runtimeMinutes": "40"
    },
    "2012_149": {
        "plotSummary": "Legendary explorer Thor Heyerdahl's epic 4,300-mile crossing of the Pacific on a balsawood raft in 1947, in an effort to prove that it was possible for South Americans to settle in Polynesia in pre-Columbian times.",
        "runtimeMinutes": "118"
    },
    "2012_15": {
        "plotSummary": "In 19th-century France, Jean Valjean, who for decades has been hunted by the ruthless policeman Javert after breaking parole, agrees to care for a factory worker's daughter. The decision changes their lives forever.",
        "runtimeMinutes": "158"
    },
    "2012_150": {
        "plotSummary": "Adam and Eden fell in love as teens despite the fact that they live on twinned worlds with gravities that pull in opposite directions. Ten years after a forced separation, Adam sets out on a dangerous quest to reconnect with his love.",
        "runtimeMinutes": "109"
    },
    "2012_151": {
        "plotSummary": "Faced with both her hot-tempered father's fading health and melting ice-caps that flood her ramshackle bayou community and unleash ancient aurochs, six-year-old Hushpuppy must learn the ways of courage and love.",
        "runtimeMinutes": "93"
    },
    "2012_152": {
        "plotSummary": "On the hunt for a fabled treasure of gold, a band of warriors, assassins, and a rogue British soldier descend upon a village in feudal China, where a humble blacksmith looks to defend himself and his fellow villagers.",
        "runtimeMinutes": "95"
    },
    "2012_153": {
        "plotSummary": "It's 1968, and four young, talented Australian Aboriginal girls learn about love, friendship and war when their all-girl group The Sapphires entertain the US troops in Vietnam.",
        "runtimeMinutes": "103"
    },
    "2012_154": {
        "plotSummary": "After a journalist discovers his identity, a former Weather Underground activist goes on the run.",
        "runtimeMinutes": "125"
    },
    "2012_155": {
        "plotSummary": "A woman is convinced her kidnapper has returned when her sister goes missing.",
        "runtimeMinutes": "94"
    },
    "2012_156": {
        "plotSummary": "A former thief frantically searches for his missing daughter, who has been kidnapped and locked in the trunk of a taxi.",
        "runtimeMinutes": "96"
    },
    "2012_157": {
        "plotSummary": "As the police launch a full-scale crackdown on organized crime, it ignites a national yakuza struggle between the Sanno of the East and Hanabishi of the West. Written by Production",
        "runtimeMinutes": "112"
    },
    "2012_158": {
        "plotSummary": "After his family is kidnapped during their sailing trip in Spain, a young Wall Street trader is confronted by the people responsible: intelligence agents looking to recover a mysterious briefcase.",
        "runtimeMinutes": "93"
    },
    "2012_159": {
        "plotSummary": "Former getaway driver Charles Bronson jeopardizes his Witness Protection Plan identity in order to help his girlfriend get to Los Angeles. The feds and Charles' former gang chase them on the road.",
        "runtimeMinutes": "100"
    },
    "2012_16": {
        "plotSummary": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
        "runtimeMinutes": "165"
    },
    "2012_160": {
        "plotSummary": "A hairdresser, who has lost her hair to cancer, finds out her husband is having an affair, travels to Italy for her daughter's wedding, and meets a widower who still blames the world for the loss of his wife.",
        "runtimeMinutes": "116"
    },
    "2012_161": {
        "plotSummary": "A girl is trapped inside her family's lakeside retreat and becomes unable to contact the outside world as supernatural forces haunt the house with mysterious energy and consequences.",
        "runtimeMinutes": "86"
    },
    "2012_162": {
        "plotSummary": "A high school French teacher is drawn into a precocious student's increasingly transgressive story about his relationship with a friend's family.",
        "runtimeMinutes": "105"
    },
    "2012_163": {
        "plotSummary": "A writer at the peak of his literary success discovers the steep price he must pay for stealing another man's work.",
        "runtimeMinutes": "102"
    },
    "2012_164": {
        "plotSummary": "A teacher lives a lonely life, all the while struggling over his son's custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie.",
        "runtimeMinutes": "115"
    },
    "2012_165": {
        "plotSummary": "A young queen, who is married to an insane king, falls secretly in love with her physician - and together they start a revolution that changes a nation forever.",
        "runtimeMinutes": "137"
    },
    "2012_166": {
        "plotSummary": "Psychologist Margaret Matheson and her assistant study paranormal activity, which leads them to investigate a world-renowned psychic who has resurfaced years after his toughest critic mysteriously passed away.",
        "runtimeMinutes": "114"
    },
    "2012_167": {
        "plotSummary": "Narrowly avoiding jail, new dad Robbie vows to turn over a new leaf. A visit to a whisky distillery inspires him and his mates to seek a way out of their hopeless lives.",
        "runtimeMinutes": "101"
    },
    "2012_168": {
        "plotSummary": "Two best friends decide to have a child together while keeping their relationship platonic, so they can avoid the toll kids can take on romantic relationships.",
        "runtimeMinutes": "107"
    },
    "2012_169": {
        "plotSummary": "1958. Rose is a terrible secretary but a demon typist. Her handsome boss resolves to turn her into the fastest girl in the world.",
        "runtimeMinutes": "111"
    },
    "2012_17": {
        "plotSummary": "Following clues to the origin of mankind, a team finds a structure on a distant moon, but they soon realize they are not alone.",
        "runtimeMinutes": "124"
    },
    "2012_170": {
        "plotSummary": "While settling his recently deceased father's estate, a salesman discovers he has a sister whom he never knew about, leading both siblings to re-examine their perceptions about family and life choices.",
        "runtimeMinutes": "114"
    },
    "2012_171": {
        "plotSummary": "An elite crime-fighting unit in the court of the Chinese emperor relies on flying swords to defeat their enemies.",
        "runtimeMinutes": "112"
    },
    "2012_172": {
        "plotSummary": "Three friends are asked to be bridesmaids at a wedding of a woman they used to ridicule back in high school.",
        "runtimeMinutes": "87"
    },
    "2012_173": {
        "plotSummary": "After India's father dies, her Uncle Charlie, whom she never knew existed, comes to live with her and her unstable mother. She comes to suspect this mysterious, charming man has ulterior motives and becomes increasingly infatuated with him.",
        "runtimeMinutes": "99"
    },
    "2012_174": {
        "plotSummary": "As an asteroid nears Earth, a man finds himself alone after his wife leaves in a panic. He decides to take a road trip to reunite with his high school sweetheart. Accompanying him is a neighbor who inadvertently puts a wrench in his plan.",
        "runtimeMinutes": "101"
    },
    "2012_175": {
        "plotSummary": "The story of Danièle Delpeuch and how she was appointed as the private chef for François Mitterrand.",
        "runtimeMinutes": "95"
    },
    "2012_176": {
        "plotSummary": "Wren's Halloween plans go awry when she's made to babysit her brother, who disappears into a sea of trick-or-treaters. With her best friend and two nerds at her side, she needs to find her brother before her mom finds out he's missing.",
        "runtimeMinutes": "86"
    },
    "2012_177": {
        "plotSummary": "A couple is haunted by a supernatural presence that is unleashed during a college experiment.",
        "runtimeMinutes": "83"
    },
    "2012_178": {
        "plotSummary": "A salesman for a natural gas company experiences life-changing events after arriving in a small town, where his corporation wants to tap into the available resources.",
        "runtimeMinutes": "106"
    },
    "2012_179": {
        "plotSummary": "A couple's wedding day turns horrific as some of the guests start showing signs of a strange illness.",
        "runtimeMinutes": "80"
    },
    "2012_18": {
        "plotSummary": "In a twist to the fairy tale, the Huntsman ordered to take Snow White into the woods to be killed winds up becoming her protector and mentor in a quest to vanquish the Evil Queen.",
        "runtimeMinutes": "127"
    },
    "2012_180": {
        "plotSummary": "The story of the love affair between FDR and his distant cousin Margaret \"Daisy\" Suckley, centered around the weekend in 1939 when the King and Queen of the United Kingdom visited upstate New York.",
        "runtimeMinutes": "94"
    },
    "2012_181": {
        "plotSummary": "A man in an iron lung who wishes to lose his virginity contacts a professional sex surrogate with the help of his therapist and priest.",
        "runtimeMinutes": "95"
    },
    "2012_182": {
        "plotSummary": "A quiet, sweet tempered housewife endures small slights from her well-educated husband and daughter every day because of her inability to speak and understand English.",
        "runtimeMinutes": "134"
    },
    "2012_183": {
        "plotSummary": "A chronicle of the Cristeros War (1926-1929); a war by the people of Mexico against the atheistic Mexican government.",
        "runtimeMinutes": "145"
    },
    "2012_184": {
        "plotSummary": "The Nazis set up a secret base on the dark side of the moon in 1945 where they hide out and plan to return to power in 2018.",
        "runtimeMinutes": "93"
    },
    "2012_185": {
        "plotSummary": "In small-town Texas, an affable mortician strikes up a friendship with a wealthy widow, though when she starts to become controlling, he goes to great lengths to separate himself from her grasp.",
        "runtimeMinutes": "99"
    },
    "2012_186": {
        "plotSummary": "A new hero is born in this hilarious, animated adventure of epic proportions. Timo, a student at the Gladiators' Academy in Rome, has no desire to become a legendary gladiator like his stepfather. That is, until the mesmerizing Lucilla ...See moreA new hero is born in this hilarious, animated adventure of epic proportions. Timo, a student at the Gladiators' Academy in Rome, has no desire to become a legendary gladiator like his stepfather. That is, until the mesmerizing Lucilla walks into his life. With the help of an unlikely band of sidekicks, Timo is determined to be the gladiator of her dreams and embarks on an action-packed journey to become the Colosseum's first victor.See less",
        "runtimeMinutes": "94"
    },
    "2012_187": {
        "plotSummary": "A man who escapes from the vicious grips of the serial killer known as \"The Collector\" is then forced to help rescue an innocent girl from the killer's booby-trapped lair.",
        "runtimeMinutes": "82"
    },
    "2012_188": {
        "plotSummary": "A dramatization of one man's rescue of Jewish refugees in the German-occupied Polish city of Lvov.",
        "runtimeMinutes": "145"
    },
    "2012_189": {
        "plotSummary": "Young writer Sal Paradise has his life shaken by the arrival of free-spirited Dean Moriarty and his girl, Marylou. As they travel across the country, they encounter a mix of people who each impact their journey indelibly.",
        "runtimeMinutes": "124"
    },
    "2012_19": {
        "plotSummary": "In Istanbul, retired CIA operative Bryan Mills and his wife are taken hostage by the father of a kidnapper Mills killed while rescuing his daughter.",
        "runtimeMinutes": "92"
    },
    "2012_190": {
        "plotSummary": "A series of seemingly unconnected events across the world leads to Agent Vinod undertaking a globe-trotting mission to discover why his colleague was murdered.",
        "runtimeMinutes": "157"
    },
    "2012_191": {
        "plotSummary": "A chronicle of a young man's rise to power in Paris via his manipulation of the city's wealthiest and most influential women.",
        "runtimeMinutes": "102"
    },
    "2012_192": {
        "plotSummary": "A veteran chef faces off against his restaurant group's new CEO, who wants to the establishment to lose a star from its rating in order to bring in a younger chef who specializes in molecular gastronomy.",
        "runtimeMinutes": "84"
    },
    "2012_193": {
        "plotSummary": "A S.W.A.T. team becomes trapped in a tenement run by a ruthless mobster and his army of killers and thugs.",
        "runtimeMinutes": "101"
    },
    "2012_194": {
        "plotSummary": "A novelist struggling with writer's block finds romance in a most unusual way: by creating a female character he thinks will love him, then willing her into existence.",
        "runtimeMinutes": "104"
    },
    "2012_195": {
        "plotSummary": "Two South Africans set out to discover what happened to their unlikely musical hero, the mysterious 1970s rock n roller, Rodriguez.",
        "runtimeMinutes": "86"
    },
    "2012_196": {
        "plotSummary": "A mother brings her teenage son to Sarajevo, where his father died in the Bosnian conflict years ago.",
        "runtimeMinutes": "127"
    },
    "2012_197": {
        "plotSummary": "At a Montreal public grade school, an Algerian immigrant is hired to replace a popular teacher who committed suicide in her classroom. While helping his students deal with their grief, his own recent loss is revealed.",
        "runtimeMinutes": "95"
    },
    "2012_198": {
        "plotSummary": "Five old friends decide to move in together as an alternate to living in a retirement home; joining them is an ethnology student whose thesis is on the aging population.",
        "runtimeMinutes": "96"
    },
    "2012_199": {
        "plotSummary": "After the events at Lake Victoria, the pre-historic school of blood-thirsty piranhas make their way into a newly opened waterpark.",
        "runtimeMinutes": "83"
    },
    "2012_2": {
        "plotSummary": "James Bond's loyalty to M is tested when her past comes back to haunt her. When MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.",
        "runtimeMinutes": "143"
    },
    "2012_20": {
        "plotSummary": "Dracula, who operates a high-end resort away from the human world, goes into overprotective mode when a boy discovers the resort and falls for the count's teenaged daughter.",
        "runtimeMinutes": "91"
    },
    "2012_200": {
        "plotSummary": "Scheming on a way to save their father's ranch, the Alvarez brothers find themselves in a war with Mexico's most feared drug lord.",
        "runtimeMinutes": "85"
    },
    "2012_201": {
        "plotSummary": "The story of an unlikely friendship between a bear, Ernest, and a young mouse named Celestine.",
        "runtimeMinutes": "80"
    },
    "2012_202": {
        "plotSummary": "A female superstar struggles through the trials and tribulations of being a Bollywood actress.",
        "runtimeMinutes": "149"
    },
    "2012_203": {
        "plotSummary": "When young Jay Moriarity discovers that the mythic Mavericks surf break, one of the biggest waves on Earth, exists just miles from his Santa Cruz home, he enlists the help of local legend Frosty Hesson to train him to survive it.",
        "runtimeMinutes": "116"
    },
    "2012_204": {
        "plotSummary": "A hardened detective in the Flying Squad of London's Metropolitan police. Based on the '70s UK TV show.",
        "runtimeMinutes": "112"
    },
    "2012_205": {
        "plotSummary": "An advertising executive comes up with a campaign to defeat Augusto Pinochet in Chile's 1988 referendum.",
        "runtimeMinutes": "118"
    },
    "2012_206": {
        "plotSummary": "When her child goes missing, a mother looks to unravel the legend of the Tall Man, an entity who allegedly abducts children.",
        "runtimeMinutes": "106"
    },
    "2012_207": {
        "plotSummary": "Riding across Manhattan in a stretch limo in order to get a haircut, a 28-year-old billionaire asset manager's day devolves into an odyssey with a cast of characters that start to tear his world apart.",
        "runtimeMinutes": "109"
    },
    "2012_208": {
        "plotSummary": "Labeled an outcast by his brainy family, a bouncer overcomes long odds to lead a team of under performing misfits to semi-pro hockey glory, beating the crap out of everything that stands in his way.",
        "runtimeMinutes": "92"
    },
    "2012_209": {
        "plotSummary": "A doctor working in 1980s East Germany finds herself banished to a small country hospital.",
        "runtimeMinutes": "105"
    },
    "2012_21": {
        "plotSummary": "A 12-year-old boy searches for the one thing that will enable him to win the affection of the girl of his dreams. To find it he must discover the story of the Lorax, the grumpy yet charming creature who fights to protect his world.",
        "runtimeMinutes": "86"
    },
    "2012_210": {
        "plotSummary": "Clinging to an unfinished letter written by her recently deceased father, young Momo moves with her mother from bustling Tokyo to the remote Japanese island of Shio. Upon their arrival, she begins to explore her new habitat, meeting local ...See moreClinging to an unfinished letter written by her recently deceased father, young Momo moves with her mother from bustling Tokyo to the remote Japanese island of Shio. Upon their arrival, she begins to explore her new habitat, meeting local children and learning their routines and customs. However, it's not long before several bizarre occurrences crop up around the previously tranquil island. Orchards are found ransacked, prized trinkets start disappearing and, worst of all, each morning after her mother leaves for work, Momo hears strange mumblings coming from the attic of their home. Annoyed by these creepy goings-on and her mother's refusal to believe them, Momo embarks on a strange and supernatural adventure to discover the source of the mischief, which leads her to a trio of troublesome imps: the flatulent lizard Kawa, the childlike Mame and their hulking ogre leader Iwa. Momo also learns that her visit to the island is in some way connected to her father's mysterious letter.  Written by AnonymousSee less",
        "runtimeMinutes": "120"
    },
    "2012_211": {
        "plotSummary": "A woman is made to realize that her prayers and sacrifice to save her boyfriend's life may have led him to a fate worse than death.",
        "runtimeMinutes": "198"
    },
    "2012_212": {
        "plotSummary": "A loan shark is forced to reconsider his violent lifestyle after the arrival of a mysterious woman claiming to be his long-lost mother.",
        "runtimeMinutes": "103"
    },
    "2012_213": {
        "plotSummary": "An enterprising Saudi girl signs on for her school's Koran recitation competition as a way to raise the remaining funds she needs in order to buy the green bicycle that has captured her interest.",
        "runtimeMinutes": "98"
    },
    "2012_214": {
        "plotSummary": "A look at the platonic relationship between Marie Antoinette and one of her female readers during the first days of the French Revolution.",
        "runtimeMinutes": "100"
    },
    "2012_215": {
        "plotSummary": "Members of a world-renowned string quartet struggle to stay together in the face of death, competing egos and insuppressible lust.",
        "runtimeMinutes": "105"
    },
    "2012_216": {
        "plotSummary": "A series of events change the orphaned Pip's life forever as he eagerly abandons his humble origins to begin a new life as a gentleman.",
        "runtimeMinutes": "128"
    },
    "2012_217": {
        "plotSummary": "The life of Andres Lopez Lopez during his years involved with the Colombian Cartel aka \"Cartel Norte del Valle\".",
        "runtimeMinutes": "102"
    },
    "2012_218": {
        "plotSummary": "Rin and his friends, along with the rest of True Cross Academy Town, are in the midst of preparing for a festival that is celebrated only once every 11 years. While the barriers protecting the city from demon intrusions are being repaired,...See moreRin and his friends, along with the rest of True Cross Academy Town, are in the midst of preparing for a festival that is celebrated only once every 11 years. While the barriers protecting the city from demon intrusions are being repaired, Rin and his twin brother Yukio are sent to the scene of an exorcism as reinforcements. Things take a turn for the worse and as they attempt to salvage their mission, they meet a mysterious young boy that may threaten everything that they know. Meanwhile, Cheng-Long Liu, a First Class Senior Exorcist from the Taiwan Branch, joins the 'simple' repair operation that forces his fate to cross with 'Satan's spawn', Rin.  Written by ELEVEN ARTSSee less",
        "runtimeMinutes": "88"
    },
    "2012_219": {
        "plotSummary": "Elise and Didier fall in love at first sight, in spite of their differences. He talks, she listens. He's a romantic atheist, she's a religious realist. When their daughter becomes seriously ill, their love is put on trial.",
        "runtimeMinutes": "111"
    },
    "2012_22": {
        "plotSummary": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.",
        "runtimeMinutes": "194"
    },
    "2012_220": {
        "plotSummary": "A mysterious creature \"Kyubey\" offers a young girl named Madoka Kaname the chance to have any one wish granted to her. In exchange she must battle evil creatures named \"Witches\" at the risk of losing her life.",
        "runtimeMinutes": "130"
    },
    "2012_221": {
        "plotSummary": "International Security Affairs agent Jon is on a dangerous mission to escort a criminal scientist to another country. En route, a member of his team, Sean, turns out to be a traitor and shoots Jon in the head while kidnapping the scientist...See moreInternational Security Affairs agent Jon is on a dangerous mission to escort a criminal scientist to another country. En route, a member of his team, Sean, turns out to be a traitor and shoots Jon in the head while kidnapping the scientist. When Jon wakes up in the hospital, a doctor tells him that within weeks, the bullet in his brain will cause complete paralysis. Jon returns to Beijing to see his mother, who confesses that Jon has a brother in Malaysia who was raised by his father, a gambler. Jon takes a flight to Malaysia to find his brother, Yeung. On the plane he forms a bond with Dr. Kan, who promises to look into possible treatments for his condition. However, when they arrive, Yeung tries to kidnap the doctor and when Jon intervenes, he's also taken hostage. The two soon realize they're brothers, and decide to work together in order to keep the criminals behind the kidnappings from reinfecting the world of a disease long thought cured.  Written by AnonymousSee less",
        "runtimeMinutes": "122"
    },
    "2012_222": {
        "plotSummary": "India's top spy Tiger and his love Zoya battle the dark world of intelligence and espionage that forbids its soldiers from loving the enemy.",
        "runtimeMinutes": "132"
    },
    "2012_223": {
        "plotSummary": "A space scientist working on a project to communicate with aliens visits a village called Paglapur. To improve the plight of the inhabitants of Paglapur, he comes up with a novel idea.",
        "runtimeMinutes": "104"
    },
    "2012_224": {
        "plotSummary": "Two determined mothers­, one a teacher, look to transform their children's failing inner city school. Facing a powerful and entrenched bureaucracy, they risk everything to make a difference in the education and future of their children.",
        "runtimeMinutes": "121"
    },
    "2012_225": {
        "plotSummary": "Inspector Surjan Shekhawat, who is dealing with a depressing past, has to investigate a high profile murder case, deal with his crumbling marriage and use the help and solace of a prostitute by the name of Rosie.",
        "runtimeMinutes": "140"
    },
    "2012_226": {
        "plotSummary": "A college freshman's world is rocked when she learns she is the adopted survivor of a failed abortion.",
        "runtimeMinutes": "107"
    },
    "2012_227": {
        "plotSummary": "A happily married woman falls for the artist who lives across the street.",
        "runtimeMinutes": "116"
    },
    "2012_228": {
        "plotSummary": "The newly appointed CEO of a giant European investment bank works to hold on to his power when an American hedge fund company tries to buy out his company.",
        "runtimeMinutes": "114"
    },
    "2012_229": {
        "plotSummary": "In the near future, an ex-jewel thief receives a gift from his son: a robot butler programmed to look after him. But soon the two companions try their luck as a heist team.",
        "runtimeMinutes": "89"
    },
    "2012_23": {
        "plotSummary": "Sean Anderson partners with his mom's husband on a mission to find his grandfather, who is thought to be missing on a mythical island.",
        "runtimeMinutes": "94"
    },
    "2012_230": {
        "plotSummary": "As single mom Grace juggles work, bills, and her affair with a married doctor, her daughter, Ansiedad, plots a shortcut to adulthood after finding inspiration in the coming-of-age stories she's reading for school.",
        "runtimeMinutes": "93"
    },
    "2012_231": {
        "plotSummary": "Dispatched from his basement room on an errand for his widowed mother, slacker Jeff might discover his destiny (finally) when he spends the day with his unhappily married brother as he tracks his possibly adulterous wife.",
        "runtimeMinutes": "83"
    },
    "2012_232": {
        "plotSummary": "Keith Lemon (Leigh Francis) is preparing to take his invention, the securipole, which he has been attempting to lift off the ground for twenty years, to a business convention in London. Meanwhile, his girlfriend Rosie (Laura Aikman) has ...See moreKeith Lemon (Leigh Francis) is preparing to take his invention, the securipole, which he has been attempting to lift off the ground for twenty years, to a business convention in London. Meanwhile, his girlfriend Rosie (Laura Aikman) has discovered that she is pregnant, but due to Keith being away, instead confides in his best friend, Dougie (Kevin Bishop). At the convention, the securipole fails to attract any big investor attention, and back at home, an order of 1,000,000 securipoles arrives, much to Rosie and Dougie's dismay. Realising that his invention may never be successful, and that he now owes Evil Steve (Leigh Francis) a ton of money for the securipoles, Lemon decides to stay in London, and takes the advice of fellow businessman Kushvinder (Harish Patel), and accepts the gift of a new style mobile phone that Kushvinder has invented. Attempting to turn the gift into his next money-making scheme, Lemon accepts an offer to appear on David Hasselhoff's prime time television chat show, after meeting up with his guardian angel, Archimedes (Verne Troyer). At first, the phone fails to impress, but after Lemon places a sticky Lemon sweet on the back, becomes an overnight sensation. Kelly Brook is impressed with the invention, and offers Lemon an invitation to go out on a date with her. Things are finally looking up - and Lemon decides to stick at his new life, while back home, Rosie is in serious danger after being kidnapped by Evil Steve. However, Lemon's world comes crashing down when the Lemon phone is discovered to have a major technical fault, which causes the owner's mouth to sag, giving them a speech impediment. Realising that he has no choice but to go back to his old life, Lemon accepts the advice of his best friend, Dougie, but will he be able to save Rosie from the clutches of Evil Steve, and escape the media backlash that he is facing?  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2012_233": {
        "plotSummary": "After suffering a stroke, an altruistic maid announces that she wants to quit her job and move into an old people's home.",
        "runtimeMinutes": "118"
    },
    "2012_234": {
        "plotSummary": "When a debt puts a young man's life in danger, he turns to putting a hit out on his evil mother in order to collect the insurance.",
        "runtimeMinutes": "102"
    },
    "2012_235": {
        "plotSummary": "Three young people learn that love can neither be defined nor contained by society's definition of normal and abnormal.",
        "runtimeMinutes": "151"
    },
    "2012_236": {
        "plotSummary": "A charismatic, crazy hothead transforms a family's life when she becomes the nanny of five girls whose mother has cracked from her husband's political ambitions and his infidelity.",
        "runtimeMinutes": "116"
    },
    "2012_237": {
        "plotSummary": "Filmed over nearly five years in twenty-five countries on five continents, and shot on seventy-millimetre film, Samsara transports us to the varied worlds of sacred grounds, disaster zones, industrial complexes, and natural wonders. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2012_238": {
        "plotSummary": "Three magazine employees head out on an assignment to interview a guy who placed a classified advertisement seeking a companion for time travel.",
        "runtimeMinutes": "86"
    },
    "2012_239": {
        "plotSummary": "An unhappily married woman struggles to break free from social pressures.",
        "runtimeMinutes": "110"
    },
    "2012_24": {
        "plotSummary": "Mr. Church reunites the Expendables for what should be an easy paycheck, but when one of their men is murdered on the job, their quest for revenge puts them deep in enemy territory and up against an unexpected threat.",
        "runtimeMinutes": "103"
    },
    "2012_240": {
        "plotSummary": "A dramatic thriller that weaves together the stories of an array of people from disparate social backgrounds through their intersecting relationships.",
        "runtimeMinutes": "110"
    },
    "2012_241": {
        "plotSummary": "While working alongside his long-time friend and colleague in building a hospital for the residents of a Buenos Aries shantytown, a troubled priest finds solace in a young, atheist social worker.",
        "runtimeMinutes": "105"
    },
    "2012_242": {
        "plotSummary": "To revenge his past, Aakash Rana plants bomb in a train endangering lives of 500 passengers.",
        "runtimeMinutes": "121"
    },
    "2012_243": {
        "plotSummary": "In future Moscow, where corporate brands have created a disillusioned population, one man's effort to unlock the truth behind the conspiracy will lead to an epic battle with hidden forces that control the world.",
        "runtimeMinutes": "112"
    },
    "2012_244": {
        "plotSummary": "Chulbul Pandey invites a fresh trouble when he kills the brother of a notorious politician and the former swears to wreak havoc in his life.",
        "runtimeMinutes": "120"
    },
    "2012_245": {
        "plotSummary": "Travis Pastrana and his tight-knit, highly-skilled, adrenaline-addicted friends bring their impossible, ridiculous, insane and hysterical adventures to the big screen for the first time.",
        "runtimeMinutes": "92"
    },
    "2012_246": {
        "plotSummary": "A team of parapsychologists try to figure out a strange phenomenon occurring in an apartment building.",
        "runtimeMinutes": "80"
    },
    "2012_247": {
        "plotSummary": "Mini isn't eager to wed the rich suitor who's been chosen for her, so she stages her own kidnapping and runs off with a man who works for her father.",
        "runtimeMinutes": "130"
    },
    "2012_248": {
        "plotSummary": "Manhattan couple Marion and Mingus, who each have children from prior relationships, find their comfortable family dynamic jostled by a visit from Marion's relatives.",
        "runtimeMinutes": "96"
    },
    "2012_249": {
        "plotSummary": "Former lovers Jimmy and Cherie discover that getting over each other isn't as easy as they thought in this sequel to the romantic comedy Love in a Puff.",
        "runtimeMinutes": "112"
    },
    "2012_25": {
        "plotSummary": "When the evil spirit Pitch launches an assault on Earth, the Immortal Guardians team up to protect the innocence of children all around the world.",
        "runtimeMinutes": "97"
    },
    "2012_250": {
        "plotSummary": "A comedy centered on a veteran film producer with major financial and family troubles who is lured into remaking a classic adult movie for the leader of a triad gang.",
        "runtimeMinutes": "93"
    },
    "2012_251": {
        "plotSummary": "A documentary on peer-to-peer bullying in schools across America.",
        "runtimeMinutes": "98"
    },
    "2012_252": {
        "plotSummary": "A woman inexplicably finds herself cut off from all human contact when an invisible, unyielding wall suddenly surrounds the countryside. Accompanied by her loyal dog Lynx, she becomes immersed in a world untouched by civilization and ruled...See moreA woman inexplicably finds herself cut off from all human contact when an invisible, unyielding wall suddenly surrounds the countryside. Accompanied by her loyal dog Lynx, she becomes immersed in a world untouched by civilization and ruled by the laws of nature.  Written by Music Box FilmsSee less",
        "runtimeMinutes": "108"
    },
    "2012_253": {
        "plotSummary": "A documentary on the life, music, and legacy of Bob Marley.",
        "runtimeMinutes": "144"
    },
    "2012_254": {
        "plotSummary": "On her latest assignment, a journalist for Elle immerses herself in a prostitution ring run by university students.",
        "runtimeMinutes": "99"
    },
    "2012_255": {
        "plotSummary": "Two young men, one Israeli and one Palestinian, discover they were accidentally switched at birth. Read more: Synopsis",
        "runtimeMinutes": "105"
    },
    "2012_256": {
        "plotSummary": "A reporter returns to his Florida hometown to investigate a case involving a death row inmate.",
        "runtimeMinutes": "107"
    },
    "2012_257": {
        "plotSummary": "A divorcing couple tries to maintain their friendship while they both pursue other people.",
        "runtimeMinutes": "92"
    },
    "2012_258": {
        "plotSummary": "Four men go on a heroic mission to help four women and wind up experiencing a series of mishaps.",
        "runtimeMinutes": "115"
    },
    "2012_259": {
        "plotSummary": "A modern ghost story which turns a love/hate relationship between mother and daughter into a tale of horror. Some rentals are too good to be true.",
        "runtimeMinutes": "85"
    },
    "2012_26": {
        "plotSummary": "A fleet of ships is forced to do battle with an armada of unknown origins in order to discover and thwart their destructive goals.",
        "runtimeMinutes": "131"
    },
    "2012_260": {
        "plotSummary": "Luciano is a charming fishmonger whose unexpected and sudden obsession with being a contestant on a reality show leads him down a rabbit hole of skewed perceptions and paranoia.",
        "runtimeMinutes": "116"
    },
    "2012_261": {
        "plotSummary": "Railroad owner Dagny Taggart and steel mogul Henry Rearden search desperately for the inventor of a revolutionary motor as the U.S. government continues to spread its control over the national economy.",
        "runtimeMinutes": "111"
    },
    "2012_262": {
        "plotSummary": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its awesome powers.",
        "runtimeMinutes": "115"
    },
    "2012_263": {
        "plotSummary": "Years after his father's death, the son of a fallen soldier tries to reconnect with his grandfather, who is still grieving the loss of his son.",
        "runtimeMinutes": "101"
    },
    "2012_264": {
        "plotSummary": "Iris invites her friend Jack to stay at her family's island getaway after the death of his brother. At their remote cabin, Jack's drunken encounter with Hannah, Iris' sister, kicks off a revealing stretch of days.",
        "runtimeMinutes": "90"
    },
    "2012_265": {
        "plotSummary": "When the older sister of Shira, an 18-year-old Hasidic Israeli, dies suddenly in childbirth, Shira must decide if she can and should marry her widowed brother-in-law, which also generates tensions within her extended family.",
        "runtimeMinutes": "90"
    },
    "2012_266": {
        "plotSummary": "A documentary centered on a young man in Spain who claims to a grieving Texas family that he is their 16-year-old son who has been missing for 3 years.",
        "runtimeMinutes": "99"
    },
    "2012_267": {
        "plotSummary": "An American finds refuge during the 1937 Japanese invasion of Nanking in a church with a group of women. Posing as a priest, he attempts to lead the women to safety.",
        "runtimeMinutes": "146"
    },
    "2012_268": {
        "plotSummary": "An aimless university dropout attempts to make sense of life as he spends one fateful day wandering the streets of Berlin.",
        "runtimeMinutes": "86"
    },
    "2012_269": {
        "plotSummary": "A love triangle between a guy and two girls, who are best friends but the complete opposite of one another.",
        "runtimeMinutes": "146"
    },
    "2012_27": {
        "plotSummary": "Perseus braves the treacherous underworld to rescue his father, Zeus, captured by his son, Ares, and brother Hades who unleash the ancient Titans upon the world.",
        "runtimeMinutes": "99"
    },
    "2012_270": {
        "plotSummary": "A documentary on 85-year-old sushi master Jiro Ono, his renowned Tokyo restaurant, and his relationship with his son and eventual heir, Yoshikazu.",
        "runtimeMinutes": "81"
    },
    "2012_271": {
        "plotSummary": "The crew of a Danish cargo ship is hijacked by Somali pirates who proceed to engage in escalating negotiations with authorities in Copenhagen.",
        "runtimeMinutes": "103"
    },
    "2012_272": {
        "plotSummary": "As he helps a young artist with her upcoming exhibition, the owner of a mannequin shop's deadly, suppressed desires come to the surface.",
        "runtimeMinutes": "89"
    },
    "2012_273": {
        "plotSummary": "A twist on the Snow White fairy tale that is set in 1920s Seville and centered on a female bullfighter.",
        "runtimeMinutes": "104"
    },
    "2012_274": {
        "plotSummary": "A documentary that follows a billionaire couple as they begin construction on a mansion inspired by Versailles. During the next two years, their empire, fueled by the real estate bubble and cheap money, falters due to the economic crisis.",
        "runtimeMinutes": "103"
    },
    "2012_275": {
        "plotSummary": "An ancient fox spirit embarks on a diabolical quest to become human after escaping an icy prison, and becomes bound to a disfigured princess who seeks the love of a noble guard as her kingdom crumbles in this lavish supernatural epic. ...See moreAn ancient fox spirit embarks on a diabolical quest to become human after escaping an icy prison, and becomes bound to a disfigured princess who seeks the love of a noble guard as her kingdom crumbles in this lavish supernatural epic. Confined to a frozen cell for centuries, malevolent fox spirit Xiaowei (Xun Zhou) regains her freedom and seeks to preserve her beauty by seducing men and consuming their hearts. Should a man offer her his heart willingly, Xiaowei will become mortal, breaking free of the underworld and experiencing living among the living. Meanwhile, as a dark cloud falls over her kingdom, Princess Jing (Wei Zhao) flees, hiding her deep facial scars under a mask of pure gold while seeking the love of her former protector, who remains haunted by his failure to save her years prior. When destiny brings Xiaowei and Princess Jing together, the battle for the princess' heart begins.  Written by AnonymousSee less",
        "runtimeMinutes": "131"
    },
    "2012_276": {
        "plotSummary": "A banished hero of Rome allies with a sworn enemy to take his revenge on the city.",
        "runtimeMinutes": "123"
    },
    "2012_277": {
        "plotSummary": "As the Allies sweep across Germany, Lore leads her siblings on a journey that exposes them to the truth of their parents' beliefs. An encounter with a mysterious refugee forces Lore to rely on a person she has always been taught to hate.",
        "runtimeMinutes": "109"
    },
    "2012_278": {
        "plotSummary": "The enduring friendship between the Walling and Ostroff families is tested when Nina, the prodigal Ostroff daughter, returns home for the holidays after a five-year absence and enters into an affair with David, head of the Walling family.",
        "runtimeMinutes": "90"
    },
    "2012_279": {
        "plotSummary": "A few drinks too many leads an uptight architect and quick-witted hairstylist to marry in Las Vegas. Can a mistake lead to friendship and love?",
        "runtimeMinutes": "110"
    },
    "2012_28": {
        "plotSummary": "Transported to Barsoom, a Civil War vet discovers a barren planet seemingly inhabited by 12-foot tall barbarians. Finding himself prisoner of these creatures, he escapes, only to encounter Woola and a princess in desperate need of a savior.",
        "runtimeMinutes": "132"
    },
    "2012_280": {
        "plotSummary": "A burgeoning stand-up comedian struggles with the stress of a stalled career, a stale relationship, and the wild spurts of severe sleepwalking he is desperate to ignore.",
        "runtimeMinutes": "81"
    },
    "2012_281": {
        "plotSummary": "Set in 1990s Belfast, an active member of the IRA becomes an informant for MI5 in order to protect her son's welfare.",
        "runtimeMinutes": "101"
    },
    "2012_282": {
        "plotSummary": "A group of animals plan a trip to Delhi in order to ask the parliament why the forest they live in is on the verge of destruction.",
        "runtimeMinutes": "96"
    },
    "2012_283": {
        "plotSummary": "A biography of the tragic life of one of Brazil's greatest soccer players, Heleno de Freitas.",
        "runtimeMinutes": "116"
    },
    "2012_284": {
        "plotSummary": "Chris wants to show girlfriend Tina his world, but events soon conspire against the couple and their dream caravan holiday takes a very wrong turn. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2012_285": {
        "plotSummary": "In Shanghai, an aging socialite's infatuation with her ex-boyfriend manifests itself as a risky game, where her former lover agrees to seduce, then abandon a naive young woman.",
        "runtimeMinutes": "110"
    },
    "2012_286": {
        "plotSummary": "The affair between King Edward VIII and American divorcee Wallis Simpson, and a contemporary romance between a married woman and a Russian security guard.",
        "runtimeMinutes": "119"
    },
    "2012_287": {
        "plotSummary": "From dawn to dusk, a few hours in the shadowy life of a mystic man named Monsieur Oscar.",
        "runtimeMinutes": "115"
    },
    "2012_288": {
        "plotSummary": "A thriller that follows two siblings who decide to fend for themselves in the wake of a botched casino heist, and their unlikely reunion during another family's Thanksgiving celebration.",
        "runtimeMinutes": "95"
    },
    "2012_289": {
        "plotSummary": "When a group of misfits are hired by an unknown third party to burglarize a desolate house and acquire a rare VHS tape, they discover more found footage than they bargained for.",
        "runtimeMinutes": "116"
    },
    "2012_29": {
        "plotSummary": "An expansion of the universe from Robert Ludlum's novels, centered on a new hero whose stakes have been triggered by the events of the previous three films.",
        "runtimeMinutes": "135"
    },
    "2012_290": {
        "plotSummary": "A story centered on a Native American lacrosse team making its way through a prep school league tournament. Read more: Synopsis",
        "runtimeMinutes": "105"
    },
    "2012_291": {
        "plotSummary": "A fugitive frantically looks for a much-coveted chicken curry recipe with which his family can reclaim their pride and wealth.",
        "runtimeMinutes": "140"
    },
    "2012_292": {
        "plotSummary": "Wealthy thrill-seekers pay huge premiums to have themselves inserted into military adventures, only this time things don't go exactly to plan.",
        "runtimeMinutes": "94"
    },
    "2012_293": {
        "plotSummary": "A documentary that follows six young dancers from around the world as they prepare for the Youth America Grand Prix, one of the most prestigious ballet competitions in the world.",
        "runtimeMinutes": "95"
    },
    "2012_294": {
        "plotSummary": "A look at the life and work of the influential fashion editor of Harpers Bazaar, Diana Vreeland.",
        "runtimeMinutes": "86"
    },
    "2012_295": {
        "plotSummary": "Teresa, a fifty-year-old Austrian mother, travels to the paradise of the beaches of Kenya, seeking out love from African boys. But she must confront the hard truth that on the beaches of Kenya, love is a business.",
        "runtimeMinutes": "120"
    },
    "2012_296": {
        "plotSummary": "Collective screening of the Academy Award nominated short films from the Live Action category for 2012.",
        "runtimeMinutes": "101"
    },
    "2012_297": {
        "plotSummary": "A substitute teacher who drifts from classroom to classroom finds a connection to the students and teachers during his latest assignment.",
        "runtimeMinutes": "98"
    },
    "2012_298": {
        "plotSummary": "A look at the lives of two teenage girls - inseparable friends Ginger and Rosa -- growing up in 1960s London as the Cuban Missile Crisis looms, and the pivotal event that comes to redefine their relationship.",
        "runtimeMinutes": "90"
    },
    "2012_299": {
        "plotSummary": "As the Berlin Wall crumbles, Katrine, the daughter of a Norwegian woman and a German occupation soldier, finds her idyllic life disrupted as she refuses to testify a trial against the Norwegian state on behalf of her fellow \"war children.\"",
        "runtimeMinutes": "97"
    },
    "2012_3": {
        "plotSummary": "Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Catwoman, is forced from his exile to save Gotham City from the brutal guerrilla terrorist Bane.",
        "runtimeMinutes": "164"
    },
    "2012_30": {
        "plotSummary": "As the American Civil War continues to rage, America's president struggles with continuing carnage on the battlefield as he fights with many inside his own cabinet on the decision to emancipate the slaves.",
        "runtimeMinutes": "150"
    },
    "2012_300": {
        "plotSummary": "A guest tries to stay inside the house of a man who can't kill him unless he's outside, because of believing guest to be equal to God.",
        "runtimeMinutes": "141"
    },
    "2012_301": {
        "plotSummary": "After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption.",
        "runtimeMinutes": "140"
    },
    "2012_302": {
        "plotSummary": "A silent film production company and cast make a difficult transition to sound.",
        "runtimeMinutes": "103"
    },
    "2012_303": {
        "plotSummary": "An in-depth look at honeybee colonies in California, Switzerland, China and Australia.",
        "runtimeMinutes": "95"
    },
    "2012_304": {
        "plotSummary": "A pair of star-crossed dancers in New York find themselves at the center of a bitter rivalry between their brothers' underground dance clubs.",
        "runtimeMinutes": "110"
    },
    "2012_305": {
        "plotSummary": "Chaos breaks out in a small Maryland town after an ecological disaster occurs.",
        "runtimeMinutes": "84"
    },
    "2012_306": {
        "plotSummary": "Ex-private dancer Beth aspires to be a Las Vegas cocktail waitress, when she falls in with Dink, a sports gambler. Sparks fly as she proves to be something of a gambling prodigy--much to the ire of Dink's wife, Tulip.",
        "runtimeMinutes": "94"
    },
    "2012_307": {
        "plotSummary": "The true love between a couple in 1910, 1960 and 2012. Their love is so strong that even destiny wants to bring them together.",
        "runtimeMinutes": "117"
    },
    "2012_308": {
        "plotSummary": "Inmates at a high-security prison in Rome prepare for a public performance of Shakespeare's \"Julius Caesar.\"",
        "runtimeMinutes": "77"
    },
    "2012_309": {
        "plotSummary": "Set in 1999 Los Angeles, veteran police officer Dave Brown, the last of the renegade cops, works to take care of his family, and struggles for his own survival.",
        "runtimeMinutes": "108"
    },
    "2012_31": {
        "plotSummary": "A veteran pot dealer creates a fake family as part of his plan to move a huge shipment of weed into the U.S. from Mexico.",
        "runtimeMinutes": "110"
    },
    "2012_310": {
        "plotSummary": "Eight people try to end their loneliness by searching for that one person to love, who can make their life complete.",
        "runtimeMinutes": "128"
    },
    "2012_311": {
        "plotSummary": "Son Donglu, a newly promoted detective teams up with Guo Zhui, fastest gunman in Tiancheng and Xiaowu, a novice policeman to investigate the mystery deaths in a bullet factory.",
        "runtimeMinutes": "108"
    },
    "2012_312": {
        "plotSummary": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
        "runtimeMinutes": "152"
    },
    "2012_313": {
        "plotSummary": "Marc Cros, an elderly sculptor, lives with his wife Lea in the south of France, safe from the War that rages in the distance. He seems to have reached the end of his life and of his art. One day, Lea gives shelter to a beautiful young ...See moreMarc Cros, an elderly sculptor, lives with his wife Lea in the south of France, safe from the War that rages in the distance. He seems to have reached the end of his life and of his art. One day, Lea gives shelter to a beautiful young Spanish political refugee named Mercè. Marc soon understands that the girl, who agrees to pose for him, inspires him and that he has no choice but to embark on this last artistic (and sensual) adventure...  Written by Guy BellingerSee less",
        "runtimeMinutes": "105"
    },
    "2012_314": {
        "plotSummary": "John looks to take down Luc Deveraux after a home invasion claims his wife and daughter. The fight pits John against Andrew Scott and an army of genetically enhanced warriors; meanwhile, he must contend with a UniSol in relentless pursuit.",
        "runtimeMinutes": "114"
    },
    "2012_315": {
        "plotSummary": "Former college frenemies Lauren and Katie move into a fabulous Gramercy Park apartment, and in order to make ends meet, the unlikely pair start a phone sex line together.",
        "runtimeMinutes": "85"
    },
    "2012_316": {
        "plotSummary": "Follow National Geographic photographer James Balog across the Arctic as he deploys time-lapse cameras designed for one purpose: to capture a multi-year record of the world's changing glaciers.",
        "runtimeMinutes": "75"
    },
    "2012_317": {
        "plotSummary": "Several alumni reminisce about their final year at St. Theresa's College and the events that shaped their lives.",
        "runtimeMinutes": "146"
    },
    "2012_318": {
        "plotSummary": "An ex-CIA agent and his estranged daughter are forced on the run when his employers erase all records of his existence, and mark them both for termination as part of a wide-reaching international conspiracy.",
        "runtimeMinutes": "100"
    },
    "2012_319": {
        "plotSummary": "A trio of girls set out to change the male-dominated environment of the Seven Oaks college campus, and to rescue their fellow students from depression, grunge and low standards of every kind.",
        "runtimeMinutes": "99"
    },
    "2012_32": {
        "plotSummary": "An imprisoned vampire, Barnabas Collins, is set free and returns to his ancestral home, where his dysfunctional descendants are in need of his protection.",
        "runtimeMinutes": "113"
    },
    "2012_320": {
        "plotSummary": "Fly into Nevada's Valley of Speed for an exploration of the fastest race in the world: the Reno National Championship Air Races. Read more: Synopsis",
        "runtimeMinutes": "40"
    },
    "2012_321": {
        "plotSummary": "In the months after the heady weeks of May '68, a group of young Europeans search for a way to continue the revolution believed to be just beginning. Read more: Synopsis",
        "runtimeMinutes": "122"
    },
    "2012_322": {
        "plotSummary": "Yang travels to Chen Village to learn a powerful form of Tai Chi. Though villagers are forbidden from teaching outsiders, Yang becomes their best hope for survival when a man arrives with a plan to build a railroad through the village.",
        "runtimeMinutes": "100"
    },
    "2012_323": {
        "plotSummary": "An inspiring look at how one family's connection to each other and their surroundings is a model of resilience and fortitude. Meet Kolo and his growing up story in the Kalahari desert.",
        "runtimeMinutes": "83"
    },
    "2012_324": {
        "plotSummary": "A pair of children, born within moments of India gaining independence from Britain, grow up in the country that is nothing like their parent's generation.",
        "runtimeMinutes": "146"
    },
    "2012_325": {
        "plotSummary": "A drama set at a Swiss ski resort and centered on a boy who supports his sister by stealing from wealthy guests.",
        "runtimeMinutes": "97"
    },
    "2012_326": {
        "plotSummary": "The Ames' seem to have built the perfect life until their six year old daughter is kidnapped; over the course of seven days they begin to uncover secrets about their past that could rip their marriage and lives apart.",
        "runtimeMinutes": "101"
    },
    "2012_327": {
        "plotSummary": "Juan lives in clandestinity. Just like his mum, his dad and his adored uncle Beto, outside his home he has another name. At school, Juan is known as Ernesto. And he meets María, who only has one name. Based on true facts, set in the ...See moreJuan lives in clandestinity. Just like his mum, his dad and his adored uncle Beto, outside his home he has another name. At school, Juan is known as Ernesto. And he meets María, who only has one name. Based on true facts, set in the Argentina of 1979, this film is \"one about love\".  Written by Historias CinematográficasSee less",
        "runtimeMinutes": "112"
    },
    "2012_328": {
        "plotSummary": "During the final days at the Yankee Pedlar Inn, two employees determined to reveal the hotel's haunted past begin to experience disturbing events as old guests check in for a stay.",
        "runtimeMinutes": "101"
    },
    "2012_329": {
        "plotSummary": "A professional diver tutor returns to deep waters after 1 year, following an almost fatal encounter with a great white shark. The nightmare from the deep is still lurking - more carnivorous and hungry than ever.",
        "runtimeMinutes": "114"
    },
    "2012_33": {
        "plotSummary": "Alice fights alongside a resistance movement to regain her freedom from an Umbrella Corporation testing facility.",
        "runtimeMinutes": "95"
    },
    "2012_330": {
        "plotSummary": "From beyond the grave, celebrated playwright Antoine d'Anthac gathers together all his friends who have appeared over the years in his play \"Eurydice.\" These actors watch a recording of the work performed by a young acting company, La ...See moreFrom beyond the grave, celebrated playwright Antoine d'Anthac gathers together all his friends who have appeared over the years in his play \"Eurydice.\" These actors watch a recording of the work performed by a young acting company, La Compagnie de la Colombe. Do love, life, death and love after death still have any place on a theater stage? It's up to them to decide. And the surprises have only just begun...  Written by lletaifSee less",
        "runtimeMinutes": "115"
    },
    "2012_331": {
        "plotSummary": "The story of a woman who loves her dog more than her husband. And then her husband loses the dog.",
        "runtimeMinutes": "103"
    },
    "2012_332": {
        "plotSummary": "When 30-something Jesse returns to his alma mater for a professor's retirement party, he falls for Zibby, a college student, and is faced with a powerful attraction that springs up between them.",
        "runtimeMinutes": "97"
    },
    "2012_333": {
        "plotSummary": "An uptight New York City lawyer takes her two teenagers to her hippie mother's farmhouse upstate for a family vacation.",
        "runtimeMinutes": "96"
    },
    "2012_334": {
        "plotSummary": "The Oogieloves, Goobie, Zoozie, and Toofie, set out to find five magical balloons that will make their good friend Schluufy's surprise birthday party extra special.",
        "runtimeMinutes": "88"
    },
    "2012_335": {
        "plotSummary": "Three doppelgangers(one girl+ two boys).Two of them loves each other and get together from many lives .And the third one(who can't be killed easily)also wants the girl and he tries to separate them through many lives. Read more: Synopsis",
        "runtimeMinutes": "130"
    },
    "2012_336": {
        "plotSummary": "A documentary on some of contemporary Mexico's most iconic artists and performers.",
        "runtimeMinutes": "98"
    },
    "2012_337": {
        "plotSummary": "A woman's idyllic life is shattered when her husband is killed in a senseless act of violence. As she prepares to take matters into her own hands, two unexpected encounters begin to change everything.",
        "runtimeMinutes": "92"
    },
    "2012_339": {
        "plotSummary": "Working in a Boston homeless shelter, Nick Flynn re-encounters his father, a con man and self-proclaimed poet. Sensing trouble in his own life, Nick wrestles with the notion of reaching out yet again to his dad.",
        "runtimeMinutes": "102"
    },
    "2012_34": {
        "plotSummary": "After a stint in a mental institution, former teacher Pat Solitano moves back in with his parents and tries to reconcile with his ex-wife. Things get more challenging when Pat meets Tiffany, a mysterious girl with problems of her own.",
        "runtimeMinutes": "122"
    },
    "2012_340": {
        "plotSummary": "The story of the tragic relationship between the son of a property developer and the daughter of an auto rickshaw owner.",
        "runtimeMinutes": "117"
    },
    "2012_341": {
        "plotSummary": "On a late night visit to an ATM, three co-workers end up in a desperate fight for their lives when they become trapped by an unknown man.",
        "runtimeMinutes": "90"
    },
    "2012_342": {
        "plotSummary": "A deadly drought in 1942 takes its toll on central China's Henan province during the war against Japan.",
        "runtimeMinutes": "145"
    },
    "2012_343": {
        "plotSummary": "A documentary that chronicles artist and activist Ai Weiwei as he prepares for a series of exhibitions and gets into an increasing number of clashes with the Chinese government.",
        "runtimeMinutes": "91"
    },
    "2012_344": {
        "plotSummary": "The underachieving son of a marriage bureau owner attempts to marry a don's daughter to a supposed police officer in an effort to prove his worth to his father. Read more: Synopsis",
        "runtimeMinutes": "141"
    },
    "2012_345": {
        "plotSummary": "A documentary about Bill Wilson, the co-founder of Alcoholics Anonymous.",
        "runtimeMinutes": "104"
    },
    "2012_346": {
        "plotSummary": "A dishonest insurance salesman's life quickly disintegrates during a Wisconsin winter when he teams up with a psychopath to steal a rare violin at the home of a reclusive farmer.",
        "runtimeMinutes": "93"
    },
    "2012_347": {
        "plotSummary": "A man is brought in by an infertility doctor to supply him with his sperm, where he becomes the biggest sperm donor for his clinic.",
        "runtimeMinutes": "126"
    },
    "2012_348": {
        "plotSummary": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
        "runtimeMinutes": "146"
    },
    "2012_349": {
        "plotSummary": "Like millions of other couples, Mounir and Murielle fall in love. Like millions of other couples, Mounir and Murielle have children. But unlike them, they accept to give up their autonomy by agreeing to live with Mounir's well off adoptive...See moreLike millions of other couples, Mounir and Murielle fall in love. Like millions of other couples, Mounir and Murielle have children. But unlike them, they accept to give up their autonomy by agreeing to live with Mounir's well off adoptive father, Doctor Andre Pinget. On the material level, all is well. But a house is not a home, and Murielle feels more and more stifled...  Written by Guy BellingerSee less",
        "runtimeMinutes": "111"
    },
    "2012_35": {
        "plotSummary": "Jim, Michelle, Stifler, and their friends reunite in East Great Falls, Michigan for their high school reunion.",
        "runtimeMinutes": "113"
    },
    "2012_350": {
        "plotSummary": "How the pursuit of an Indian cricket legend's Ferrari makes a young boy's dreams of playing cricket at Lords a reality. Read more: Synopsis",
        "runtimeMinutes": "140"
    },
    "2012_351": {
        "plotSummary": "Thiru join hands with his brother Guru to face the mobsters of a city.",
        "runtimeMinutes": "150"
    },
    "2012_352": {
        "plotSummary": "The friendship between two young women who grew up in the same orphanage; one has found refuge at a convent in Romania and refuses to leave with her friend, who now lives in Germany.",
        "runtimeMinutes": "152"
    },
    "2012_353": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2012_354": {
        "plotSummary": "About the early years of Yang Luchan, a Tai chi master. The man who founded Tai Chi in the 19th century and what has now become the most popular Tai Chi style in the world. The second instalment of the \"Tai Chi\" trilogy continues the ...See moreAbout the early years of Yang Luchan, a Tai chi master. The man who founded Tai Chi in the 19th century and what has now become the most popular Tai Chi style in the world. The second instalment of the \"Tai Chi\" trilogy continues the journey of Yang Luchan, a gifted child who helped save a village from soldiers.See less",
        "runtimeMinutes": "100"
    },
    "2012_355": {
        "plotSummary": "When three rebellious students leave their hometown to pursue their lifelong dreams in the big city, their relationships start to face the pressures of real life as the 1980s Taiwanese socio-political reformation movement unfolds in the ...See moreWhen three rebellious students leave their hometown to pursue their lifelong dreams in the big city, their relationships start to face the pressures of real life as the 1980s Taiwanese socio-political reformation movement unfolds in the background.  Written by AnonymousSee less",
        "runtimeMinutes": "106"
    },
    "2012_356": {
        "plotSummary": "Tal is 17 years old. Naim is 20. She's Israeli. He's Palestinian. She lives in Jerusalem. He lives in Gaza. They were born in a land of scorched earth, where fathers bury their children. They must endure an explosive situation that is not ...See moreTal is 17 years old. Naim is 20. She's Israeli. He's Palestinian. She lives in Jerusalem. He lives in Gaza. They were born in a land of scorched earth, where fathers bury their children. They must endure an explosive situation that is not of their choosing at an age where young people are falling in love and taking their place in adult life. A bottle thrown in the sea and a correspondence by email nurture the slender hope that their relationship might give them the strength to confront this harsh reality to grapple with it, and thereby ever so slightly change it. Only 60 miles separate them but how many bombings, check-points, sleepless nights and bloodstained days stand between them?  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "2012_357": {
        "plotSummary": "In London, a military plane crashes leaving its highly classified contents strewn across the city. Completely unaware that the city is in lockdown, a group of people become trapped inside a storage facility with a highly unwelcome guest. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2012_358": {
        "plotSummary": "Asia Argento stars in horror legend Dario Argento's sexy spin on the classic tale about the sharp-toothed count who craves human blood. Read more: Synopsis",
        "runtimeMinutes": "110"
    },
    "2012_359": {
        "plotSummary": "When a young soldier in Vietnam gets dumped by his hometown girl, he and his best friend decide to go AWOL and return to the States to win her back.",
        "runtimeMinutes": "100"
    },
    "2012_36": {
        "plotSummary": "Acting under the cover of a Hollywood producer scouting a location for a science fiction film, a CIA agent launches a dangerous operation to rescue six Americans in Tehran during the U.S. hostage crisis in Iran in 1979.",
        "runtimeMinutes": "120"
    },
    "2012_360": {
        "plotSummary": "When a Vienna museum guard befriends an enigmatic visitor, the grand Kunsthistorisches Art Museum becomes a mysterious crossroads that sparks explorations of their lives, the city, and the ways in which works of art reflect and shape the world.",
        "runtimeMinutes": "107"
    },
    "2012_361": {
        "plotSummary": "Set in suburban New Jersey in the 1960s, a group of friends form a rock band and try to make it big.",
        "runtimeMinutes": "117"
    },
    "2012_362": {
        "plotSummary": "On April 2nd 2011, LCD Soundsystem played its final show at Madison Square Garden. Documenting this once in a life time performance and an intimate portrait of James Murphy as he navigates the lead-up to the show, the day after, and the ...See moreOn April 2nd 2011, LCD Soundsystem played its final show at Madison Square Garden. Documenting this once in a life time performance and an intimate portrait of James Murphy as he navigates the lead-up to the show, the day after, and the personal and professional ramifications of his decision.See less",
        "runtimeMinutes": "108"
    },
    "2012_363": {
        "plotSummary": "A three-tiered story centered on a trio of French tourists visiting the same seaside resort.",
        "runtimeMinutes": "89"
    },
    "2012_364": {
        "plotSummary": "A group of college kids accidentally create, and then unleash, a curse that makes anyone they come into contact with kill themselves and then turn into zombie demons.",
        "runtimeMinutes": "88"
    },
    "2012_365": {
        "plotSummary": "Don, a nineteen-year-old sophomore at a Texas junior college, tries to escape his Bible Belt upbringing for life in the Pacific Northwest at the most godless campus in America.",
        "runtimeMinutes": "108"
    },
    "2012_366": {
        "plotSummary": "A normal Friday service at a fast food restaurant becomes interrupted by a police officer who claims an employee stole from a customer, but something more sinister is going on.",
        "runtimeMinutes": "90"
    },
    "2012_367": {
        "plotSummary": "A 3D adventure into the world of big wave surfing with Aussie tow-surfing legend Ross Clarke-Jones and two-time World Champion Tom Carroll.",
        "runtimeMinutes": "95"
    },
    "2012_368": {
        "plotSummary": "When Brian, a hopelessly uncoordinated young fan magically switches talents with his hero, basketball star Kevin Durant, he becomes the star of his high school team, while Kevin Durant suddenly can't make a shot to save his life.",
        "runtimeMinutes": "94"
    },
    "2012_369": {
        "plotSummary": "Chronicles three underprivileged students from inner-city Memphis and their volunteer coach who tries to help them beat the odds on and off the field.",
        "runtimeMinutes": "113"
    },
    "2012_37": {
        "plotSummary": "A homicide investigator digs deeper into a case involving a trained military sniper who shot five random victims.",
        "runtimeMinutes": "130"
    },
    "2012_370": {
        "plotSummary": "As a documentarian cleans out the flat that belonged to his grandparents - both immigrants from Nazi Germany - he uncovers clues pointing to a complicated and shocking story.",
        "runtimeMinutes": "97"
    },
    "2012_371": {
        "plotSummary": "In Tokyo, a young sex worker develops an unexpected connection with a widower over a period of two days.",
        "runtimeMinutes": "109"
    },
    "2012_372": {
        "plotSummary": "A married couple whose bond is built on a mutual love of alcohol gets their relationship put to the test when the wife decides to get sober.",
        "runtimeMinutes": "81"
    },
    "2012_373": {
        "plotSummary": "A promising young man about to start university suddenly throws his life into uncertainty when he accidentally commits a serious crime.",
        "runtimeMinutes": "88"
    },
    "2012_374": {
        "plotSummary": "After failing to get his wife pregnant, a guy (Schneider) recruits his pals to steal the deposit he left at a sperm bank years ago.",
        "runtimeMinutes": "95"
    },
    "2012_375": {
        "plotSummary": "The lives of the residents of a Brazilian apartment building and the security guards who get the job guarding the surrounding streets.",
        "runtimeMinutes": "131"
    },
    "2012_377": {
        "plotSummary": "Dumped by her boyfriend just three weeks before their wedding, Lola enlists her close friends for a series of adventures she hopes will help her come to terms with approaching 30 as a single woman.",
        "runtimeMinutes": "87"
    },
    "2012_378": {
        "plotSummary": "Two documentary filmmakers attempt to penetrate a cult who worships a woman who claims to be from the future.",
        "runtimeMinutes": "87"
    },
    "2012_379": {
        "plotSummary": "Rebecca is suspicious of Ernessa, the new arrival at her boarding school. But is Rebecca just jealous of Ernessa's bond with Lucie, or does the new girl truly possess a dark secret?",
        "runtimeMinutes": "82"
    },
    "2012_38": {
        "plotSummary": "A young CIA agent is tasked with looking after a fugitive in a safe house. But when the safe house is attacked, he finds himself on the run with his charge.",
        "runtimeMinutes": "115"
    },
    "2012_380": {
        "plotSummary": "On a mission to rid society of its most repellent citizens, terminally ill Frank makes an unlikely accomplice in 16-year-old Roxy.",
        "runtimeMinutes": "105"
    },
    "2012_381": {
        "plotSummary": "A documentary on the city of Detroit and its woes, which are emblematic of the collapse of the U.S. manufacturing base.",
        "runtimeMinutes": "90"
    },
    "2012_382": {
        "plotSummary": "In Manhattan, film-maker Erik bonds with closeted lawyer Paul after a fling. As their relationship becomes one fueled by highs, lows, and dysfunctional patterns, Erik struggles to negotiate his own boundaries while being true to himself.",
        "runtimeMinutes": "101"
    },
    "2012_383": {
        "plotSummary": "An exploration of various interpretations of Stanley Kubrick's horror film, The Shining.",
        "runtimeMinutes": "102"
    },
    "2012_384": {
        "plotSummary": "Circumstances force a young divorcee to move back in with her parents in suburban Connecticut, where an affair with a younger guy rejuvenates her passion for life",
        "runtimeMinutes": "95"
    },
    "2012_385": {
        "plotSummary": "A middle-class boy from Atlanta finds his worldview changed as he spends the summer with his deeply religious grandfather in the housing projects of Red Hook, Brooklyn.",
        "runtimeMinutes": "121"
    },
    "2012_386": {
        "plotSummary": "Romance blooms between two tricenarians in arrested development: an avid toy collector who is the dark horse of his family and a depressed woman on the rebound.",
        "runtimeMinutes": "86"
    },
    "2012_387": {
        "plotSummary": "A documentary on rap music and its rise to global prominence.",
        "runtimeMinutes": "106"
    },
    "2012_388": {
        "plotSummary": "A story based on the life of journalist Torgny Segerstedt, who alerted the Swedish public to the threat of Fascism in the 1930s.",
        "runtimeMinutes": "126"
    },
    "2012_389": {
        "plotSummary": "Paul has no faith in his son, Martin, to inherit his prestigious family wine estate. Paul dreams of a harder-working, successful son - a dream that one day seemingly materializes when he meets Philippe, the son of his dying estate manager.",
        "runtimeMinutes": "102"
    },
    "2012_39": {
        "plotSummary": "A pair of underachieving cops are sent back to a local high school to blend in and bring down a synthetic drug ring.",
        "runtimeMinutes": "109"
    },
    "2012_390": {
        "plotSummary": "A documentary that examines the 1989 case of five black and Latino teenagers who were convicted of raping a white woman in Central Park. After having spent between 6 and 13 years each in prison, a serial rapist confessed to the crime.",
        "runtimeMinutes": "119"
    },
    "2012_391": {
        "plotSummary": "A group of slackers face an army of zombies. The Cuban government and media claim the living dead are dissidents revolting against the government.",
        "runtimeMinutes": "92"
    },
    "2012_392": {
        "plotSummary": "This is the tale of a hit and run accident that results in the death of an illegal foreigner. Three men, including a young executive, are aboard the vehicle responsible of the accident and decide to keep silence about the whole thing. But ...See moreThis is the tale of a hit and run accident that results in the death of an illegal foreigner. Three men, including a young executive, are aboard the vehicle responsible of the accident and decide to keep silence about the whole thing. But a young woman is witness of it and succeeds in finding the driver. She also searches and finds the deceased's wife too.  Written by AnonymousSee less",
        "runtimeMinutes": "101"
    },
    "2012_393": {
        "plotSummary": "Two security guards - one from Beijing, one from Taipei - are forced to work together to track down a legendary Chinese painting that has been stolen by international art thieves.",
        "runtimeMinutes": "87"
    },
    "2012_394": {
        "plotSummary": "An examination of a failure of justice in the case against the West Memphis Three.",
        "runtimeMinutes": "147"
    },
    "2012_395": {
        "plotSummary": "Somewhere in Sub-Saharan Africa, Komona, a 14-year-old girl, tells her unborn child growing inside her the story of her life since she has been at war. Everything started when she was abducted by the rebel army at the age of 12.",
        "runtimeMinutes": "90"
    },
    "2012_396": {
        "plotSummary": "A sound engineer's work for an Italian horror studio becomes a terrifying case of life imitating art. Read more: Synopsis",
        "runtimeMinutes": "92"
    },
    "2012_397": {
        "plotSummary": "A look at the lives of a group of teenagers who ride the same bus route and how their relationships change and evolve on the last day of school.",
        "runtimeMinutes": "103"
    },
    "2012_398": {
        "plotSummary": "13-year-old Sinikka vanishes on a hot summer night. Her bicycle is found in the exact place where a girl was killed 23 years ago. The dramatic present forces those involved in the original case to face their past.",
        "runtimeMinutes": "118"
    },
    "2012_399": {
        "plotSummary": "The night of their high school reunion, a group of friends realize they still haven't quite grown up in some ways.",
        "runtimeMinutes": "110"
    },
    "2012_4": {
        "plotSummary": "A reluctant Hobbit, Bilbo Baggins, sets out to the Lonely Mountain with a spirited group of dwarves to reclaim their mountain home, and the gold within it from the dragon Smaug.",
        "runtimeMinutes": "169"
    },
    "2012_40": {
        "plotSummary": "A factory worker, Douglas Quaid, begins to suspect that he is a spy after visiting Rekall - a company that provides its clients with implanted fake memories of a life they would like to have led - goes wrong and he finds himself on the run.",
        "runtimeMinutes": "118"
    },
    "2012_400": {
        "plotSummary": "Newlywed Molly moves into her deceased father's house in the countryside, where painful memories soon begin to haunt her.",
        "runtimeMinutes": "100"
    },
    "2012_401": {
        "plotSummary": "Farhad Pastakia (Boman Irani) has a dream job as a bra-and-panty salesman. Except that he is a 45-year old Parsi bachelor still living with his overbearing mother and grandmother. But it's not like he's stopped trying. Desperate to get him...See moreFarhad Pastakia (Boman Irani) has a dream job as a bra-and-panty salesman. Except that he is a 45-year old Parsi bachelor still living with his overbearing mother and grandmother. But it's not like he's stopped trying. Desperate to get him married, Farhad's mother drags him to see women and even to embarrassing Parsi matrimony services. In the midst of all the daily humdrum, Farhad meets the woman of his dreams: Shirin Fugawala ('Farah Khan'), who drops by his store. Shirin, who works at the Parsi Trust, hits it off with Farhad from the start. Everything seems to be perfect and Farhad gets ready to introduce Shirin to his mother. But mummy becomes the villain in their story when she discovers that Shirin is the devious Parsi Trust Secretary who got the illegal water tank in their home demolished. The water tank being the 'aakhri nishaani' of Farhad's late father doesn't help matters. The ups and downs in Shirin-Farhad's relationship and how the two try to make it work is the rest of the journey.  Written by Links2alllDoTcomSee less",
        "runtimeMinutes": "111"
    },
    "2012_402": {
        "plotSummary": "An engaged couple's backpacking trip in the Caucasus Mountains is derailed by a single misstep that threatens to undo everything the pair believed about each other and about themselves.",
        "runtimeMinutes": "113"
    },
    "2012_403": {
        "plotSummary": "In the 1970s, a gay couple fights a biased legal system to keep custody of the abandoned mentally handicapped teenager that comes to live under their roof.",
        "runtimeMinutes": "98"
    },
    "2012_404": {
        "plotSummary": "A young businessman who lands a community service sentence falls in with a group of misfit kids who need mentoring. With the help of a pro instructor, he works to get the kids ready for a big underground dance competition. Read more: Synopsis",
        "runtimeMinutes": "106"
    },
    "2012_405": {
        "plotSummary": "Go behind the doors of an American public hospital struggling to care for a community of largely uninsured patients.",
        "runtimeMinutes": "81"
    },
    "2012_406": {
        "plotSummary": "When a TV producer is desperate to find a replacement series, she convinces a 71 year-old Armenian, tell-it-like-it-is Uncle, to star in a new reality show.",
        "runtimeMinutes": "102"
    },
    "2012_407": {
        "plotSummary": "When her husband is sentenced to eight years in prison, Ruby drops out of medical school in order to focus on her husband's well-being while he's incarcerated - leading her on a journey of self-discovery in the process.",
        "runtimeMinutes": "97"
    },
    "2012_408": {
        "plotSummary": "A US Senator's son (Jaime Kennedy) who attempts to forget the break up of his fiancee, is forced to vacation in Turkey by his best friends. A para-sailing trip mishap lands him in a small village in Armenia, where he is accused of being a ...See moreA US Senator's son (Jaime Kennedy) who attempts to forget the break up of his fiancee, is forced to vacation in Turkey by his best friends. A para-sailing trip mishap lands him in a small village in Armenia, where he is accused of being a spy. It is there he meets a young woman (Angela Sarafyan) who helps him to escape from misfortune.  Written by AnnoymousSee less",
        "runtimeMinutes": "100"
    },
    "2012_409": {
        "plotSummary": "On the request of his friend Kabir, SP Adil Sends him to the Naxal group as an informer. When Kabir finds the truth he becomes one of their gang leader.",
        "runtimeMinutes": "152"
    },
    "2012_41": {
        "plotSummary": "The story of a tourist family in Thailand caught in the destruction and chaotic aftermath of the 2004 Indian Ocean tsunami.",
        "runtimeMinutes": "114"
    },
    "2012_410": {
        "plotSummary": "In the most brutal and often most misunderstood sport in the world, becoming a champion takes more than just blood, sweat, and tears. Like Water follows middleweight Ultimate Fighter Anderson Silva as he prepares to crown his four-year run...See moreIn the most brutal and often most misunderstood sport in the world, becoming a champion takes more than just blood, sweat, and tears. Like Water follows middleweight Ultimate Fighter Anderson Silva as he prepares to crown his four-year run as the unbeaten king of the sport with a record 12th straight win in the UFC. With intimate access to Silva and his intense training, the surprising and inspiring man behind one of the greatest mixed martial artists of all time emerges.  Written by AnonymousSee less",
        "runtimeMinutes": "76"
    },
    "2012_411": {
        "plotSummary": "Two guys get a billion dollars to make a movie, only to watch their dream run off course. In order to make the money back, they then attempt to revitalize a failing shopping mall.",
        "runtimeMinutes": "93"
    },
    "2012_412": {
        "plotSummary": "A high school valedictorian who gets baked with the local stoner finds himself the subject of a drug test. The situation causes him to concoct an ambitious plan to get his entire graduating class to face the same fate, and fail.",
        "runtimeMinutes": "99"
    },
    "2012_413": {
        "plotSummary": "Neil Young returns to his birth Canadian province of Ontario to revisit his old haunts and to perform in Toronto's vintage Massey Hall.",
        "runtimeMinutes": "87"
    },
    "2012_414": {
        "plotSummary": "Amidst financial crises and unprecedented public school budget cuts, Brooklyn Castle takes an intimate look at the challenges and triumphs facing members of a junior high school's champion chess team.",
        "runtimeMinutes": "101"
    },
    "2012_415": {
        "plotSummary": "From the dealer to the narcotics officer, the inmate to the federal judge, a penetrating look inside America's criminal justice system, revealing the profound human rights implications of U.S. drug policy.",
        "runtimeMinutes": "108"
    },
    "2012_416": {
        "plotSummary": "The identity of a blind church pianist is uncovered. Military officer Shiva Kumar is on the run as an accused fugitive, and is attempting to take revenge against those who killed his wife.",
        "runtimeMinutes": "160"
    },
    "2012_417": {
        "plotSummary": "Daniela, raised in the bosom of a strict Evangelical family and recently unmasked as a fornicator by her shocked parents, struggles to find her own path to spiritual harmony. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "2012_418": {
        "plotSummary": "A documentary on four teenage girls living in different parts of the US and united by one thing: all four were adopted from China due to family situations colliding with the country's \"One Child Policy\".",
        "runtimeMinutes": "88"
    },
    "2012_419": {
        "plotSummary": "Ginger Baker looks back on his musical career with Cream and Blind Faith; his introduction to Fela Kuti; his self-destructive patterns and losses of fortune; and his current life inside a fortified South African compound.",
        "runtimeMinutes": "100"
    },
    "2012_42": {
        "plotSummary": "On a wild road trip, three men find inner peace in the city that never sleeps.",
        "runtimeMinutes": "105"
    },
    "2012_420": {
        "plotSummary": "A man looks back 15 years to the injury that ended his career as a promising high-school football player.",
        "runtimeMinutes": "118"
    },
    "2012_421": {
        "plotSummary": "In London, a street dealer's life spins out of control over the course of one week after he borrows money from his supplier on what's supposed to be a sure thing. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2012_422": {
        "plotSummary": "A young English woman is immigrating to her uncle's ranch - but is kidnapped on the way by a rugged outlaw who discovers a problem he never knew he had - leading them on a wild ride across the West. Read more: Synopsis",
        "runtimeMinutes": "92"
    },
    "2012_423": {
        "plotSummary": "A story of what happens when a reluctant man is forced to face his fears, which begins as a fun camping trip and ends in a fight for survival in the remote forest of the pacific northwest.",
        "runtimeMinutes": "88"
    },
    "2012_424": {
        "plotSummary": "Justice needs to be served at Britain's most notorious young offenders institute.",
        "runtimeMinutes": "102"
    },
    "2012_425": {
        "plotSummary": "Follow Kirk Cameron across Europe and the U.S. as he seeks to discover the people, places and principles that made America the freest, most prosperous and generous nation the world has ever known. Read more: Synopsis",
        "runtimeMinutes": "84"
    },
    "2012_426": {
        "plotSummary": "In Iowa, a girl in foster care discovers her talent for butter carving and finds herself pitted against an ambitious local woman in their town's annual contest.",
        "runtimeMinutes": "91"
    },
    "2012_427": {
        "plotSummary": "",
        "runtimeMinutes": "95"
    },
    "2012_428": {
        "plotSummary": "A young woman frets upstairs in her family's country manor on her wedding day, fearful she's about to marry the wrong man. Downstairs, her fiance and her former lover grow increasingly anxious.",
        "runtimeMinutes": "89"
    },
    "2012_429": {
        "plotSummary": "A successful Paris lawyer is forced to re-invent his life after he makes a fatal mistake.",
        "runtimeMinutes": "114"
    },
    "2012_43": {
        "plotSummary": "A car accident puts Paige in a coma, and when she wakes up with severe memory loss, her husband Leo works to win her heart again.",
        "runtimeMinutes": "104"
    },
    "2012_430": {
        "plotSummary": "A look inside Paris' Crazy Horse, a club that boasts the greatest and most chic nude dancing in the world.",
        "runtimeMinutes": "134"
    },
    "2012_431": {
        "plotSummary": "A documentary that follows the Serbian performance artist as she prepares for a retrospective of her work at The Museum of Modern Art in New York.",
        "runtimeMinutes": "106"
    },
    "2012_432": {
        "plotSummary": "A Birmingham-based band are ordered by their unhappy record company to an old warehouse; the goal being to re-start their ailing careers with a kick-ass new promo video. Unfortunately the band and their entourage find themselves targets of...See moreA Birmingham-based band are ordered by their unhappy record company to an old warehouse; the goal being to re-start their ailing careers with a kick-ass new promo video. Unfortunately the band and their entourage find themselves targets of a mysterious knife-wielding maniac, haunted by the voice of Satan, and out for revenge.  Written by Spooked Films Ltd. (used with permission)See less",
        "runtimeMinutes": "97"
    },
    "2012_433": {
        "plotSummary": "An Albanian family is torn apart by a murder, resulting in a blood feud that makes eldest son Nik a prime target and forces his sister, eldest daughter Rudina, to leave school in order to take over the family business.",
        "runtimeMinutes": "109"
    },
    "2012_434": {
        "plotSummary": "A documentary on a Palestinian farmer's chronicle of his nonviolent resistance to the actions of the Israeli army.",
        "runtimeMinutes": "94"
    },
    "2012_435": {
        "plotSummary": "An unlikely friendship forms between twenty-one-year-old Jane and the elderly Sadie after Jane discovers a hidden stash of money inside an object at Sadie's yard sale.",
        "runtimeMinutes": "103"
    },
    "2012_436": {
        "plotSummary": "When a small house flipping group discovers that their Hotel project may contain millions of cash hidden somewhere within, the project turns deadly.",
        "runtimeMinutes": "85"
    },
    "2012_437": {
        "plotSummary": "Jason, is bit by a strange organism while on vacation with his girlfriend, Sam, at her sister's secluded farmhouse. The bite begins a transformation in Jason, and now the couple must race against time to figure out what happened to Sam's ...See moreJason, is bit by a strange organism while on vacation with his girlfriend, Sam, at her sister's secluded farmhouse. The bite begins a transformation in Jason, and now the couple must race against time to figure out what happened to Sam's sister and her family, and what lies in store for them. All of these elements are tantamount to the ultimate fear addressed in the film, the fear of losing a loved one and worse, becoming a monster in their eyes.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "2012_438": {
        "plotSummary": "A group of people start a business where they impersonate the recently deceased in order to help their clients through the grieving process.",
        "runtimeMinutes": "93"
    },
    "2012_439": {
        "plotSummary": "A papermaker gets involved with a murder case concerning two criminals leading to a determined detective suspecting him and the former's vicious father searching for him Read more: Synopsis",
        "runtimeMinutes": "115"
    },
    "2012_44": {
        "plotSummary": "An evil queen steals control of a kingdom and an exiled princess enlists the help of seven resourceful rebels to win back her birthright.",
        "runtimeMinutes": "106"
    },
    "2012_440": {
        "plotSummary": "An agoraphobic father teams up with a renegade priest to save his daughter from the clutches of a gang of twisted feral children who committed an act of violence against his family years earlier.",
        "runtimeMinutes": "84"
    },
    "2012_441": {
        "plotSummary": "The 42 year long relationship between legendary actress Liv Ullmann and master filmmaker Ingmar Bergman. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2012_442": {
        "plotSummary": "In the heat of the summer of 1976, drama teacher Vivienne fights sweltering heat and general teenage apathy to put on an end-of-term version of Shakespeare's The Tempest.",
        "runtimeMinutes": "110"
    },
    "2012_443": {
        "plotSummary": "In February of 2006, a documentary film crew from Dallas, Texas followed a young woman as she began her career in the porn industry. By March, she had disappeared.",
        "runtimeMinutes": "94"
    },
    "2012_444": {
        "plotSummary": "The incredible story of the 1992 Lithuanian basketball team, whose athletes struggled under Soviet rule, became symbols of Lithuania's independence movement, and - with help from the Grateful Dead - triumphed at the Barcelona Olympics.",
        "runtimeMinutes": "89"
    },
    "2012_445": {
        "plotSummary": "A concert documentary of Led Zeppelin's December 10, 2007 tribute performance for Atlantic Records founder Ahmet Ertegun.",
        "runtimeMinutes": "124"
    },
    "2012_446": {
        "plotSummary": "A documentary about a man who impersonates a wise Indian Guru and builds a following in Arizona. At the height of his popularity, the Guru Kumare must reveal his true identity to his disciples and unveil his greatest teaching of all.",
        "runtimeMinutes": "84"
    },
    "2012_447": {
        "plotSummary": "Two teenage brothers must face their own prejudices head on if they are to survive the perils of being British Arabs growing up on the streets of gangland London.",
        "runtimeMinutes": "111"
    },
    "2012_448": {
        "plotSummary": "The story of two coalitions -- ACT UP and TAG (Treatment Action Group) -- whose activism and innovation turned AIDS from a death sentence into a manageable condition.",
        "runtimeMinutes": "110"
    },
    "2012_449": {
        "plotSummary": "A hopeless young man uses his \"Kung-fu\" skills and mask to tackle a bank robbery group without revealing his identity.",
        "runtimeMinutes": "150"
    },
    "2012_45": {
        "plotSummary": "The heroic story of a dictator who risked his life to ensure that democracy would never come to the country he so lovingly oppressed.",
        "runtimeMinutes": "83"
    },
    "2012_450": {
        "plotSummary": "A novelist and an accountant meet while they are traveling for work, and though they both are in relationships, their one-night stand could become something more.",
        "runtimeMinutes": "82"
    },
    "2012_451": {
        "plotSummary": "This sequel to Yossi and Jagger finds Dr. Yossi Gutmann reminiscing about his love ten years after his death; however, as he encounters a group of young soldiers, one of them, Tom, reignites his romantic feelings.",
        "runtimeMinutes": "84"
    },
    "2012_452": {
        "plotSummary": "The police force of a remote Midwestern town search for a killer Santa Claus who is picking off citizens on Christmas Eve.",
        "runtimeMinutes": "94"
    },
    "2012_453": {
        "plotSummary": "An investigative documentary that uncovers the U.S. healthcare system's true design.",
        "runtimeMinutes": "95"
    },
    "2012_454": {
        "plotSummary": "Juan and his urban family live in the Mexican countryside, where they enjoy and suffer a world apart. And nobody knows if these two worlds are complementary or if they strive to eliminate one another.",
        "runtimeMinutes": "115"
    },
    "2012_455": {
        "plotSummary": "Monty Wildhorn, an alcoholic novelist of Westerns, has lost his drive. His nephew pushes him to summer in quiet Belle Isle. He begrudgingly befriends a newly single mom and her 3 girls who help him find the inspiration to write again. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2012_456": {
        "plotSummary": "Young Emilio and and his stepfather deliver mail as well as read and write letters for most of the illiterate villagers. Emilio changes some letters to optimistic stories from sad stories. Emilio then falls for a young girl named Elena.",
        "runtimeMinutes": "97"
    },
    "2012_457": {
        "plotSummary": "A group of rodeo trick-riders recruits a young girl to join them.",
        "runtimeMinutes": "92"
    },
    "2012_458": {
        "plotSummary": "The evil Brand X joins a supermarket that becomes a city after closing time.",
        "runtimeMinutes": "91"
    },
    "2012_459": {
        "plotSummary": "Two years in the making, this film gives snowboarder [ling=nm1751071] and friends the opportunity to redefine what is possible in the mountains.",
        "runtimeMinutes": "80"
    },
    "2012_46": {
        "plotSummary": "In 2074, when the mob wants to get rid of someone, the target is sent into the past, where a hired gun awaits - someone like Joe - who one day learns the mob wants to 'close the loop' by sending back Joe's future self for assassination.",
        "runtimeMinutes": "113"
    },
    "2012_460": {
        "plotSummary": "A documentary about Detroit told through the eyes of firefighters charged with the thankless task of saving a city that many have written off as dead.",
        "runtimeMinutes": "86"
    },
    "2012_461": {
        "plotSummary": "The story of Yonatan Netanyahu, commander of an elite Israeli army commando unit who was killed during Operation Entebbe, a hostage-rescue mission carried out at Entebbe Airport in Uganda on July 4, 1976, after members of the Popular Front...See moreThe story of Yonatan Netanyahu, commander of an elite Israeli army commando unit who was killed during Operation Entebbe, a hostage-rescue mission carried out at Entebbe Airport in Uganda on July 4, 1976, after members of the Popular Front for the Liberation of Palestine and the German Revolutionary Cells hijacked an Air France plane with 248 passengers aboard.  Written by AnonymousSee less",
        "runtimeMinutes": "87"
    },
    "2012_462": {
        "plotSummary": "The Extreme Mustang Makeover Challenge is an annual contest that dares 100 people to each tame a totally wild mustang in order to get it adopted into a better life beyond federal corrals.",
        "runtimeMinutes": "106"
    },
    "2012_463": {
        "plotSummary": "A serious health scare ignites John Thomas, an insurance salesman in his 50s, to take a closer look at his life. Motivated by a misguided obsession with getting Barack Obama elected, John takes an overwhelming involvement in the ...See moreA serious health scare ignites John Thomas, an insurance salesman in his 50s, to take a closer look at his life. Motivated by a misguided obsession with getting Barack Obama elected, John takes an overwhelming involvement in the Presidential campaign. While John becomes obsessed with the ideal of change that Obama represents for Americans, he has in turn neglected to create positive change in his own life, particularly with regard to his health and familial relationships. John hides his health problems from his strong, yet supportive wife, Molly, creating a strain on their marriage. John seeks the support of a Republican relative, MLK, who initially starkly resists supporting a Democratic candidate. John's son, Kalil, rebels against his father's avid support of Obama by supporting the Republican candidate as well. John neglects to support his daughter, Tamika, at a crucial moment in her life, as she has recently fallen in love and become engaged to be married. John faces additional discord with his other son, Jamel, an up-and-coming boxer, who gets mixed up with a shady manager, Slim, as he rises toward a professional boxing career. Joshua, John's recently-paroled brother, also struggles as he attempts to find work in a tough economy and to maintain his new marriage. When Molly discovers that John has been hiding his health scares from her, she urges him to take positive action to improve his bad habits. John works to get back on the right path with his health and family as Obama soars to success in the campaign.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2012_464": {
        "plotSummary": "A devoutly Catholic wife and mother has been nominated for one of the church's top awards. She then goes about trying to prove she has the \"perfect\" family, refusing to accept them for who they are.",
        "runtimeMinutes": "84"
    },
    "2012_465": {
        "plotSummary": "A gang of bank robbers fight their way out of a zombie-infested London.",
        "runtimeMinutes": "88"
    },
    "2012_466": {
        "plotSummary": "Dolph Springer wakes up one morning to realize he has lost the love of his life, his dog, Paul. During his quest to get Paul (and his life) back, Dolph radically changes the lives of others -- risking his sanity all the while.",
        "runtimeMinutes": "94"
    },
    "2012_467": {
        "plotSummary": "A Secret Service Agent is held captive in the trunk of a car and endures mental and physical torture as terrorists attempt to extract information for their plot against the President of the United States.",
        "runtimeMinutes": "92"
    },
    "2012_468": {
        "plotSummary": "After growing up with his single mom, skateboarder Caleb, 18, finds his busy, rich architect dad. He contacts him, when his mom's hospitalized with cancer. He joins a skateboard competition, when rent's up.",
        "runtimeMinutes": "112"
    },
    "2012_469": {
        "plotSummary": "Two female vampires in modern-day New York City are faced with daunting romantic possibilities.",
        "runtimeMinutes": "92"
    },
    "2012_47": {
        "plotSummary": "A male stripper teaches a younger performer how to party, pick up women, and make easy money.",
        "runtimeMinutes": "110"
    },
    "2012_470": {
        "plotSummary": "A shy senior and a down-to-earth junior fall in love over one weekend.",
        "runtimeMinutes": "95"
    },
    "2012_471": {
        "plotSummary": "It's been months since Jafar Panahi, stuck in jail, has been awaiting a verdict by the appeals court. By depicting a day in his life, Panahi and Mojtaba Mirtahmasb try to portray the deprivations looming in contemporary Iranian cinema.",
        "runtimeMinutes": "75"
    },
    "2012_472": {
        "plotSummary": "One man with a website who forever changed the media paradigm, upending the traditional press and changing the ground rules of political journalism.",
        "runtimeMinutes": "85"
    },
    "2012_473": {
        "plotSummary": "After bringing democracy to his country, President Mohamed Nasheed of the Maldives, the lowest-lying country in the world, takes up the fight to keep his homeland from disappearing under the sea.",
        "runtimeMinutes": "101"
    },
    "2012_474": {
        "plotSummary": "Taur Mittran Di is a campus based story of 2 boys set in Guru Nanak Dev University, Amritsar. Both being touted as Badmash of university with strong rivalry between them. Whilst one of them has an authoritative position, the other being ...See moreTaur Mittran Di is a campus based story of 2 boys set in Guru Nanak Dev University, Amritsar. Both being touted as Badmash of university with strong rivalry between them. Whilst one of them has an authoritative position, the other being new to college life challenges this authority. They both have beautiful girl friends who are real sisters. Hockey connects them & they join hands to take up the mission to save hockey showcasing Youth Power.  Written by AnonymousSee less",
        "runtimeMinutes": "135"
    },
    "2012_475": {
        "plotSummary": "A powerful documentary that exposes the direct connection between the long history of U.S. intervention in Latin America and the immigration crisis we face today. From the territorial expansionist policies that decimated the young ...See moreA powerful documentary that exposes the direct connection between the long history of U.S. intervention in Latin America and the immigration crisis we face today. From the territorial expansionist policies that decimated the young economies of Mexico, Puerto Rico and Cuba, to the covert operations that imposed oppressive military regimes in the Dominican Republic, Guatemala, Nicaragua and El Salvador, Harvest of Empire provides an unflinching look at the origins of the growing Latino presence in the United States. Adapted from the landmark book written by journalist Juan Gonzalez, the film tells the story of an epic human saga that is largely unknown to the great majority of citizens in the U.S., but must become part of our national conversation about immigration.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2012_476": {
        "plotSummary": "Sid and Sonali help people in getting divorce who are not happy in their married life while in the case of Mark and Maggie Pereira it is then Sonali will come to know about Sid's intentions which will seriously affect their own ...See moreSid and Sonali help people in getting divorce who are not happy in their married life while in the case of Mark and Maggie Pereira it is then Sonali will come to know about Sid's intentions which will seriously affect their own relationship.  Written by alex.mjacko@gmail.comSee less",
        "runtimeMinutes": "127"
    },
    "2012_477": {
        "plotSummary": "In Barrow, Alaska, teenagers Qalli and Aivaaq find their bond tested when a seal-hunting trip goes wrong, resulting in the death of their friend.",
        "runtimeMinutes": "96"
    },
    "2012_478": {
        "plotSummary": "An investigative documentary about the epidemic of rape of soldiers within the US military.",
        "runtimeMinutes": "93"
    },
    "2012_479": {
        "plotSummary": "A perpetual state of welfare exists in the U.S., creating a form of modern slavery for a large percentage of African-Americans. Rev. C.L. Bryant presents an insightful and compelling look at how freedom can be restored.",
        "runtimeMinutes": "108"
    },
    "2012_48": {
        "plotSummary": "An airline pilot saves almost all his passengers on his malfunctioning airliner which eventually crashed, but an investigation into the accident reveals something troubling.",
        "runtimeMinutes": "138"
    },
    "2012_480": {
        "plotSummary": "A look at how a painter and a successful actor spend their last day together before the world comes to an end.",
        "runtimeMinutes": "82"
    },
    "2012_481": {
        "plotSummary": "Interviewing multiple scientists on climate change, not only does this film cover the science and the facts, it explores the culture of the global warming movement and its motivation, and who stands to make millions.",
        "runtimeMinutes": "89"
    },
    "2012_482": {
        "plotSummary": "In order to prove his fatherhood potential to his pregnant girlfriend, Frank 'kidnaps' her 12-year-old nephew and tags along on his best friend Casper's debauched weekend canoe trip.",
        "runtimeMinutes": "93"
    },
    "2012_483": {
        "plotSummary": "The documentary investigates the history, process and workflow of both digital and photochemical film creation.",
        "runtimeMinutes": "99"
    },
    "2012_484": {
        "plotSummary": "Most people know the lasting legacy of Harry Belafonte, the entertainer. This film unearths his significant contribution to and his leadership in the civil rights movement in America and to social justice globally.",
        "runtimeMinutes": "103"
    },
    "2012_485": {
        "plotSummary": "In this David and Goliath story for the 21st century, a group of proud Scottish homeowners take on celebrity tycoon Donald Trump as he buys up one of Scotland's last wilderness areas to build a golf resort.",
        "runtimeMinutes": "79"
    },
    "2012_486": {
        "plotSummary": "A teddy bear, a mechanical mouse, and a marionette join forces to save their kidnapped friend, Buttercup the doll, from the denizens of the Land of Evil.",
        "runtimeMinutes": "74"
    },
    "2012_487": {
        "plotSummary": "When a family of raccoons discover worms living underneath the sod in Jeff and Nealy's backyard, this pest problem begins a darkly comic and wild chain reaction of domestic tension, infidelity and murder.",
        "runtimeMinutes": "101"
    },
    "2012_488": {
        "plotSummary": "An animated, factually incorrect biography of Graham Arthur Chapman, one of the founding members of the comedy group Monty Python. Read more: Synopsis",
        "runtimeMinutes": "85"
    },
    "2012_489": {
        "plotSummary": "As a Labrador puppy, Quill is sent to live with a couple, Isamu and Mitsuko Nii, who work as volunteers, training guide dogs (seeing eye dogs). When he grows to an adult dog, he is taken to a guide dog school, by a friendly, yet firm ...See moreAs a Labrador puppy, Quill is sent to live with a couple, Isamu and Mitsuko Nii, who work as volunteers, training guide dogs (seeing eye dogs). When he grows to an adult dog, he is taken to a guide dog school, by a friendly, yet firm trainer Satoru Tawada. Although Quill is a little slower than the other dogs at the school, he seems to have an unusual 'empathy' and remarkable patience with his trainers. Tawade decides that Quill would be the ideal guide dog for Mitsuru Watanabe, but Wanatabe, a lonely and ill-tempered middle aged man, isn't as enthusiastic - he would \"would rather sleep than be dragged around by a dog.\". From here, the story is narrated by Wanatabe's daughter, Mitsuko, and slowly, Wantanbe is rehabilitated, venturing into the outside world, and learning, not only to trust other humans, but the animal at his side who guides him.  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "2012_49": {
        "plotSummary": "When human forces discover the existence of the Vampire and Lycan clans, a war to eradicate both species commences. The vampire warrior Selene leads the battle against humankind.",
        "runtimeMinutes": "88"
    },
    "2012_490": {
        "plotSummary": "When a fiercely competitive 30 year old rower fails to make the Olympic boat for the second time, she takes a coaching job at a school but struggles to adjust to life off the race course. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2012_491": {
        "plotSummary": "A former Secret Service agent takes on the job of bodyguard to an R&B singer, whose lifestyle is most unlike a President's.",
        "runtimeMinutes": "129"
    },
    "2012_492": {
        "plotSummary": "A documentary shot over a decade with unprecedented access to photographer Gregory Crewdson that bares the artist's process.",
        "runtimeMinutes": "78"
    },
    "2012_493": {
        "plotSummary": "A documentary that chronicles the cinematic journey of the iconic film A Trip to the Moon.",
        "runtimeMinutes": "80"
    },
    "2012_494": {
        "plotSummary": "A cop investigates the case of a missing local teen, though he discovers a dark secret that has been unleashed in his town, and an evil spirit that will stop at nothing to find its heir.",
        "runtimeMinutes": "98"
    },
    "2012_495": {
        "plotSummary": "Despite being under heavy sedation, a young woman tries to make her way out of the Arboria Institute, a secluded, quasifuturistic commune.",
        "runtimeMinutes": "110"
    },
    "2012_496": {
        "plotSummary": "Having discovered that her dying husband has an illegitimate child living in Florida, a devout Christian housewife leaves her sheltered world on a mission to reunite father and son.",
        "runtimeMinutes": "90"
    },
    "2012_497": {
        "plotSummary": "Actor and writer Stephen Fry explores his passion for the world's most controversial composer - Richard Wagner. But Stephen is Jewish and lost family members in the Holocaust, so can he salvage the music he loves from its dark association ...See moreActor and writer Stephen Fry explores his passion for the world's most controversial composer - Richard Wagner. But Stephen is Jewish and lost family members in the Holocaust, so can he salvage the music he loves from its dark association with anti-semitism and the Nazis? Shot on location in Germany, Switzerland and Russia, the film includes unique behind-the-scenes access to the Bayreuth Festival, the annual extravaganza of Wagner's music held in the composer's own purpose built theatre. Animated by Stephen Fry's trademark wit and intelligence, and featuring a soundtrack of Wagner's extraordinary music, this is a fantastic introduction to the life and legacy of one of the most important composers ever, and a must-see film for those who already know and love his music.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2012_498": {
        "plotSummary": "R & B superstar Andre Stephens (Deitrick Haddon) is on top of the world. He has success, fame and fortune but spiritually he has lost his way. However, his \"perfect\" world is shattered when his entourage is brutally attacked, leaving Andre...See moreR & B superstar Andre Stephens (Deitrick Haddon) is on top of the world. He has success, fame and fortune but spiritually he has lost his way. However, his \"perfect\" world is shattered when his entourage is brutally attacked, leaving Andre and his best friend Chris Johnson (Robert Ri'chard) clinging to life. As his very existence hangs in the balance, Andre goes on a spiritual journey in a place that is neither on Earth nor in Heaven where he is given an opportunity to reevaluate his life, his faith and discover a beautiful soul.See less",
        "runtimeMinutes": "87"
    },
    "2012_499": {
        "plotSummary": "Theorists consider the evolution of human society and question the sustainability of the current paradigm.",
        "runtimeMinutes": "86"
    },
    "2012_5": {
        "plotSummary": "Manny, Diego, and Sid embark upon another adventure after their continent is set adrift. Using an iceberg as a ship, they encounter sea creatures and battle pirates as they explore a new world.",
        "runtimeMinutes": "88"
    },
    "2012_50": {
        "plotSummary": "C.I.A. operatives wage an epic battle on each other when they discover they are dating the same woman.",
        "runtimeMinutes": "103"
    },
    "2012_500": {
        "plotSummary": "An alternate look at Occupy Wall Street camps around the country.",
        "runtimeMinutes": "76"
    },
    "2012_501": {
        "plotSummary": "A young doctor goes to unconscionable extremes in order to remain in the service of a female patient with a kidney disorder.",
        "runtimeMinutes": "91"
    },
    "2012_502": {
        "plotSummary": "After a bad gambling bet, a schoolteacher is marooned in a town full of crazy, drunk, violent men who threaten to make him just as crazy, drunk, and violent.",
        "runtimeMinutes": "109"
    },
    "2012_503": {
        "plotSummary": "The adult siblings of the Fitzgerald family prepare for their estranged father to return home for Christmas for the first time since he walked out on his family 20 years ago.",
        "runtimeMinutes": "99"
    },
    "2012_504": {
        "plotSummary": "A young writer recounts an earlier romance in hopes of attracting his new love interest.",
        "runtimeMinutes": "95"
    },
    "2012_505": {
        "plotSummary": "A comedy centered on two best friends, Kim and Deena, who fight to maintain normalcy in their lives after Kim gets pregnant and has a baby.",
        "runtimeMinutes": "101"
    },
    "2012_506": {
        "plotSummary": "A documentary on French chef Michel Bras and his decision to hand over his restaurant to his son, Sebastien, who has been working with him for 15 years.",
        "runtimeMinutes": "86"
    },
    "2012_507": {
        "plotSummary": "Using the late WG Sebald's book \"The Rings of Saturn\" as its template, this documentary traces the immensely respected author's account of a walk through Suffolk; a tour which prompted tangential musings.",
        "runtimeMinutes": "86"
    },
    "2012_508": {
        "plotSummary": "Melting sea ice, glacier loss and rising sea levels. Severe droughts and wildfires. Increasingly severe tornadoes, hurricanes, and flooding. Record heat waves. Climate change is no longer a prediction for the future, but a startling ...See moreMelting sea ice, glacier loss and rising sea levels. Severe droughts and wildfires. Increasingly severe tornadoes, hurricanes, and flooding. Record heat waves. Climate change is no longer a prediction for the future, but a startling reality of today. Yet, as evidence of our changing climate mounts and the scientific consensus proves human causation, there continues to be little political action to thwart the warming of our planet. \"Greedy Lying Bastards\" investigates the reason behind stalled efforts to tackle climate change despite consensus in the scientific community that it is not only a reality but also a growing problem placing us on the brink of disaster. The film details the people and organizations casting doubt on climate science and claims that greenhouse gases are not affected by human behavior. From the Koch Brothers to ExxonMobil, to oil industry front groups, to prominent politicians and Justices, this provocative expose unravels the layers of deceit threatening democracy and the ability for future generations to survive on planet earth.  Written by One Earth ProductionsSee less",
        "runtimeMinutes": "90"
    },
    "2012_509": {
        "plotSummary": "Two top baseball prospects in the Dominican Republic face fierce competition and corruption as they chase their big league dreams.",
        "runtimeMinutes": "77"
    },
    "2012_51": {
        "plotSummary": "It has been five years since the disappearance of Katie and Hunter, and a suburban family witness strange events in their neighborhood when a woman and a mysterious child move in.",
        "runtimeMinutes": "88"
    },
    "2012_510": {
        "plotSummary": "A painter struggling for inspiration finds an unexpected muse after he accepts a teaching position in a small town and becomes the caregiver to Eddie, a seemingly docile art student with a rare sleepwalking condition.",
        "runtimeMinutes": "90"
    },
    "2012_511": {
        "plotSummary": "Destroyed in a dramatic and highly-publicized implosion, the Pruitt-Igoe public housing complex has become a widespread symbol of failure amongst architects, politicians and policy makers. The Pruitt-Igoe Myth explores the social, economic...See moreDestroyed in a dramatic and highly-publicized implosion, the Pruitt-Igoe public housing complex has become a widespread symbol of failure amongst architects, politicians and policy makers. The Pruitt-Igoe Myth explores the social, economic and legislative issues that led to the decline of conventional public housing in America, and the city centers in which they resided, while tracing the personal and poignant narratives of several of the project's residents. In the post-War years, the American city changed in ways that made it unrecognizable from a generation earlier, privileging some and leaving others in its wake. The next time the city changes, remember Pruitt-Igoe.  Written by AnonymousSee less",
        "runtimeMinutes": "79"
    },
    "2012_512": {
        "plotSummary": "Jenny, who has rejected her tumultuous family for a more ordered life, gets a surprise visit from her sister Lucy at a critical time - right at the moment where she's feels ready to commit to her longtime fiance.",
        "runtimeMinutes": "80"
    },
    "2012_513": {
        "plotSummary": "Director Bud Clayman documents his struggle with OCD and Asperger's Syndrome and how it derailed his plan to become a filmmaker.",
        "runtimeMinutes": "100"
    },
    "2012_514": {
        "plotSummary": "A disillusioned college graduate finds himself torn between his older lover and her daughter.",
        "runtimeMinutes": "106"
    },
    "2012_515": {
        "plotSummary": "A documentary on the world's water crisis.",
        "runtimeMinutes": "105"
    },
    "2012_516": {
        "plotSummary": "Do people exist to serve the economy, or should the economy exist to serve the people? In Fixing the Future, host David Brancaccio, of public radio's Marketplace and NOW on PBS, visits people and organizations across America that are ...See moreDo people exist to serve the economy, or should the economy exist to serve the people? In Fixing the Future, host David Brancaccio, of public radio's Marketplace and NOW on PBS, visits people and organizations across America that are attempting a revolution: the reinvention of the American economy. There are thousands of initiatives around the country - from farmers markets to local business networks - aimed at creating sustainable, local economies. The film highlights effective practices such as: local business alliances, community banking, time banking/hour exchange, worker cooperatives, local currencies and other innovative strategies that people across America have embraced to reinvent the economy on their own terms. By featuring Main Street communities using these innovative approaches to create jobs and build prosperity, Fixing the Future inspires hope and renewal in people struggling with economic adversity.  Written by John SiceloffSee less",
        "runtimeMinutes": "97"
    },
    "2012_517": {
        "plotSummary": "When seenu loses the girl he loves , Raghu loses seenu's hotel in a card game. Now seenu must get back his girl and his hotel while 10 diamonds make the situation more complicated.",
        "runtimeMinutes": "135"
    },
    "2012_518": {
        "plotSummary": "A dying 15-year-old boy draws stories of an invincible superhero as he struggles with his mortality.",
        "runtimeMinutes": "97"
    },
    "2012_519": {
        "plotSummary": "Indifferent to the notion of inheriting his father's estate, a restless, aging New Yorker passes time with his friends in games of mock sincerity and irreverence.",
        "runtimeMinutes": "95"
    },
    "2012_52": {
        "plotSummary": "Emily arrives in Miami with aspirations to become a professional dancer. She sparks with Sean, the leader of a dance crew whose neighborhood is threatened by Emily's father's development plans.",
        "runtimeMinutes": "99"
    },
    "2012_520": {
        "plotSummary": "A dropout comes to the aid of a chubby and suicidal high-school kid by recruiting him as the drummer for his upstart punk-rock band. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2012_521": {
        "plotSummary": "Each citizen of Jotuomba plays an integral role in village life. Madalena is responsible for baking bread; each morning she stacks her rolls as Antonio prepares the coffee. The two share a morning ritual of arguments and insults, followed ...See moreEach citizen of Jotuomba plays an integral role in village life. Madalena is responsible for baking bread; each morning she stacks her rolls as Antonio prepares the coffee. The two share a morning ritual of arguments and insults, followed by an amicable cup of coffee on the bench outside Antonio's shop. At midday the church bells ring, summoning the villagers to mass. In the early evening, they all share a meal together. And so life proceeds in Jotuomba, the days languidly drifting into one another. The only variations seem to be in the weather. One day Rita arrives looking for a place to stay. She came upon the village while traveling through the valley, following the unused railroad tracks. She is a photographer, intent on capturing the village's special allure. Initially reticent, the townsfolk gradually open up to her, sharing their stories and allowing themselves to be photographed. Rita is comfortable with technologies old and new, and Madalena teaches her to knead dough by the light of an oil lamp. Only the village priest continues to find Rita's presence worrisome, especially when she begins asking about the locked cemetery.  Written by TIFFSee less",
        "runtimeMinutes": "98"
    },
    "2012_522": {
        "plotSummary": "In a post apocalyptic future, two rival gangs fight for control of Frazier Park by playing \"Beat Beat Revelation\", a deadly version of Dance, Dance, Revolution(TM).",
        "runtimeMinutes": "82"
    },
    "2012_523": {
        "plotSummary": "The story of Paan Singh Tomar, an Indian athlete and seven-time national steeplechase champion who becomes one of the most feared dacoits in Chambal Valley after his retirement.",
        "runtimeMinutes": "135"
    },
    "2012_524": {
        "plotSummary": "A military deserter finds love and trouble (and a small dog) in a smoky French port city.",
        "runtimeMinutes": "91"
    },
    "2012_525": {
        "plotSummary": "A documentary about legendary songwriter and 70's icon Paul Williams.",
        "runtimeMinutes": "87"
    },
    "2012_526": {
        "plotSummary": "In 2001, China joined the World Trade Organization with the strong support of a Democratic President and Republican Congress. Before the ink was dry on this free trade agreement, China began flooding U.S. markets with illegally subsidized ...See moreIn 2001, China joined the World Trade Organization with the strong support of a Democratic President and Republican Congress. Before the ink was dry on this free trade agreement, China began flooding U.S. markets with illegally subsidized exports while the big multinational companies that had lobbied heavily for the agreement rapidly accelerated the off shoring of American jobs to China. Today, as a result of the biggest shell game in American history, China has stolen millions of our jobs, corporate profits are soaring, and we now owe over $3 trillion to the world's largest totalitarian nation. This film is about how that happened... and why the best jobs program for America is trade reform with China.  Written by AnonymousSee less",
        "runtimeMinutes": "78"
    },
    "2012_527": {
        "plotSummary": "The theatrical life of a beautiful courtesan and the four men who love her.",
        "runtimeMinutes": "189"
    },
    "2012_528": {
        "plotSummary": "A documentary that follows Hole drummer Patty Schemel as she struggles with fame and addiction during the band's 1994-1995 world tour and after.",
        "runtimeMinutes": "103"
    },
    "2012_529": {
        "plotSummary": "A documentary that explores the question: In the age of manscaping, metrosexuals, and grooming products galore - what does it mean to be a man?",
        "runtimeMinutes": "82"
    },
    "2012_53": {
        "plotSummary": "British retirees travel to India to take up residence in what they believe is a newly restored hotel. Less luxurious than advertised, the Marigold Hotel nevertheless slowly begins to charm in unexpected ways.",
        "runtimeMinutes": "124"
    },
    "2012_530": {
        "plotSummary": "A young pickpocket in the New York subways, living a fast, free, lifestyle is confronted by a woman with whom he had a one night affair.",
        "runtimeMinutes": "89"
    },
    "2012_531": {
        "plotSummary": "After witnessing the brutal murder of his parents, a young boy is raised by a martial arts master who grooms him to be a lethal killer. Some 20 years later, it's time to take revenge on the assassins who destroyed his childhood.",
        "runtimeMinutes": "82"
    },
    "2012_532": {
        "plotSummary": "A detective decides to go undercover and set up a group of robbers, but he may be getting too caught up in the task at hand.",
        "runtimeMinutes": "112"
    },
    "2012_533": {
        "plotSummary": "A behind-the-scenes look at the fans who gather by the thousands each year in San Diego, California to attend Comic-Con, the world's largest comic book convention.",
        "runtimeMinutes": "88"
    },
    "2012_534": {
        "plotSummary": "Some stories get lost in the turmoil of their times. It is often only in retrospect that we can discover the true shapers of history. One such man is the prodigious Polish violinist Bronislaw Huberman. Orchestra of Exiles explores this ...See moreSome stories get lost in the turmoil of their times. It is often only in retrospect that we can discover the true shapers of history. One such man is the prodigious Polish violinist Bronislaw Huberman. Orchestra of Exiles explores this great man's 4-year odyssey, which culminates in the founding of the orchestra that would become the Israel Philharmonic. His fascinating story touches many of the major themes of the 20th century and the unfolding drama of his life is riveting. During the darkest days of a Europe being torn apart by anti- Semitism and Nazi aggression, Huberman's extraordinary efforts saved hundreds of Jewish families from the approaching holocaust and his achievements changed the landscape of cultural history. Before the Nazis came to power Huberman was focused only on building his own monumental career but witnessing Hitler's agenda was a call to action that Huberman could not ignore. Huberman's personal transformation and subsequent heroic struggle to get Jewish musicians out of Europe to found this orchestra will be at the heart of this film.  Written by Josh AronsonSee less",
        "runtimeMinutes": "85"
    },
    "2012_535": {
        "plotSummary": "In this delightful comedy Justine (Inglourious Basterds' MÃ©lanie Laurent) flits from one boyfriend to the next while her immature father secretly befriends them all.",
        "runtimeMinutes": "98"
    },
    "2012_536": {
        "plotSummary": "The latest film from Stephen K. Bannon: District of Corruption, traces the arc of government corruption and secrecy from the Clinton administration through the Bush years to the current corruption and transparency crises of the Obama administration.",
        "runtimeMinutes": "70"
    },
    "2012_537": {
        "plotSummary": "When, Mia, a dance teacher, lands in the hospital after an accident, Armando, a would-be dancer who admires her from afar, persuades her to train for an upcoming wheelchair ballroom dancing contest.",
        "runtimeMinutes": "102"
    },
    "2012_538": {
        "plotSummary": "A mysteriously linked pair of young women find their daily lives preempted by a strange boudoir melodrama that plays itself out in a hallucinatory parallel reality.",
        "runtimeMinutes": "193"
    },
    "2012_539": {
        "plotSummary": "Cartographer Will Shepard hits the road for his latest job: to create a new, more accurate satellite survey of Armenia. During his assignment, he forms a bond with an Armenian expatriate and art photographer.",
        "runtimeMinutes": "126"
    },
    "2012_54": {
        "plotSummary": "A look at the life of Jiro Horikoshi, the man who designed Japanese fighter planes during World War II.",
        "runtimeMinutes": "126"
    },
    "2012_540": {
        "plotSummary": "A documentary on Louise and Martine Fokkens, 69-year-old twin sisters who have worked as prostitutes in the red-light district in Amsterdam for over 40 years.",
        "runtimeMinutes": "80"
    },
    "2012_541": {
        "plotSummary": "A successful businessman attempting to resurrect his life buys and boards a dilapidated sailboat.",
        "runtimeMinutes": "88"
    },
    "2012_542": {
        "plotSummary": "Two young men who have been raised as brothers look to their soccer skills as a way of getting out of their slum. While a scout is in town, an act of violence threatens to tear them apart.",
        "runtimeMinutes": "97"
    },
    "2012_543": {
        "plotSummary": "A look into the lives of the descendants of the top Nazi officials who worked under Hitler's command.",
        "runtimeMinutes": "59"
    },
    "2012_544": {
        "plotSummary": "A teenage boy's search for love finds him fixated on a boy who lives nearby.",
        "runtimeMinutes": "98"
    },
    "2012_545": {
        "plotSummary": "Danish journalist Mads Brügger goes undercover as a Liberian Ambassador to embark on a dangerous yet hysterical journey to uncover the blood diamond trade in Africa.",
        "runtimeMinutes": "97"
    },
    "2012_546": {
        "plotSummary": "A haunted soldier just back from war and a boy who has never known peace in his home life embark on a life-changing journey as they become unlikely friends -- and one another's last shot at redemption.",
        "runtimeMinutes": "107"
    },
    "2012_547": {
        "plotSummary": "Charles drifts through politics, religion and psychoanalysis, rejecting them all. Once he realises the depth of his disgust with the moral and physical decline of the society he lives in, he decides that suicide is the only option...See moreCharles drifts through politics, religion and psychoanalysis, rejecting them all. Once he realises the depth of his disgust with the moral and physical decline of the society he lives in, he decides that suicide is the only option...  Written by Michael Brooke See less",
        "runtimeMinutes": "95"
    },
    "2012_548": {
        "plotSummary": "Breast cancer has become the poster child of corporate cause-related marketing campaigns. Countless women and men walk, bike, climb and shop for the cure. Each year, millions of dollars are raised in the name of breast cancer, but where ...See moreBreast cancer has become the poster child of corporate cause-related marketing campaigns. Countless women and men walk, bike, climb and shop for the cure. Each year, millions of dollars are raised in the name of breast cancer, but where does this money go and what does it actually achieve? Pink Ribbons, Inc. is a feature documentary that shows how the devastating reality of breast cancer, which marketing experts have labeled a \"dream cause,\" becomes obfuscated by a shiny, pink story of success.  Written by The National Film Board of CanadaSee less",
        "runtimeMinutes": "97"
    },
    "2012_549": {
        "plotSummary": "A coffin-dragging gunslinger and a half-breed prostitute become embroiled in a bitter feud between a Klan of Southern racists and a band of Mexican Revolutionaries.",
        "runtimeMinutes": "91"
    },
    "2012_55": {
        "plotSummary": "Four friends take a break from their day-to-day lives to throw a bachelor party in Las Vegas for their last remaining single pal.",
        "runtimeMinutes": "105"
    },
    "2012_550": {
        "plotSummary": "A Silver Lake family's relaxed dynamic is tested after they take in a young artist so she can complete her art film.",
        "runtimeMinutes": "83"
    },
    "2012_551": {
        "plotSummary": "May, a young Canadian woman with a horrifying past travels to the small highly spiritual town to take her vows into nun hood. There she begins to have premonitions of varies murders that seem to be related to the paintings of Caravaggio. ...See moreMay, a young Canadian woman with a horrifying past travels to the small highly spiritual town to take her vows into nun hood. There she begins to have premonitions of varies murders that seem to be related to the paintings of Caravaggio. When the inexplicable murders begin, May is plagued by merciless dreams and a tortured ghost that haunts her waking hours. In an escalation of terror and madness, she discovers an obscure secret that digs deep into the history of the town.  Written by AnonymousSee less",
        "runtimeMinutes": "103"
    },
    "2012_552": {
        "plotSummary": "A group of five people working to stay alive in a post-apocalyptic future discover what they think is a safe, abandoned farmhouse, but they soon find themselves fighting to stay alive as a gang of bloodthirsty predators attack.",
        "runtimeMinutes": "87"
    },
    "2012_553": {
        "plotSummary": "A storm grows, a sea otter pup is separated from her mother, and a young woman bound for adventure blows in to town. On a wild and windswept beach these lives collide and an entire species' survival gets personal. Through Katie's eyes you ...See moreA storm grows, a sea otter pup is separated from her mother, and a young woman bound for adventure blows in to town. On a wild and windswept beach these lives collide and an entire species' survival gets personal. Through Katie's eyes you will see our playful pup, otter number 501, get an amazing second chance at life in the wild. As the two learn to navigate the opportunities and risks of life without anchor we see the incredible efforts people have undertaken to save sea otters from the brink of existence. Framed against the strikingly beautiful Monterey Bay coastline, the last stronghold of these iconic animals, Katie discovers just how serious this threat remains. Their adventure, unexpected as it was, illustrates what we can do to contribute to the growing movement to protect the southern sea otter...and ourselves.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2012_554": {
        "plotSummary": "Legendary radio personality Bob Fass revolutionized late-night F.M. radio by serving as a cultural hub for music, politics and audience participation for nearly half a century. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2012_555": {
        "plotSummary": "After watching their best friend get murdered, a group of teens struggle to expose a local hero as the vicious killer and keep from becoming his next victims.",
        "runtimeMinutes": "96"
    },
    "2012_556": {
        "plotSummary": "A documentary that follows one year in the life of American pro basketball player Kevin Sheppard, who signed on to play for the upstart Iranian Super League team A.S. Shiraz.",
        "runtimeMinutes": "90"
    },
    "2012_557": {
        "plotSummary": "If God is our pure, all-loving creator, can he really turn his back on sinners and allow them to suffer for eternity in hell? Where did this vision of hell come from? Is it possible we've got hell wrong? Or are recent challenges to the ...See moreIf God is our pure, all-loving creator, can he really turn his back on sinners and allow them to suffer for eternity in hell? Where did this vision of hell come from? Is it possible we've got hell wrong? Or are recent challenges to the traditional view merely an attempt to avoid the inevitable? \"Hellbound?\" is a feature-length documentary that seeks to discover why we are so bound to the idea of hell and what our views on hell reveal about how we perceive God, justice, the Bible and, ultimately, ourselves.  Written by Kevin MillerSee less",
        "runtimeMinutes": "84"
    },
    "2012_558": {
        "plotSummary": "Gangster and deadbeat dad, Ulysses Pick, embarks on an unusual journey through his home.",
        "runtimeMinutes": "94"
    },
    "2012_559": {
        "plotSummary": "A young British boy comes of age among his loving family and the austere Catholic Church as he realizes his love of cinema and his homosexuality.",
        "runtimeMinutes": "85"
    },
    "2012_56": {
        "plotSummary": "A chronicle of the decade-long hunt for al-Qaeda terrorist leader Osama bin Laden after the September 2001 attacks, and his death at the hands of the Navy S.E.A.L.s Team 6 in May 2011.",
        "runtimeMinutes": "157"
    },
    "2012_560": {
        "plotSummary": "A documentary on Broadway legend Carol Channing.",
        "runtimeMinutes": "87"
    },
    "2012_561": {
        "plotSummary": "The theory of evolution and a re-write of American history are caught in the crosshairs when an unabashed Creationist seeks re-election as chairman of America's most influential Board of Education.",
        "runtimeMinutes": "92"
    },
    "2012_562": {
        "plotSummary": "A documentary on the modeling industry's 'supply chain' between Siberia, Japan, and the U.S., told through the experiences of the scouts, agencies, and a 13-year-old model.",
        "runtimeMinutes": "78"
    },
    "2012_563": {
        "plotSummary": "Three characters of different social classes escape their unfinished painting in search of the Painter, hoping he will complete it.",
        "runtimeMinutes": "80"
    },
    "2012_564": {
        "plotSummary": "Unable to give her boyfriend Ben (Reid Scott) a firm yes when he asks her to marry him, Sam (Miranda Kent) sets off on a series of dating adventures to find empirical proof that Ben is \"the one\".",
        "runtimeMinutes": "91"
    },
    "2012_565": {
        "plotSummary": "For Jimmy Lee Lindsay, life was a mosh pit. Whether it was growing up among crack addicts on the rough side of Memphis, or his years in the rough-and-tumble underground rock scene of the '00s, the man the world came to know as Jay Reatard ...See moreFor Jimmy Lee Lindsay, life was a mosh pit. Whether it was growing up among crack addicts on the rough side of Memphis, or his years in the rough-and-tumble underground rock scene of the '00s, the man the world came to know as Jay Reatard always had to fight in order to create, to grow, to live, to rise above. For the first time, filmmakers Alex Hammond and Ian Markiewicz tell Reatard's difficult, tragic, and ultimately inspiring story, tracing his steps from a poverty-stricken childhood to his teen years as a two-fisted tunesmith slugging it out with fans and band-mates alike to his final years as a surprisingly thoughtful and restlessly creative man. While Reatard died too young, his music-and the story that made it possible-is as vital and thrilling as ever.  Written by Steven HydenSee less",
        "runtimeMinutes": "89"
    },
    "2012_566": {
        "plotSummary": "Visitors to the mystical town of Sedona encounter eccentric characters and a series of calamities that lead them to unexpected miracles.",
        "runtimeMinutes": "90"
    },
    "2012_567": {
        "plotSummary": "A documentary on pro skateboarder Danny Way's tough childhood and his contributions to the sport, including footage of his jump over the Great Wall of China.",
        "runtimeMinutes": "96"
    },
    "2012_568": {
        "plotSummary": "Dennis, a painfully shy 38-year-old bodybuilder who lives with his mother, sets off to Thailand in search of love.",
        "runtimeMinutes": "92"
    },
    "2012_569": {
        "plotSummary": "A struggling musician takes an overnight long-distance drive in order to fight his estranged wife for custody of their young daughter.",
        "runtimeMinutes": "94"
    },
    "2012_57": {
        "plotSummary": "Johnny Blaze, tortured by the Ghost Rider's curse, gets a chance of redemption through protecting the Devil's son, whose father is pursuing him.",
        "runtimeMinutes": "96"
    },
    "2012_570": {
        "plotSummary": "Adam learns that his Yogi guru, Anand, has discovered a prophesy that was printed on his birth chart - he would die in an accident at the age of 27; and when Anand invites Adam to join him on a motorcycle journey through India's Himalayas,...See moreAdam learns that his Yogi guru, Anand, has discovered a prophesy that was printed on his birth chart - he would die in an accident at the age of 27; and when Anand invites Adam to join him on a motorcycle journey through India's Himalayas, to the highest motorable road in the world, he faces the ultimate question: Is truly living worth dying for?  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2012_571": {
        "plotSummary": "At the age of ten, Henry James Herman, a boy who was conceived in a petri-dish and raised by his feminist mother, follows a string of Post-It notes in hopes of finding his biological father.",
        "runtimeMinutes": "92"
    },
    "2012_572": {
        "plotSummary": "Chris Thile is at a crossroads. His marriage has ended and his platinum-selling band, Nickel Creek, has gone on hiatus. But Thile, a prodigy who has defied expectations since he picked up the mandolin at age five, has a plan.",
        "runtimeMinutes": "89"
    },
    "2012_573": {
        "plotSummary": "After losing his job, a journalist reluctantly agrees to help his oddball friend with his bid to earn a seat on the Seattle City Council. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2012_574": {
        "plotSummary": "Nathan believes he is entitled to live the way he wants, but when tragedy strikes, he is forced to give up his plans and make a choice--his siblings or his girlfriend. Or maybe he doesn't have to give up anything. Maybe he can have it all.",
        "runtimeMinutes": "106"
    },
    "2012_575": {
        "plotSummary": "A documentary that follows three brothers as they discover the scenes of late-night New Orleans.",
        "runtimeMinutes": "80"
    },
    "2012_576": {
        "plotSummary": "When a brother accompanies his estranged sister on a road trip, they rediscover how obnoxious they are together - and how much they might need each other.",
        "runtimeMinutes": "83"
    },
    "2012_577": {
        "plotSummary": "A group of high school kids enjoy many adventures throughout their formative tenth grade year.",
        "runtimeMinutes": "98"
    },
    "2012_578": {
        "plotSummary": "After a lifetime of hiding, Chely Wright becomes the first commercial country music singer to come out as gay, shattering cultural stereotypes within Nashville, her conservative heartland family and, most importantly, within herself. With ...See moreAfter a lifetime of hiding, Chely Wright becomes the first commercial country music singer to come out as gay, shattering cultural stereotypes within Nashville, her conservative heartland family and, most importantly, within herself. With unprecedented access over a two-year period, including her private video diaries, the film layers Chely's rise to fame while hiding in the late 90's with the execution of her coming out plan, culminating in the exciting moment when she steps into the media glare to reveal she is gay. The film shows both the devastation of internalized homophobia and the transformational power of living an authentic life. The film also documents the conflicting responses from Nashville, the heartland and the LGBT community as Chely Wright prepares for an unknown future.  Written by AnonymousSee less",
        "runtimeMinutes": "120"
    },
    "2012_579": {
        "plotSummary": "The friars of a poor war-ravaged monastery find an infant abandoned on their doorstep.",
        "runtimeMinutes": "91"
    },
    "2012_58": {
        "plotSummary": "An exploration of how the actions of individual lives impact one another in the past, present and future, as one soul is shaped from a killer into a hero, and an act of kindness ripples across centuries to inspire a revolution.",
        "runtimeMinutes": "172"
    },
    "2012_580": {
        "plotSummary": "When a man goes for virtual vacation memories of the planet Mars, an unexpected and harrowing series of events forces him to go to the planet for real - or is he?",
        "runtimeMinutes": "113"
    },
    "2012_581": {
        "plotSummary": "An adaptation of Margaret Atwood's book examining the metaphor of indebtedness.",
        "runtimeMinutes": "82"
    },
    "2012_582": {
        "plotSummary": "Lily and Alison face a life-changing event after they leave their Salton Sea home and follow the boys they meet back to Los Angeles. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2012_583": {
        "plotSummary": "A veteran cop chases a cold blooded serial killer, who murders his victims in alphabetical order.",
        "runtimeMinutes": "100"
    },
    "2012_584": {
        "plotSummary": "A perennial understudy takes matters into her own hands to achieve fame at any price. Read more: Synopsis",
        "runtimeMinutes": "101"
    },
    "2012_585": {
        "plotSummary": "The Prophet's Son combines action, drama, and romance as it addresses teen violence, dating, pregnancy, gangs, drug abuse, family conflict, and politics inviting nuclear war. As society crumbles, faith in God becomes the only path of hope.",
        "runtimeMinutes": "97"
    },
    "2012_586": {
        "plotSummary": "A soldier returns to her family, friends, and old job after a tour of duty, though she finds herself struggling to find her place in her everyday life.",
        "runtimeMinutes": "97"
    },
    "2012_587": {
        "plotSummary": "Inventing Our Life examines the 100 year history of Israel's kibbutz movement, one of the world's longest running and most successful experiments in pure communism. Recreating its glorious past and chronicling its recent decline, Inventing...See moreInventing Our Life examines the 100 year history of Israel's kibbutz movement, one of the world's longest running and most successful experiments in pure communism. Recreating its glorious past and chronicling its recent decline, Inventing Our Life focuses on the heartbreak and hope of the modern kibbutz, as a new generation struggles to insure its survival. Can a radically socialist institution survive a new market-driven reality with its ideological integrity intact? How will this affect the lives of the tens of thousands of people who still believe in the kibbutz experiment and continue to call it home? As the film progresses, the drama shifts from Can it survive? to Yes, but at what price?  Written by AnonymousSee less",
        "runtimeMinutes": "79"
    },
    "2012_588": {
        "plotSummary": "The story of Kevin Laue striving to be the first one-armed basketball player ever to receive a scholarship and play on an elite NCAA Division 1 basketball team.",
        "runtimeMinutes": "93"
    },
    "2012_589": {
        "plotSummary": "Young-Chan comes from planet of snail where deaf blind people live slow and quiet lives. When Young-Chan came to Earth, nobody understood his language and he was desperate. Then an angel walked into his life. Soon-Ho knows how it is to be ...See moreYoung-Chan comes from planet of snail where deaf blind people live slow and quiet lives. When Young-Chan came to Earth, nobody understood his language and he was desperate. Then an angel walked into his life. Soon-Ho knows how it is to be lonely and soon becomes an inseparable part of his life. Young-Chan also discovers an amazing world under his fingers as he learned to read books with braille. Hopes began to grow and he dreams of writing a book. However, Soon-Ho cannot always be there for him because of her own problem of spine disability. The couple now should learn to survive alone. While Soon-Ho uneasily spends her first day waiting for his return, Young-Chan goes out for the biggest adventure of his life.  Written by AnonymousSee less",
        "runtimeMinutes": "88"
    },
    "2012_59": {
        "plotSummary": "A young solicitor travels to a remote village where he discovers the vengeful ghost of a scorned woman is terrorizing the locals.",
        "runtimeMinutes": "95"
    },
    "2012_590": {
        "plotSummary": "A maverick New York hedge fund trader with uncanny analytic abilities moves to Hong Kong and orchestrates a mega-deal that swiftly escalates beyond his control.",
        "runtimeMinutes": "102"
    },
    "2012_591": {
        "plotSummary": "In this world of wonders there are still places that have not been smoothed over with the shallow surfaces of Western commercialism. This film is a personal Valentine to a life filled with amazing, exotic, beautiful and fearsome places for...See moreIn this world of wonders there are still places that have not been smoothed over with the shallow surfaces of Western commercialism. This film is a personal Valentine to a life filled with amazing, exotic, beautiful and fearsome places for the world. The amazing thing is not just the visual demonstration of how fleeting life is, but a meditation on how the decisions that seem momentous on our time scale are flickering snapshots of life on this planet, too small to be observed by most. Somehow the music combined with technology becomes a personal experience that makes the earth and its inhabitants seem touchingly fragile and full of wonder...  Written by IndicanSee less",
        "runtimeMinutes": "107"
    },
    "2012_592": {
        "plotSummary": "Soon after Thom starts operating as an illegal taxi driver in New York City, Claire hires him to drive her to California after her estranged father suffers a heart attack.",
        "runtimeMinutes": "97"
    },
    "2012_593": {
        "plotSummary": "A former Britpop rocker who now works on a farm gets caught driving drunk and faces deportation after living in Los Angeles for many years. His efforts to stay in the U.S. force him to confront the past and current demons in his life.",
        "runtimeMinutes": "94"
    },
    "2012_594": {
        "plotSummary": "A documentary on three teenagers living in a small desert town in Southern California.",
        "runtimeMinutes": "72"
    },
    "2012_595": {
        "plotSummary": "After twenty years in prison, Foley is finished with the grifter's life. When he meets an elusive young woman named Iris, the possibility of a new start looks real. But his past is proving to be a stubborn companion.",
        "runtimeMinutes": "90"
    },
    "2012_596": {
        "plotSummary": "Kung Fu Joe, neighborhood hero and martial arts expert, must uncover the plot of a mad scientist and his bizarre minions bent on ruling the world. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2012_597": {
        "plotSummary": "A couple grieving the loss of their own daughter set out to rescue young girls sold into the sex slave trade.",
        "runtimeMinutes": "88"
    },
    "2012_598": {
        "plotSummary": "The story begins on a bus, when white-collar worker Ye refuses to give up her seat to a senior citizen. Her defiance is videotaped by a journalist intern and played during a news show. The video sparks intense debate on and off the ...See moreThe story begins on a bus, when white-collar worker Ye refuses to give up her seat to a senior citizen. Her defiance is videotaped by a journalist intern and played during a news show. The video sparks intense debate on and off the Internet. Some Internet users search for Ye's personal information and post it all online. The issue soon brings tremendous changes to the families of both the journalist intern and Ye's boss.  Written by nitorchSee less",
        "runtimeMinutes": "117"
    },
    "2012_599": {
        "plotSummary": "Bank-robber Franck Adrien is serving a prison sentence after robbing a national bank. Before he was caught he managed to hide the money but now it's not just the police who are looking for the money. His cell-mate is Jean-Louis Maurel, an ...See moreBank-robber Franck Adrien is serving a prison sentence after robbing a national bank. Before he was caught he managed to hide the money but now it's not just the police who are looking for the money. His cell-mate is Jean-Louis Maurel, an alleged rapist/child molester who claims his innocence. When the court finds Maurel not guilty, Maurel promises to look after Franck's family when he gets out. But one day, a man called Manuel Carrega tells Franck that Maurel is a suspected serial killer and that Franck's family is in danger. Franck escapes from prison and police officer Claire Linne and her team take up the chase.  Written by curtherzstarkSee less",
        "runtimeMinutes": "102"
    },
    "2012_6": {
        "plotSummary": "After the birth of Renesmee/Nessie, the Cullens gather other vampire clans in order to protect the child from a false allegation that puts the family in front of the Volturi.",
        "runtimeMinutes": "115"
    },
    "2012_60": {
        "plotSummary": "Three high school friends gain superpowers after making an incredible discovery underground. Soon they find their lives spinning out of control and their bond tested as they embrace their darker sides.",
        "runtimeMinutes": "89"
    },
    "2012_600": {
        "plotSummary": "A summer heat wave and a series of sexual encounters connect a group of New Yorkers.",
        "runtimeMinutes": "88"
    },
    "2012_601": {
        "plotSummary": "A documentary on Marc Dreier, the once-prominent Manhattan attorney who was arrested for orchestrating a massive fraud scheme that netted over 700 million dollars from hedge funds.",
        "runtimeMinutes": "84"
    },
    "2012_602": {
        "plotSummary": "Shortly after her mother's death, an innocent and youthful woman will find refuge into the household of her middle-aged aristocratic guardian, who will submit her to his sexual advances.",
        "runtimeMinutes": "99"
    },
    "2012_603": {
        "plotSummary": "The film explores why dance matters - to those who create and perform it and to those who watch it. This documentary tells the remarkable story of how an abandoned Massachusetts farm has evolved into a National Historic Landmark and a ...See moreThe film explores why dance matters - to those who create and perform it and to those who watch it. This documentary tells the remarkable story of how an abandoned Massachusetts farm has evolved into a National Historic Landmark and a nexus for dance throughout the world. Its unlikely purchase by choreographer Ted Shawn during the Great Depression allowed this secluded site in the Berkshires to become the internationally renowned Jacob's Pillow Dance Festival. Through candid conversations with world-class choreographers and dancers, thrilling performances, backstage access, and rare footage from the Pillow's Archives, 'Never Stand Still' immerses the viewer in this most ephemeral of art forms, celebrating not only its value to our culture but to our lives.  Written by AnonymousSee less",
        "runtimeMinutes": "78"
    },
    "2012_604": {
        "plotSummary": "A husband and wife in a loveless marriage struggle to remain ignorant to their failed relationship.",
        "runtimeMinutes": "110"
    },
    "2012_605": {
        "plotSummary": "Jenn (straight) and Matt (gay) are best friends from college who are now in their thirties. Single by choice, they decide to fulfill a youthful promise to have a child together... the old fashioned way.",
        "runtimeMinutes": "85"
    },
    "2012_606": {
        "plotSummary": "A womanizer teaches his clueless friend the rules about being single and avoiding emotional attachment. Read more: Synopsis",
        "runtimeMinutes": "100"
    },
    "2012_607": {
        "plotSummary": "A documentary that follows football player and pro-wrestler Chris Nowinski's quest to uncover the truth about the consequences of sports related head injuries.",
        "runtimeMinutes": "95"
    },
    "2012_608": {
        "plotSummary": "When a school bus accident devastates an inner city Los Angeles neighborhood, it will forever change the paths for all. Friendships will be challenged, beliefs questioned and it become a time when they must choose which way to fall.",
        "runtimeMinutes": "86"
    },
    "2012_609": {
        "plotSummary": "After realizing that all world is spoiled, Marie and Marie are committed to be spoiled themselves. They rip off older men, feast in lavish meals and do all kinds of mischief. But what is all this leading to?",
        "runtimeMinutes": "74"
    },
    "2012_61": {
        "plotSummary": "See and feel what it was like when dinosaurs ruled the Earth, in a story where an underdog dino triumphs to become a hero for the ages.",
        "runtimeMinutes": "87"
    },
    "2012_610": {
        "plotSummary": "Can justice truly be served in the occupied territories given the current system of law administered by Israel for Palestinians?",
        "runtimeMinutes": "100"
    },
    "2012_611": {
        "plotSummary": "WHEN THE IRON BIRD FLIES takes us on an up-close and personal journey, exploring the complex interactions between contemporary Tibetan Buddhism and western culture. The film goes in-depth to portray the experiences and insights of both ...See moreWHEN THE IRON BIRD FLIES takes us on an up-close and personal journey, exploring the complex interactions between contemporary Tibetan Buddhism and western culture. The film goes in-depth to portray the experiences and insights of both teachers and practitioners in the US and around the world. Along the way, it illuminates the wide ranging dialogs taking place between Buddhist teachings and science, psychology, gender theory and the arts. The film creates a vivid and entertaining portrait of the world of Tibetan Buddhism, as it is manifesting in the West and asks the vital question - 'In these increasingly chaotic modern times, can these age old teachings help us to find genuine happiness and create a saner, more compassionate 21st century world?'  Written by AnonymousSee less",
        "runtimeMinutes": "96"
    },
    "2012_612": {
        "plotSummary": "Nine estranged friends are reunited after their larger than life friend unexpectedly dies. The friends who haven't seen each other in years are all forced to stay at their deceased friends estate for the weekend and must reconnect with ...See moreNine estranged friends are reunited after their larger than life friend unexpectedly dies. The friends who haven't seen each other in years are all forced to stay at their deceased friends estate for the weekend and must reconnect with each other working through all of their issues in order to each collect their inheritance.  Written by B_wallaceSee less",
        "runtimeMinutes": "111"
    },
    "2012_613": {
        "plotSummary": "A guy in his mid-thirties watches as his life comically unravels after he enters into a relationship with the daughter of a former high school classmate.",
        "runtimeMinutes": "97"
    },
    "2012_614": {
        "plotSummary": "A black man and his school-teacher wife face discriminatory challenges in 1960s America.",
        "runtimeMinutes": "95"
    },
    "2012_615": {
        "plotSummary": "The film traces the rise of one of the world's premier architects, Norman Foster, and his unending quest to improve the quality of life through design.",
        "runtimeMinutes": "78"
    },
    "2012_616": {
        "plotSummary": "A sheriff sees his state senate bid slide out onto the ice when his daughter begins to date the son of a charming but psychologically disturbed woman with whom the sheriff has engaged in a two-decade-long affair.",
        "runtimeMinutes": "111"
    },
    "2012_617": {
        "plotSummary": "Husbands in Goa is a story of three friends - Jerry Thomas (Advocate), Murali Govind (Chartered Accountant) and Arjun (Interior Designer). The three of them are faced with a common dilemma, as they are all harassed by certain behavioral ...See moreHusbands in Goa is a story of three friends - Jerry Thomas (Advocate), Murali Govind (Chartered Accountant) and Arjun (Interior Designer). The three of them are faced with a common dilemma, as they are all harassed by certain behavioral traits of their wives. To get away from them, the three friends plan a pleasure trip to Goa. On their journey to Goa they meet Sunny who they befriend but fail to realize the trouble that he attracts due to his usual drunkenness. Theirshort holiday turns into a crazy ride as they keep trying to get themselves out of comedic situations.  Written by AnonymousSee less",
        "runtimeMinutes": "140"
    },
    "2012_618": {
        "plotSummary": "A love story set in the shadow of the shipyards of San Francisco. A young woman (June) living with her much adored uncle Henry and domineering, abusive father (Murry), meets a penniless illegal immigrant (Juan Diego), whose love gives her ...See moreA love story set in the shadow of the shipyards of San Francisco. A young woman (June) living with her much adored uncle Henry and domineering, abusive father (Murry), meets a penniless illegal immigrant (Juan Diego), whose love gives her the insight and courage to finally break free and live her own life.  Written by James SavocaSee less",
        "runtimeMinutes": "93"
    },
    "2012_619": {
        "plotSummary": "In Uganda, a new bill threatens to make homosexuality punishable by death. David Kato - Uganda's first openly gay man - and his fellow activists work against the clock to defeat the legislation while combating vicious persecution in their ...See moreIn Uganda, a new bill threatens to make homosexuality punishable by death. David Kato - Uganda's first openly gay man - and his fellow activists work against the clock to defeat the legislation while combating vicious persecution in their daily lives. But no one, not even the filmmakers, is prepared for the brutal murder that shakes the movement to its core and sends shock waves around the world.  Written by AnonymousSee less",
        "runtimeMinutes": "87"
    },
    "2012_62": {
        "plotSummary": "Pirate Captain sets out on a mission to defeat his rivals Black Bellamy and Cutlass Liz for the Pirate of the year Award. The quest takes Captain and his crew from the shores of Blood Island to the foggy streets of Victorian London.",
        "runtimeMinutes": "88"
    },
    "2012_620": {
        "plotSummary": "Los Angeles' Skid Row is home to one of the largest homeless populations in the United States. And we found, inside that community, the remarkable and enormously moving stories of Olympic athletes, Harvard attorneys, accomplished musicians...See moreLos Angeles' Skid Row is home to one of the largest homeless populations in the United States. And we found, inside that community, the remarkable and enormously moving stories of Olympic athletes, Harvard attorneys, accomplished musicians, scholars. We found poverty, drugs and mental illness, of course - but more importantly we found life, hope and incredibly powerful human journeys.  Written by David LangnessSee less",
        "runtimeMinutes": "77"
    },
    "2012_621": {
        "plotSummary": "11-year-old Wang lives with his family in a remote village in China. Life is tough, but they make the most of what little they have. When Wang is selected to lead his school's daily gymnastics, his teacher recommends that he wear a new ...See more11-year-old Wang lives with his family in a remote village in China. Life is tough, but they make the most of what little they have. When Wang is selected to lead his school's daily gymnastics, his teacher recommends that he wear a new shirt, which forces his family to make a great sacrifice. Soon after, Wang encounters a wounded man on the run and their fates are intertwined.See less",
        "runtimeMinutes": "110"
    },
    "2012_622": {
        "plotSummary": "An exploration of the clothes, the glamour and the decadence of iconic fashion designer Halston.",
        "runtimeMinutes": "85"
    },
    "2012_623": {
        "plotSummary": "Lucien and Regina are foragers - they gather wild mushrooms and sell them to New York restaurants. They live simply- according to the seasons. When Regina seeks and finds more stability, their marriage is put to a test.",
        "runtimeMinutes": "93"
    },
    "2012_624": {
        "plotSummary": "The small town Ystad in Sweden is suddenly struck by could-be terrorist attacks after the townhouse has an art controversial exhibition that is religious in nature. The army, secret service and politicians interfere with police work, but ...See moreThe small town Ystad in Sweden is suddenly struck by could-be terrorist attacks after the townhouse has an art controversial exhibition that is religious in nature. The army, secret service and politicians interfere with police work, but the police must find out who is blowing things up in Ystad and murdering local citizens?  Written by AnonymousSee less",
        "runtimeMinutes": "93"
    },
    "2012_625": {
        "plotSummary": "Ernest Borgnine plays Rex Page, an old man who is bitter about never becoming famous and having lived a life without any meaning. After suffering a stroke, he ends up in a nursing home staffed by Latin American immigrants. Put off by the ...See moreErnest Borgnine plays Rex Page, an old man who is bitter about never becoming famous and having lived a life without any meaning. After suffering a stroke, he ends up in a nursing home staffed by Latin American immigrants. Put off by the situation, Rex focuses his energy on getting out, which places him at odds with the Latino workers. However, their relationship takes on new meaning when it is discovered that he once shook hands with Vicente Fernandez, a Mexican singer, producer and actor idolized throughout Latin culture. The employees soon begin to treat Rex like the celebrity he's always dreamed of being.  Written by AnonymousSee less",
        "runtimeMinutes": "99"
    },
    "2012_626": {
        "plotSummary": "A documentary on rural teenagers in southwestern China who are recruited as their country's next Olympic hopefuls, with a focus on the coach Qi Moxiang.",
        "runtimeMinutes": "94"
    },
    "2012_627": {
        "plotSummary": "Following his mother's death, Hector arrives in Manila to live with his grandmother. Unable to speak Tagalog, Hector falls in with a street gang before a photographer takes him under his wing. Haunted by memories of his mother, Hector ...See moreFollowing his mother's death, Hector arrives in Manila to live with his grandmother. Unable to speak Tagalog, Hector falls in with a street gang before a photographer takes him under his wing. Haunted by memories of his mother, Hector photographs an anonymous woman when suddenly, these seemingly disconnected lives collide.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "2012_628": {
        "plotSummary": "Hoping to earn his mother's respect, a young hustler-turned-businessman tries to open a brothel with his two useless buddies.",
        "runtimeMinutes": "98"
    },
    "2012_629": {
        "plotSummary": "Masha Drokova joins Nashi, a Russian ultra nationalist youth group, at the age of 16 and rapidly ascends its ranks, famously garnering a medal and the opportunity to kiss Vladimir Putin. The film details her growing disillusion with the ...See moreMasha Drokova joins Nashi, a Russian ultra nationalist youth group, at the age of 16 and rapidly ascends its ranks, famously garnering a medal and the opportunity to kiss Vladimir Putin. The film details her growing disillusion with the group's leaders and her falling in with the anti-Putin opposition, especially a journalist and blogger named Oleg Kashin, who gets brutally attacked.See less",
        "runtimeMinutes": "85"
    },
    "2012_63": {
        "plotSummary": "Artie and Diane agree to look after their three grandkids when their type-A helicopter parents need to leave town for work. Problems arise when the kids' 21st-century behavior collides with Artie and Diane's old-school methods.",
        "runtimeMinutes": "105"
    },
    "2012_630": {
        "plotSummary": "The tale of how Arjuna fought his inner self and became the legendary archer.",
        "runtimeMinutes": "96"
    },
    "2012_631": {
        "plotSummary": "Two brothers compete in their own private 25-event Olympics.",
        "runtimeMinutes": "90"
    },
    "2012_632": {
        "plotSummary": "THE CITY DARK is a feature documentary about the loss of night. After moving to NYC from rural Maine, filmmaker Ian Cheney asks a simple question - do we need the stars? - taking him from Brooklyn to Mauna Kea, Paris, and beyond. Exploring...See moreTHE CITY DARK is a feature documentary about the loss of night. After moving to NYC from rural Maine, filmmaker Ian Cheney asks a simple question - do we need the stars? - taking him from Brooklyn to Mauna Kea, Paris, and beyond. Exploring the threat of killer asteroids in Hawaii, tracking hatching turtles along the Florida coast, and rescuing injured birds on Chicago streets, Cheney unravels the myriad implications of a globe glittering with lights - including increased breast cancer rates from exposure to light at night, and a generation of kids without a glimpse of the universe above. Featuring stunning astrophotography and a cast of eclectic scientists, THE CITY DARK is the definitive story of light pollution and the disappearing stars.  Written by Wicked Delicate FilmsSee less",
        "runtimeMinutes": "83"
    },
    "2012_633": {
        "plotSummary": "Deepak Chopra's son, Gotham, spends a year traveling with this father in an attempt to resolve the spiritual icon he is to the world with the man known to his family.",
        "runtimeMinutes": "83"
    },
    "2012_634": {
        "plotSummary": "This full-contact action drama, loaded with authentic mixed martial arts, is a transcending inspirational story of redemption.",
        "runtimeMinutes": "119"
    },
    "2012_635": {
        "plotSummary": "After being assigned as study partners, two Chicana high schoolers find a bond that confuses them at times.",
        "runtimeMinutes": "85"
    },
    "2012_636": {
        "plotSummary": "The feature doc takes a look behind the scenes at top-class restaurants and offers exclusive interviews with celebrity chefs from France, Spain, Germany, the Netherlands, Denmark, the USA and Japan.",
        "runtimeMinutes": "90"
    },
    "2012_637": {
        "plotSummary": "Two little league teams take on their coaches sibling rivalry, and end up doing battle in a place the baseball world never expected it: in the outfield of the Home Run Derby.",
        "runtimeMinutes": "94"
    },
    "2012_638": {
        "plotSummary": "An altruistic chemist invents a fabric which resists wear and stain as a boon to humanity, but big business and labor realize it must be suppressed for economic reasons.",
        "runtimeMinutes": "85"
    },
    "2012_639": {
        "plotSummary": "The story of legendary computer game developer Richard Garriott's spaceflight in October 2008.",
        "runtimeMinutes": "83"
    },
    "2012_64": {
        "plotSummary": "Abraham Lincoln, the 16th President of the United States, discovers vampires are planning to take over the United States. He makes it his mission to eliminate them.",
        "runtimeMinutes": "105"
    },
    "2012_640": {
        "plotSummary": "Sarah Sparks is pregnant and feeling wholly ambivalent, despite her boyfriend's pure enthusiasm. A committed tech-geek, she fears she is more interested in ultrasound technology than in what's being ultra-sounded. When her sister lures her...See moreSarah Sparks is pregnant and feeling wholly ambivalent, despite her boyfriend's pure enthusiasm. A committed tech-geek, she fears she is more interested in ultrasound technology than in what's being ultra-sounded. When her sister lures her to L.A. for what ends up being a terrorizing baby shower, Sarah keeps her rental van and hits the road in search of the source of her anxiety: her estranged mother, now living off the grid. SMALL, BEAUTIFULLY MOVING PARTS takes a comic and poignant look at one woman's coming-of-parenthood in the age of technology.  Written by AnonymousSee less",
        "runtimeMinutes": "73"
    },
    "2012_641": {
        "plotSummary": "Levi Collins is set to go to the local University on a tennis scholarship, but he forgot to tell his parents one thing - he didn't graduate. As a result, he must take summer school before his mom and dad discover he's failed senior science...See moreLevi Collins is set to go to the local University on a tennis scholarship, but he forgot to tell his parents one thing - he didn't graduate. As a result, he must take summer school before his mom and dad discover he's failed senior science. At school, Levi falls in love with his classmate, Katie, and learns that he has to make a choice between playing tennis and receiving a proper education. General Education is a quirky comedy about a family learning to grow together.  Written by PHPSee less",
        "runtimeMinutes": "94"
    },
    "2012_642": {
        "plotSummary": "A troubled young woman moves to San Francisco, where she becomes involved in pornography and aligns herself with a cocaine-addicted lawyer.",
        "runtimeMinutes": "98"
    },
    "2012_643": {
        "plotSummary": "A singer-songwriter hits the road with a self-appointed music revolutionary.",
        "runtimeMinutes": "98"
    },
    "2012_644": {
        "plotSummary": "Tells the story of an African immigrant surviving on the fringes of New York City where music is his passion, life is a hustle and falling in love is his greatest risk.",
        "runtimeMinutes": "80"
    },
    "2012_645": {
        "plotSummary": "After 20 years on the road with Blue Oyster Cult, Jimmy Testagros returns to his hometown to life with his ailing mother. Complications arise when he falls for an old friend, who is now married to his longtime nemesis.",
        "runtimeMinutes": "95"
    },
    "2012_646": {
        "plotSummary": "Filmmaker Ross McElwee (Sherman's March, Bright Leaves) finds himself in frequent conflict with his son, a young adult who seems addicted to and distracted by the virtual worlds of the internet. To understand his fractured love for his son...See moreFilmmaker Ross McElwee (Sherman's March, Bright Leaves) finds himself in frequent conflict with his son, a young adult who seems addicted to and distracted by the virtual worlds of the internet. To understand his fractured love for his son, McElwee travels back to St. Quay-Portrieux in Brittany for the first time in decades to retrace his own journey into adulthood. A meditation on the passing of time, the praxis of photography and film, and the digital versus analog divide.  Written by AnonymousSee less",
        "runtimeMinutes": "87"
    },
    "2012_647": {
        "plotSummary": "Documentary follows Bobby Liebling, lead singer of seminal hard rock/heavy metal band Pentagram, as he battles decades of hard drug addiction and personal demons to try and get his life back.",
        "runtimeMinutes": "91"
    },
    "2012_648": {
        "plotSummary": "Tattooed onto the skin of Salvador, Brazil, are ubiquitous public artworks created by the artist Bel. Salvador is a 500 year old city with a rich cultural heritage. The documentary film reflects the intimate relationship between this ...See moreTattooed onto the skin of Salvador, Brazil, are ubiquitous public artworks created by the artist Bel. Salvador is a 500 year old city with a rich cultural heritage. The documentary film reflects the intimate relationship between this historically unique city and her beloved native son. This lyrical journey shares his joy and madness: creating large-scale outdoor art at lightning speed and then working alone in deep introspection. His exuberant personality shines as he draws inspiration from his surroundings, especially in impoverished neighborhoods. Working as a voice of the people, Bel breathes new life into the city he loves through his art. See his renaissance through constant acts of creation.  Written by AnonymousSee less",
        "runtimeMinutes": "95"
    },
    "2012_649": {
        "plotSummary": "Peter, a family man who works for a failing supermarket chain finds his life shaken up by his new boss, Susan, who starts to groom him for an executive position. Money and opportunities are within his grasp, but at what price?",
        "runtimeMinutes": "92"
    },
    "2012_65": {
        "plotSummary": "Beca, a freshman at Barden University, is cajoled into joining The Bellas, her school's all-girls singing group. Injecting some much needed energy into their repertoire, The Bellas take on their male rivals in a campus competition.",
        "runtimeMinutes": "112"
    },
    "2012_650": {
        "plotSummary": "An offbeat romantic comedy about a silver-painted street performer and the soft spoken zoo worker who falls for him.",
        "runtimeMinutes": "95"
    },
    "2012_651": {
        "plotSummary": "A drama centered on the relationship between a teenager, Pierre, and Nadia, a woman in her thirties.",
        "runtimeMinutes": "110"
    },
    "2012_652": {
        "plotSummary": "Modern day celebrities interpret excerpts from memoirs written by people who knew Marilyn Monroe as well as her recently discovered personal journals and letters.",
        "runtimeMinutes": "107"
    },
    "2012_653": {
        "plotSummary": "A young boy travels across Australia with his father, who's wanted by the law for committing a violent crime.",
        "runtimeMinutes": "90"
    },
    "2012_654": {
        "plotSummary": "A scheduling mistake leads to an estranged father and son sharing a vacation home with their respective girlfriends.",
        "runtimeMinutes": "103"
    },
    "2012_655": {
        "plotSummary": "Wind power... It's green... It's good... Or is it? Windfall exposes the dark side of wind energy development when the residents of a rural upstate New York town consider going green.",
        "runtimeMinutes": "81"
    },
    "2012_656": {
        "plotSummary": "1957. The Latin Quarter, Paris. A cheap no-name hotel became a haven for a new breed of artists fleeing the conformity and censorship of America. The hotel soon turned into an epicenter of Beat writing that produced some of the most ...See more1957. The Latin Quarter, Paris. A cheap no-name hotel became a haven for a new breed of artists fleeing the conformity and censorship of America. The hotel soon turned into an epicenter of Beat writing that produced some of the most important works of the movement. It came to be known as the Beat Hotel. Alan Govenar's documentary \"The Beat Hotel\" explores this amazing place and time.See less",
        "runtimeMinutes": "88"
    },
    "2012_657": {
        "plotSummary": "Plastics salesman Oshima disappeared without a word to anyone, and has been missing for two years. Shohei Imamura and his crew follow Oshima's fiance Yoshie and actor Shigeru Tsuyuguchi as they investigate the disappearance.",
        "runtimeMinutes": "130"
    },
    "2012_658": {
        "plotSummary": "Zach is guy for whom the party never ends. But when he meets the girl he nicknames \"Crazy Eyes,\" the inability to have her, combined with family matters, are signs that his idle life might be due for a change.",
        "runtimeMinutes": "95"
    },
    "2012_659": {
        "plotSummary": "An NFL journeyman struggles to deal with life's complexities after his professional career is over.",
        "runtimeMinutes": "98"
    },
    "2012_66": {
        "plotSummary": "After thirty years of marriage, a middle-aged couple attends an intense, week-long counseling session to work on their relationship.",
        "runtimeMinutes": "100"
    },
    "2012_660": {
        "plotSummary": "The ill-fated coal mining communities in North East England are the subject of this inspired documentary by multi-media artist Bill Morrison.",
        "runtimeMinutes": "52"
    },
    "2012_661": {
        "plotSummary": "A terminally-ill man descends into madness when he learns his best friend and roommate is leaving for a new job in the morning.",
        "runtimeMinutes": "95"
    },
    "2012_662": {
        "plotSummary": "A struggling writer, Ray Wyatt, acquires fame in an unusual way when a notorious serial murderer, named the Karaoke Killer, steals his car and the newest draft of his script.",
        "runtimeMinutes": "94"
    },
    "2012_663": {
        "plotSummary": "From humble beginnings as a simple food sold by Japanese street vendors, sushi has exploded into an international phenomenon in the past 30 years. SUSHI: THE GLOBAL CATCH is a feature-length documentary shot in five countries exploring the...See moreFrom humble beginnings as a simple food sold by Japanese street vendors, sushi has exploded into an international phenomenon in the past 30 years. SUSHI: THE GLOBAL CATCH is a feature-length documentary shot in five countries exploring the history, problems and future of this popular cuisine. Much of sushi's rich cultural tradition that began in Tokyo is changing as raw fish now appear from cities like Warsaw and New York to small towns worldwide. But what is the cost? Will the worldwide hunger for sushi continue to grow until wild fish vanish, or will new technology like aquaculture keep plates full? Can sustainable sushi restaurants satisfy consumers or will competition for declining resources drive prices so high that only a few can afford raw fish?  Written by Sakana FilmsSee less",
        "runtimeMinutes": "75"
    },
    "2012_664": {
        "plotSummary": "Sarah begins to confront her shortcomings after she rejects her boyfriend's hasty proposal and soon finds herself in a rebound romance. Meanwhile, her sister Beth is immersed in the details of her wedding.",
        "runtimeMinutes": "97"
    },
    "2012_665": {
        "plotSummary": "While filming a documentary in Mississippi in 1965, Frank De Felitta forever changed the life of an African-American waiter and his family. In 2011, Frank's son returns to the Delta to examine the repercussions of that fateful encounter.",
        "runtimeMinutes": "90"
    },
    "2012_666": {
        "plotSummary": "Sasha is a young Russian violinist on a scholarship to Juilliard, living with his affectionate but overbearing father, a cellist determined to manage his son's career. While Sasha prepares for a critical recital that will launch him on a ...See moreSasha is a young Russian violinist on a scholarship to Juilliard, living with his affectionate but overbearing father, a cellist determined to manage his son's career. While Sasha prepares for a critical recital that will launch him on a path to a glittering future, he is increasingly drawn to the rhythms he hears on the streets of New York. When he meets Ramona, a bohemian singer/songwriter, he joins her band, and falls in love with her and her music. He begins to lead a double life, careening frantically between two worlds.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2012_667": {
        "plotSummary": "Newlyweds Buzzy and Katie find their blissful life disrupted by the arrival of his half-sister and news of her sister's marriage troubles.",
        "runtimeMinutes": "95"
    },
    "2012_668": {
        "plotSummary": "A con artist moves her son to a conservative neighborhood in Oklahoma in an effort to build a better future, but it doesn't take long for her past to catch up with her, and for her son's behavior to cause problems of its own.",
        "runtimeMinutes": "93"
    },
    "2012_669": {
        "plotSummary": "In Art Is...The Permanent Revolution three contemporary artists and a master printer explore how social reality and protest are conveyed in art. While the stirring works of the masters sweep by - among them graphics by Rembrandt, Goya, ...See moreIn Art Is...The Permanent Revolution three contemporary artists and a master printer explore how social reality and protest are conveyed in art. While the stirring works of the masters sweep by - among them graphics by Rembrandt, Goya, Daumier, Kollwitz, Dix, Grosz and Picasso - the making of an etching, a woodcut and a lithograph unfolds before our eyes as the contemporary artists join their illustrious predecessors in creating art of social engagement.  Written by First Run FeaturesSee less",
        "runtimeMinutes": "82"
    },
    "2012_67": {
        "plotSummary": "A misunderstood boy takes on ghosts, zombies and grown-ups to save his town from a centuries-old curse.",
        "runtimeMinutes": "92"
    },
    "2012_670": {
        "plotSummary": "When doctors diagnosed 19-year-old rock star Jason Becker with Lou Gehrig's Disease, they said he would never make music again. 22 years later, without the ability to move or to speak, Jason is alive and making music with his eyes.",
        "runtimeMinutes": "87"
    },
    "2012_671": {
        "plotSummary": "Recognized as the reincarnation ('yangsi') of one of the most revered Tibetan Masters of the 20th century, Ugyen Tenzin Jigme Lhundrup must train to perpetuate this legacy, starting with an enthronement before thousands at age four. '...See moreRecognized as the reincarnation ('yangsi') of one of the most revered Tibetan Masters of the 20th century, Ugyen Tenzin Jigme Lhundrup must train to perpetuate this legacy, starting with an enthronement before thousands at age four. 'Yangsi' follows this process, from childhood up to the time he embarks on a world tour at the age of eighteen to fully assume the mantle of his predecessor. Filmed in large part in Himalayan Kingdom of Bhutan, over a period of 14 years, Yangsi tells a unique coming of age story as it explores the doubts and hesitations along with the unusual strength of character of the 'Yangsi'.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "2012_672": {
        "plotSummary": "Johnny and Milo love music Ã¢ÂEURÂ\" just not the corn dog jingles they've resorted to performing to make ends meet. Facing failure, they decide to travel cross-country for a last chance at success.",
        "runtimeMinutes": "108"
    },
    "2012_673": {
        "plotSummary": "What is experimental film, and why is it called that? Artists and poet working in celluloid since before WWI have always found themselves in a no man's land. Excluded both from the art world and from the film industry, they bodly created a...See moreWhat is experimental film, and why is it called that? Artists and poet working in celluloid since before WWI have always found themselves in a no man's land. Excluded both from the art world and from the film industry, they bodly created a grassroots network for making and showing their films. They also created a profound body of work that continues to influence our culture. I wanted to share a few of the films I love and introduce you some of the free, radicals artists who made them.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2012_674": {
        "plotSummary": "A documentary that explores the human and financial costs of illegal immigration.",
        "runtimeMinutes": "99"
    },
    "2012_675": {
        "plotSummary": "9 college students on road trip get waylaid and wind up in deep trouble.",
        "runtimeMinutes": "107"
    },
    "2012_676": {
        "plotSummary": "A 12-year-old Kansas orphan turns to the Scarecrow and the Tin Woodman for help during a difficult time. She imagines that things have not gone well in Oz since the Wizard left and that the Scarecrow and the Tin Woodman must travel to ...See moreA 12-year-old Kansas orphan turns to the Scarecrow and the Tin Woodman for help during a difficult time. She imagines that things have not gone well in Oz since the Wizard left and that the Scarecrow and the Tin Woodman must travel to Kansas to find Dorothy.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2012_677": {
        "plotSummary": "Linked by a rare psychological disorder, Noah Greene and Emily Gates must uncover the mystery of a tragic past in order to find hope for the future.",
        "runtimeMinutes": "85"
    },
    "2012_678": {
        "plotSummary": "A psychological horror/thriller depicting a backwoods family with a dark secret.",
        "runtimeMinutes": "90"
    },
    "2012_679": {
        "plotSummary": "A truly mad concoction, blending 1950s juvenile delinquents, sci-fi melodrama, song-and-dance, and a touch of horror, everything in just the right combination to create an engaging big screen spectacle! This curious and curiously ...See moreA truly mad concoction, blending 1950s juvenile delinquents, sci-fi melodrama, song-and-dance, and a touch of horror, everything in just the right combination to create an engaging big screen spectacle! This curious and curiously entertaining story involves one Jonathan Xavier and his devoted misfit gang who, incidentally, have been exiled to Earth from the far reaches of outer space. Johnny's former girlfriend Bliss has left him and stolen his Resurrection Suit, a cosmic, mind-bending uniform that gives the owner power over others. Along the way, there will be several highly stylized musical numbers, lots of genuinely humorous dialogue, and a wacky plot-twist or two, all beautifully captured on the very last of Kodak's black-and-white Plus-X film stock.  Written by Anthony Craig GilbertSee less",
        "runtimeMinutes": "106"
    },
    "2012_68": {
        "plotSummary": "An incumbent Representative embroiled in personal scandal faces a no-holds-barred challenge from a naive newcomer funded by two unscrupulous billionaire lobbyist brothers.",
        "runtimeMinutes": "85"
    },
    "2012_680": {
        "plotSummary": "When a college piano prodigy tries to check his mother into rehab, he is taken hostage by her drug dealer and swept along on a wild adventure.",
        "runtimeMinutes": "85"
    },
    "2012_681": {
        "plotSummary": "Martin, the night watchman, arrives with the setting sun in his rumbling blue Chevrolet. The cemetery mascots, EI Negro y La Negra, chase his truck down the road and greet him with wagging tails. The sound of construction fades away as the...See moreMartin, the night watchman, arrives with the setting sun in his rumbling blue Chevrolet. The cemetery mascots, EI Negro y La Negra, chase his truck down the road and greet him with wagging tails. The sound of construction fades away as the daytime workers leave and Martin is left alone, looking out over the skyline of mausoleums where Mexico's most notorious drug lords lie at rest. Crosses and steel construction bars pierce the purple and pink sky. As night descends luxurious cars fill the dirt roads. Mercedes, a sexy young widow, arrives with her little girl in a pristine white Audi. A portrait of her husband, a corrupt policeman holding a machine gun, watches over them as they sweep and mop the shiny marble floors. The coconut vendor's radio blasts a gory list of the day's murders: \"Culiacán has become a war zone.\" The buzz of cicadas fills the air with anticipation. Through Martin's vigilant eyes we watch time pass in this place where time stands still.See less",
        "runtimeMinutes": "72"
    },
    "2012_682": {
        "plotSummary": "Scorn takes a look into the trials and tribulations of a group of people dealing with relationships, love, pain and friendship during the course of one year.",
        "runtimeMinutes": "88"
    },
    "2012_683": {
        "plotSummary": "A documentary that chronicles a plan to build five large hydroelectric dams on two of the world's purest free-flowing rivers in Patagonia, Chile.",
        "runtimeMinutes": "85"
    },
    "2012_684": {
        "plotSummary": "\"Split: A Deeper Divide\" is a riveting investigation into the partisanship paralyzing our politics, going beyond the bitter rancor to reveal the truth of why our country is more polarized and our politics more gridlocked than at any other ...See more\"Split: A Deeper Divide\" is a riveting investigation into the partisanship paralyzing our politics, going beyond the bitter rancor to reveal the truth of why our country is more polarized and our politics more gridlocked than at any other time in recent memory. Featuring interviews with some of the most insightful and recognizable names in politics today, including Senator Evan Bayh (D-IN), Senator Chuck Hagel (R-NE), Lawrence Lessig (Foundation of Ethics; Harvard), Grover Norquist (Americans for Tax Reform), Ezra Klein (MSNBC), Robert Kaiser (Washington Post), Thomas Frank (Wall Street Journal), Noam Chomsky (MIT), Nicholas Kristof (NY Times), Tucker Carlson (Fox News), Amy Goodman (Democracy Now), and more, this thought-provoking documentary unpacks the partisan wedges that have been driven ever deeper into our national fabric to show the devastating impact these have had on our democracy.  Written by AnonymousSee less",
        "runtimeMinutes": "72"
    },
    "2012_685": {
        "plotSummary": "Haunted by bizarre dreams about goth rocker Trey Sylvania (Drew Seeley), with a growing lust for blood, Dylan (Lucas Grabeel) is not your average teenager-he's transforming into a vampire! It all started when he was bitten by a voracious ...See moreHaunted by bizarre dreams about goth rocker Trey Sylvania (Drew Seeley), with a growing lust for blood, Dylan (Lucas Grabeel) is not your average teenager-he's transforming into a vampire! It all started when he was bitten by a voracious fanged exchange student, and it's a process he is desperate to stop-but how? His demented dentist can't do anything about Dylan's aching teeth and emerging fangs, and the anti-bloodsucking pills he gets from his para-psychologist just give him a rash. Dylan is terrified and he doesn't know what to do-especially about his beautiful girlfriend Sara (Adrian Slade). Every time Dylan gets close to Sara his fangs pop out and he gets an overwhelming urge to bite her. He isn't sure how much longer he can stop himself, so he's been avoiding her and she has no idea why. Confused and hurt, Sara sings about her frustration. Dylan knows he's got to explain himself, and vocalizes his torment.  Written by AnonymousSee less",
        "runtimeMinutes": "91"
    },
    "2012_686": {
        "plotSummary": "A film about the mythical and mysterious cataclysm which befalls mankind on December 21st, 2012 and what happens next. Centered around 4 characters, each with a back story of what their life was like before it all came crashing down, the ...See moreA film about the mythical and mysterious cataclysm which befalls mankind on December 21st, 2012 and what happens next. Centered around 4 characters, each with a back story of what their life was like before it all came crashing down, the film depicts life for these characters as they struggle for survival and strive to discover the cause of the end of civilization as we presently know it.  Written by AnonymousSee less",
        "runtimeMinutes": "122"
    },
    "2012_687": {
        "plotSummary": "A high society wedding, bustling city streets, a center for former child soldiers, a nightclub full of music and laughter: these are the many faces of today's Uganda, as wonderfully captured by filmmaker Kimi Takesue. Whether exploring the...See moreA high society wedding, bustling city streets, a center for former child soldiers, a nightclub full of music and laughter: these are the many faces of today's Uganda, as wonderfully captured by filmmaker Kimi Takesue. Whether exploring the pulsating energy of the city or contemplating quiet moments in the country, her artful camera compositions and the lyrical pacing of the film allow us to truly engage and process the foreign land on our own terms. Documenting Uganda while it deals with day-to-day realities and the aftermath of its civil wars, Takesue, well aware of her perspective as an outsider, strives for simple, unadorned honesty. Employing a largely observational style, Takesue allows the sight and sounds-and the people-of Uganda to speak for themselves. Usually the people she records simply ignore the camera, but when someone does engage-whether it's a group of school children clamoring for their moment in front of the lens or a young man asking the title question-the barriers between filmmaker, subject, and audience give way for breathtaking cinematic epiphanies.  Written by Los Angeles Film FestivalSee less",
        "runtimeMinutes": "72"
    },
    "2012_688": {
        "plotSummary": "Along the rhythm of the seasons, beasts and humans regard each other. 'Bestiary' unfolds like a picture book about mutual observation. A contemplation of a stable imbalance, and of loose, tranquil and indefinable elements.",
        "runtimeMinutes": "72"
    },
    "2012_689": {
        "plotSummary": "While protecting a crime boss's home in the Carpathian Mountains, a contract killer and his old friend get into a dangerous situation when the boss's wife is accidentally killed.",
        "runtimeMinutes": "95"
    },
    "2012_69": {
        "plotSummary": "Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory.",
        "runtimeMinutes": "136"
    },
    "2012_690": {
        "plotSummary": "Diane's feelings for Jack -- the girl she met over the summer -- begin to manifest themselves in terrifying ways when she learns that her friend will soon be moving away.",
        "runtimeMinutes": "110"
    },
    "2012_691": {
        "plotSummary": "A racially-charged criminal trial and a heart-rending love story converge in this documentary about Richard and Mildred Loving, set during the turbulent Civil Rights era. Long Way Home: The Loving Story is a story of love and the struggle ...See moreA racially-charged criminal trial and a heart-rending love story converge in this documentary about Richard and Mildred Loving, set during the turbulent Civil Rights era. Long Way Home: The Loving Story is a story of love and the struggle for dignity set against a backdrop of historic anti-miscegenation sentiments in the U.S. The Lovings, an interracial couple, fell in love and married at a critical time in American history, and, because of a confluence of social and political turmoil our reluctant heroes bring about change where previously no one else could. They are paired with two young and ambitious lawyers who are driven to pave the way for Civil Rights and social justice through an historic Supreme Court ruling, changing the country's story forever.  Written by AnonymousSee less",
        "runtimeMinutes": "77"
    },
    "2012_692": {
        "plotSummary": "Polar-opposite brothers Randy and Kirk never saw eye-to-eye, but their rivalry is taken to a new level when Randy hijacks Kirk's son's sleepover, taking the boys on a Scout Trip to remember.",
        "runtimeMinutes": "79"
    },
    "2012_693": {
        "plotSummary": "WWII vet Eddie Boyd is torn between providing for his young family and an unfulfilled dream of becoming a Hollywood star. He discovers a way to do both, but his dream leads him down a path of danger and tragedy.",
        "runtimeMinutes": "105"
    },
    "2012_694": {
        "plotSummary": "World famous Austrian artist, Gottfried Helnwein, takes on the contentious role of Production Designer for a never before seen opera in Tel Aviv, Israel in 2010.",
        "runtimeMinutes": "70"
    },
    "2012_695": {
        "plotSummary": "John is taken on a murder-fueled ride by a mysterious stranger that transforms the weak-willed, disillusioned husband and father into a desperate hero willing to go to any length to protect his family.",
        "runtimeMinutes": "89"
    },
    "2012_7": {
        "plotSummary": "After Peter Parker is bitten by a genetically altered spider, he gains newfound, spider-like powers and ventures out to save the city from the machinations of a mysterious reptilian foe.",
        "runtimeMinutes": "136"
    },
    "2012_70": {
        "plotSummary": "3 high school seniors throw a birthday party to make a name for themselves. As the night progresses, things spiral out of control as word of the party spreads.",
        "runtimeMinutes": "88"
    },
    "2012_71": {
        "plotSummary": "In Italy, a woman becomes involved in a series of unauthorized exorcisms during her mission to discover what happened to her mother, who allegedly murdered three people during her own exorcism.",
        "runtimeMinutes": "83"
    },
    "2012_72": {
        "plotSummary": "A Marine travels to Louisiana after serving three tours in Iraq and searches for the unknown woman he believes was his good luck charm during the war.",
        "runtimeMinutes": "101"
    },
    "2012_73": {
        "plotSummary": "To protect his brother-in-law from a drug lord, a former smuggler heads to Panama to score millions of dollars in counterfeit bills.",
        "runtimeMinutes": "109"
    },
    "2012_74": {
        "plotSummary": "Four friends conspire to turn the tables on their women when they discover the ladies have been using Steve Harvey's relationship advice against them.",
        "runtimeMinutes": "123"
    },
    "2012_75": {
        "plotSummary": "A look-alike commoner is secretly hired to take the place of a poisoned king to save his country from falling into chaos.",
        "runtimeMinutes": "131"
    },
    "2012_76": {
        "plotSummary": "Pete and Debbie are both about to turn 40, their kids hate each other, both of their businesses are failing, they're on the verge of losing their house, and their relationship is threatening to fall apart.",
        "runtimeMinutes": "134"
    },
    "2012_77": {
        "plotSummary": "After a heist in South Korea, a gang of 5+1 fly to Hong Kong to look into a heist, in a Macau casino, of a $30M diamond, planned by someone unreliable. He brings in HK thieves as well. Can anyone be trusted?",
        "runtimeMinutes": "135"
    },
    "2012_78": {
        "plotSummary": "A young girl buys an antique box at a yard sale, unaware that inside the collectible lives a malicious ancient spirit. The girl's father teams with his ex-wife to find a way to end the curse upon their child.",
        "runtimeMinutes": "92"
    },
    "2012_79": {
        "plotSummary": "Follows the lives of five interconnected couples as they experience the thrills and surprises of having a baby and realize that no matter what you plan for, life does not always deliver what is expected.",
        "runtimeMinutes": "110"
    },
    "2012_8": {
        "plotSummary": "The Madagascar animals join a struggling European circus to get back to New York, but find themselves being pursued by a psychotic animal control officer.",
        "runtimeMinutes": "95"
    },
    "2012_80": {
        "plotSummary": "Pot growers Ben and Chon face off against the Mexican drug cartel who kidnapped their shared girlfriend.",
        "runtimeMinutes": "131"
    },
    "2012_81": {
        "plotSummary": "Washed-up true crime writer Ellison Oswalt finds a box of super 8 home movies in his new home that suggest the murder that he is currently researching is the work of a serial killer whose work dates back to the 1960s.",
        "runtimeMinutes": "110"
    },
    "2012_82": {
        "plotSummary": "An elite team of Navy SEALs embark on a covert mission to recover a kidnapped CIA agent.",
        "runtimeMinutes": "110"
    },
    "2012_83": {
        "plotSummary": "When a boy's beloved dog passes away suddenly, he attempts to bring the animal back to life through a powerful science experiment.",
        "runtimeMinutes": "87"
    },
    "2012_84": {
        "plotSummary": "After their plane crashes in Alaska, six oil workers are led by a skilled huntsman to survival, but a pack of merciless wolves haunts their every step.",
        "runtimeMinutes": "117"
    },
    "2012_85": {
        "plotSummary": "School's out. Summer vacation is on. However, Greg may not have the best summer vacation ever. What could go wrong?",
        "runtimeMinutes": "94"
    },
    "2012_86": {
        "plotSummary": "The lives of some visitors and residents of Rome and the romances, adventures and predicaments they get into.",
        "runtimeMinutes": "112"
    },
    "2012_87": {
        "plotSummary": "A high-school biology teacher looks to become a successful mixed martial arts fighter in an effort to raise money to prevent extracurricular activities from being axed at his cash-strapped school.",
        "runtimeMinutes": "105"
    },
    "2012_88": {
        "plotSummary": "Five friends go for a break at a remote cabin, where they get more than they bargained for, discovering the truth behind the cabin in the woods.",
        "runtimeMinutes": "95"
    },
    "2012_89": {
        "plotSummary": "After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.",
        "runtimeMinutes": "100"
    },
    "2012_9": {
        "plotSummary": "Katniss Everdeen voluntarily takes her younger sister's place in the Hunger Games: a televised competition in which two teenagers from each of the twelve Districts of Panem are chosen at random to fight to the death.",
        "runtimeMinutes": "142"
    },
    "2012_90": {
        "plotSummary": "In late-19th-century Russian high society, St. Petersburg aristocrat Anna Karenina enters into a life-changing affair with the dashing Count Alexei Vronsky.",
        "runtimeMinutes": "129"
    },
    "2012_91": {
        "plotSummary": "Four men who form a neighborhood watch group as a way to get out of their day-to-day family routines find themselves defending the Earth from an alien invasion.",
        "runtimeMinutes": "102"
    },
    "2012_92": {
        "plotSummary": "A pair of young lovers flee their New England town, which causes a local search party to fan out to find them.",
        "runtimeMinutes": "94"
    },
    "2012_93": {
        "plotSummary": "A Wall Street investment banker who has been set up as the linchpin of his company's mob-backed Ponzi scheme is relocated with his family to Aunt Madea's southern home.",
        "runtimeMinutes": "114"
    },
    "2012_94": {
        "plotSummary": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love.",
        "runtimeMinutes": "84"
    },
    "2012_95": {
        "plotSummary": "14 years have passed since the near third impact. Most of the world has changed except Shinji Ikari who awakens, unaged in a new and strange environment. Misato has formed a group that has is separate from Nerv. The fight is far from over ...See more14 years have passed since the near third impact. Most of the world has changed except Shinji Ikari who awakens, unaged in a new and strange environment. Misato has formed a group that has is separate from Nerv. The fight is far from over but the biggest struggle might be against humans and former allies.  Written by AnonymousSee less",
        "runtimeMinutes": "96"
    },
    "2012_96": {
        "plotSummary": "At a home for retired musicians, the annual concert to celebrate Composer Giuseppe Verdi's birthday is disrupted by the arrival of Jean (Dame Maggie Smith), an eternal diva and the former wife of one of the residents.",
        "runtimeMinutes": "98"
    },
    "2012_97": {
        "plotSummary": "A small town girl and a city boy meet on the Sunset Strip while pursuing their Hollywood dreams.",
        "runtimeMinutes": "123"
    },
    "2012_98": {
        "plotSummary": "While in his teens, Donny fathered a son, Todd, and raised him as a single parent until Todd's 18th birthday. Now Donny resurfaces just before Todd's wedding after years apart, sending the groom-to-be's world crashing down.",
        "runtimeMinutes": "116"
    },
    "2012_99": {
        "plotSummary": "A childless couple bury a box in their backyard, containing all of their wishes for an infant. Soon, a child is born, though Timothy Green is not all that he appears.",
        "runtimeMinutes": "105"
    }
}