{
    "2013_1": {
        "plotSummary": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice to curse her home in infinite winter, her sister Anna teams up with a mountain man, his playful reindeer, and a snowman to change the weather condition.",
        "runtimeMinutes": "102"
    },
    "2013_10": {
        "plotSummary": "When the Dark Elves attempt to plunge the universe into darkness, Thor must embark on a perilous and personal journey that will reunite him with doctor Jane Foster.",
        "runtimeMinutes": "112"
    },
    "2013_100": {
        "plotSummary": "When an unseen enemy threatens mankind by taking over their bodies and erasing their memories, Melanie Stryder risks everything to protect the people she cares about.",
        "runtimeMinutes": "125"
    },
    "2013_101": {
        "plotSummary": "When a poor college student who cracks an online poker game goes bust, he arranges a face-to-face with the man he thinks cheated him, a sly offshore entrepreneur.",
        "runtimeMinutes": "88"
    },
    "2013_102": {
        "plotSummary": "About Nae-kyung who is able to assess the personality, mental state and habits of a person by looking at his face. Because of his abilities, he gets involved in a power struggle between Prince Sooyang and Kim Jong-Seo.",
        "runtimeMinutes": "140"
    },
    "2013_103": {
        "plotSummary": "The origin story of the mythical Greek hero. Betrayed by his stepfather, the King, and exiled and sold into slavery because of a forbidden love, Hercules must use his formidable powers to fight his way back to his rightful kingdom.",
        "runtimeMinutes": "99"
    },
    "2013_104": {
        "plotSummary": "Following Kick-Ass' heroics, other citizens are inspired to become masked crusaders. But Red Mist leads his own group of evil supervillains to get revenge, kill Kick-Ass and destroy everything he stands for.",
        "runtimeMinutes": "103"
    },
    "2013_105": {
        "plotSummary": "Malcolm and Kisha move into their dream home, but soon learn a demon also resides there. When Kisha becomes possessed, Malcolm - determined to keep his sex life on track - turns to a priest, a psychic, and a team of ghost-busters for help.",
        "runtimeMinutes": "86"
    },
    "2013_106": {
        "plotSummary": "Ethan Wate (Alden Ehrenreich) longs to escape his small southern town. He meets a mysterious new girl, Lena Duchannes (Alice Englert). Together, they uncover dark secrets about their respective families, their history, and their town.",
        "runtimeMinutes": "124"
    },
    "2013_107": {
        "plotSummary": "A father goes undercover for the DEA in order to free his son, who was imprisoned after being set up in a drug deal.",
        "runtimeMinutes": "112"
    },
    "2013_108": {
        "plotSummary": "In 1985 Dallas, electrician and hustler Ron Woodroof works around the system to help AIDS patients get the medication they need after he is diagnosed with the disease.",
        "runtimeMinutes": "117"
    },
    "2013_109": {
        "plotSummary": "Madea dispenses her unique form of holiday spirit on rural town when she's coaxed into helping a friend pay her daughter a surprise visit in the country for Christmas.",
        "runtimeMinutes": "100"
    },
    "2013_11": {
        "plotSummary": "After their cave is destroyed, a caveman family must trek through an unfamiliar fantastical world with the help of an inventive boy.",
        "runtimeMinutes": "98"
    },
    "2013_110": {
        "plotSummary": "An ambitious married woman's temptation by a handsome billionaire leads to betrayal, recklessness, and forever alters the course of her life.",
        "runtimeMinutes": "111"
    },
    "2013_111": {
        "plotSummary": "An affable underachiever finds out he's fathered 533 children through anonymous donations to a fertility clinic 20 years ago. Now he must decide whether or not to come forward when 142 of them file a lawsuit to reveal his identity.",
        "runtimeMinutes": "105"
    },
    "2013_112": {
        "plotSummary": "After living a long and colorful life, Allan Karlsson finds himself stuck in a nursing home. On his 100th birthday, he leaps out a window and begins an unexpected journey.",
        "runtimeMinutes": "114"
    },
    "2013_113": {
        "plotSummary": "The Z-Fighters must contend with Lord Beerus, the God of Destruction, but only a God can fight a God, and none of them are Gods. However with the creation of the Super Saiyan God, will the Z-Fighters be able to defeat Lord Beerus?",
        "runtimeMinutes": "85"
    },
    "2013_114": {
        "plotSummary": "Jong-seong, a North Korean ghost agent, interrupts an illegal arms sale in Berlin. A notorious North Korean agent tests the loyalties of everyone involved as Jong-Seong prepares to make the ultimate sacrifice.",
        "runtimeMinutes": "121"
    },
    "2013_115": {
        "plotSummary": "In a near future, a lonely writer develops an unlikely relationship with an operating system designed to meet his every need.",
        "runtimeMinutes": "126"
    },
    "2013_116": {
        "plotSummary": "A former DEA agent moves his family to a quiet town, where he soon tangles with a local meth druglord.",
        "runtimeMinutes": "100"
    },
    "2013_117": {
        "plotSummary": "The leader of a drug cartel busts out of a courthouse and speeds to the Mexican border, where the only thing in his path is a sheriff and his inexperienced staff.",
        "runtimeMinutes": "107"
    },
    "2013_118": {
        "plotSummary": "The night before his big medical school interview, a promising student celebrates his 21st birthday with his two best friends.",
        "runtimeMinutes": "93"
    },
    "2013_119": {
        "plotSummary": "A young woman travels to Texas to collect an inheritance; little does she know that an encounter with a chainsaw-wielding killer is part of the reward.",
        "runtimeMinutes": "92"
    },
    "2013_12": {
        "plotSummary": "Former United Nations employee Gerry Lane traverses the world in a race against time to stop a zombie pandemic that is toppling armies and governments and threatens to destroy humanity itself.",
        "runtimeMinutes": "116"
    },
    "2013_120": {
        "plotSummary": "Set four years after the first movie, Lin Xiao, Lily, Nan Xiang, and Ruby, confront opportunities and challenges as their school days come to an end.",
        "runtimeMinutes": "113"
    },
    "2013_121": {
        "plotSummary": "A motorcycle stunt rider turns to robbing banks as a way to provide for his lover and their newborn child, a decision that puts him on a collision course with an ambitious rookie cop navigating a department ruled by a corrupt detective.",
        "runtimeMinutes": "140"
    },
    "2013_122": {
        "plotSummary": "A thief with a unique code of professional ethics is double-crossed by his crew and left for dead. Assuming a new disguise and forming an unlikely alliance with a woman on the inside, he looks to hijack the score of the crew's latest heist.",
        "runtimeMinutes": "118"
    },
    "2013_123": {
        "plotSummary": "A long-divorced couple fakes being married as their family unites for a wedding.",
        "runtimeMinutes": "90"
    },
    "2013_124": {
        "plotSummary": "Five friends who reunite in an attempt to top their epic pub crawl from twenty years earlier unwittingly become humanity's only hope for survival.",
        "runtimeMinutes": "109"
    },
    "2013_125": {
        "plotSummary": "A pair of aging boxing rivals are coaxed out of retirement to fight one final bout, thirty years after their last match.",
        "runtimeMinutes": "113"
    },
    "2013_126": {
        "plotSummary": "The story of Steve Jobs' ascension from college dropout into one of the most revered creative entrepreneurs of the 20th century.",
        "runtimeMinutes": "128"
    },
    "2013_127": {
        "plotSummary": "A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love.",
        "runtimeMinutes": "90"
    },
    "2013_128": {
        "plotSummary": "Ryota is a successful workaholic businessman. When he learns that his biological son was switched with another boy after birth, he faces the difficult decision to choose his true son or the boy he and his wife have raised as their own.",
        "runtimeMinutes": "121"
    },
    "2013_129": {
        "plotSummary": "In a city rife with injustice, ex-cop Billy Taggart seeks redemption and revenge after being double-crossed and then framed by its most powerful figure: Mayor Nicholas Hostetler.",
        "runtimeMinutes": "109"
    },
    "2013_13": {
        "plotSummary": "A frustrated circus magician from Kansas is transported to a magical land called Oz, where he will have to fulfill a prophecy to become the king, and release the land from the Wicked Witches using his great (but fake) powers.",
        "runtimeMinutes": "130"
    },
    "2013_130": {
        "plotSummary": "A week in the life of a young singer as he navigates the Greenwich Village folk scene of 1961.",
        "runtimeMinutes": "104"
    },
    "2013_131": {
        "plotSummary": "Two young boys encounter a fugitive and form a pact to help him evade the vigilantes that are on his trail and to reunite him with his true love.",
        "runtimeMinutes": "130"
    },
    "2013_132": {
        "plotSummary": "Filmed at a sold-out performance at Madison Square Garden, comedian Kevin Hart delivers material from his 2012 \"Let Me Explain\" concert tour.",
        "runtimeMinutes": "75"
    },
    "2013_133": {
        "plotSummary": "Four college girls hold up a restaurant in order to fund their spring break vacation. While partying, drinking, and taking drugs, they are arrested, only to be bailed out by a drug and arms dealer.",
        "runtimeMinutes": "94"
    },
    "2013_134": {
        "plotSummary": "An undercover cop finds it difficult to play both a cop and a goon.",
        "runtimeMinutes": "135"
    },
    "2013_135": {
        "plotSummary": "High school sweethearts QiaoQiao and Li Xing are about to graduate from university and Li Xing surprises QiaoQiao with a marriage proposal. QiaoQiao, however, declines the proposal, offering rash arguments as to why he's not ready. Little ...See moreHigh school sweethearts QiaoQiao and Li Xing are about to graduate from university and Li Xing surprises QiaoQiao with a marriage proposal. QiaoQiao, however, declines the proposal, offering rash arguments as to why he's not ready. Little does he know, QiaoQiao has a devastating secret. Nonetheless, they write a break-up contract; if they're both single in five years, they'll get married. The two part ways and five years pass. Believing Li Xing is still waiting for her, QiaoQiao waits patiently for his call. But when Li Xing finally does contact her it's to invite her to his wedding. QiaoQiao is flabbergasted and is determined to win her former flame back at any cost-even though the secret that forced them apart lingers. Can their love truly be reignited?  Written by CJ EntertainmentSee less",
        "runtimeMinutes": "101"
    },
    "2013_136": {
        "plotSummary": "A cop goes undercover in a ruthless underworld organization to stop a gang leader, only to put himself in great danger after being exposed by his former protege and best friend.",
        "runtimeMinutes": "99"
    },
    "2013_137": {
        "plotSummary": "Betrayed and on the run, a North Korean agent tries to uncover the volatile secrets hidden inside the eyeglasses of a dead man.",
        "runtimeMinutes": "137"
    },
    "2013_138": {
        "plotSummary": "Newlywed couple Nat and Josh are deliriously happy despite their differences, though friends and family aren't convinced that they can last. With their first anniversary approaching and attractive alternatives in the mix, can they last?",
        "runtimeMinutes": "97"
    },
    "2013_139": {
        "plotSummary": "A chronicle of Nelson Mandela's life journey from his childhood in a rural village through to his inauguration as the first democratically elected president of South Africa.",
        "runtimeMinutes": "141"
    },
    "2013_14": {
        "plotSummary": "After the crew of the Enterprise find an unstoppable force of terror from within their own organization, Captain Kirk leads a manhunt to a war-zone world to capture a one-man weapon of mass destruction.",
        "runtimeMinutes": "132"
    },
    "2013_140": {
        "plotSummary": "As the Barrett family's peaceful suburban life is rocked by an escalating series of disturbing events, they come to learn that a terrifying and deadly force is after them, one which may have arrived from beyond the stars.",
        "runtimeMinutes": "97"
    },
    "2013_141": {
        "plotSummary": "An aging, booze-addled father makes the trip from Montana to Nebraska with his estranged son in order to claim a million-dollar Mega Sweepstakes Marketing prize.",
        "runtimeMinutes": "115"
    },
    "2013_142": {
        "plotSummary": "A veteran Vegas magician tries to revive his career after his longtime partner quits, he gets fired from his casino act, and an edgy new \"street magician\" steals his thunder.",
        "runtimeMinutes": "100"
    },
    "2013_143": {
        "plotSummary": "Rejected by his superstitious herd, a half-striped zebra embarks on a daring quest to earn his stripes but finds the courage and self-acceptance to save all the animals of the Great Karoo.",
        "runtimeMinutes": "85"
    },
    "2013_144": {
        "plotSummary": "When the Davison family comes under attack during their wedding anniversary getaway, the gang of mysterious killers soon learns that one of the victims harbors a secret talent for fighting back.",
        "runtimeMinutes": "95"
    },
    "2013_145": {
        "plotSummary": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.",
        "runtimeMinutes": "103"
    },
    "2013_146": {
        "plotSummary": "A divorced woman who decides to pursue the man she's interested in learns he's her new friend's ex-husband.",
        "runtimeMinutes": "93"
    },
    "2013_147": {
        "plotSummary": "As Nell Sweetzer tries to build a new life after the events of the first movie, the evil force that once possessed her returns with an even more horrific plan.",
        "runtimeMinutes": "88"
    },
    "2013_148": {
        "plotSummary": "A drug cartel boss who is arrested in a raid is coerced into betraying his former accomplices as part of an undercover operation.",
        "runtimeMinutes": "107"
    },
    "2013_149": {
        "plotSummary": "Found inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her, but ultimately she must confront her fate, ...See moreFound inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her, but ultimately she must confront her fate, the punishment for her crime.See less",
        "runtimeMinutes": "137"
    },
    "2013_15": {
        "plotSummary": "Wolverine comes to Japan to meet an old friend whose life he saved years ago, and gets embroiled in a conspiracy involving yakuza and mutants.",
        "runtimeMinutes": "126"
    },
    "2013_150": {
        "plotSummary": "Jep Gambardella has seduced his way through the lavish nightlife of Rome for decades, but after his 65th birthday and a shock from the past, Jep looks past the nightclubs and parties to find a timeless landscape of absurd, exquisite beauty.",
        "runtimeMinutes": "141"
    },
    "2013_151": {
        "plotSummary": "An art auctioneer becomes mixed up with a group of criminals partners with a hypnotherapist in order to recover a lost painting.",
        "runtimeMinutes": "101"
    },
    "2013_152": {
        "plotSummary": "A former British Army officer, who was tortured as a prisoner of war at a Japanese labor camp during World War II, discovers that the man responsible for much of his treatment is still alive and sets out to confront him.",
        "runtimeMinutes": "116"
    },
    "2013_153": {
        "plotSummary": "Pledging to keep herself from being the oldest and the only woman in her entire family never to wed, Montana embarks on a thirty-day, thirty-thousand-mile expedition to charm a potential suitor into becoming her fiance.",
        "runtimeMinutes": "96"
    },
    "2013_154": {
        "plotSummary": "A woman gets caught up in an international diamond heist which pushes her close to a spy who is trying to save the world.",
        "runtimeMinutes": "114"
    },
    "2013_155": {
        "plotSummary": "After watching their respective partners die, a New Orleans hitman and a Washington, D.C. detective form an alliance in order to bring down their common enemy.",
        "runtimeMinutes": "92"
    },
    "2013_156": {
        "plotSummary": "During the last two years of her life, Princess Diana embarks on a final rite of passage: a secret love affair with Pakistani heart surgeon Hasnat Khan.",
        "runtimeMinutes": "113"
    },
    "2013_157": {
        "plotSummary": "When it appears as though the end is in sight, the pilots, flight crew, and passengers of a plane heading to Mexico City look to forget the anguish of the moment and face the greatest danger, which we carry within ourselves.",
        "runtimeMinutes": "90"
    },
    "2013_158": {
        "plotSummary": "We meet Jesse and Celine nine years on in Greece. Almost two decades have passed since their first meeting on that train bound for Vienna.",
        "runtimeMinutes": "109"
    },
    "2013_159": {
        "plotSummary": "A lonely art expert working for a mysterious and reclusive heiress finds not only her art worth examining.",
        "runtimeMinutes": "131"
    },
    "2013_16": {
        "plotSummary": "As a war between humankind and monstrous sea creatures wages on, a former pilot and a trainee are paired up to drive a seemingly obsolete special weapon in a desperate effort to save the world from the apocalypse.",
        "runtimeMinutes": "131"
    },
    "2013_160": {
        "plotSummary": "Ranvir treads through the world of the Indian mafia in Turkey as he looks to avenge the death of his lover and partner in crime.",
        "runtimeMinutes": "150"
    },
    "2013_161": {
        "plotSummary": "Inspired by actual events, a group of fame-obsessed teenagers use the internet to track celebrities' whereabouts in order to rob their homes.",
        "runtimeMinutes": "90"
    },
    "2013_162": {
        "plotSummary": "Gao and his friends are the happiest kids in the city of Galilee. Living on the rooftops of this bustling metropolis, sometimes life can be tough, but they still churn out songs all day, and dance under the stars at night. But when Gao ...See moreGao and his friends are the happiest kids in the city of Galilee. Living on the rooftops of this bustling metropolis, sometimes life can be tough, but they still churn out songs all day, and dance under the stars at night. But when Gao meets his dream girl, a billboard beauty named Sian, fate takes him on a wild ride through the high and low parts of the town he loves.  Written by Well Go USASee less",
        "runtimeMinutes": "120"
    },
    "2013_163": {
        "plotSummary": "Madoka Kaname used to be a normal girl living happy days of her life. This all ended when she sacrificed herself in order to save other magical girls from the utterly cruel fate that awaited them. Unable to let her memories of Madoka die, ...See moreMadoka Kaname used to be a normal girl living happy days of her life. This all ended when she sacrificed herself in order to save other magical girls from the utterly cruel fate that awaited them. Unable to let her memories of Madoka die, Homura Akemi continues to fight alone in the world that Madoka left behind for humanity in order to see her smile once more.  Written by AniplexSee less",
        "runtimeMinutes": "116"
    },
    "2013_164": {
        "plotSummary": "Adèle's life is changed when she meets Emma, a young woman with blue hair, who will allow her to discover desire and to assert herself as a woman and as an adult. In front of others, Adèle grows, seeks herself, loses herself, and ...See moreAdèle's life is changed when she meets Emma, a young woman with blue hair, who will allow her to discover desire and to assert herself as a woman and as an adult. In front of others, Adèle grows, seeks herself, loses herself, and ultimately finds herself through love and loss.See less",
        "runtimeMinutes": "180"
    },
    "2013_165": {
        "plotSummary": "A cop from the provinces moves to Paris to join the Anti-Crime Brigade of Montfermeil, discovering an underworld where the tensions between the different groups mark the rhythm.",
        "runtimeMinutes": "104"
    },
    "2013_166": {
        "plotSummary": "A Princeton admissions officer who is up for a major promotion takes a professional risk after she meets a college-bound alternative school kid who just might be the son she gave up years ago in a secret adoption.",
        "runtimeMinutes": "108"
    },
    "2013_167": {
        "plotSummary": "In New York City, a crime lord's right-hand man is helped by a woman seeking retribution.",
        "runtimeMinutes": "118"
    },
    "2013_168": {
        "plotSummary": "The U.S. government recruits Machete to battle his way through Mexico in order to take down an arms dealer who looks to launch a weapon into space.",
        "runtimeMinutes": "107"
    },
    "2013_169": {
        "plotSummary": "The daily adventures of a boy named Boule and his spaniel Bill.",
        "runtimeMinutes": "82"
    },
    "2013_17": {
        "plotSummary": "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government.",
        "runtimeMinutes": "180"
    },
    "2013_170": {
        "plotSummary": "The story of Oscar Grant III, a 22-year-old Bay Area resident, who crosses paths with friends, enemies, family, and strangers on the last day of 2008.",
        "runtimeMinutes": "85"
    },
    "2013_171": {
        "plotSummary": "A 40-year-old father's life is complicated when the mother of his two children moves to New York. Since he can't bear them growing up far away from him, he decides to move there as well.",
        "runtimeMinutes": "117"
    },
    "2013_172": {
        "plotSummary": "Battle of the Year attracts all the best teams from around the world, but the Americans haven't won in fifteen years. Dante enlists Blake to assemble a team of the best dancers and bring the Trophy back to America where it started.",
        "runtimeMinutes": "110"
    },
    "2013_173": {
        "plotSummary": "When Rodney Baze mysteriously disappears and law enforcement doesn't follow through fast enough, his older brother, Russell, takes matters into his own hands to find justice.",
        "runtimeMinutes": "116"
    },
    "2013_174": {
        "plotSummary": "An entry-level employee at a powerful corporation finds himself occupying a corner office, but at a dangerous price: he must spy on his boss's old mentor to secure for him a multi-billion dollar advantage.",
        "runtimeMinutes": "106"
    },
    "2013_175": {
        "plotSummary": "An underwater voyage to Indonesia to learn about its inhabitants such as giant rays and whale sharks as well as efforts being made in the region for ocean conservation.",
        "runtimeMinutes": "40"
    },
    "2013_176": {
        "plotSummary": "As the Japanese surrender at the end of World War II, General Fellers is tasked with deciding if Emperor Hirohito will be hanged as a war criminal. Influencing his ruling is his quest to find Aya, an exchange student he met years earlier in the U.S.",
        "runtimeMinutes": "107"
    },
    "2013_177": {
        "plotSummary": "After a night of drinking, Rachel (Laura Ramsey), a diplomat working in Mexico City finds her world turned upside down after she's saved by Alejandro (Jaime Camil), a Mariachi singer whose visa was rejected the day before - by Rachel.",
        "runtimeMinutes": "111"
    },
    "2013_178": {
        "plotSummary": "After a collision with a shipping container at sea, a resourceful sailor finds himself, despite all efforts to the contrary, staring his mortality in the face.",
        "runtimeMinutes": "106"
    },
    "2013_179": {
        "plotSummary": "A self-diagnosed nymphomaniac recounts her erotic experiences to the man who saved her after a beating.",
        "runtimeMinutes": "117"
    },
    "2013_18": {
        "plotSummary": "The G.I. Joes are not only fighting their mortal enemy Cobra; they are forced to contend with threats from within the government that jeopardize their very existence.",
        "runtimeMinutes": "110"
    },
    "2013_180": {
        "plotSummary": "An Iranian man deserts his French wife and her two children to return to his homeland. Meanwhile, his wife starts up a new relationship, a reality her husband confronts upon his wife's request for a divorce.",
        "runtimeMinutes": "130"
    },
    "2013_181": {
        "plotSummary": "A damaged ex-special forces soldier navigating London's criminal underworld seizes an opportunity to assume another man's identity.",
        "runtimeMinutes": "100"
    },
    "2013_182": {
        "plotSummary": "To save his kidnapped wife, Brent Magna must drive at the orders of a mysterious man.",
        "runtimeMinutes": "90"
    },
    "2013_183": {
        "plotSummary": "A mistaken delivery in Mumbai's famously efficient lunchbox delivery system connects a young housewife to an older man in the dusk of his life as they build a fantasy world together through notes in the lunchbox.",
        "runtimeMinutes": "104"
    },
    "2013_184": {
        "plotSummary": "Three old friends and rivals get set to face off on a TV program billed as \"The Greatest Fight Show on Earth\".",
        "runtimeMinutes": "154"
    },
    "2013_185": {
        "plotSummary": "A novice nun about to take her vows uncovers a family secret dating back to the German occupation.",
        "runtimeMinutes": "82"
    },
    "2013_186": {
        "plotSummary": "Two actors. One play. Can the differences between the two egocentric men be put aside for the sake of friendship and theatre?",
        "runtimeMinutes": "104"
    },
    "2013_187": {
        "plotSummary": "A backstage and on-stage look at Justin Bieber during his rise to super stardom.",
        "runtimeMinutes": "92"
    },
    "2013_188": {
        "plotSummary": "The true story of Paul Potts, a shy, bullied shop assistant by day and an amateur opera singer by night who became a phenomenon after being chosen for -- and ultimately winning -- Britain's Got Talent.",
        "runtimeMinutes": "103"
    },
    "2013_189": {
        "plotSummary": "Julian, a drug-smuggler thriving in Bangkok's criminal underworld, sees his life get even more complicated when his mother compels him to find and kill whoever is responsible for his brother's recent death.",
        "runtimeMinutes": "90"
    },
    "2013_19": {
        "plotSummary": "When one of their own is kidnapped by an angry gangster, the Wolf Pack must track down Mr. Chow, who has escaped from prison and is on the run.",
        "runtimeMinutes": "100"
    },
    "2013_190": {
        "plotSummary": "Wealthy, inventive bachelor Colin endeavors to find a cure for his lover Chloe after she's diagnosed with an unusual illness caused by a flower growing in her lungs.",
        "runtimeMinutes": "131"
    },
    "2013_191": {
        "plotSummary": "A man heading towards Rameshwaram via Chennai express to immerse his late grandfather's ashes unwillingly gets caught amidst goons after helping their boss's daughter and them board the train.",
        "runtimeMinutes": "141"
    },
    "2013_192": {
        "plotSummary": "When famous DJ Alan Partridge's radio station is taken over by a new media conglomerate, it sets in motion a chain of events which see Alan having to work with the police to defuse a potentially violent siege.",
        "runtimeMinutes": "90"
    },
    "2013_193": {
        "plotSummary": "After losing her virginity, Isabelle takes up a secret life as a call girl, meeting her clients for hotel-room trysts. Throughout, she remains curiously aloof, showing little interest in the encounters themselves or the money she makes.",
        "runtimeMinutes": "95"
    },
    "2013_194": {
        "plotSummary": "A ten-year-old scientist secretly leaves his family's ranch in Montana where he lives with his cowboy father and scientist mother, escapes home, and travels across the country aboard a freight train to receive an award at the Smithsonian Institute.",
        "runtimeMinutes": "105"
    },
    "2013_195": {
        "plotSummary": "Sparks fly when Wade Walker crashes the Peeples annual reunion in the Hamptons to ask for their precious daughter Grace's hand in marriage.",
        "runtimeMinutes": "95"
    },
    "2013_196": {
        "plotSummary": "An immersive experience about one of the world's most beloved cities. Discover why this tiny piece of land is sacred to billions of people and how archaeology is uncovering secrets of Jerusalem's past.",
        "runtimeMinutes": "44"
    },
    "2013_197": {
        "plotSummary": "Grumpy pensioner Arthur honors his recently deceased wife's passion for performing by joining the unconventional local choir to which she used to belong, a process that helps him build bridges with his estranged son, James.",
        "runtimeMinutes": "90"
    },
    "2013_198": {
        "plotSummary": "A dramatic thriller based on real events that reveals the quest to expose the deceptions and corruptions of power that turned an Internet upstart into the 21st century's most fiercely debated organization.",
        "runtimeMinutes": "128"
    },
    "2013_199": {
        "plotSummary": "A New York woman (who doesn't really have an apartment) apprentices for a dance company (though she's not really a dancer) and throws herself headlong into her dreams, even as the possibility of realizing them dwindles.",
        "runtimeMinutes": "86"
    },
    "2013_2": {
        "plotSummary": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
        "runtimeMinutes": "130"
    },
    "2013_20": {
        "plotSummary": "A writer and wall street trader, Nick, finds himself drawn to the past and lifestyle of his millionaire neighbor, Jay Gatsby.",
        "runtimeMinutes": "143"
    },
    "2013_200": {
        "plotSummary": "A look at the life of philosopher and political theorist Hannah Arendt, who reported for 'The New Yorker' on the trial of the Nazi leader Adolf Eichmann in Jerusalem.",
        "runtimeMinutes": "113"
    },
    "2013_201": {
        "plotSummary": "A British couple return to Paris many years after their honeymoon there in an attempt to rejuvenate their marriage.",
        "runtimeMinutes": "93"
    },
    "2013_202": {
        "plotSummary": "When a temple priest commits suicide after being dishonored by an evil landlord, his son returns to his native village on a mission of vengeance.",
        "runtimeMinutes": "150"
    },
    "2013_203": {
        "plotSummary": "A corrupt, junkie cop with bipolar disorder attempts to manipulate his way through a promotion in order to win back his wife and daughter while also fighting his own inner demons.",
        "runtimeMinutes": "97"
    },
    "2013_204": {
        "plotSummary": "An actress attempts to convince a director how she's perfect for a role in his upcoming production.",
        "runtimeMinutes": "96"
    },
    "2013_205": {
        "plotSummary": "Trip, a young roadie for Metallica, is sent on an urgent mission during the band's show. But what seems like a simple assignment turns into a surreal adventure.",
        "runtimeMinutes": "93"
    },
    "2013_206": {
        "plotSummary": "Set on the French Riviera in the summer of 1915, Jean Renoir -- son of the Impressionist painter, Pierre-Auguste -- returns home to convalesce after being wounded in World War I. At his side is Andree, a young woman who rejuvenates, ...See moreSet on the French Riviera in the summer of 1915, Jean Renoir -- son of the Impressionist painter, Pierre-Auguste -- returns home to convalesce after being wounded in World War I. At his side is Andree, a young woman who rejuvenates, enchants, and inspires both father and son.  Written by Samuel Goldwyn FilmsSee less",
        "runtimeMinutes": "111"
    },
    "2013_207": {
        "plotSummary": "When a capable dancer is provoked by the evil design of his employer, naturally he will be out to prove his mettle.",
        "runtimeMinutes": "160"
    },
    "2013_208": {
        "plotSummary": "A depressed musician reunites with his lover. Though their romance, which has already endured several centuries, is disrupted by the arrival of her uncontrollable younger sister.",
        "runtimeMinutes": "123"
    },
    "2013_209": {
        "plotSummary": "A street-wise teen from Baltimore who has been raised by a single mother travels to New York City to spend the Christmas holiday with his estranged relatives, where he embarks on a surprising and inspirational journey.",
        "runtimeMinutes": "93"
    },
    "2013_21": {
        "plotSummary": "An F.B.I. Agent and an Interpol Detective track a team of illusionists who pull off bank heists during their performances, and reward their audiences with the money.",
        "runtimeMinutes": "115"
    },
    "2013_210": {
        "plotSummary": "A hard-partying high school senior's philosophy on life changes when he meets the not-so-typical \"nice girl.\"",
        "runtimeMinutes": "95"
    },
    "2013_211": {
        "plotSummary": "The son of a North Korean spy decides to follow in his father's footsteps to protect his little sister.",
        "runtimeMinutes": "113"
    },
    "2013_212": {
        "plotSummary": "A story set in Santiago and centered on Gloria, a free-spirited older woman, and the realities of her whirlwind relationship with a former naval officer whom she meets out in the clubs.",
        "runtimeMinutes": "110"
    },
    "2013_213": {
        "plotSummary": "A high-profile terrorism case unexpectedly binds together two ex-lovers on the defense team - testing the limits of their loyalties and placing their lives in jeopardy.",
        "runtimeMinutes": "96"
    },
    "2013_214": {
        "plotSummary": "Kabir and Naina bond during a trekking trip. Before Naina can express herself, Kabir leaves India to pursue his career. They meet again years later, but he still cherishes his dreams more than bonds.",
        "runtimeMinutes": "160"
    },
    "2013_215": {
        "plotSummary": "Harry is an industrialist who loves his daughter Bijlee, and the bond they share with Harry's man friday, Matru. Bijlee's plan to wed the son of a politician, however, brings twists and turns in the lives of Matru, Bijlee and Mandola.",
        "runtimeMinutes": "151"
    },
    "2013_216": {
        "plotSummary": "1921. An innocent immigrant woman is tricked into a life of burlesque and vaudeville until a dazzling magician tries to save her and reunite her with her sister who is being held in the confines of Ellis Island.",
        "runtimeMinutes": "120"
    },
    "2013_217": {
        "plotSummary": "Backup singers live in a world that lies just beyond the spotlight. Their voices bring harmony to the biggest bands in popular music, but we've had no idea who these singers are or what lives they lead, until now.",
        "runtimeMinutes": "91"
    },
    "2013_218": {
        "plotSummary": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
        "runtimeMinutes": "102"
    },
    "2013_219": {
        "plotSummary": "Alexandre Taillard de Vorms is tall and impressive, a man with style, attractive to women. He also happens to be the Minister of Foreign Affairs for the land of enlightenment: France. With his silver mane and tanned, athletic body, he ...See moreAlexandre Taillard de Vorms is tall and impressive, a man with style, attractive to women. He also happens to be the Minister of Foreign Affairs for the land of enlightenment: France. With his silver mane and tanned, athletic body, he stalks the world stage, from the floor of the United Nations in New York to the powder keg of Oubanga. There, he calls on the powerful and invokes the mighty to bring peace, to calm the trigger-happy, and to cement his aura of Nobel Peace Prize winner-in-waiting. Alexandre Taillard de Vorms is a force to be reckoned with, waging his own war backed up by the holy trinity of diplomatic concepts: legitimacy, lucidity and efficacy. He takes on American neo-cons, corrupt Russians and money-grabbing Chinese. Perhaps the world doesn't deserve France's magnanimousness, but his art would be wasted if just restricted to home turf. Enter the young Arthur Vlaminck, graduate of the elite National School of Administration, who is hired as head of \"language\" at the foreign ministry. In other words, he is to write the minister's speeches. But he also has to learn to deal with the sensibilities of the boss and his entourage, and find his way between the private secretary and the special advisers who stalk the corridors of the Quai d'Orsay - the ministry's home - where stress, ambition and dirty dealing are the daily currency. But just as he thinks he can influence the fate of the world, everything seems threatened by the inertia of the technocrats.  Written by Sundance SelectsSee less",
        "runtimeMinutes": "113"
    },
    "2013_22": {
        "plotSummary": "The Smurfs team up with their human friends to rescue Smurfette, who has been abducted by Gargamel, since she knows a secret spell that can turn the evil sorcerer's newest creation, creatures called \"The Naughties\", into real Smurfs.",
        "runtimeMinutes": "105"
    },
    "2013_220": {
        "plotSummary": "Facing a failed relationship and a struggling restaurant, a woman hits the road for a trip with her grandson.",
        "runtimeMinutes": "116"
    },
    "2013_221": {
        "plotSummary": "A young martial artist's unparalleled Tai Chi skills land him in a highly lucrative underworld fight club.",
        "runtimeMinutes": "105"
    },
    "2013_222": {
        "plotSummary": "A modern retelling of Shakespeare's classic comedy about two pairs of lovers with different takes on romance and a way with words.",
        "runtimeMinutes": "109"
    },
    "2013_223": {
        "plotSummary": "Obsessed with vengeance, a man sets out to find out why he was kidnapped and locked into solitary confinement for twenty years without reason.",
        "runtimeMinutes": "104"
    },
    "2013_224": {
        "plotSummary": "In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion. Read more: Synopsis",
        "runtimeMinutes": "77"
    },
    "2013_225": {
        "plotSummary": "A pair of aging stickup men try to get the old gang back together for one last hurrah before one of the guys takes his last assignment - to kill his comrade.",
        "runtimeMinutes": "95"
    },
    "2013_226": {
        "plotSummary": "Modern adaptation of William Shakespeare's 'Romeo and Juliet' with an Indian twist, the film focuses on the story of Ram and Leela, their love, lust and the drama afterwards.",
        "runtimeMinutes": "150"
    },
    "2013_227": {
        "plotSummary": "The story of Richard Kuklinski, the notorious contract killer and family man. When finally arrested in 1986, neither his wife nor daughters had any clue about his real profession.",
        "runtimeMinutes": "106"
    },
    "2013_228": {
        "plotSummary": "Krrish and his scientist father have to save the world and their own family from an evil man named Kaal and his gang of mutants, led by the ruthless Kaya.",
        "runtimeMinutes": "152"
    },
    "2013_229": {
        "plotSummary": "At the height of his career, Charles Dickens (Ralph Fiennes) meets a younger woman who becomes his secret lover until his death.",
        "runtimeMinutes": "111"
    },
    "2013_23": {
        "plotSummary": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse.",
        "runtimeMinutes": "112"
    },
    "2013_230": {
        "plotSummary": "In postwar Hong Kong, legendary Wing Chun grandmaster Ip Man is reluctantly called into action once more, when what begin as simple challenges from rival kung fu styles soon draw him into the dark and dangerous underworld of the Triads. ...See moreIn postwar Hong Kong, legendary Wing Chun grandmaster Ip Man is reluctantly called into action once more, when what begin as simple challenges from rival kung fu styles soon draw him into the dark and dangerous underworld of the Triads. Now, to defend life and honor, he has no choice but to fight one last time ...  Written by Emperor Motion PicturesSee less",
        "runtimeMinutes": "100"
    },
    "2013_231": {
        "plotSummary": "19th Century violinist and composer Niccolò Paganini incurs the wrath of his diabolical manager while preparing for his debut performance in London, and falling for the daughter of an English impresario.",
        "runtimeMinutes": "122"
    },
    "2013_232": {
        "plotSummary": "When a notorious criminal is forced to return to London, it gives a detective one last chance to take down the man he's always been after.",
        "runtimeMinutes": "99"
    },
    "2013_233": {
        "plotSummary": "Feeling pressured to become more sexually experienced before she goes to college, Brandy Klark makes a list of things to accomplish before hitting campus in the fall.",
        "runtimeMinutes": "104"
    },
    "2013_234": {
        "plotSummary": "In this Hunger Games spoof, Kantmiss Evershot must fight for her life in the 75th annual Starving Games, where she could also win an old ham, a coupon for a foot-long sub, and a partially eaten pickle.",
        "runtimeMinutes": "83"
    },
    "2013_235": {
        "plotSummary": "Norwegian archaeologist Sigurd Svendsen forms a small team and sets off to find the true meaning of the secret runes found carved in rock and accidentally awakens a giant monster.",
        "runtimeMinutes": "100"
    },
    "2013_236": {
        "plotSummary": "The true story of an Argentine family who lived with Josef Mengele without knowing his true identity, and of a girl who fell in love with one of the biggest criminals of all time.",
        "runtimeMinutes": "93"
    },
    "2013_237": {
        "plotSummary": "A romantic comedy that brings together three disparate characters who are learning to face a challenging and often confusing world as they struggle together against a common demon: sex addiction.",
        "runtimeMinutes": "112"
    },
    "2013_238": {
        "plotSummary": "A drama centered on a group of people searching for human connections in today's wired world.",
        "runtimeMinutes": "115"
    },
    "2013_239": {
        "plotSummary": "When the owner of a major elephant camp is murdered, Kham finds himself the number one suspect and on the run from both the police and the deceased's vengeful twin nieces. But luck is on Kham's side when he runs into an Interpol agent sent...See moreWhen the owner of a major elephant camp is murdered, Kham finds himself the number one suspect and on the run from both the police and the deceased's vengeful twin nieces. But luck is on Kham's side when he runs into an Interpol agent sent to Thailand on a secret mission.  Written by ProductionSee less",
        "runtimeMinutes": "104"
    },
    "2013_24": {
        "plotSummary": "John McClane travels to Russia to help out his seemingly wayward son, Jack, only to discover that Jack is a CIA operative working undercover, causing the father and son to team up against underworld forces.",
        "runtimeMinutes": "98"
    },
    "2013_240": {
        "plotSummary": "Antoine is a lawyer living in New York. On his way back to France for the final round of a job interview, Antoine finds himself sitting right next to his ex-girlfriend Julie. With a seven-hour flight ahead of them, they are going to have ...See moreAntoine is a lawyer living in New York. On his way back to France for the final round of a job interview, Antoine finds himself sitting right next to his ex-girlfriend Julie. With a seven-hour flight ahead of them, they are going to have to speak to each other.  Written by AnonymousSee less",
        "runtimeMinutes": "96"
    },
    "2013_241": {
        "plotSummary": "An underachieving voice coach finds herself competing in the movie trailer voice-over profession against her arrogant father and his protege.",
        "runtimeMinutes": "93"
    },
    "2013_242": {
        "plotSummary": "In Spain in 1966, an English teacher picks up two hitchhikers on his quest to meet John Lennon.",
        "runtimeMinutes": "108"
    },
    "2013_243": {
        "plotSummary": "As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.",
        "runtimeMinutes": "110"
    },
    "2013_244": {
        "plotSummary": "A public housing tenement is plunged into a dark storm of supernatural chaos.",
        "runtimeMinutes": "103"
    },
    "2013_245": {
        "plotSummary": "Romeo and Juliet secretly wed despite the sworn contempt their families hold for each other. It is not long, however, before a chain of fateful events changes the lives of both families forever.",
        "runtimeMinutes": "118"
    },
    "2013_246": {
        "plotSummary": "A promising hip-hop rhymer from Los Angeles finds herself in a gray area when a record producer offers her a compromising shot at stardom.",
        "runtimeMinutes": "80"
    },
    "2013_247": {
        "plotSummary": "An operative for an elite private intelligence firm finds her priorities changing dramatically after she is tasked with infiltrating an anarchist group known for executing covert attacks upon major corporations.",
        "runtimeMinutes": "116"
    },
    "2013_248": {
        "plotSummary": "A pro ball player with a substance abuse problem is forced into rehab in his hometown, finding new hope when he gets honest about his checkered past, and takes on coaching duties for a misfit Little League team.",
        "runtimeMinutes": "113"
    },
    "2013_249": {
        "plotSummary": "After falling in love in Paris, Marina and Neil come to Oklahoma, where problems arise. Their church's Spanish-born pastor struggles with his faith, while Neil encounters a woman from his childhood.",
        "runtimeMinutes": "112"
    },
    "2013_25": {
        "plotSummary": "A veteran assigned to extract Earth's remaining resources begins to question what he knows about his mission and himself.",
        "runtimeMinutes": "124"
    },
    "2013_250": {
        "plotSummary": "On May 5th, 1862, a few thousand Mexican soldiers put their lives on the line against the world's largest and most powerful army in one legendary battle for freedom and for Mexico.",
        "runtimeMinutes": "125"
    },
    "2013_251": {
        "plotSummary": "In New York City, a young girl is caught in the middle of her parents' bitter custody battle.",
        "runtimeMinutes": "99"
    },
    "2013_252": {
        "plotSummary": "A thriller set at the beginning of the 1980's Norwegian Oil Boom and centered on a diver whose obsession with reaching the bottom of the Norwegian Sea leads to tragedy.",
        "runtimeMinutes": "111"
    },
    "2013_253": {
        "plotSummary": "A film that excavates layers of myth and memory to find the elusive truth at the core of a family of storytellers.",
        "runtimeMinutes": "108"
    },
    "2013_254": {
        "plotSummary": "A documentary featuring interviews with all surviving former heads of Shin Bet, the Israeli security agency whose activities and membership are closely held state secrets.",
        "runtimeMinutes": "101"
    },
    "2013_255": {
        "plotSummary": "Two brothers, on either side of the law, face off over organized crime in Brooklyn during the 1970s.",
        "runtimeMinutes": "127"
    },
    "2013_256": {
        "plotSummary": "Rebecca is one of the world's top war photographers. She must weather a major emotional storm when her husband refuses to put up with her dangerous life any longer.",
        "runtimeMinutes": "117"
    },
    "2013_257": {
        "plotSummary": "Grace Trey is a phenomenal singer. But at the tender age of eighteen, after she gets the music break of a lifetime and is thrust into the \"real world\" - her faith is put to the test.",
        "runtimeMinutes": "102"
    },
    "2013_258": {
        "plotSummary": "Miles Montego (Ja Rule) has it all - cars, boats, good looks, mansion, money, women, but more importantly, he has a past. Miles is a retired high level drug trafficker who is now completely legitimate. Even though Miles has turned over a ...See moreMiles Montego (Ja Rule) has it all - cars, boats, good looks, mansion, money, women, but more importantly, he has a past. Miles is a retired high level drug trafficker who is now completely legitimate. Even though Miles has turned over a new leaf, the DEA can't seem to let him out of their sights. Miles' only downfall is that he is extremely loyal to his circle of friends and former colleagues who are not retired from the lucrative business. Struggling to keep on the right side of the law, Miles meets the one girl of his dreams but she's not the usual type of girl that he's used to dating. Vanessa (Adrienne Bailon) is a church girl in every sense of the word. They are tested to their last ounce of faith and strength in God and each other. God continues to chip away at Miles through struggles from his past, having to live up to his reputation, feelings of unworthiness, the death of his mother, federal charges, his friends being indicted, the strain on his relationship with Vanessa, almost losing her in a near fatal car accident, and finally the spiritual breakdown and one on one with God that brings Miles to his knees.  Written by AnonymousSee less",
        "runtimeMinutes": "118"
    },
    "2013_259": {
        "plotSummary": "A council case worker looks for the relatives of those found dead and alone.",
        "runtimeMinutes": "92"
    },
    "2013_26": {
        "plotSummary": "In the year 2154, the very wealthy live on a man-made space station while the rest of the population resides on a ruined Earth. A man takes on a mission that could bring equality to the polarized worlds.",
        "runtimeMinutes": "109"
    },
    "2013_260": {
        "plotSummary": "A pastor who's suffered a personal loss accepts a position in a town that believes in a Christmas miracle candle, which he strives to abolish.",
        "runtimeMinutes": "100"
    },
    "2013_261": {
        "plotSummary": "Parisian Thomas Platz is suddenly made the guardian of a baby - then pretends to be its real father in order to win back Marie, the girlfriend who dumped him a year before. Stuck between staying a man-child forever, and proving he is ready...See moreParisian Thomas Platz is suddenly made the guardian of a baby - then pretends to be its real father in order to win back Marie, the girlfriend who dumped him a year before. Stuck between staying a man-child forever, and proving he is ready to take the next steps of marriage and family with the love of his life, Thomas goes on an unexpectedly hilarious adventure getting the girl of his dreams to believe he has changed.  Written by Rialto PremieresSee less",
        "runtimeMinutes": "90"
    },
    "2013_262": {
        "plotSummary": "The truth behind the ascension of Milkha Singh who was scarred because of the India-Pakistan partition.",
        "runtimeMinutes": "186"
    },
    "2013_263": {
        "plotSummary": "Obsessed with Pride and Prejudice, a woman travels to a Jane Austen theme park in search for her perfect gentleman.",
        "runtimeMinutes": "97"
    },
    "2013_264": {
        "plotSummary": "A documentary following the controversial captivity of killer whales, and its dangers for both humans and whales.",
        "runtimeMinutes": "83"
    },
    "2013_265": {
        "plotSummary": "\"Marius\" takes place in Marseilles' Old Port, at the La Marine Bar, owned by Cesar and his son Marius. Marius' biggest dream is to embark on one of the boats passing by his dad's bar and to set off to a faraway land. Fanny, a young and ...See more\"Marius\" takes place in Marseilles' Old Port, at the La Marine Bar, owned by Cesar and his son Marius. Marius' biggest dream is to embark on one of the boats passing by his dad's bar and to set off to a faraway land. Fanny, a young and pretty seafood peddler, has secretly been in love with Marius since her childhood; Marius, never admitting it, has always loved Fanny. One day, a sailor drops by La Marine and offers him a job on an exploratory ship. Trying to hold him off and to make him jealous, Fanny confesses his love to him and provokes a fight between Marius and one of Cesar's old friends, Panisse, a boat merchant, who despite his old age, has been courting Fanny for a while. Torn between the call of the sea and his love for her, Marius abandons his dream to be with Fanny who gives herself to him. As Cesar and Honorine, Fanny's mother, are getting ready for the wedding, Marius changes his mind, drawn back to the call of the sea. Sacrificing her love, Fanny convinces Marius to embark on his journey, leaving her behind. Devastated but holding back her tears, she hides Marius' decision to his father.See less",
        "runtimeMinutes": "93"
    },
    "2013_266": {
        "plotSummary": "A young Pakistani man is chasing corporate success on Wall Street. He finds himself embroiled in a conflict between his American Dream, a hostage crisis, and the enduring call of his family's homeland. Read more: Synopsis",
        "runtimeMinutes": "130"
    },
    "2013_267": {
        "plotSummary": "This riveting drama tells the true story of two young American Mormon missionaries held captive and brutalized for a week in a remote part of Russia.",
        "runtimeMinutes": "107"
    },
    "2013_268": {
        "plotSummary": "Collective screening of the Academy Award nominated short films from the Live Action category for 2013.",
        "runtimeMinutes": "115"
    },
    "2013_269": {
        "plotSummary": "An Arab surgeon living in Tel Aviv discovers a dark secret about his wife in the aftermath of a suicide bombing.",
        "runtimeMinutes": "102"
    },
    "2013_27": {
        "plotSummary": "A freak accident might just help an everyday garden snail achieve his biggest dream: winning the Indy 500.",
        "runtimeMinutes": "96"
    },
    "2013_270": {
        "plotSummary": "A failed New York playwright awkwardly navigates the transition from Next Big Thing to Last Year's News.",
        "runtimeMinutes": "103"
    },
    "2013_271": {
        "plotSummary": "12-year-old Pelle is bitten by an ant and develops superpowers. Aided by comic book nerd Wilhelm, Pelle creates a secret identity as superhero Antboy. When a super villain The Flea enters the scene, Antboy must step up to the challenge.",
        "runtimeMinutes": "77"
    },
    "2013_272": {
        "plotSummary": "A murder in 1944 draws together the great poets of the beat generation: Allen Ginsberg, Jack Kerouac, and William Burroughs.",
        "runtimeMinutes": "104"
    },
    "2013_273": {
        "plotSummary": "A widow falls for a guy who bears a striking resemblance to her late husband.",
        "runtimeMinutes": "92"
    },
    "2013_274": {
        "plotSummary": "This film follows 9 girls from Haiti, Nepal, Ethiopia, India, Egypt, Peru, Cambodia, Sierra Leone, and Afghanistan on their journey to education.",
        "runtimeMinutes": "101"
    },
    "2013_275": {
        "plotSummary": "A family's journey toward a better life is interrupted by an unstable man of the cloth.",
        "runtimeMinutes": "100"
    },
    "2013_276": {
        "plotSummary": "A 20-something supervising staff member of a residential treatment facility navigates the troubled waters of that world alongside her co-worker and longtime boyfriend.",
        "runtimeMinutes": "96"
    },
    "2013_277": {
        "plotSummary": "A pianist with stage fright endures a performance under the eyes of a mysterious sniper, who will shoot and kill him if a wrong note is played.",
        "runtimeMinutes": "90"
    },
    "2013_278": {
        "plotSummary": "Three girls in 1980s Stockholm decide to form a punk band -- despite not having any instruments and being told by everyone that punk is dead.",
        "runtimeMinutes": "102"
    },
    "2013_279": {
        "plotSummary": "The story of Linda Lovelace, who is used and abused by the porn industry at the behest of her coercive husband before taking control of her life. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2013_28": {
        "plotSummary": "Flint Lockwood now works at The Live Corp Company for his idol Chester V. But he's forced to leave his post when he learns that his most infamous machine is still operational, and is churning out menacing food-animal hybrids.",
        "runtimeMinutes": "95"
    },
    "2013_280": {
        "plotSummary": "A pair of childhood friends and neighbors fall for each other's sons.",
        "runtimeMinutes": "112"
    },
    "2013_281": {
        "plotSummary": "A drama set in New Mexico during WWII, centered on the relationship between a young man and an elderly medicine woman who helps him contend with the battle between good and evil that rages in his village.",
        "runtimeMinutes": "106"
    },
    "2013_282": {
        "plotSummary": "An elderly couple fight against local authorities in rural New Brunswick to build their final home.",
        "runtimeMinutes": "102"
    },
    "2013_283": {
        "plotSummary": "Heidi, a radio DJ, is sent a box containing a record - a \"gift from the Lords\". The sounds within the grooves trigger flashbacks of her town's violent past. Is Heidi going mad, or are the Lords back to take revenge on Salem, Massachusetts?",
        "runtimeMinutes": "101"
    },
    "2013_284": {
        "plotSummary": "A chronicle of the tragic love affair between American poet Elizabeth Bishop and Brazilian architect Lota de Macedo Soares.",
        "runtimeMinutes": "118"
    },
    "2013_285": {
        "plotSummary": "Three teenage friends, in the ultimate act of independence, decide to spend their summer building a house in the woods and living off the land.",
        "runtimeMinutes": "95"
    },
    "2013_286": {
        "plotSummary": "A troubled Native American veteran forms an extraordinary friendship with his maverick French psychoanalyst as they try to find a cure to his suffering.",
        "runtimeMinutes": "117"
    },
    "2013_287": {
        "plotSummary": "A car thief falls in love with a woman whose car he has stolen.",
        "runtimeMinutes": "143"
    },
    "2013_288": {
        "plotSummary": "Three friends growing up in India at the turn of the millennium set out to open a training academy to produce the country's next cricket stars.",
        "runtimeMinutes": "130"
    },
    "2013_289": {
        "plotSummary": "A recounting of the chaotic events that occurred at Dallas' Parkland Hospital on the day U.S. President John F. Kennedy was assassinated.",
        "runtimeMinutes": "93"
    },
    "2013_29": {
        "plotSummary": "A teenager finds herself transported to a deep forest setting where a battle between the forces of good and the forces of evil is taking place. She bands together with a rag-tag group of characters in order to save their world -- and ours.",
        "runtimeMinutes": "102"
    },
    "2013_290": {
        "plotSummary": "Alix and Doug were not supposed to meet, but they did. Alix was on a train bound for Paris where she was going to audition for a film, having just left Calais where she had performed in an Ibsen play. Doug, a literature professor, had left...See moreAlix and Doug were not supposed to meet, but they did. Alix was on a train bound for Paris where she was going to audition for a film, having just left Calais where she had performed in an Ibsen play. Doug, a literature professor, had left England for Paris, where he was to attend the funeral of a dear friend. They were not supposed to meet and yet they did. They did because Alix, whose relationship with her boyfriend was at a crossroads, fancied this handsome serious-looking gentleman on the Paris-bound train. They did because Doug, although not in the mood for love, quickly fell for her. They were not supposed to meet but their brief encounter would prove to be overwhelming.  Written by Guy BellingerSee less",
        "runtimeMinutes": "104"
    },
    "2013_291": {
        "plotSummary": "A billionaire with questionable priorities re-examines his life after discovering his grandfather's journal.",
        "runtimeMinutes": "105"
    },
    "2013_292": {
        "plotSummary": "The life of Paul Raymond, the controversial entrepreneur who became Britain's richest man.",
        "runtimeMinutes": "101"
    },
    "2013_293": {
        "plotSummary": "After spending 12 years in prison for keeping his mouth shut, notorious safe-cracker Dom Hemingway is back on the streets of London looking to collect what he's owed.",
        "runtimeMinutes": "93"
    },
    "2013_294": {
        "plotSummary": "A renegade film crew becomes embroiled with a yakuza clan feud.",
        "runtimeMinutes": "129"
    },
    "2013_295": {
        "plotSummary": "The story of the marriage between Michel and Lena, as told by their daughter Anne, with reflections on the mystery of abiding love.",
        "runtimeMinutes": "110"
    },
    "2013_296": {
        "plotSummary": "Nenette, who has the mental age of an 8-year-old, has always lived with her mother, who raised her alone. Nenette works, cleaning the community school, and her best friend is a tortoise. But when her mum dies, she faces life in a ...See moreNenette, who has the mental age of an 8-year-old, has always lived with her mother, who raised her alone. Nenette works, cleaning the community school, and her best friend is a tortoise. But when her mum dies, she faces life in a retirement home. But, as the institution doesn't accept animals, Nenette sets out with her suitcase and her tortoise, planning to find her father, whom she knows only by a yellowed photograph, a letter and an address.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2013_297": {
        "plotSummary": "A corporate go-getter sees his priorities shift when a personal tragedy brings him face-to-face with political corruption.",
        "runtimeMinutes": "152"
    },
    "2013_298": {
        "plotSummary": "In 90s Singapore, the friendship between Filipino nursemaid Teresa and her young charge Jiale makes waves in a family, while the Asian recession hits the region.",
        "runtimeMinutes": "99"
    },
    "2013_299": {
        "plotSummary": "A documentary that follows former U.S. Labor Secretary Robert Reich as he looks to raise awareness of the country's widening economic gap.",
        "runtimeMinutes": "89"
    },
    "2013_3": {
        "plotSummary": "When Gru, the world's most super-bad turned super-dad has been recruited by a team of officials to stop lethal muscle and a host of Gru's own, He has to fight back with new gadgetry, cars, and more minion madness.",
        "runtimeMinutes": "98"
    },
    "2013_30": {
        "plotSummary": "Native American warrior Tonto recounts the untold tales that transformed John Reid, a man of the law, into a legend of justice.",
        "runtimeMinutes": "150"
    },
    "2013_300": {
        "plotSummary": "The haunted Captain of a Soviet submarine holds the fate of the world in his hands. Forced to leave his family behind, he is charged with leading a covert mission cloaked in mystery.",
        "runtimeMinutes": "98"
    },
    "2013_301": {
        "plotSummary": "Kundan, the son of a Hindu pundit, discovers that his childhood sweetheart Zoya loves city-bred Akram and wants to marry him. However, he persistently seeks to win her heart.",
        "runtimeMinutes": "140"
    },
    "2013_302": {
        "plotSummary": "Summertime. A cruising spot for men, tucked away on the shores of a lake. Franck falls in love with Michel, an attractive, potent and lethally dangerous man. Franck knows this but wants to live out his passion anyway.",
        "runtimeMinutes": "100"
    },
    "2013_303": {
        "plotSummary": "Running toward God but away from his sexuality, Adam became a priest at age 21. Now the head of a rural parish, he's still tormented by desire. When Father Adam attempts to help a troubled teen, long-suppressed feelings begin to surface.",
        "runtimeMinutes": "102"
    },
    "2013_304": {
        "plotSummary": "Two thirteen year-old working-class friends in Bradford seek fortune by getting involved with a local scrap dealer and criminal.",
        "runtimeMinutes": "91"
    },
    "2013_305": {
        "plotSummary": "Two veterans of the Bosnian War, one American, one Serbian, find their unlikely friendship tested when one of them reveals their true intentions.",
        "runtimeMinutes": "91"
    },
    "2013_306": {
        "plotSummary": "A vagrant enters the lives of an arrogant upper-class family, turning their lives into a psychological nightmare in the process.",
        "runtimeMinutes": "113"
    },
    "2013_307": {
        "plotSummary": "A gang of ruthless highway killers kidnap a wealthy couple traveling cross country only to shockingly discover that things are not what they seem.",
        "runtimeMinutes": "86"
    },
    "2013_308": {
        "plotSummary": "The tale of an outlaw who escapes from prison and sets out across the Texas hills to reunite with his wife and the daughter he has never met.",
        "runtimeMinutes": "96"
    },
    "2013_309": {
        "plotSummary": "After the terrible news of a fatal car accident involving her son, a desperate mother will do anything in her power to set her child free.",
        "runtimeMinutes": "112"
    },
    "2013_31": {
        "plotSummary": "A con man, Irving Rosenfeld, along with his seductive partner Sydney Prosser, is forced to work for a wild F.B.I. Agent, Richie DiMaso, who pushes them into a world of Jersey powerbrokers and the Mafia.",
        "runtimeMinutes": "138"
    },
    "2013_310": {
        "plotSummary": "Sixteen-year-old Sarah is given thirteen hours to solve a labyrinth and rescue her baby brother Toby when her wish for him to be taken away is granted by the Goblin King Jareth.",
        "runtimeMinutes": "101"
    },
    "2013_311": {
        "plotSummary": "As a war rages on in the province of Bougainville in Papua New Guinea, a young girl becomes transfixed by the Charles Dickens novel Great Expectations, which is being read at school by the only white man in the village.",
        "runtimeMinutes": "116"
    },
    "2013_312": {
        "plotSummary": "An acclaimed writer, his ex-wife, and their teenaged children come to terms with the complexities of love in all its forms over the course of one tumultuous year.",
        "runtimeMinutes": "97"
    },
    "2013_313": {
        "plotSummary": "An American girl, sent to the English countryside to stay with relatives, finds love and purpose while fighting for her survival as war envelops the world around her.",
        "runtimeMinutes": "101"
    },
    "2013_314": {
        "plotSummary": "A documentary that follows top bodybuilders as they train to compete in the Mr. Olympia competition.",
        "runtimeMinutes": "106"
    },
    "2013_315": {
        "plotSummary": "The year is 1755, and the English colonies are being ravaged by the atrocities of war. Opposing European powers have clashed over the fertile Ohio valley, and entire families are devastated by the ensuing violence. Hostile native tribes ...See moreThe year is 1755, and the English colonies are being ravaged by the atrocities of war. Opposing European powers have clashed over the fertile Ohio valley, and entire families are devastated by the ensuing violence. Hostile native tribes are raiding the vulnerable frontier farms, and two young sisters are among those taken captive. While hoping for rescue and return to their home, they are comforted with the words of a family hymn: Alone Yet Not Alone. But when the sisters are suddenly and cruelly separated, their tender faith is brought to a stretching point. Forcibly immersed into a primitive foreign culture, the older sister, Barbara, clings to her beliefs. Yet now a deeper fate threatens, and she makes a difficult decision: to risk her life in an attempt to escape. Pursued by a relentless and cunning warrior, Barbara and her three fellow captives must cross over two hundred miles of raw wilderness in their effort to reach friendly territory. Will their courage and trust in God be enough to see them through? And if they do succeed, will they find their family? Will Barbara ever see her sister again? Alone Yet Not Alone depicts the riveting true story of a family at a critical juncture in our nation's history.  Written by AnonymousSee less",
        "runtimeMinutes": "103"
    },
    "2013_316": {
        "plotSummary": "Four independent stories set in modern China about random acts of violence.",
        "runtimeMinutes": "130"
    },
    "2013_317": {
        "plotSummary": "When two people who no longer believe in love find each other, nothing can get in the way of their blossoming romance - except for a playful farce of miscues, meddling, and mistaken identity.",
        "runtimeMinutes": "97"
    },
    "2013_318": {
        "plotSummary": "Residents of a coastal town learn, with deathly consequences, the secret shared by the two mysterious women who have sought shelter at a local resort.",
        "runtimeMinutes": "118"
    },
    "2013_319": {
        "plotSummary": "In the 16th century in the Cevennes, a horse dealer by the name of Michael Kohlhaas leads a happy family life. When a lord treats him unjustly, he raises an army and puts the country to fire and sword in order to have his rights restored.",
        "runtimeMinutes": "122"
    },
    "2013_32": {
        "plotSummary": "After moving his family back to his hometown to be with his friends and their kids, Lenny finds out that between old bullies, new bullies, schizo bus drivers, drunk cops on skis, and four hundred costumed party crashers sometimes crazy follows you.",
        "runtimeMinutes": "101"
    },
    "2013_320": {
        "plotSummary": "Searching for a missing student, two private investigators break into his house and find collection of VHS tapes. Viewing the horrific contents of each cassette, they realize there may be dark motives behind the student's disappearance. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "2013_321": {
        "plotSummary": "An aristocrat's daughter falls in love with a visiting archaeologist, but he holds a secret that could drive them apart.",
        "runtimeMinutes": "136"
    },
    "2013_322": {
        "plotSummary": "Meet, Prem, and Amar look to have a blast at their college reunion, though they soon find themselves in another predicament.",
        "runtimeMinutes": "137"
    },
    "2013_323": {
        "plotSummary": "A story of a man who fakes his own death and assumes a new identity in order to escape his life, who then moves in with a woman who is also trying to leave her past behind.",
        "runtimeMinutes": "93"
    },
    "2013_324": {
        "plotSummary": "A common man who transforms into a gangster revolts against the very system he once obediently followed by declaring war on the police, the government, and the industrialists.",
        "runtimeMinutes": "138"
    },
    "2013_325": {
        "plotSummary": "A documentary which challenges former Indonesian death-squad leaders to reenact their mass-killings in whichever cinematic genres they wish, including classic Hollywood crime scenarios and lavish musical numbers. Read more: Synopsis",
        "runtimeMinutes": "117"
    },
    "2013_326": {
        "plotSummary": "The rivalry between the manipulative boss of an advertising agency and her talented protegee escalates from stealing credit to public humiliation to murder.",
        "runtimeMinutes": "102"
    },
    "2013_327": {
        "plotSummary": "The first-ever registered encounter by the Mumbai Police, which took place on November 1, 1982. Based on a true story.",
        "runtimeMinutes": "155"
    },
    "2013_328": {
        "plotSummary": "A documentary that celebrates Rick Hall, the founder of FAME Studios in Muscle Shoals, Alabama, and the signature sound he developed in songs such as \"I'll Take You There\", \"Brown Sugar\", and \"When a Man Loves a Woman\".",
        "runtimeMinutes": "111"
    },
    "2013_329": {
        "plotSummary": "Milan and Jonas once were the best friends in the world. Until the day when they had to denounce Serki, a criminal psychopath, to the Mexican police. Six years later Jonas meets up with a devastated Milan: Serki has just been released and ...See moreMilan and Jonas once were the best friends in the world. Until the day when they had to denounce Serki, a criminal psychopath, to the Mexican police. Six years later Jonas meets up with a devastated Milan: Serki has just been released and he is back to Paris seeking vengeance.  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "2013_33": {
        "plotSummary": "A crash landing leaves Kitai Raige and his father Cypher stranded on Earth, a millennium after events forced humanity's escape. With Cypher injured, Kitai must embark on a perilous journey to signal for help.",
        "runtimeMinutes": "100"
    },
    "2013_330": {
        "plotSummary": "Self-centered Sriram Venkat changes his outlook and actions when his girlfriend leaves him.",
        "runtimeMinutes": "150"
    },
    "2013_331": {
        "plotSummary": "A man who stops into a foster home to drop off some donations soon tells the kids a story about two teenage friends who uncover a long-lost medallion that transports them back in time.",
        "runtimeMinutes": "97"
    },
    "2013_332": {
        "plotSummary": "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.",
        "runtimeMinutes": "144"
    },
    "2013_333": {
        "plotSummary": "An aging, out-of-work actress accepts one last job, though the consequences of her decision affect her in ways she didn't consider.",
        "runtimeMinutes": "122"
    },
    "2013_334": {
        "plotSummary": "When Katie innocently accepts an offer to have new photos taken for her portfolio, the experience quickly turns into a nightmare of rape, torture and kidnapping. Now, she will have to find the strength to exact her brutal revenge.",
        "runtimeMinutes": "106"
    },
    "2013_335": {
        "plotSummary": "The retired dentist Caroline attends a class for computer users. Although she is married, she falls in love with her significantly younger lecturer. It turns out he used to visit her surgery because primarily in order to enjoy her view. ...See moreThe retired dentist Caroline attends a class for computer users. Although she is married, she falls in love with her significantly younger lecturer. It turns out he used to visit her surgery because primarily in order to enjoy her view. Her husband finds out about her affair with this admirer.  Written by AnonymousSee less",
        "runtimeMinutes": "94"
    },
    "2013_336": {
        "plotSummary": "Vishwas Rao is raised by his mother who wants him to become a police officer while he wants to become an actor.",
        "runtimeMinutes": "146"
    },
    "2013_337": {
        "plotSummary": "Winter, 1915. Confined by her family to an asylum in the South of France - where she will never sculpt again - the chronicle of Camille Claudel's reclusive life, as she waits for a visit from her brother, Paul Claudel.",
        "runtimeMinutes": "95"
    },
    "2013_338": {
        "plotSummary": "In a war ridden country a woman watches over the husband reduced to a vegetable state by a bullet in the neck, abandoned by Jihad companions and brothers. One day, the woman decides to say things to him she could never have done before.",
        "runtimeMinutes": "102"
    },
    "2013_339": {
        "plotSummary": "Therèse grows up with her aunt and cousin. Around 1860 the aunt decides they move to Paris and that her son and Therèse get married. The joy- and loveless life changes when her husband brings a friend home. The affair turns ugly for all.",
        "runtimeMinutes": "107"
    },
    "2013_34": {
        "plotSummary": "A cropdusting plane with a fear of heights lives his dream of competing in a famous around-the-world aerial race.",
        "runtimeMinutes": "91"
    },
    "2013_340": {
        "plotSummary": "An unprecedented look inside the private world of J.D. Salinger, the reclusive author of The Catcher in the Rye.",
        "runtimeMinutes": "120"
    },
    "2013_341": {
        "plotSummary": "A traveler is confronted by spirits in an abandoned shrine; a story of honor and firefighting in ancient Japan; a white bear defends the royal family from a monstrous red demon; ragtag soldiers battle a robotic force in futuristic Japan.",
        "runtimeMinutes": "68"
    },
    "2013_342": {
        "plotSummary": "A single woman in her 50's devotes her vacations to doing Catholic missionary work in Vienna, descending into violent self-punishment as part of her faith.",
        "runtimeMinutes": "115"
    },
    "2013_343": {
        "plotSummary": "A young Palestinian freedom fighter agrees to work as an informant after he's tricked into an admission of guilt by association in the wake of an Israeli soldier's killing. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2013_344": {
        "plotSummary": "A profile of six pilgrims taking the Camino De Santiago pilgrimage.",
        "runtimeMinutes": "84"
    },
    "2013_345": {
        "plotSummary": "In a post-zombie world, where the infected live normal lives, their retroviral drug is running out.",
        "runtimeMinutes": "98"
    },
    "2013_346": {
        "plotSummary": "A true tale of love, liberty and scandal amongst the Edwardian artists' colony in Cornwall",
        "runtimeMinutes": "100"
    },
    "2013_347": {
        "plotSummary": "A documentary chronicling sports legend Lance Armstrong's improbable rise and ultimate fall from grace.",
        "runtimeMinutes": "124"
    },
    "2013_348": {
        "plotSummary": "After his younger son falls prey to a corrupt police officer, an honest old man summons his estranged elder son to save the day.",
        "runtimeMinutes": "143"
    },
    "2013_349": {
        "plotSummary": "A man and woman are drawn together, entangled in the life cycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the loose fragments of wrecked lives.",
        "runtimeMinutes": "96"
    },
    "2013_35": {
        "plotSummary": "Hansel & Gretel are bounty hunters who track and kill witches all over the world. As the fabled Blood Moon approaches, the siblings encounter a new form of evil that might hold a secret to their past.",
        "runtimeMinutes": "88"
    },
    "2013_350": {
        "plotSummary": "In a Chilean little town, the son of an uprooted couple, formed by a rigorous communist father and a loving but weak mother, tries to pave his own path in a society that does not understand their Jewish-Ukrainian origins.",
        "runtimeMinutes": "133"
    },
    "2013_351": {
        "plotSummary": "A documentary on the fabled recording studio that was located in Van Nuys, California.",
        "runtimeMinutes": "107"
    },
    "2013_352": {
        "plotSummary": "A documentary on the Manhattan department store with interviews from an array of fashion designers, style icons, and celebrities.",
        "runtimeMinutes": "93"
    },
    "2013_353": {
        "plotSummary": "A coming-of-age story about two inner city boys who are left to fend for themselves over the summer after their mothers are taken away by the authorities. Read more: Synopsis",
        "runtimeMinutes": "108"
    },
    "2013_354": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2013_355": {
        "plotSummary": "A man wakes up in the wilderness, in a pit full of dead bodies, with no memory and must determine if the murderer is one of the strangers who rescued him, or if he himself is the killer.",
        "runtimeMinutes": "102"
    },
    "2013_356": {
        "plotSummary": "A farming family's business is threatened by an unexpected crisis, further testing the relationship between a father and his rebellious son.",
        "runtimeMinutes": "105"
    },
    "2013_357": {
        "plotSummary": "When a foreign exchange student arrives in a small upstate New York town, she challenges the dynamics of her host family's relationships and alters their lives forever.",
        "runtimeMinutes": "98"
    },
    "2013_358": {
        "plotSummary": "Inspired by a real-life scandal in which prison inmates are temporarily released from prison to work as contract killers on behalf of politicians and high ranking military officials.",
        "runtimeMinutes": "118"
    },
    "2013_359": {
        "plotSummary": "A safe cracker claims he has lost his memory when two criminals come calling for their cut of the bank heist loot.",
        "runtimeMinutes": "137"
    },
    "2013_36": {
        "plotSummary": "The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the U.S.-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.",
        "runtimeMinutes": "134"
    },
    "2013_360": {
        "plotSummary": "A documentary that details the creation of Julian Assange's controversial website, which facilitated the largest security breach in U.S. history.",
        "runtimeMinutes": "130"
    },
    "2013_361": {
        "plotSummary": "The final installment in Ulrich Seidl's Paradise trilogy, 'Paradise: Hope' tells the story of overweight thirteen-year-old Melanie and her first love. While her mother travels to Kenya ('Paradise: Love') and her aunt does missionary work (...See moreThe final installment in Ulrich Seidl's Paradise trilogy, 'Paradise: Hope' tells the story of overweight thirteen-year-old Melanie and her first love. While her mother travels to Kenya ('Paradise: Love') and her aunt does missionary work ('Paradise: Faith'), Melanie spends her summer vacation at a strict diet camp for overweight adolescents. Between physical education and nutrition counseling, pillow fights and her first cigarette, Melanie falls in love with the camp director, a doctor forty years her senior. As the doctor struggles with the guilty nature of his desire, Melanie had imagined her paradise differently.  Written by AnonymousSee less",
        "runtimeMinutes": "92"
    },
    "2013_362": {
        "plotSummary": "Laos. In a land ravaged by war and exploitation, a boy whose family believe he is cursed must redeem himself by taking part in a dangerous rocket competition.",
        "runtimeMinutes": "100"
    },
    "2013_363": {
        "plotSummary": "While travelling abroad, a guy falls for a Romanian beauty whose unreachable heart has its origins in her violent, charismatic ex.",
        "runtimeMinutes": "103"
    },
    "2013_364": {
        "plotSummary": "Two highway road workers spend the summer of 1988 away from their city lives. The isolated landscape becomes a place of misadventure as the men find themselves at odds with each other and the women they left behind.",
        "runtimeMinutes": "94"
    },
    "2013_365": {
        "plotSummary": "Marco returns to Paris after his brother-in-law's suicide, where he targets the man his sister believes caused the tragedy - though he is ill-prepared for her secrets as they quickly muddy the waters.",
        "runtimeMinutes": "100"
    },
    "2013_366": {
        "plotSummary": "A group of friends, just looking to have a good time in a rave party on a remote island in Goa, find out that the island is infested with Zombies.",
        "runtimeMinutes": "108"
    },
    "2013_367": {
        "plotSummary": "Three struggling room-mates unknowingly become potential prey of a ruthless gangster.",
        "runtimeMinutes": "136"
    },
    "2013_368": {
        "plotSummary": "Investigative journalist Jeremy Scahill is pulled into an unexpected journey as he chases down the hidden truth behind America's expanding covert wars.",
        "runtimeMinutes": "87"
    },
    "2013_369": {
        "plotSummary": "An aimless youth starts working for drug baron and his mission is to kill is rival.",
        "runtimeMinutes": "146"
    },
    "2013_37": {
        "plotSummary": "Tang Sanzang, an aspiring Buddhist hero tries to protect a village from three demons. He develops complex feelings for Miss Duan, the demon hunter who repeatedly helps him, and finally quests to meet the legendary Monkey King.",
        "runtimeMinutes": "110"
    },
    "2013_370": {
        "plotSummary": "Gabrielle is a young woman with Williams syndrome who has a contagious joie de vivre and an exceptional musical gift. Since she met her boyfriend Martin, at the recreation centre where they are choir members, they have been inseparable. ...See moreGabrielle is a young woman with Williams syndrome who has a contagious joie de vivre and an exceptional musical gift. Since she met her boyfriend Martin, at the recreation centre where they are choir members, they have been inseparable. However, because they are \"different,\" their loved ones are fearful of their relationship. As the choir prepares for an important music festival, Gabrielle does everything she can to gain her independence. As determined as she is, Gabrielle must still confront other people's prejudices as well as her own limitations in the hope of experiencing a love far from the \"ordinary\".  Written by micro_scopeSee less",
        "runtimeMinutes": "104"
    },
    "2013_371": {
        "plotSummary": "Luke and Kate are coworkers at a brewery who spend their nights drinking and flirting heavily. One weekend away together with their significant others proves who really belongs together and who doesn't.",
        "runtimeMinutes": "90"
    },
    "2013_372": {
        "plotSummary": "After killing his mentor, a gangster comes into power to rule over Mumbai. In the process he falls for an aspiring actress, nevertheless he finds that his protege has fallen for her too which leads to enmity between them.",
        "runtimeMinutes": "160"
    },
    "2013_373": {
        "plotSummary": "A tax collector willing to reform the society with the thought of change instead of revenge tries to control himself while attempting to teach a lesson to the man responsible behind his wife's death.",
        "runtimeMinutes": "134"
    },
    "2013_374": {
        "plotSummary": "The account of Human Rights lawyer Shahid Azmi, an ordinary citizen with an extraordinary commitment to justice.",
        "runtimeMinutes": "129"
    },
    "2013_375": {
        "plotSummary": "\"Fanny\" is the second part of the \"Marseille trilogy\", made by Marcel Pagnol with the generic name of \"Marius, Fanny and Cesar\". Fanny falls in love and is abandoned by Marius. Now she discovers she is pregnant. Her mother and Marius's ...See more\"Fanny\" is the second part of the \"Marseille trilogy\", made by Marcel Pagnol with the generic name of \"Marius, Fanny and Cesar\". Fanny falls in love and is abandoned by Marius. Now she discovers she is pregnant. Her mother and Marius's father, Cesar, persuade her to accept the romantic advances of a much older man. To save face, Fanny accepts to marry Honore Panisse, a rich merchant of the Vieux Port, 30 years her senior who will recognize her son.  Written by Jim EkasSee less",
        "runtimeMinutes": "102"
    },
    "2013_376": {
        "plotSummary": "Víctor receives an unusual proposal, to carry 7 boxes of unknown content through the Market Number 4 but things get complicated along the way.",
        "runtimeMinutes": "105"
    },
    "2013_377": {
        "plotSummary": "A documentary on the history, mystery, and meaning of the ubiquitous Jewish standard that follows the around-the-world journey of the song from Ukraine to Youtube. of the song \"Hava Nagila.\"",
        "runtimeMinutes": "75"
    },
    "2013_378": {
        "plotSummary": "The birth of modern stand-up comedy began in the Catskill Mountains - a boot camp for the greatest generation of Jewish-American comedians.",
        "runtimeMinutes": "83"
    },
    "2013_379": {
        "plotSummary": "A documentary on Ed Koch, the mayor of New York City from 1978 to 1989.",
        "runtimeMinutes": "100"
    },
    "2013_38": {
        "plotSummary": "While on a tour of the White House with his young daughter, a Capitol policeman springs into action to save his child and protect the president from a heavily armed group of paramilitary invaders.",
        "runtimeMinutes": "131"
    },
    "2013_380": {
        "plotSummary": "A documentary depicting the life and work of the trappers of Bakhtia, a village in the heart of the Siberian Taiga, where daily life has changed little in over a century.",
        "runtimeMinutes": "90"
    },
    "2013_381": {
        "plotSummary": "The life story of basketball sensation, Jeremy Lin.",
        "runtimeMinutes": "89"
    },
    "2013_382": {
        "plotSummary": "10-year-old Eli finds himself at summer camp.",
        "runtimeMinutes": "109"
    },
    "2013_383": {
        "plotSummary": "An English teacher's life is disrupted when a former student returns to her small town after failing as a playwright in New York.",
        "runtimeMinutes": "93"
    },
    "2013_384": {
        "plotSummary": "While on vacation with friends in Hyderabad, India, Caden Welles - a privileged young man with the world at his disposal - takes an unexpected turn in life after initially refusing to help a starving man and his daughter.",
        "runtimeMinutes": "103"
    },
    "2013_385": {
        "plotSummary": "A Canadian doctor finds her sympathies sorely tested while working in the conflict ravaged Palestinian territories.",
        "runtimeMinutes": "102"
    },
    "2013_386": {
        "plotSummary": "In Chile, a group of travelers who are in an underground nightclub when a massive earthquake hits quickly learn that reaching the surface is just the beginning of their nightmare.",
        "runtimeMinutes": "89"
    },
    "2013_387": {
        "plotSummary": "Recovery is OUT - to change the addiction conversation from problems to SOLUTIONS. An independent feature documentary about the over 23 million Americans living in long-term recovery from alcohol and other drug addictions.",
        "runtimeMinutes": "88"
    },
    "2013_388": {
        "plotSummary": "The story of the deadliest day on the world's most dangerous mountain, when 11 climbers mysteriously perished on K2. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2013_389": {
        "plotSummary": "A couple take a vacation to a remote island - their last holiday together before they become parents. Soon after their arrival, they notice that no adults seem to be present - an observation that quickly presents a nightmarish reality.",
        "runtimeMinutes": "105"
    },
    "2013_39": {
        "plotSummary": "In order to restore their dying safe haven, the son of Poseidon and his friends embark on a quest to the Sea of Monsters, to find the mythical Golden Fleece, all the while trying to stop an ancient evil from rising.",
        "runtimeMinutes": "106"
    },
    "2013_390": {
        "plotSummary": "When Christian, an LA trust-fund kid with casual ties to Hollywood, learns of a secret affair between Tara and the lead of his film project, Ryan, he spirals out of control, and his cruel mind games escalate into an act of bloody violence.",
        "runtimeMinutes": "99"
    },
    "2013_391": {
        "plotSummary": "Caught between an overbearing, manic-depressive brother and a father suffering from a neurodegenerative disease that is as funny as it is worrying, Romain no longer accepts to perform the role he has always played: the guy who does what's ...See moreCaught between an overbearing, manic-depressive brother and a father suffering from a neurodegenerative disease that is as funny as it is worrying, Romain no longer accepts to perform the role he has always played: the guy who does what's expected of him without complaining. Now approaching thirty, it is high time that he finally deals with his crazy father, his cynical brother, and his own tendencies to repress his emotions and his feelings, in order to fully assume his normality.  Written by AnonymousSee less",
        "runtimeMinutes": "86"
    },
    "2013_392": {
        "plotSummary": "A look at the relationship between pioneering 19th century French neurologist Dr. Jean-Martin Charcot and his star teenage patient, a kitchen maid who is left partially paralyzed after a seizure.",
        "runtimeMinutes": "102"
    },
    "2013_393": {
        "plotSummary": "After a Soviet space station crashes into a New York City subway tunnel, a species of venomous spiders is discovered, and soon they mutate to gigantic proportions and wreak havoc on the city.",
        "runtimeMinutes": "89"
    },
    "2013_394": {
        "plotSummary": "When a cop's crooked past comes back to get him, can he do the right thing, or will he succumb to the threats of his dangerous connections?",
        "runtimeMinutes": "98"
    },
    "2013_395": {
        "plotSummary": "The real story of ten terrorists, who sail to Mumbai and wage war on the populace for the next 72 hours.",
        "runtimeMinutes": "116"
    },
    "2013_396": {
        "plotSummary": "Twin siblings enduring the harshness of WWII in a village on the Hungarian border hedge their survival on studying and learning from the evil surrounding them.",
        "runtimeMinutes": "112"
    },
    "2013_397": {
        "plotSummary": "Sonny is a collection agent for the Rangeelay Fynance Company. When he repossesses a scooter from Simmi, it's love at first sight. But she is free spirited, spoiled, cynical and does not believe in love. And she is also engaged to Ricky.",
        "runtimeMinutes": "129"
    },
    "2013_398": {
        "plotSummary": "A country romance about the human streak in the horse and the horse in the human. Love and death become interlaced and with immense consequences. The fortunes of the people in the country through the horses' perception.",
        "runtimeMinutes": "81"
    },
    "2013_399": {
        "plotSummary": "The great chateaux of Bordeaux struggle to accommodate the voracious appetite for their rare, expensive wines, which have become a powerful status symbol in booming China.",
        "runtimeMinutes": "75"
    },
    "2013_4": {
        "plotSummary": "The dwarves, along with Bilbo Baggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from Smaug. Bilbo Baggins is in possession of a mysterious and magical ring.",
        "runtimeMinutes": "161"
    },
    "2013_40": {
        "plotSummary": "The ancient war between humans and a race of giants is reignited when Jack, a young farmhand fighting for a kingdom and the love of a princess, opens a gateway between the two worlds.",
        "runtimeMinutes": "114"
    },
    "2013_400": {
        "plotSummary": "A romantic comedy which tells the journey of three restless young people who junk society's syllabus for finding love and decide to follow their heart.",
        "runtimeMinutes": "141"
    },
    "2013_401": {
        "plotSummary": "A documentary that investigates incidents of hunger experienced by millions of Americans, and proposed solutions to the problem.",
        "runtimeMinutes": "84"
    },
    "2013_402": {
        "plotSummary": "In this comedy film, a computer tablet full of the world's most hilariously offensive apps breaks through the borders of political correctness, stirring up cultural anarchy.",
        "runtimeMinutes": "83"
    },
    "2013_403": {
        "plotSummary": "As Jamie travels in Chile, he invites an eccentric woman to join his group's quest to score a fabled hallucinogen, a move that finds him at odds with his new companion, until they drink the magic brew on a beach at the edge of the desert.",
        "runtimeMinutes": "98"
    },
    "2013_404": {
        "plotSummary": "Philosopher Slavoj Zizek examines the hidden themes and existential questions asked by world renowned films.",
        "runtimeMinutes": "136"
    },
    "2013_405": {
        "plotSummary": "A graphic designer's enviable life slides into despair when his girlfriend breaks up with him.",
        "runtimeMinutes": "86"
    },
    "2013_406": {
        "plotSummary": "A cynical American expatriate struggles to decide whether or not he should help his former lover and her fugitive husband escape French Morocco.",
        "runtimeMinutes": "102"
    },
    "2013_407": {
        "plotSummary": "When gifted magician Bobo finds himself assailed by hallucinations and seeks professional help, he learns he's being haunted by a sinister spirit.",
        "runtimeMinutes": "135"
    },
    "2013_408": {
        "plotSummary": "A cave exploration in Ukraine leads to the unearthing of a story of World War II survivors who once found shelter in the same cave.",
        "runtimeMinutes": "83"
    },
    "2013_409": {
        "plotSummary": "This candid New York love story explores the chaotic 40-year marriage of famed boxing painter Ushio Shinohara and his wife, Noriko. Anxious to shed her role as her overbearing husband's assistant, Noriko finds an identity of her own.",
        "runtimeMinutes": "82"
    },
    "2013_41": {
        "plotSummary": "When both he and a colleague are about to lose their job, Walter takes action by embarking on an adventure more extraordinary than anything he could have ever imagined.",
        "runtimeMinutes": "114"
    },
    "2013_410": {
        "plotSummary": "A documentary that chronicles the life of young college professor Angela Davis, and how her social activism implicates her in a botched kidnapping attempt that ends with a shootout, four dead, and her name on the FBI's 10 most wanted list.",
        "runtimeMinutes": "102"
    },
    "2013_411": {
        "plotSummary": "A Muslim detective teams with an American posing as a graduate student to find the man behind a series of deadly terrorist bombings in Indonesia.",
        "runtimeMinutes": "104"
    },
    "2013_412": {
        "plotSummary": "A group of astronaut explorers succumb one by one to a mysterious and terrifying force while collecting specimens on Mars.",
        "runtimeMinutes": "98"
    },
    "2013_413": {
        "plotSummary": "Western frontiers of the USSR, 1942. The region is under German occupation. A man is wrongly accused of collaboration. Desperate to save his dignity, he faces impossible moral choice.",
        "runtimeMinutes": "127"
    },
    "2013_414": {
        "plotSummary": "The paths of four dream-chasing college friends cross with an array of colourful characters, from a tough-talking Punjabi female don to a Jugaad Baaz college watchman. Mayhem ensues.",
        "runtimeMinutes": "139"
    },
    "2013_415": {
        "plotSummary": "Beirut, 1982: a young Palestinian refugee helps an Israeli fighter pilot escape from PLO captivity because he wants to visit his ancestral family home. En route through war-torn Lebanon their relationship develops into a close bond.",
        "runtimeMinutes": "110"
    },
    "2013_416": {
        "plotSummary": "Paolo (Vincenzo Amato), an Italian who drives a Paris tour bus, has just proposed to his true love, the German stewardess, Greta (Nora Tschirner), when the young French beauty, Cecile (Louise Monot) pulls up beside his bus on her bicycle -...See morePaolo (Vincenzo Amato), an Italian who drives a Paris tour bus, has just proposed to his true love, the German stewardess, Greta (Nora Tschirner), when the young French beauty, Cecile (Louise Monot) pulls up beside his bus on her bicycle - and, in short order, Paolo, following some very bad advice from his friend, Derek (Paddy Considine), finds himself with a German fiancee, a French \"wife\", two Australian children who call him \"Papa\", and his life upside-down.  Written by monterey media inc.See less",
        "runtimeMinutes": "101"
    },
    "2013_417": {
        "plotSummary": "Rachel tries to spice up her marriage with a trip to a strip club. She befriends McKenna who gave her a lapdance. She moves in with Rachel's family and becomes a nanny for the son.",
        "runtimeMinutes": "98"
    },
    "2013_418": {
        "plotSummary": "A grown man caught in the crossfire of his parents' 15-year divorce discovers he was unknowingly part of a study on divorced children and is enlisted in a follow-up years later, which wreaks new havoc on his family.",
        "runtimeMinutes": "88"
    },
    "2013_419": {
        "plotSummary": "Three childhood friends set aside their personal issues and reunite for a girls' weekend on a remote island off the coast of Maine. One wrong move turns their weekend getaway into a deadly fight for survival.",
        "runtimeMinutes": "83"
    },
    "2013_42": {
        "plotSummary": "In the antebellum United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery.",
        "runtimeMinutes": "134"
    },
    "2013_420": {
        "plotSummary": "Four sommeliers attempt to pass the prestigious Master Sommelier exam, a test with one of the lowest pass rates in the world. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2013_421": {
        "plotSummary": "In a world of fake castles and anthropomorphic rodents, an epic battle begins when an unemployed father's sanity is challenged by a chance encounter with two underage girls on holiday.",
        "runtimeMinutes": "90"
    },
    "2013_422": {
        "plotSummary": "An Upstate New York family is torn apart during the American Civil War.",
        "runtimeMinutes": "120"
    },
    "2013_423": {
        "plotSummary": "In 1992 Professor Richard Davidson, one of the world's leading neuroscientists, met the Dalai Lama, who encouraged him to apply the same rigorous methods he used to study depression and anxiety to the study of compassion and kindness, ...See moreIn 1992 Professor Richard Davidson, one of the world's leading neuroscientists, met the Dalai Lama, who encouraged him to apply the same rigorous methods he used to study depression and anxiety to the study of compassion and kindness, those qualities cultivated by Tibetan meditation practice. The results of Davidson's studies at the Center for Investigating Healthy Minds at the University of Wisconsin, Madison, are portrayed in Free the Mind as they are applied to treating PTSD in returning Iraqi vets and children with ADHD. The film poses two fundamental questions: What really is consciousness, and how does it manifest in the brain and body? And is it possible to physically change the brain solely through mental practices?  Written by ProductionSee less",
        "runtimeMinutes": "80"
    },
    "2013_424": {
        "plotSummary": "To a growing number of Mexicans and Latinos in the Americas, narco traffickers have become iconic outlaws and the new models of fame and success. They represent a pathway out of the ghetto - a new form of the American Dream, fueled by the ...See moreTo a growing number of Mexicans and Latinos in the Americas, narco traffickers have become iconic outlaws and the new models of fame and success. They represent a pathway out of the ghetto - a new form of the American Dream, fueled by the war on drugs. NARCO CULTURA looks at this explosive phenomenon from within; cycles of addiction to money, drugs and violence that are rapidly gaining strength on both sides of the US/Mexican border.  Written by AnonymousSee less",
        "runtimeMinutes": "103"
    },
    "2013_425": {
        "plotSummary": "A hot-shot fashion and wildlife photographer Vikram gets into a relationship with Nisha. She moves in with him in his palatial house outside of the city. The old world house, made decades ago is as beautiful as it is scary. It holds many ...See moreA hot-shot fashion and wildlife photographer Vikram gets into a relationship with Nisha. She moves in with him in his palatial house outside of the city. The old world house, made decades ago is as beautiful as it is scary. It holds many secrets which Nisha is soon to unearth; of the life of the man who made it and of Vikram, who is dealing with the mysterious disappearance of his former girlfriend Roshni.  Written by FIPSee less",
        "runtimeMinutes": "124"
    },
    "2013_426": {
        "plotSummary": "The Parkers, a reclusive family who follow ancient customs, find their secret existence threatened as a torrential downpour moves into their area, forcing daughters Iris and Rose to assume responsibilities beyond those of a typical family.",
        "runtimeMinutes": "105"
    },
    "2013_427": {
        "plotSummary": "Adenike and Ayodele, a Nigerian couple living in Brooklyn, are having trouble conceiving a child - a problem that defies cultural expectations and leads Adenike to make a shocking decision that could either save or destroy her family. Read more: Synopsis",
        "runtimeMinutes": "107"
    },
    "2013_428": {
        "plotSummary": "An 11-year-old boy gets a crash course in what it means to be a man when he spends a day with the ex-convict uncle he idolizes.",
        "runtimeMinutes": "94"
    },
    "2013_429": {
        "plotSummary": "Ricky Jay is a world-renowned magician, author, historian and actor (often a mischievous presence in the films of David Mamet and Paul Thomas Anderson) -- and a performer who regularly provokes astonishment from even the most jaded ...See moreRicky Jay is a world-renowned magician, author, historian and actor (often a mischievous presence in the films of David Mamet and Paul Thomas Anderson) -- and a performer who regularly provokes astonishment from even the most jaded audiences. Deceptive Practice traces Jay's achievements and influences, from his apprenticeship at age 4 with his grandfather, to such now-forgotten legends as Al Flosso, Slydini, Cardini and his primary mentors, Dai Vernon and Charlie Miller. Featuring rare footage from his 1970s TV appearances (doing 3-card Monte with Steve Martin on The Dinah Shore Show) and told in Jay's inimitable voice, this is a remarkable journey inside the secretive world of magic and the small circle of eccentrics who are its perpetual devotees.  Written by First Run FeaturesSee less",
        "runtimeMinutes": "88"
    },
    "2013_43": {
        "plotSummary": "As Cecil Gaines serves eight presidents during his tenure as a butler at the White House, the civil rights movement, Vietnam, and other major events affect this man's life, family, and American society.",
        "runtimeMinutes": "132"
    },
    "2013_430": {
        "plotSummary": "The untold story of how Southern California drag racers, Don \"The Snake\" Prudhomme and Tom \"The Mongoose\" McEwen combined with corporate giants to change the face of sports and ultimately became the most famous rivalry in racing history.",
        "runtimeMinutes": "102"
    },
    "2013_431": {
        "plotSummary": "As one of the world's best restaurants opens for its final evening, a couple in the midst of a divorce who made their reservation a year ago (before separating) reunite for a once-in-lifetime meal.",
        "runtimeMinutes": "85"
    },
    "2013_432": {
        "plotSummary": "This intimate documentary follows the 12-year journey of two African-American families pursuing the promise of opportunity through the education of their sons.",
        "runtimeMinutes": "135"
    },
    "2013_433": {
        "plotSummary": "A look at the life of activist, musician, and cultural icon Kathleen Hanna, who formed the punk band Bikini Kill and pioneered the \"riot grrrl\" movement of the 1990s.",
        "runtimeMinutes": "81"
    },
    "2013_434": {
        "plotSummary": "A new street drug that sends its users across time and dimensions has one drawback: some people return no longer human. Can two college drop-outs save humanity from this silent, otherworldly invasion?",
        "runtimeMinutes": "99"
    },
    "2013_435": {
        "plotSummary": "A documentary in which Freda Kelly looks back at her career as lifelong secretary for The Beatles.",
        "runtimeMinutes": "86"
    },
    "2013_436": {
        "plotSummary": "A series of interviews featuring linguist, philosopher and activist Noam Chomsky done in hand-drawn animation.",
        "runtimeMinutes": "88"
    },
    "2013_437": {
        "plotSummary": "A 1980s-set story centered around a man vs. machine chess tournament.",
        "runtimeMinutes": "92"
    },
    "2013_438": {
        "plotSummary": "A documentary on the 1970s punk trio Death, and their new-found popularity decades after they disbanded.",
        "runtimeMinutes": "96"
    },
    "2013_439": {
        "plotSummary": "An international crew of astronauts undertakes a privately funded mission to search for life on Jupiter's fourth largest moon.",
        "runtimeMinutes": "97"
    },
    "2013_44": {
        "plotSummary": "Mild mannered businessman Sandy Patterson travels from Denver to Florida to confront the deceptively harmless looking woman who has been living it up after stealing Sandy's identity.",
        "runtimeMinutes": "111"
    },
    "2013_440": {
        "plotSummary": "A documentary about three unique restaurants and their respective owners.",
        "runtimeMinutes": "93"
    },
    "2013_441": {
        "plotSummary": "A gritty, international tale of four separate stories woven together by a common theme: the Rapture.",
        "runtimeMinutes": "90"
    },
    "2013_442": {
        "plotSummary": "A group of Egyptian revolutionaries battle leaders and regimes, risking their lives to build a new society of conscience.",
        "runtimeMinutes": "108"
    },
    "2013_443": {
        "plotSummary": "Each year, 60,000 people from around the globe gather in a dusty windswept Nevada desert to build a temporary city, collaborating on large-scale art and partying for a week before burning a giant effigy in a ritual frenzy. Rooted in ...See moreEach year, 60,000 people from around the globe gather in a dusty windswept Nevada desert to build a temporary city, collaborating on large-scale art and partying for a week before burning a giant effigy in a ritual frenzy. Rooted in principles of self-expression, self-reliance and community effort, Burning Man has grown famous for stirring ordinary people to shed their nine-to-five existence and act on their dreams. Spark takes us behind the curtain with Burning Man organizers and participants, revealing a year of unprecedented challenges and growth. When ideals of a new world based on freedom and inclusion collide with realities of the \"default world,\" we wonder which dreams can survive.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2013_444": {
        "plotSummary": "When their latest work is buffed by a rival crew, two determined graffiti writers embark on an elaborate plan to bomb the ultimate location: the New York Mets' Home Run Apple.",
        "runtimeMinutes": "79"
    },
    "2013_445": {
        "plotSummary": "A young writer tries to impress a girl he meets online with an embellished profile, but he finds himself in a real mess when she falls for him and he has to keep up the act.",
        "runtimeMinutes": "89"
    },
    "2013_446": {
        "plotSummary": "How Divine, aka Harris Glenn Milstead, became John Waters' cinematic muse and an international drag icon.",
        "runtimeMinutes": "90"
    },
    "2013_447": {
        "plotSummary": "A documentary on Levon Helm, a founding member of The Band, at home in Woodstock in the midst of creating his first studio album in 25 years.",
        "runtimeMinutes": "83"
    },
    "2013_448": {
        "plotSummary": "In Havana, Raul dreams of escaping to Miami. Accused of assault, he appeals to Elio to help him reach the forbidden world 90 miles across the ocean. One night, full of hope, they face the biggest challenge of their lives.",
        "runtimeMinutes": "90"
    },
    "2013_449": {
        "plotSummary": "Two teenage assassins accept what they think will be a quick-and-easy job, until an unexpected target throws them off their plan.",
        "runtimeMinutes": "88"
    },
    "2013_45": {
        "plotSummary": "With the 1970s behind them, San Diego's top-rated newsman, Ron Burgundy, returns to take New York City's first twenty-four-hour news channel by storm.",
        "runtimeMinutes": "119"
    },
    "2013_450": {
        "plotSummary": "The world's greatest pinup model and cult icon, Bettie Page, recounts the true story of how her free expression overcame government witch-hunts to help launch America's sexual revolution.",
        "runtimeMinutes": "101"
    },
    "2013_451": {
        "plotSummary": "Big Star: Nothing Can Hurt Me is a feature-length documentary film about the dismal commercial failure, subsequent massive critical acclaim, and enduring legacy of pop music's greatest cult phenomenon, Big Star.",
        "runtimeMinutes": "113"
    },
    "2013_452": {
        "plotSummary": "A veteran police detective becomes a criminal justice teacher and baseball coach at a local high school, leading him to the most important investigation of his life. Inspired by true events.",
        "runtimeMinutes": "101"
    },
    "2013_453": {
        "plotSummary": "A documentary that follows Stevie Nicks as she begins writing and recording her first solo album in nearly a decade.",
        "runtimeMinutes": "112"
    },
    "2013_454": {
        "plotSummary": "Natalie Dessay prepares to take on the role of Violetta in this documentary about the staging of Verdi's masterwork at the Aix-en-Provence Festival in France.",
        "runtimeMinutes": "120"
    },
    "2013_455": {
        "plotSummary": "In order to ruin a western town, a corrupt politician appoints a black Sheriff, who promptly becomes his most formidable adversary.",
        "runtimeMinutes": "93"
    },
    "2013_456": {
        "plotSummary": "Follow one man's 11,000 mile, 40 day journey across the American landscape to visit twenty families and individuals affected by autism while searching for answers for his own son. With interviews from around the nation that include the ...See moreFollow one man's 11,000 mile, 40 day journey across the American landscape to visit twenty families and individuals affected by autism while searching for answers for his own son. With interviews from around the nation that include the widest spectrum of backgrounds - each conducted in the participants' original language - the film weaves a broad and compelling tapestry across the spectrum of American life in all its faiths, disparities, colors, and cultures. What he learns along the way will change not only his life, but the lives of those he meets, forever. It's a story about the best days that still lie ahead for our nation, the families, and the people who give America its heart.  Written by AnonymousSee less",
        "runtimeMinutes": "93"
    },
    "2013_457": {
        "plotSummary": "Krishna Das is on a journey to India to discover legendary spiritual teacher Neem Karoli Baba, through drug addiction and depression, to his eventual emergence as a world-famous Kirtan singer.",
        "runtimeMinutes": "74"
    },
    "2013_458": {
        "plotSummary": "Set in the Georgian capital of Tbilisi in 1992. Friends Eka and Natia look to leave childhood behind as they ignore societal customs and work to escape their turbulent family lives.",
        "runtimeMinutes": "102"
    },
    "2013_459": {
        "plotSummary": "Amid the Civil War in 17th-century England, a group of deserters flee from battle through an overgrown field. Captured by an alchemist, the men are forced to help him search to find a hidden treasure that he believes is buried in the field.",
        "runtimeMinutes": "90"
    },
    "2013_46": {
        "plotSummary": "Secret Service agent Mike Banning finds himself trapped inside the White House in the wake of a terrorist attack and works with national security to rescue the President from his kidnappers.",
        "runtimeMinutes": "119"
    },
    "2013_460": {
        "plotSummary": "A documentary shot in the North Atlantic and focused on the commercial fishing industry. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2013_461": {
        "plotSummary": "A silent film production company and cast make a difficult transition to sound.",
        "runtimeMinutes": "103"
    },
    "2013_462": {
        "plotSummary": "An abandoned boy is lured to America and drawn into the shadow of a dangerous father figure. Inspired by the real-life events that led to the 2002 Beltway sniper attacks.",
        "runtimeMinutes": "93"
    },
    "2013_463": {
        "plotSummary": "A married man begins to question his sexual orientation as he and his wife consider having another child.",
        "runtimeMinutes": "104"
    },
    "2013_464": {
        "plotSummary": "When eighteen-year-old Brendan King attempts to leave his turbulent gang life behind him, his past continues to threaten his new-found faith, family, and future.",
        "runtimeMinutes": "108"
    },
    "2013_465": {
        "plotSummary": "A comedy about a man, his best friend, and the woman they both adore watching their lives fly by.",
        "runtimeMinutes": "76"
    },
    "2013_466": {
        "plotSummary": "A romantic comedy centered on a gentile who pretends to be Jewish in order to win the affection of his love interest.",
        "runtimeMinutes": "90"
    },
    "2013_467": {
        "plotSummary": "Nearly 100 years after its creation, the power of the U.S. Federal Reserve has never been greater. Markets and governments around the world hold their breath in anticipation of the Fed Chairman's every word. Yet the average person knows ...See moreNearly 100 years after its creation, the power of the U.S. Federal Reserve has never been greater. Markets and governments around the world hold their breath in anticipation of the Fed Chairman's every word. Yet the average person knows very little about the most powerful - and least understood - financial institution on earth. Narrated by Liev Schreiber, Money For Nothing is the first film to take viewers inside the Fed and reveal the impact of Fed policies - past, present, and future - on our lives. Join current and former Fed officials as they debate the critics, and each other, about the decisions that helped lead the global financial system to the brink of collapse in 2008. And why we might be headed there again.  Written by AnonymousSee less",
        "runtimeMinutes": "104"
    },
    "2013_468": {
        "plotSummary": "Based on real characters and events, this drama focuses on the personal sacrifice of a Prague history student, Jan Palach, who set himself on fire in protest against the Soviet occupation of Czechoslovakia in 1969. Dagmar Buresová, a young...See moreBased on real characters and events, this drama focuses on the personal sacrifice of a Prague history student, Jan Palach, who set himself on fire in protest against the Soviet occupation of Czechoslovakia in 1969. Dagmar Buresová, a young female lawyer, became part of his legacy by defending Jan's family in a trial against the communist government, a regime which tried to dishonor Palach's sacrifice, a heroic action for the freedom of Czechoslovakia.  Written by HBO EuropeSee less",
        "runtimeMinutes": "231"
    },
    "2013_469": {
        "plotSummary": "A drama that chronicles the life of Winnie Mandela from her childhood through her marriage and her husband's incarceration.",
        "runtimeMinutes": "104"
    },
    "2013_47": {
        "plotSummary": "The Lamberts believe that they have defeated the spirits that have haunted their family, but they soon discover that evil is not beaten so easily.",
        "runtimeMinutes": "106"
    },
    "2013_470": {
        "plotSummary": "Ram falls in love with Sona, who lives on the fields of Punjab. He follows her to her farm, where her elder brother challenges him to produce more seed on their fields. If he wins, he will be allowed to marry her.",
        "runtimeMinutes": "148"
    },
    "2013_471": {
        "plotSummary": "Kingship knows no Kinship and there can be only one Emperor in Aurangzeb's world. In Gurgaon, to bring down a criminal the law has to think like one.",
        "runtimeMinutes": "137"
    },
    "2013_472": {
        "plotSummary": "Alabama; 1969: The death of a clan's estranged wife and mother brings together two very different families. Do the scars of the past hide differences that will tear them apart, or expose truths that could lead to unexpected collisions?",
        "runtimeMinutes": "122"
    },
    "2013_473": {
        "plotSummary": "After a blow to the head, Abby decides she can't do it anymore. Her life just can't be only about the house, the kids and the wife. She needs more: she needs to be Eleanor.",
        "runtimeMinutes": "96"
    },
    "2013_474": {
        "plotSummary": "A couple is drawn into a game show with a whooping winning prize. However the game turns into more than a survival for them with no escape.",
        "runtimeMinutes": "108"
    },
    "2013_475": {
        "plotSummary": "A documentary focused on former Vogue Paris editor-in-chief and fashion stylist Carine Roitfeld as she moves to New York to launch her own magazine.",
        "runtimeMinutes": "93"
    },
    "2013_476": {
        "plotSummary": "Four friends lose themselves in a carefree South-East Asian holiday. Only three come back. Dave and Alice return home to their young family desperate for answers about Jeremy's mysterious disappearance. When Alice's sister Steph returns ...See moreFour friends lose themselves in a carefree South-East Asian holiday. Only three come back. Dave and Alice return home to their young family desperate for answers about Jeremy's mysterious disappearance. When Alice's sister Steph returns not long after, a nasty secret is revealed about the night her boyfriend went missing. But it is only the first of many. Who amongst them knows what happened on that fateful night when they were dancing under a full moon in Cambodia?  Written by ProductionSee less",
        "runtimeMinutes": "89"
    },
    "2013_477": {
        "plotSummary": "Norway, WWII: A group of British and German soldiers find themselves stranded in the wilderness after an aircraft battle. Finding shelter in the same cabin, they realize the only way to survive the winter is to place the rules of war aside.",
        "runtimeMinutes": "104"
    },
    "2013_478": {
        "plotSummary": "After the assassination of Dr. George Tiller in Kansas in 2009, there are a limited number of doctors left in the country who provide third-trimester abortions for women. AFTER TILLER moves between the rapidly unfolding stories of these ...See moreAfter the assassination of Dr. George Tiller in Kansas in 2009, there are a limited number of doctors left in the country who provide third-trimester abortions for women. AFTER TILLER moves between the rapidly unfolding stories of these doctors, all of whom were close colleagues of Dr. Tiller, and are fighting to keep this service available in the wake of his death. These four people have become the new number-one targets of the pro-life movement, yet continue to risk their lives every day to do work that many believe is murder, but which they believe is profoundly important for their patients' lives. AFTER TILLER shows them confronting harassment from protesters, challenges in their personal lives, and a series of tough ethical decisions.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2013_479": {
        "plotSummary": "An artist's shortsighted film about a failed relationship is reedited into a more collaborative, more inclusive work of art.",
        "runtimeMinutes": "84"
    },
    "2013_48": {
        "plotSummary": "Marcus Luttrell and his team set out on a mission to capture or kill notorious Taliban leader Ahmad Shah, in late June 2005. Marcus and his team are left to fight for their lives in one of the most valiant efforts of modern warfare.",
        "runtimeMinutes": "121"
    },
    "2013_480": {
        "plotSummary": "Based on the classic novel by William Faulkner, first published in 1930, \"As I Lay Dying\" is the story of the death of Addie Bundren and her family's quest to honor her last wish to be buried in the nearby town of Jefferson.",
        "runtimeMinutes": "110"
    },
    "2013_481": {
        "plotSummary": "Hated and betrayed by his brothers, Brady Gray is forced off the family ranch and must start a new life in Dallas. With a good job and a promising romance, better days seem to lay ahead until Brady is framed for a crime he doesn't commit.",
        "runtimeMinutes": "90"
    },
    "2013_482": {
        "plotSummary": "Fontayne is enlisted by Bernice - her estranged old friend and current parole officer - along with a disgraced cop to search for Bernice's son, who went missing on the Mexican border. Read more: Synopsis",
        "runtimeMinutes": "123"
    },
    "2013_483": {
        "plotSummary": "Surviving family members and friends of a man who was conned by the cunning businessman Sabbarwahl string together a series of their own cons in an attempt to bring him down.",
        "runtimeMinutes": "107"
    },
    "2013_484": {
        "plotSummary": "14-year-old Laura Dekker sets out on a two-year voyage in pursuit of her dream to become the youngest person ever to sail around the world alone. Read more: Synopsis",
        "runtimeMinutes": "82"
    },
    "2013_485": {
        "plotSummary": "A feature-length documentary about the history and future of nuclear power. The film explores how and why mankind's most feared and controversial technological discovery is now passionately embraced by many of those who once led the charge...See moreA feature-length documentary about the history and future of nuclear power. The film explores how and why mankind's most feared and controversial technological discovery is now passionately embraced by many of those who once led the charge against it. Operating as history, cultural meditation and contemporary exploration, PANDORA'S PROMISE aims to inspire a serious and realistic debate over what is without question the most important question of our time: how do we continue to power modern civilization without destroying it?  Written by RSSee less",
        "runtimeMinutes": "87"
    },
    "2013_486": {
        "plotSummary": "A drama centered on the love affair between two men on opposite sides of the Mid-East conflict: Palestinian student Nimer and Roy, an Israeli lawyer.",
        "runtimeMinutes": "96"
    },
    "2013_487": {
        "plotSummary": "A team of experts dispatched to bring in The Most Wanted Man in India almost achieve the unthinkable ... until something goes horribly wrong.",
        "runtimeMinutes": "153"
    },
    "2013_488": {
        "plotSummary": "A history of the conflict of the City of Philadelphia and the Black Liberation organization, MOVE, that led to the disastrously violent final confrontation in 1985.",
        "runtimeMinutes": "88"
    },
    "2013_489": {
        "plotSummary": "A place: Theresienstadt. A unique place of propaganda which Adolf Eichmann called the \"model ghetto\", designed to mislead the world and Jewish people regarding its real nature, to be the last step before the gas chamber. A man: Benjamin ...See moreA place: Theresienstadt. A unique place of propaganda which Adolf Eichmann called the \"model ghetto\", designed to mislead the world and Jewish people regarding its real nature, to be the last step before the gas chamber. A man: Benjamin Murmelstein, last president of the Theresienstadt Jewish Council, a fallen hero condemned to exile, who was forced to negotiate day after day from 1938 until the end of the war with Eichmann, to whose trial Murmelstein wasn't even called to testify. Even though he was without a doubt the one who knew the Nazi executioner best. More than twenty-five years after Shoah, Claude Lanzmann's new film reveals a little-known yet fundamental aspect of the Holocaust, and sheds light on the origins of the \"Final Solution\" like never before.  Written by SynecdocheSee less",
        "runtimeMinutes": "220"
    },
    "2013_49": {
        "plotSummary": "86-year-old Irving Zisman takes a trip from Nebraska to North Carolina to take his 8 year-old grandson, Billy, back to his real father.",
        "runtimeMinutes": "92"
    },
    "2013_490": {
        "plotSummary": "As Ishaan, a music producer who has commitment issues with the women in his life, feels a connection with Gauri, his next-door neighbor, he begins to learn the importance of relationships.",
        "runtimeMinutes": "108"
    },
    "2013_491": {
        "plotSummary": "A documentary on Arnel Pineda, who was plucked from YouTube to become the new singer for the rock & roll band, Journey.",
        "runtimeMinutes": "113"
    },
    "2013_492": {
        "plotSummary": "A puritan Police Sergeant arrives in a Scottish island village in search of a missing girl who the locals claim never existed.",
        "runtimeMinutes": "88"
    },
    "2013_493": {
        "plotSummary": "Four couples meet for Sunday brunch only to discover they are stuck in a house together as the world may be about to end.",
        "runtimeMinutes": "88"
    },
    "2013_494": {
        "plotSummary": "A remarkable group of Rwandan women defies the devastation of the genocide to form the country's first all-female drumming troupe and open the country's first ice cream shop.",
        "runtimeMinutes": "89"
    },
    "2013_495": {
        "plotSummary": "The legal battles of the great American boxer against being conscripted into the US military during the Vietnam War.",
        "runtimeMinutes": "86"
    },
    "2013_496": {
        "plotSummary": "A despairing scholar sells his soul to Satan in exchange for one night with a beautiful young woman.",
        "runtimeMinutes": "140"
    },
    "2013_497": {
        "plotSummary": "A documentary that exposes what corporations and governments learn about people through Internet and cell phone usage, and what can be done about it ... if anything.",
        "runtimeMinutes": "79"
    },
    "2013_498": {
        "plotSummary": "A cocky young man travels to Oregon to work on an apple farm. Out of his element, he finds his lifestyle and notions being picked apart by everyone who crosses his path.",
        "runtimeMinutes": "88"
    },
    "2013_499": {
        "plotSummary": "Chris Marker and Pierre Lhomme's LE JOLI MAI (The Lovely Month of May) is a portrait of Paris and Parisians during May 1962;the first springtime of peace after the ceasefire with Algeria and the first time in 23 years that France was not ...See moreChris Marker and Pierre Lhomme's LE JOLI MAI (The Lovely Month of May) is a portrait of Paris and Parisians during May 1962;the first springtime of peace after the ceasefire with Algeria and the first time in 23 years that France was not involved in any war.  Written by AnonymousSee less",
        "runtimeMinutes": "165"
    },
    "2013_5": {
        "plotSummary": "Katniss Everdeen and Peeta Mellark become targets of the Capitol after their victory in the 74th Hunger Games sparks a rebellion in the Districts of Panem.",
        "runtimeMinutes": "146"
    },
    "2013_50": {
        "plotSummary": "A band of samurai set out to avenge the death and dishonor of their master at the hands of a ruthless shogun.",
        "runtimeMinutes": "128"
    },
    "2013_500": {
        "plotSummary": "Four friends from the rough side of town grow apart when two are consumed by a life of crime, and the other two become FBI agents sent deep undercover - to bring down those childhood friends.",
        "runtimeMinutes": "112"
    },
    "2013_501": {
        "plotSummary": "The impossible triumph of Team Rwanda.",
        "runtimeMinutes": "82"
    },
    "2013_502": {
        "plotSummary": "A film about the life and relationships of the early 20th century American educator, editor, and journalist Leonie Gilmour, the mother of the acclaimed artist and architect Isamu Noguchi. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2013_503": {
        "plotSummary": "Once a vibrant part of American culture, drive-ins reached their peak in the late 50s with almost 5,000 dotting the nation. Although drive-ins are experiencing a resurgence, today less than 400 remain. In a nation that loves cars and ...See moreOnce a vibrant part of American culture, drive-ins reached their peak in the late 50s with almost 5,000 dotting the nation. Although drive-ins are experiencing a resurgence, today less than 400 remain. In a nation that loves cars and movies, why haven't they survived?  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2013_504": {
        "plotSummary": "Ever since Venus and Serena Williams started playing in tennis tournaments, they've provoked strong reactions - from awe and admiration to suspicion and resentment. They've been winning championships for over a decade, pushing the limits ...See moreEver since Venus and Serena Williams started playing in tennis tournaments, they've provoked strong reactions - from awe and admiration to suspicion and resentment. They've been winning championships for over a decade, pushing the limits of longevity in such a demanding sport. How long can they last? In Venus & Serena, we gain unprecedented access into their lives during the most intimidating year of their career. Over the course of 2011, Venus grappled with an energy-sapping autoimmune disease while Serena battled back from a life-threatening pulmonary embolism. Neither Venus nor Serena let their adversities hold them back. They drew their greatest strength from each other.  Written by Michelle MajorSee less",
        "runtimeMinutes": "99"
    },
    "2013_505": {
        "plotSummary": "An account of the American Evangelicals' attempts to indoctrinate their Christian Right beliefs in Uganda.",
        "runtimeMinutes": "83"
    },
    "2013_506": {
        "plotSummary": "An Arab immigrant wins the American green card lottery, arriving in New York City on September 10, 2001.",
        "runtimeMinutes": "99"
    },
    "2013_507": {
        "plotSummary": "After a shaky first heist, a group of thieves plan an even more elaborate- and more risky- second heist.",
        "runtimeMinutes": "98"
    },
    "2013_508": {
        "plotSummary": "Today in the United States, by the simple acts of feeding ourselves, we are unwittingly participating in the largest experiment ever conducted on human beings. Each of us unknowingly consumes genetically engineered food on a daily basis. ...See moreToday in the United States, by the simple acts of feeding ourselves, we are unwittingly participating in the largest experiment ever conducted on human beings. Each of us unknowingly consumes genetically engineered food on a daily basis. The risks and effects to our health and the environment are largely unknown. Yet more and more studies are being conducted around the world, which only provide even more reason for concern. We are the oblivious guinea pigs for wide-scale experimentation of modern biotechnology. GMO OMG tells the story of a fathers discovery of GMOs in relationship to his 3 young children and the world around him. We still have time to heal the planet, feed the world, and live sustainably. But we have to start now!  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2013_509": {
        "plotSummary": "American Made Movie looks back on the glory days of U.S. manufacturing when there was a more balanced relationship between the goods produced and consumed, and illustrates how technology and globalization have changed the competitive ...See moreAmerican Made Movie looks back on the glory days of U.S. manufacturing when there was a more balanced relationship between the goods produced and consumed, and illustrates how technology and globalization have changed the competitive landscape for companies doing business in America, as well as overseas. By illustrating the successes of companies and entrepreneurs that, of their own accord, have prospered without adopting the practices of their competitors, American Made Movie shows the positive impact these jobs can have on national and local economies in the face of great challenges.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "2013_51": {
        "plotSummary": "Retired CIA agent Frank Moses reunites his unlikely team of elite operatives for a global quest to track down a missing portable nuclear device.",
        "runtimeMinutes": "116"
    },
    "2013_510": {
        "plotSummary": "Screenwriter Paul Javal's marriage to his wife Camille disintegrates during movie production as she spends time with the producer. Layered conflicts between art and business ensue.",
        "runtimeMinutes": "103"
    },
    "2013_511": {
        "plotSummary": "As a deadly virus which infects people who have loveless sex sweeps Paris, a lonely pariah attempts to steal a potent antidote, only to fall for the mistress of his partner-in-crime. Is the infectious young love the cure to the bad blood?",
        "runtimeMinutes": "116"
    },
    "2013_512": {
        "plotSummary": "An exploration of the life and work of the groundbreaking director, actor, artist, and raconteur.",
        "runtimeMinutes": "108"
    },
    "2013_513": {
        "plotSummary": "After narrowly escaping with her life at the hands of her mentally ill sister Veronica, Monica, with the help of her Mother, Marion, has taken great measures to ensure her safety, including changing her face and relocating to the South. ...See moreAfter narrowly escaping with her life at the hands of her mentally ill sister Veronica, Monica, with the help of her Mother, Marion, has taken great measures to ensure her safety, including changing her face and relocating to the South. Six years has past and now she finally believes she is safe from Veronica. Little does she know that death and betrayal still await her and her friends on the eve of her wedding at a southern plantation house rumored to be haunted by 13 murdered slaves. This time no one is safe and everyone is a suspect as killing becomes addictive.  Written by AnnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2013_514": {
        "plotSummary": "When a male neurotic best-selling author on love finds his fiancÃ© with another man, he's sent into a tailspin reflecting on his numerous romantic failures only to find hope again with a quirky antiquarian bookseller",
        "runtimeMinutes": "100"
    },
    "2013_515": {
        "plotSummary": "Almost fifty years ago, when she was very young and unknown, Mercedes Sosa broke the mould by drafting, together with other four young artists, the so-called \"Manifesto del Nuevo Cancionero\" (The New songbook Manifesto). How did this ...See moreAlmost fifty years ago, when she was very young and unknown, Mercedes Sosa broke the mould by drafting, together with other four young artists, the so-called \"Manifesto del Nuevo Cancionero\" (The New songbook Manifesto). How did this manifesto make an impact on the next generations? How much did the \"Nuevo Cancionero\" influence the development of the \"Nueva Trova Cubana\"? How did this ideology affect the politics of both emerging and developed countries? Apart from the millions of records she sold, the thousands of concerts she made all over the world, her countless fans and detractors, Mercedes Sosa left behind an indelible legacy, an ideal that has not become a reality yet but which keeps pushing forward. \"Mercedes Sosa, The Voice of Latin America\" is a deep intimate journey into Mercedes Sosa's world, not only as an artist but as human being. An autobiography through her own voice. She will guide us through her life, her successes and failures, her love stories and all her suffering. With never seen before achieve, an artistic construction and several international artists giving their testimony about Mercedes Sosa's importance for Latin America political and musical history, this documentary will show the ideology of an artists who went beyond the borders of music , to become in one of the most influential personalities of the 20th century.  Written by Cinema 7 FilmsSee less",
        "runtimeMinutes": "90"
    },
    "2013_516": {
        "plotSummary": "A look at the New York City punk-rock scene and the venerable nightclub, CBGB.",
        "runtimeMinutes": "102"
    },
    "2013_517": {
        "plotSummary": "The best 7 year old golfers from around the world descend on the world famous Pinehurst Golf course in North Carolina to determine the next world champion and who might become golf's next phenomenon. Most of these young prodigies have been...See moreThe best 7 year old golfers from around the world descend on the world famous Pinehurst Golf course in North Carolina to determine the next world champion and who might become golf's next phenomenon. Most of these young prodigies have been holding clubs since before they could walk and are better by the time they are six than most people will be in their lifetime. This is the breeding ground for the PGA and the stakes are huge. The short game follows 9 young golfers vying for the title of 'world champion'.  Written by AnonymousSee less",
        "runtimeMinutes": "99"
    },
    "2013_518": {
        "plotSummary": "A documentary that reveals the untold story of apartheid's fall, and the mysterious French businessman who was instrumental in Nelson Mandela's release from jail.",
        "runtimeMinutes": "84"
    },
    "2013_519": {
        "plotSummary": "Ten easy steps show you how to make money from drugs, featuring a series of interviews with drug dealers, prison employees, and lobbyists arguing for tougher drug laws.",
        "runtimeMinutes": "96"
    },
    "2013_52": {
        "plotSummary": "After a young couple take in their two nieces, they suspect that a supernatural spirit named Mama has latched onto their family.",
        "runtimeMinutes": "100"
    },
    "2013_520": {
        "plotSummary": "A runaway seeks refuge with her aunt and uncle in Baltimore and finds their marriage ending and her cousin in crisis. In the days that follow, the family struggles to let go of the past while searching for new things to hold onto.",
        "runtimeMinutes": "89"
    },
    "2013_521": {
        "plotSummary": "A follow up to the documentary Herb & Dorothy, that captures an ordinary couple's extraordinary gift of art to the nation as they close the door on their life as collectors.",
        "runtimeMinutes": "87"
    },
    "2013_522": {
        "plotSummary": "A member of an Israeli anti-terrorist unit clashes with a group of young radicals.",
        "runtimeMinutes": "105"
    },
    "2013_523": {
        "plotSummary": "A 19th century French aristocrat, notorious for his scathing memoirs about life in Russia, travels through the Russian State Hermitage Museum and encounters historical figures from the last 200+ years.",
        "runtimeMinutes": "99"
    },
    "2013_524": {
        "plotSummary": "The film chronicles the life and revolutionary times of the former death row inmate Mumia Abu-Jamal.",
        "runtimeMinutes": "120"
    },
    "2013_525": {
        "plotSummary": "A recounting of Jack Kerouac's three sojourns to the cabin in Big Sur owned by his friend, poet Lawrence Ferlinghetti.",
        "runtimeMinutes": "81"
    },
    "2013_526": {
        "plotSummary": "Drama about the friendship between an Oxford-educated Southerner and a former black slave in turn-of-the-century Savannah.",
        "runtimeMinutes": "101"
    },
    "2013_527": {
        "plotSummary": "Upper-class Tony hires servant Hugo Barrett, who turns out to have a hidden agenda.",
        "runtimeMinutes": "116"
    },
    "2013_528": {
        "plotSummary": "A massage therapist is unable to do her job when stricken with a mysterious and sudden aversion to bodily contact. Meanwhile, her uptight brother's floundering dental practice receives new life when clients seek out his healing touch.",
        "runtimeMinutes": "88"
    },
    "2013_529": {
        "plotSummary": "Far Out Isn't Far Enough: The Tomi Ungerer Story depicts one man's wild, lifelong adventure of testing societal boundaries through his use of subversive art. This 98-minute film combines traditional documentary storytelling with original ...See moreFar Out Isn't Far Enough: The Tomi Ungerer Story depicts one man's wild, lifelong adventure of testing societal boundaries through his use of subversive art. This 98-minute film combines traditional documentary storytelling with original animation from over 70 years worth of art from the renegade children's book author and illustrator. Using a historical palette of 20th century events to paint an artist's epic yet controversial life story, this HD documentary film offers a feature-length retrospective of Ungerer's life and art, pondering the complexities and contradictions of a man who, armed with an acerbic wit, an accusing finger and a razor sharp pencil, gave visual representation to the revolutionary voices during one of the most tantalizing and dramatic periods in American history. Far Out Isn't Far Enough explores the circumstances of his meteoric rise and fall on American soil, but also delves into Ungerer's formative years leading up to, and prolific years since, his time in America.  Written by ProducerSee less",
        "runtimeMinutes": "98"
    },
    "2013_53": {
        "plotSummary": "When a structural-security authority finds himself set up and incarcerated in the world's most secret and secure prison, he has to use his skills to escape with help from the inside.",
        "runtimeMinutes": "115"
    },
    "2013_530": {
        "plotSummary": "When the police in a German city are unable to catch a child-murderer, other criminals join in the manhunt.",
        "runtimeMinutes": "117"
    },
    "2013_531": {
        "plotSummary": "Set in rural Ohio, the birthplace of football, a small-town high school football team rises to play their cross-town rival, a perennial powerhouse, while standing up for an entire community.",
        "runtimeMinutes": "102"
    },
    "2013_532": {
        "plotSummary": "A young Texan mother who loses her child to foster care begins smuggling Mexicans across the border.",
        "runtimeMinutes": "95"
    },
    "2013_533": {
        "plotSummary": "Two women get on the highway heading to Santa Fe. Marilyn dreams of winning a contest held by a famous belly dancing company, while her friend, Mona, has a secret: she's a fugitive from justice - accused of her mother-in-law's death.",
        "runtimeMinutes": "87"
    },
    "2013_534": {
        "plotSummary": "\"Bert Stern: Original Mad Man\" is the definitive voyage into the life and work of one of America's most influential photographers. Photographing the world's most alluring women in fashion and Hollywood for the past 50 years -- Marilyn ...See more\"Bert Stern: Original Mad Man\" is the definitive voyage into the life and work of one of America's most influential photographers. Photographing the world's most alluring women in fashion and Hollywood for the past 50 years -- Marilyn Monroe, Elizabeth Taylor and Audrey Hepburn among them -- minted Stern as a celebrity in his own right.See less",
        "runtimeMinutes": "89"
    },
    "2013_535": {
        "plotSummary": "'Running from Crazy' is a documentary examining the personal journey of model and actress Mariel Hemingway, the great granddaughter of Ernest Hemingway, as she strives for a greater understanding of her family history of suicide and mental...See more'Running from Crazy' is a documentary examining the personal journey of model and actress Mariel Hemingway, the great granddaughter of Ernest Hemingway, as she strives for a greater understanding of her family history of suicide and mental illness. Through stunning archival footage of the three Hemingway sisters and intimate verite moments with Mariel herself, the film examines the remarkable though often heartbreaking Hemingway legacy. As Mariel comes to terms with the tragedies of her family's past that have shaped the course of her life, deeply hidden secrets are revealed and truths emerge. Through it all, Mariel finds a way to overcome a similar fate for herself and her daughters, brings awareness to an issue she's deeply passionate about, and discovers an inner strength and peace.  Written by AnonymousSee less",
        "runtimeMinutes": "100"
    },
    "2013_536": {
        "plotSummary": "Dislecksia: The Movie, dyslexic director Harvey Hubbell V and crew explore Hubbell's own experiences about growing up as a dyslexic while also looking into the latest scientific research and educational developments regarding the condition...See moreDislecksia: The Movie, dyslexic director Harvey Hubbell V and crew explore Hubbell's own experiences about growing up as a dyslexic while also looking into the latest scientific research and educational developments regarding the condition. They examine how the education system in the US handles students with learning disabilities, and explore ways in which this treatment can be changed to improve the social status of dyslexics. And along the way, they meet a variety of dyslexics from very different backgrounds who share their experiences and demonstrate that dyslexics are not disabled - just different.  Written by AnonymousSee less",
        "runtimeMinutes": "83"
    },
    "2013_537": {
        "plotSummary": "The University of California at Berkeley, the oldest and most prestigious member of a ten campus public education system, is also one of the finest research and teaching facilities in the world. The film, At Berkeley, shows the major ...See moreThe University of California at Berkeley, the oldest and most prestigious member of a ten campus public education system, is also one of the finest research and teaching facilities in the world. The film, At Berkeley, shows the major aspects of university life, its intellectual and social mission, its obligation to the state and to larger ideas of higher education, as well as illustrates how decisions are made and implemented by the administration in collaboration with its various constituencies.  Written by Zipporah FilmsSee less",
        "runtimeMinutes": "244"
    },
    "2013_538": {
        "plotSummary": "A twist of fate brings the national spotlight to a forgotten Texas town, and a once famous preacher has an opportunity to regain his former glory or seize one last chance to restore his fractured family.See moreA twist of fate brings the national spotlight to a forgotten Texas town, and a once famous preacher has an opportunity to regain his former glory or seize one last chance to restore his fractured family.  Written by Andrew LibrizziSee less",
        "runtimeMinutes": "119"
    },
    "2013_539": {
        "plotSummary": "A poor runaway boy and a reluctant ambulance driver in Karachi. Their two lives come together through a dying humanitarian upon whom so much of their daily lives depend.",
        "runtimeMinutes": "71"
    },
    "2013_54": {
        "plotSummary": "Two hardened criminals get into trouble with the US border patrol after meeting with a Mexican drug lord, and then revelations start to unfold.",
        "runtimeMinutes": "109"
    },
    "2013_540": {
        "plotSummary": "The story of Kevin Laue striving to be the first one-armed basketball player ever to receive a scholarship and play on an elite NCAA Division 1 basketball team.",
        "runtimeMinutes": "93"
    },
    "2013_541": {
        "plotSummary": "An exploration of the environmental movement - grassroots and global activism spanning fifty years from conservation to climate change.",
        "runtimeMinutes": "101"
    },
    "2013_542": {
        "plotSummary": "A western set on the New Mexico frontier a few years after the Civil War and centered on a struggling young family and the mining company who wants to buy their land.",
        "runtimeMinutes": "93"
    },
    "2013_543": {
        "plotSummary": "A young boy fears that he shot his older brother, who is only faking. He then runs away to Coney Island, a crowded beach area, and gets money by returning soda bottles for their deposits.",
        "runtimeMinutes": "80"
    },
    "2013_544": {
        "plotSummary": "An ode to rural France and the simple joys of life, Dominique Benicheti's glorious masterpiece COUSIN JULES captures the daily routine and rituals of Jules, a blacksmith, living with his wife, Felice, on a small farm in the French countryside.",
        "runtimeMinutes": "91"
    },
    "2013_545": {
        "plotSummary": "An intricate tale of \"medicine, monopoly and malice\", FIRE IN THE BLOOD tells the story of how Western pharmaceutical companies and governments blocked access to low-cost AIDS drugs for the countries of the global south in the years after ...See moreAn intricate tale of \"medicine, monopoly and malice\", FIRE IN THE BLOOD tells the story of how Western pharmaceutical companies and governments blocked access to low-cost AIDS drugs for the countries of the global south in the years after 1996 - causing ten million or more unnecessary deaths - and the improbable group of people who decided to fight back. Shot on four continents and including contributions from global figures such as Bill Clinton, Desmond Tutu and Joseph Stiglitz, FIRE IN THE BLOOD is the never-before-told true story of the remarkable coalition which came together to stop 'the crime of the century' and save millions of lives in the process.  Written by AnonymousSee less",
        "runtimeMinutes": "87"
    },
    "2013_546": {
        "plotSummary": "A young singer/songwriter, despite being married, becomes involved with her new guitarist, who she soon discovers has a dark past and may be a danger to her and those close to her.",
        "runtimeMinutes": "99"
    },
    "2013_547": {
        "plotSummary": "A high schooler recounts the way he blackmailed his fellow classmates into contributing to his literary magazine.",
        "runtimeMinutes": "90"
    },
    "2013_548": {
        "plotSummary": "A recent college graduate flees to Paris after a break-up, where his involvement with a prostitute begins to reveal a potentially dark recent past.",
        "runtimeMinutes": "101"
    },
    "2013_549": {
        "plotSummary": "A behind-the-scenes look at Green Day's \"American Idiot\" album becoming a punk rock Broadway musical.",
        "runtimeMinutes": "81"
    },
    "2013_55": {
        "plotSummary": "Six Los Angeles celebrities are stuck in James Franco's house after a series of devastating events just destroyed the city. Inside, the group not only have to face the apocalypse, but themselves.",
        "runtimeMinutes": "107"
    },
    "2013_550": {
        "plotSummary": "After Davey's father is killed in a hold-up, she and her mother and younger brother visit relatives in New Mexico. Here Davey is befriended by a young man who helps her find the strength to carry on and conquer her fears.",
        "runtimeMinutes": "92"
    },
    "2013_551": {
        "plotSummary": "Religious conspiracy collides with urban crime in a story told from multiple perspectives.",
        "runtimeMinutes": "96"
    },
    "2013_552": {
        "plotSummary": "A struggling motel owner and her daughter are taken hostage by a nearly blind career criminal to be his eyes as he attempts to retrieve his cash package from a crooked cop.",
        "runtimeMinutes": "90"
    },
    "2013_553": {
        "plotSummary": "When a kidnapping goes wrong, a desperate father risks everything to save his daughter from the men who hold her captive.",
        "runtimeMinutes": "84"
    },
    "2013_554": {
        "plotSummary": "During the Algerian War, a man and woman from opposing sides fall in love with one another.",
        "runtimeMinutes": "88"
    },
    "2013_555": {
        "plotSummary": "Harry Dean Stanton: Partly Fiction is a mesmerizing, impressionistic portrait of the iconic actor comprised of intimate moments, film clips from some of his 250 films and his own heart-breaking renditions of American folk songs. Stunningly...See moreHarry Dean Stanton: Partly Fiction is a mesmerizing, impressionistic portrait of the iconic actor comprised of intimate moments, film clips from some of his 250 films and his own heart-breaking renditions of American folk songs. Stunningly lensed in color and b/w by Seamus McGarvey, the film explores the actor's enigmatic outlook on his life, his unexploited talents as a musician, and includes candid scenes with David Lynch, Wim Wenders, Sam Shepard, Kris Kristofferson and Debbie Harry. The fragile soul of an actor emerges from the poignant collage.  Written by Isotope FilmsSee less",
        "runtimeMinutes": "77"
    },
    "2013_556": {
        "plotSummary": "A documentary about the impact of the newspaper comic strip \"Calvin and Hobbes\", created by Bill Watterson.",
        "runtimeMinutes": "89"
    },
    "2013_557": {
        "plotSummary": "Explores the music scene in Greenwich Village, New York in the 60's and early 70's. The film highlights some of the finest singer/songwriters of the day.",
        "runtimeMinutes": "92"
    },
    "2013_558": {
        "plotSummary": "The surprising, never-before-told tale of the indispensable yet unsung Casting Director - Iconoclasts whose keen eye, exquisite taste and gut instincts redefined Hollywood.",
        "runtimeMinutes": "89"
    },
    "2013_559": {
        "plotSummary": "Ten murders, two cops, and one killer... or so they think.",
        "runtimeMinutes": "90"
    },
    "2013_56": {
        "plotSummary": "Young Ender Wiggin is recruited by the International Military to lead the fight against the Formics, an insectoid alien race who had previously tried to invade Earth and had inflicted heavy losses on humankind.",
        "runtimeMinutes": "114"
    },
    "2013_560": {
        "plotSummary": "A 26-chapter anthology that showcases death in all its vicious wonder and brutal beauty.",
        "runtimeMinutes": "129"
    },
    "2013_561": {
        "plotSummary": "A group of actresses performing in a production of Shakespeare's \"Twelfth Night\" get caught up in a web of romantic intrigue and revelation.",
        "runtimeMinutes": "65"
    },
    "2013_562": {
        "plotSummary": "Before entire networks were built on populist personalities; before reality morphed into a TV genre; the masses fixated on a single, sociopathic star: controversial talk-show host Morton Downey, Jr.",
        "runtimeMinutes": "90"
    },
    "2013_563": {
        "plotSummary": "Wild bachelor Ray Ray Dominguez dreams of nothing more than a carefree life of indulgence in Miami, but his plans are abruptly changed when he becomes the legal guardian of his sister's six children.",
        "runtimeMinutes": "87"
    },
    "2013_564": {
        "plotSummary": "A cinematic documentary that illuminates the lives of individual animals living within and rescued from the machine of our modern world.",
        "runtimeMinutes": "93"
    },
    "2013_565": {
        "plotSummary": "Never before seen Super 8 home movies filmed by Richard Nixon's closest aides - and convicted Watergate conspirators - offer a surprising and intimate new look into his Presidency.",
        "runtimeMinutes": "84"
    },
    "2013_566": {
        "plotSummary": "After being abandoned at the altar, Jason courts the girl of his dreams in cyberspace. When she arrives in LA for their wedding, she turns out to be completely different than expected.",
        "runtimeMinutes": "98"
    },
    "2013_567": {
        "plotSummary": "A man learns that his unusual stomach pains are being caused by a demon living in his intestines.",
        "runtimeMinutes": "85"
    },
    "2013_568": {
        "plotSummary": "Documentarian Abe Benjamin stumbles across an old cassette tape in a thrift store that leads him to investigate the mysterious origin of a bamboo bike and the odd little girl who accompanies it on its journey through time. Unbeknownst to ...See moreDocumentarian Abe Benjamin stumbles across an old cassette tape in a thrift store that leads him to investigate the mysterious origin of a bamboo bike and the odd little girl who accompanies it on its journey through time. Unbeknownst to Abe, the Braughman Brothers Security Team are on the hunt for the same bike at the request of their billionaire boss and best friend Joe Panda. Chaos ensues.  Written by Official siteSee less",
        "runtimeMinutes": "100"
    },
    "2013_569": {
        "plotSummary": "The world's most successful diamond thieves take us into the dark world of the international jewel trade.",
        "runtimeMinutes": "89"
    },
    "2013_57": {
        "plotSummary": "When Keller Dover's daughter and her friend go missing, he takes matters into his own hands as the police pursue multiple leads and the pressure mounts.",
        "runtimeMinutes": "153"
    },
    "2013_570": {
        "plotSummary": "A Russian poet and his interpreter travel to Italy to research the life of an 18th-century composer.",
        "runtimeMinutes": "125"
    },
    "2013_571": {
        "plotSummary": "A master monk tries to protect a naive young physician from a thousand-year-old snake demon. A contest of psychic powers results in mayhem.",
        "runtimeMinutes": "100"
    },
    "2013_572": {
        "plotSummary": "The tragic death of a beautiful young girl starts a tense and atmospheric game of cat and mouse between hunter John Moon and the hardened backwater criminals out for his blood.",
        "runtimeMinutes": "116"
    },
    "2013_573": {
        "plotSummary": "Every day dozens of decommissioned school buses leave the United States on a southward migration that carries them to Guatemala, where they are repaired, repainted, and resurrected as the brightly-colored camionetas that bring the vast ...See moreEvery day dozens of decommissioned school buses leave the United States on a southward migration that carries them to Guatemala, where they are repaired, repainted, and resurrected as the brightly-colored camionetas that bring the vast majority of Guatemalans to work each day. \"This is powerful reportage, beautifully shot and gracefully laid out.\" VILLAGE VOICESee less",
        "runtimeMinutes": "71"
    },
    "2013_574": {
        "plotSummary": "At Passover, Reuben, a French-Jewish man living in Finland with his Nordic boyfriend, finds himself back in Paris with his zany family after a lovers' quarrel.",
        "runtimeMinutes": "96"
    },
    "2013_575": {
        "plotSummary": "Two men carry at night four suitcases of contraband meat across German-occupied Paris during WWII. Their opposite personalities and strange encounters provoke different adventures - until they are arrested by the police.",
        "runtimeMinutes": "80"
    },
    "2013_576": {
        "plotSummary": "Two families bond when their teenage sons are killed in an explosion at a suburban mall only to discover one of their children is the prime suspect.",
        "runtimeMinutes": "80"
    },
    "2013_577": {
        "plotSummary": "A documentary on Brooklyn-born photographer Jamel Shabazz.",
        "runtimeMinutes": "82"
    },
    "2013_578": {
        "plotSummary": "After experiencing the insanity of the adults connected to his son's baseball team, a comedian researches for a comedy movie about them.",
        "runtimeMinutes": "88"
    },
    "2013_579": {
        "plotSummary": "The lives of three different men named David are about to change forever.",
        "runtimeMinutes": "155"
    },
    "2013_58": {
        "plotSummary": "A pragmatic paleontologist visiting an almost complete theme park is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose.",
        "runtimeMinutes": "127"
    },
    "2013_580": {
        "plotSummary": "The possibly exaggerated origin story of the real life alien bluegrass band, Future Folk, that has been playing for NYC audiences for the better part of a decade.",
        "runtimeMinutes": "86"
    },
    "2013_581": {
        "plotSummary": "Young unhinged female ex-con with a motorcycle helps a sickly young homeless woman in red discover what the map of Paris she took from her gangster boyfriend leads to.",
        "runtimeMinutes": "129"
    },
    "2013_582": {
        "plotSummary": "A drama centered on an office worker on the verge of retirement who begins to relive both real and imagined memories.",
        "runtimeMinutes": "110"
    },
    "2013_583": {
        "plotSummary": "Italian-born Massimo and Lella Vignelli are among the world's most influential designers. Throughout their long career, their motto has been, 'If you can't find it, design it' The work covers such a broad spectrum that one could say the ...See moreItalian-born Massimo and Lella Vignelli are among the world's most influential designers. Throughout their long career, their motto has been, 'If you can't find it, design it' The work covers such a broad spectrum that one could say the Vignellis are known by everybody, even those who don't know their names. From graphics to interiors to products and corporate identities, the film brings us into the work and everyday moments of the Vignellis' world, capturing their intelligence and creativity, as well as their humanity, warmth, and humor.  Written by AnonymousSee less",
        "runtimeMinutes": "86"
    },
    "2013_584": {
        "plotSummary": "A documentary that explores the effects of 9/11 on the firm Cantor Fitzgerald, whose offices on the top five floors of the North Tower of the World Trade Center were destroyed in the attacks, killing 658 out of their 960 employees.",
        "runtimeMinutes": "107"
    },
    "2013_585": {
        "plotSummary": "Summer war games between neighborhood kids turn deadly serious when jealousy and betrayal enter the mix.",
        "runtimeMinutes": "94"
    },
    "2013_586": {
        "plotSummary": "Twenty-four hours in the life of Radio France, from one dawn to another. Along its corridors, inside its recording studios, with its producers, presenters, journalists and various guests. And outside on a motorbike in the wake of the Tour ...See moreTwenty-four hours in the life of Radio France, from one dawn to another. Along its corridors, inside its recording studios, with its producers, presenters, journalists and various guests. And outside on a motorbike in the wake of the Tour de France or in the company of a thunderstorm photographer.  Written by Guy BellingerSee less",
        "runtimeMinutes": "104"
    },
    "2013_587": {
        "plotSummary": "The vampire Djuna resists the advances of Paolo, but soon gives in to their passion. When her trouble-making sister unexpectedly comes to visit, Djuna's love is threatened, and the whole vampire community becomes endangered.",
        "runtimeMinutes": "97"
    },
    "2013_588": {
        "plotSummary": "Renowned scientists Richard Dawkins and Lawrence Krauss cross the globe as they speak publicly about the importance of science and reason in the modern world.",
        "runtimeMinutes": "77"
    },
    "2013_589": {
        "plotSummary": "In a future where MRI technology can read your mind, the trial of the century soon begins when a defendant faces his own memory for a double murder he doesn't remember committing.",
        "runtimeMinutes": "153"
    },
    "2013_59": {
        "plotSummary": "Author P.L. Travers reflects on her childhood after reluctantly meeting with Walt Disney, who seeks to adapt her Mary Poppins books for the big screen.",
        "runtimeMinutes": "125"
    },
    "2013_590": {
        "plotSummary": "A womanizing husband inadvertently falls back in love with his wife over the phone when she pretends to be another woman. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2013_591": {
        "plotSummary": "When their parents die, Bianca starts to smoke and Tomas is still a virgin. The orphans explore the dangerous streets of adulthood until Bianca finds Maciste, a retired Mr. Universe, and enters his dark mansion in search of a future. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2013_592": {
        "plotSummary": "Martin Bonner has just moved to Nevada from the East Coast, leaving behind his two adult children and a life he spent more than two decades building.",
        "runtimeMinutes": "83"
    },
    "2013_593": {
        "plotSummary": "Unknowingly trapped in her role as caretaker of her unappreciative family, a young single woman desperately needs to get her own life. When she volunteers to cat sit at her unrequited love's downtown L.A. loft, her world, as she knows it, changes forever.",
        "runtimeMinutes": "92"
    },
    "2013_594": {
        "plotSummary": "Van Vlahakis left Greece five decades ago with 22 dollars in his pocket. He arrived in the US hoping for a better future for him and his family. Eftichios as is his Greek name not only managed to live the American dream for himself, but ...See moreVan Vlahakis left Greece five decades ago with 22 dollars in his pocket. He arrived in the US hoping for a better future for him and his family. Eftichios as is his Greek name not only managed to live the American dream for himself, but also created Earth Friendly Products, a US giant for environmentally friendly cleaning products. His story is not only about transforming his life but also the lives of the ones around him as the owner and CEO of Earth Friendly Products. The story centers on the modern day Vlahakis (played by Ed O'Ross), who is diagnosed with cancer and given only few months to live. During this time, he reflects on his early life as an immigrant (played by George Finn) during the 1950's and ultimately decides to push himself to the limit by closing one final business deal that will concretize his company's success, even if it means taking on a large corporation that is trying to take over his company.  Written by IvanWongSee less",
        "runtimeMinutes": "90"
    },
    "2013_595": {
        "plotSummary": "It's 1983 and Brad Roberts is the best high school quarterback in the country. He dates the sexiest girl in town and is extremely popular, but Brad is not satisfied. He wants to prove that he's more than just a hot-shot quarterback; Brad ...See moreIt's 1983 and Brad Roberts is the best high school quarterback in the country. He dates the sexiest girl in town and is extremely popular, but Brad is not satisfied. He wants to prove that he's more than just a hot-shot quarterback; Brad tries to turn his heavy metal band into the first ever boy band, and they reject him. So Brad, the jock, teams up with a stoner, and an ex-figure skater, and a couple of reject break-dancers from the Bronx to make their mark in this sweet film.  Written by Betsy T.See less",
        "runtimeMinutes": "90"
    },
    "2013_596": {
        "plotSummary": "A chronicle of the days leading up to Jeff Buckley's performance at his father's tribute concert in 1991.",
        "runtimeMinutes": "99"
    },
    "2013_597": {
        "plotSummary": "When New York Police Headquarters is confronted with the horror of a serial murderer loose on the streets of Manhattan. Oblivious to the danger, a group of hip students from all over the world, who now attend school together in New York, ...See moreWhen New York Police Headquarters is confronted with the horror of a serial murderer loose on the streets of Manhattan. Oblivious to the danger, a group of hip students from all over the world, who now attend school together in New York, are planning a memorial to celebrate the lives of their lost \"brothers and sisters\" who died suddenly in a tragic plane crash a year prior. Aspiring actress EVE, her athletic boyfriend SEBASTIAN, bad boy gone good DOMINIC, tough but sweet JOAN, hip hop mogul on the rise, VALENTINE and beautiful, carefree MARIA, soon begin to turn up dead, one by one. As more dead bodies mount, detectives JOSEPH and MICHAEL are in a race against time to stop the serial killing. The crime scenes and the way each victim was killed lead the detectives to theorize that each of the killings may be linked to the victims' ancient namesakes. Those namesakes are known to be some of the most saintly people that have graced the earth. As evidence continues to mount and more body bags are gathered, the detectives are convinced that the killer is basing his crimes on the belief that every generation has 36 righteous individuals who live among us, where, with all of them gone, the world would fall into chaos, corruption and eventual darkness. The hunt is on to find the last of the 36 Saints before the killer does.  Written by AFPSee less",
        "runtimeMinutes": "81"
    },
    "2013_598": {
        "plotSummary": "When some college students get together for a hot tub party, they're shocked to find out that their party is being crashed by some tiny, uninvited guests who are hungry for flesh - human flesh.",
        "runtimeMinutes": "73"
    },
    "2013_599": {
        "plotSummary": "A murdered boys spirit seeks revenge by seeking six souls to live again.",
        "runtimeMinutes": "89"
    },
    "2013_6": {
        "plotSummary": "Hobbs has Dominic and Brian reassemble their crew to take down a team of mercenaries: Dominic unexpectedly gets sidetracked with facing his presumed deceased girlfriend, Letty.",
        "runtimeMinutes": "130"
    },
    "2013_60": {
        "plotSummary": "After a highly unusual zombie saves a still-living girl from an attack, the two form a relationship that sets in motion events that might transform the entire lifeless world.",
        "runtimeMinutes": "98"
    },
    "2013_600": {
        "plotSummary": "Tale of life, love and the pursuit of happiness... in Cleveland. Nine vignettes about love: an old war hero defends the honor and memory of a long-lost love; a man's past comes to light in the midst of a perfect date; a recently separated ...See moreTale of life, love and the pursuit of happiness... in Cleveland. Nine vignettes about love: an old war hero defends the honor and memory of a long-lost love; a man's past comes to light in the midst of a perfect date; a recently separated paramedic gets more than he bargains for when he is thrust in the middle of a domestic dispute; a desperate man employs his friends in an elaborate scheme to meet the girl of his dreams, a recovering sex addict returns home to start a new life. There are thousands of stories of love, lust, loss and despair all over Cleveland-these are just a few of them.  Written by 1031 Films, LLCSee less",
        "runtimeMinutes": "113"
    },
    "2013_601": {
        "plotSummary": "American Meat is a solutions-oriented documentary chronicling the current state of the U.S. meat industry. Featuring Joel Salatin, Chuck Wirtz, Fred Kirschenmann, Steve Ells, Paul Willis, and farmers across America, it takes an even-handed...See moreAmerican Meat is a solutions-oriented documentary chronicling the current state of the U.S. meat industry. Featuring Joel Salatin, Chuck Wirtz, Fred Kirschenmann, Steve Ells, Paul Willis, and farmers across America, it takes an even-handed look at animal husbandry. First explaining how America arrived at our current industrial system, the story shifts to the present day, showing the feedlots and confinement houses, not through hidden cameras but through the eyes of the farmers who live and work there. From there, the documentary introduces the revolution taking root in animal husbandry, led by the charismatic and passionate Joel Salatin. Stories are shared of farmers across the country who have changed their life to start grass-based farms, and everyday solutions highlight actions people can make to support America's agriculture.  Written by Rachel SignerSee less",
        "runtimeMinutes": "84"
    },
    "2013_602": {
        "plotSummary": "A documentary about the 2012 Iowa presidential political caucus.",
        "runtimeMinutes": "104"
    },
    "2013_603": {
        "plotSummary": "Stephanie and Kelly are best friends and roommates. Paul is Stephanie's boyfriend and Kelly's former boyfriend. The three of them eventually realize they are part of a love triangle that's filled with love, betrayal, insanity, and murder.See moreStephanie and Kelly are best friends and roommates. Paul is Stephanie's boyfriend and Kelly's former boyfriend. The three of them eventually realize they are part of a love triangle that's filled with love, betrayal, insanity, and murder.  Written by AnonymousSee less",
        "runtimeMinutes": "74"
    },
    "2013_604": {
        "plotSummary": "A New York attorney is sent to Shanghai on business, where he finds himself in a legal mess that threatens his career. With the help of a relocation specialist and her contacts, he soon learns to appreciate the wonders of Shanghai.",
        "runtimeMinutes": "100"
    },
    "2013_605": {
        "plotSummary": "Elemental follows three outsiders who are obsessed by nature and driven by a deep desire to change the status quo. Rajendra Singh, an Indian government official gone rogue, mounts a national crusade to save the Ganges River. Activist Eriel...See moreElemental follows three outsiders who are obsessed by nature and driven by a deep desire to change the status quo. Rajendra Singh, an Indian government official gone rogue, mounts a national crusade to save the Ganges River. Activist Eriel Deranger leads a David and Goliath fight against the oil giants who are destroying her homeland in the Canadian Tar Sands. Australian inventor, Jay Harman, is attempting to halve the world's energy consumption by mimicking natural systems. Separated by continents, each character is part of a global story about water and climate change that goes beyond the issues to reveal the public triumphs and emotional scars of life on the front line.  Written by Emmanuel Vaughan-LeeSee less",
        "runtimeMinutes": "92"
    },
    "2013_606": {
        "plotSummary": "Shepard & Dark is the remarkable story of a friendship in letters.",
        "runtimeMinutes": "92"
    },
    "2013_607": {
        "plotSummary": "After an Algerian informant is murdered, two female investigators are sent to investigate.",
        "runtimeMinutes": "106"
    },
    "2013_608": {
        "plotSummary": "An anthology of stories involving meth addicted white supremacists, a man looking for his kidnapped wife and an Elvis impersonator.",
        "runtimeMinutes": "112"
    },
    "2013_609": {
        "plotSummary": "A documentary on radical left-wing activist turned FBI informant, Brandon Darby. Read more: Synopsis",
        "runtimeMinutes": "81"
    },
    "2013_61": {
        "plotSummary": "A story centered on a company that grants wishes to people looking for a day away from their ordinary lives.",
        "runtimeMinutes": "118"
    },
    "2013_610": {
        "plotSummary": "A documentary that shows how George A. Romero gathered an unlikely team of Pittsburghers to shoot his seminal film: Night of the Living Dead.",
        "runtimeMinutes": "76"
    },
    "2013_611": {
        "plotSummary": "Working class couple Antoine and Antoinette dream of a better life. In the midst of constantly fending off the unwanted attention of men, especially the grocer Monsieur Roland, Antoinette purchases a winning lottery ticket. But when ...See moreWorking class couple Antoine and Antoinette dream of a better life. In the midst of constantly fending off the unwanted attention of men, especially the grocer Monsieur Roland, Antoinette purchases a winning lottery ticket. But when Antoine loses their ticket out of poverty, their dreams seem like they'll remain just that.  Written by Rialto PicturesSee less",
        "runtimeMinutes": "78"
    },
    "2013_612": {
        "plotSummary": "NORTHERN LIGHTS has the feel of an old black and white photograph discovered in an attic. The bitter-sweet story of young lovers caught up in an political struggle waged by farmers against the grain trade, the banks and the railroads, ...See moreNORTHERN LIGHTS has the feel of an old black and white photograph discovered in an attic. The bitter-sweet story of young lovers caught up in an political struggle waged by farmers against the grain trade, the banks and the railroads, NORTHERN LIGHTS brings back a forgotten era of American history and evokes the austere beauty of the Northern Plains.  Written by Rob NilssonSee less",
        "runtimeMinutes": "95"
    },
    "2013_613": {
        "plotSummary": "When a woman tries to outwit her husband's sexy young mistress, the unexpected consequences include starring as King Lear in a very amateur production - with the mistress, an aspiring actress, playing The Fool.",
        "runtimeMinutes": "115"
    },
    "2013_614": {
        "plotSummary": "An overgrown nerd who serves as Game Master of a fantasy board game finds his role as leader of the misfits put into jeopardy when a new initiate enters the group.",
        "runtimeMinutes": "86"
    },
    "2013_615": {
        "plotSummary": "When the mother of his infant son unexpectedly passes away, struggling actor Mark grapples with fatherhood and his inability to grow up. And when he sparks with a single mother, he learns how his choices have real-life consequences.",
        "runtimeMinutes": "89"
    },
    "2013_616": {
        "plotSummary": "Raul, a Puerto Rican born in New York, meets Maria, a young Puerto Rican woman visiting NY, one night. Struck by love at first sight, he travels to Puerto Rico in search of this beautiful girl.",
        "runtimeMinutes": "98"
    },
    "2013_617": {
        "plotSummary": "The film follows warring political factions in 1970s Jamaica as they enlist the support of gangs to enforce their policies, and advance their political agenda. It is a fictionalized dramatization of real historical events, specifically, ...See moreThe film follows warring political factions in 1970s Jamaica as they enlist the support of gangs to enforce their policies, and advance their political agenda. It is a fictionalized dramatization of real historical events, specifically, the Green Bay Massacre, where the government finally tracked down these gangs and had systematically wiped out.  Written by AnonymousSee less",
        "runtimeMinutes": "104"
    },
    "2013_618": {
        "plotSummary": "Two roommates deathly afraid of ghosts both fall in love with a girl who believes their home is haunted.",
        "runtimeMinutes": "84"
    },
    "2013_619": {
        "plotSummary": "Two American newlyweds in Paris experience a love so strong, it almost devours them.",
        "runtimeMinutes": "101"
    },
    "2013_62": {
        "plotSummary": "A college freshman encounters new friends, romance, and adventure upon her arrival at campus.",
        "runtimeMinutes": "131"
    },
    "2013_620": {
        "plotSummary": "Members of a once-promising hip-hop group, now in their late 30's, struggle with regret, disappointment, and change on Election Night 2008.",
        "runtimeMinutes": "93"
    },
    "2013_621": {
        "plotSummary": "An expectant couple who moves into the most haunted house in New Orleans call upon the services of the Vatican's elite exorcism team to save them from a demonic baby.",
        "runtimeMinutes": "98"
    },
    "2013_622": {
        "plotSummary": "A documentary on the Jejune Institute, a mind-bending San Francisco phenomenon where 10,000 people became \"inducted\" without ever quite realizing what they'd signed up for.",
        "runtimeMinutes": "92"
    },
    "2013_623": {
        "plotSummary": "A journalist interviews a sixteen year old boy, who is in police custody after he shot and killed 42 people at his high school.",
        "runtimeMinutes": "90"
    },
    "2013_624": {
        "plotSummary": "Two young couples in New York-one black and gay, one white and heterosexual-find their lives intertwined as they create new relationship norms, explore sexual identity, and redefine monogamy.",
        "runtimeMinutes": "87"
    },
    "2013_625": {
        "plotSummary": "A documentary that explores the downloading revolution; the kids that created it, the bands and the businesses that were affected by it, and its impact on the world at large.",
        "runtimeMinutes": "107"
    },
    "2013_626": {
        "plotSummary": "A high school teacher in Austin, Texas takes sexual advantage over one of her students. Her life begins to unravel as the details of the relationship are exposed.",
        "runtimeMinutes": "75"
    },
    "2013_627": {
        "plotSummary": "Drug dealer Alex finds hope for a new start when his cousin offers him a job in Israel. Now he must make the final score, while balancing a new romance, a past lover, a lifelong friendship and his brother's addiction. In French w/ English ...See moreDrug dealer Alex finds hope for a new start when his cousin offers him a job in Israel. Now he must make the final score, while balancing a new romance, a past lover, a lifelong friendship and his brother's addiction. In French w/ English subtitles. Official Selection - Cannes FF Directors' Fortnight.  Written by AnonymousSee less",
        "runtimeMinutes": "88"
    },
    "2013_628": {
        "plotSummary": "In seven different segments, Godard, Klein, Lelouch, Marker, Resnais and Varda show their sympathy and support for the North Vietnamese army during the Vietnam war.See moreIn seven different segments, Godard, Klein, Lelouch, Marker, Resnais and Varda show their sympathy and support for the North Vietnamese army during the Vietnam war.  Written by See less",
        "runtimeMinutes": "115"
    },
    "2013_629": {
        "plotSummary": "While working on a writing project on the island of Ischia, a married woman (Bosworth) enters into an affair with a younger man. Read more: Synopsis",
        "runtimeMinutes": "83"
    },
    "2013_63": {
        "plotSummary": "Two turkeys from opposite sides of the tracks must put aside their differences and team up to travel back in time to change the course of history, and get Turkeys off the Thanksgiving menu for good.",
        "runtimeMinutes": "91"
    },
    "2013_630": {
        "plotSummary": "After a series of bad experiences with men, Shae teams up with her co-worker, Lu, who has a simple, deadly way of dealing with the opposite sex.",
        "runtimeMinutes": "93"
    },
    "2013_631": {
        "plotSummary": "A magician competes in an international magic competition where he goes head to head with a female street magician he has fallen in love with. This film shows great magic performed by a cast of professional magicians. Like a great musical ...See moreA magician competes in an international magic competition where he goes head to head with a female street magician he has fallen in love with. This film shows great magic performed by a cast of professional magicians. Like a great musical where the songs and the story are seamlessly intertwined, Desperate Acts of Magic does the same, mixing story and magic as one.  Written by AnonymousSee less",
        "runtimeMinutes": "86"
    },
    "2013_632": {
        "plotSummary": "In a village on the French Opal Coast, a drifter engages in a perplexing relationship with a young woman who has suffered abuse.",
        "runtimeMinutes": "110"
    },
    "2013_633": {
        "plotSummary": "When a couple discovers that a brass teapot makes them money whenever they hurt themselves, they must come to terms with how far they are willing to go.",
        "runtimeMinutes": "101"
    },
    "2013_634": {
        "plotSummary": "With the original intention of empowering a citizenry's ability to defend themselves against a corrupt or tyrannical government, the concept today may seem farfetched or the makings of a Hollywood blockbuster. However, it has happened ...See moreWith the original intention of empowering a citizenry's ability to defend themselves against a corrupt or tyrannical government, the concept today may seem farfetched or the makings of a Hollywood blockbuster. However, it has happened throughout U.S. history. And long before gun control was positioned as a \"common sense measure\" to combat violence, it was used as a means to oppress certain minority groups. Presently, the growing trend in gun control favors the wealthy and privileged, who leverage their connections to ensure their Second Amendment rights and safety, while those of lesser means struggle. Informative and emotionally charged, \"Assaulted: Civil Rights Under Fire\" is an eye-opening look at the genesis of the Second Amendment to the Constitution, leading the audience to rethink the issues surrounding gun control, and the effect on civil rights and liberty. After all, what you don't know can kill you.  Written by Dead Patriot FilmsSee less",
        "runtimeMinutes": "79"
    },
    "2013_635": {
        "plotSummary": "The last day in the life of the actor Sal Mineo, who was murdered on February 12, 1976.",
        "runtimeMinutes": "103"
    },
    "2013_636": {
        "plotSummary": "Half of the human population lives in urban areas. By 2050, this will increase to 80%. Life in a megacity is both enchanting and problematic. Today we face peak oil, climate change, loneliness and severe health issues due to our way of ...See moreHalf of the human population lives in urban areas. By 2050, this will increase to 80%. Life in a megacity is both enchanting and problematic. Today we face peak oil, climate change, loneliness and severe health issues due to our way of life. But why? The Danish architect and professor Jan Gehl has studied human behavior in cities through four decades. He has documented how modern cities repel human interaction, and argues that we can build cities in a way, which takes human needs for inclusion and intimacy into account. 'The Human Scale' meets thinkers, architects and urban planners across the globe. It questions our assumptions about modernity, exploring what happens when we put people into the centre of our planning.  Written by Final Cut for RealSee less",
        "runtimeMinutes": "83"
    },
    "2013_637": {
        "plotSummary": "Syd is an eccentric bookseller with delusions of grandeur fueled by red wine. He caused a rift 5 years ago between his bohemian housemates and the family next door, but now tries to recruit his 14-year-old neighbor as a collaborator.",
        "runtimeMinutes": "84"
    },
    "2013_638": {
        "plotSummary": "Aaron Clark's comfortable life in the bucolic New England countryside is shattered by the unexpected arrival of former classmate Teddy who accuses him of business improprieties and cover-ups, with unforeseen consequences.",
        "runtimeMinutes": "88"
    },
    "2013_639": {
        "plotSummary": "The lives of three childhood friends on the Jersey Shore begin to unravel when a secret from their past is revealed.",
        "runtimeMinutes": "93"
    },
    "2013_64": {
        "plotSummary": "It's 1949 Los Angeles, the city is run by gangsters and a malicious mobster, Mickey Cohen. Determined to end the corruption, John O'Mara assembles a team of cops, ready to take down the ruthless leader and restore peace to the city.",
        "runtimeMinutes": "113"
    },
    "2013_640": {
        "plotSummary": "A man surprises his former mistress by claiming to have left his wife. However, before long, a dark history between the two comes into focus.",
        "runtimeMinutes": "84"
    },
    "2013_641": {
        "plotSummary": "Reg and Lindsay run an organic fertiliser business. They need a fresh supply of their \"secret ingredient\" to process through the meat grinder. Reg comes across two guys and a girl with a broken-down vehicle on their way to a music festival.",
        "runtimeMinutes": "91"
    },
    "2013_642": {
        "plotSummary": "Years after he left Damascus under suspicious circumstances, Adib Abdel Kareem must confront what he left behind when his daughter goes missing.",
        "runtimeMinutes": "93"
    },
    "2013_643": {
        "plotSummary": "In the late 1800s, a fanatical religious leader, a renegade Sheriff, and a former prostitute collide in a blood triangle on the rugged plains of the New Mexico Territory.",
        "runtimeMinutes": "95"
    },
    "2013_644": {
        "plotSummary": "In Search of Blind Joe Death: The Saga of John Fahey is a documentary film about the legendary American guitarist, composer and provocateur John Fahey, 1939-2001. Fahey is often considered the godfather of 'American primitive guitar'. This...See moreIn Search of Blind Joe Death: The Saga of John Fahey is a documentary film about the legendary American guitarist, composer and provocateur John Fahey, 1939-2001. Fahey is often considered the godfather of 'American primitive guitar'. This cinematic exploration features Pete Townshend, Chris Funk of The Decemberists and Joey Burns of Calexico. These stellar musicians, along with Fahey associates and friends such as the famous 'Dr. Demento', guitarist and producer Terry Robb, and radio broadcaster Barry Hansen, explore the legacy of this profoundly influential artist. The film was recorded in the Washington D.C. area where John Fahey was born, along the Mississippi Delta from Memphis to New Orleans, in Los Angeles, Toronto, Austin, New York and in Oregon where Fahey spent his last two decades.  Written by AnonymousSee less",
        "runtimeMinutes": "58"
    },
    "2013_645": {
        "plotSummary": "A recently reformed drug dealer, now working as a claims adjuster by day and bouncer by night, receives earth-shattering news, compelling to make peace with his past and search for freedom beyond the concrete jungle of New York City.",
        "runtimeMinutes": "81"
    },
    "2013_646": {
        "plotSummary": "Three friends who come together to help a fourth friend elope with his lover, come together once again to teach the couple a lesson, when they part away.",
        "runtimeMinutes": "144"
    },
    "2013_647": {
        "plotSummary": "Two filmmakers leave to Macao in an adventure of discovery of a city-labyrinth, multicultural and mysterious, where the memories of the childhood - featured memories by the lived reality in Macao - have a dialog with the memories of the ...See moreTwo filmmakers leave to Macao in an adventure of discovery of a city-labyrinth, multicultural and mysterious, where the memories of the childhood - featured memories by the lived reality in Macao - have a dialog with the memories of the East built by the codes of the cinema and the literature - memories lived on a featured reality-, creating a testimony which tries to raise the veil on the past and the present time. A personal album of physical and emotional geography, structured as an investigation disguised as a thriller, where the puzzle of the history challenges the reality.  Written by AnonymousSee less",
        "runtimeMinutes": "82"
    },
    "2013_648": {
        "plotSummary": "Four children in their attic hideaway make up a fantastic story, while downstairs their parents weave a drunken intrigue of their own.",
        "runtimeMinutes": "83"
    },
    "2013_649": {
        "plotSummary": "The coming of age tale of an extraordinarily gifted young dancer recently arrived in New York City.",
        "runtimeMinutes": "83"
    },
    "2013_65": {
        "plotSummary": "A man who has made a new life for himself and the daughter left on his doorstep 6 years ago finds his family threatened when the birth mother resurfaces.",
        "runtimeMinutes": "115"
    },
    "2013_650": {
        "plotSummary": "A former CIA operative turned political talk show host is hired by a disaffected corporate shareholder to expose her company's cover-up of an incident and deaths in an Ecuadorian village.",
        "runtimeMinutes": "106"
    },
    "2013_651": {
        "plotSummary": "Featuring stunning footage from seven winters in the Arctic, People of a Feather takes you through time into the world of the Inuit on the Belcher Islands in Canada's Hudson Bay. Connecting past, present and future is a unique relationship...See moreFeaturing stunning footage from seven winters in the Arctic, People of a Feather takes you through time into the world of the Inuit on the Belcher Islands in Canada's Hudson Bay. Connecting past, present and future is a unique relationship with the eider duck. Eider down, the warmest feather in the world, allows both Inuit and bird to survive harsh Arctic winters. Traditional life is juxtaposed with modern challenges as both Inuit and eiders confront changing sea ice and ocean currents disrupted by the massive hydroelectric dams powering New York and eastern North America. Inspired by Inuit ingenuity and the technology of a simple feather, the film is a call to action to implement energy solutions that work with nature.  Written by First Run FeaturesSee less",
        "runtimeMinutes": "90"
    },
    "2013_652": {
        "plotSummary": "A political strategist juggling three clients questions whether or not to take the high road as the ugly side of his work begins to haunt him.",
        "runtimeMinutes": "100"
    },
    "2013_653": {
        "plotSummary": "An artist meets a mysterious and wealthy benefactor and their relationship is not what it appears to be.",
        "runtimeMinutes": "85"
    },
    "2013_654": {
        "plotSummary": "Tim DeChristopher is Bidder 70, a young man who derailed an illegal BLM oil and gas auction in a courageous act of civil disobedience.",
        "runtimeMinutes": "73"
    },
    "2013_655": {
        "plotSummary": "Filmmaker Roman Polanski spends a weekend with world champion driver Jackie Stewart as he attempts to win the 1971 Monaco Grand Prix, offering an extraordinarily rare glimpse into the life of a gifted athlete at the height of his powers.",
        "runtimeMinutes": "93"
    },
    "2013_656": {
        "plotSummary": "A documentary chronicling the lives of Japanese refugees displaced by the 2011 tsunami and nuclear meltdown at Fukushima Daiichi.",
        "runtimeMinutes": "96"
    },
    "2013_657": {
        "plotSummary": "'What kind of house does a man who has been imprisoned in a six-foot-by-nine-foot cell for over 30 years dream of?' This film captures the remarkable creative journey and friendship of Herman Wallace, one of the Angola 3, and artist Jackie...See more'What kind of house does a man who has been imprisoned in a six-foot-by-nine-foot cell for over 30 years dream of?' This film captures the remarkable creative journey and friendship of Herman Wallace, one of the Angola 3, and artist Jackie Sumell while examining the injustice of prolonged solitary confinement.  Written by AnonymousSee less",
        "runtimeMinutes": "80"
    },
    "2013_658": {
        "plotSummary": "Two New York film editors balance their personal relationships while reworking a movie in crisis.",
        "runtimeMinutes": "87"
    },
    "2013_659": {
        "plotSummary": "With the Rapture now history, traveling salesman Josh becomes a warrior on the road in his plan to return home, but God guides others to help make Josh part of His plan.",
        "runtimeMinutes": "90"
    },
    "2013_66": {
        "plotSummary": "A world-weary political journalist picks up the story of a woman's search for her son, who was taken away from her decades ago after she became pregnant and was forced to live in a convent.",
        "runtimeMinutes": "98"
    },
    "2013_660": {
        "plotSummary": "The poet and painter, Lawrence Ferlinghetti, is among the world's living monuments to arts and letters. For well over a half century, Ferlinghetti helped shape the currents of poetry and literature with his forceful engagement with society...See moreThe poet and painter, Lawrence Ferlinghetti, is among the world's living monuments to arts and letters. For well over a half century, Ferlinghetti helped shape the currents of poetry and literature with his forceful engagement with society and an ideological position that often found him at odds with the political currents of his day. Ferlinghetti's quiet, behind the scenes demeanor and disarming mien may have assuaged, or even fooled, certain opponents, while in reality he was a literary mercenary, a rebel at the forefront of our own cultural revolution.  Written by AnonymousSee less",
        "runtimeMinutes": "79"
    },
    "2013_661": {
        "plotSummary": "While out on parole, Dennis reluctantly takes a job selling Christmas trees with his old buddy Rene in order to make enough money to buy his estranged daughter the piano she's always wanted.",
        "runtimeMinutes": "107"
    },
    "2013_662": {
        "plotSummary": "A married couple lose their children while on a family trip near some caves in Tijuana. The kids eventually reappear without explanation, but it becomes clear that they are not who they used to be, that something terrifying has changed ...See moreA married couple lose their children while on a family trip near some caves in Tijuana. The kids eventually reappear without explanation, but it becomes clear that they are not who they used to be, that something terrifying has changed them.  Written by AnonymousSee less",
        "runtimeMinutes": "97"
    },
    "2013_663": {
        "plotSummary": "Two couples reunite over two incendiary evenings where anything can happen in this darkly comedic story of best friends, marriage, love, disappointment and dreams.",
        "runtimeMinutes": "90"
    },
    "2013_664": {
        "plotSummary": "Explores our perception of time.",
        "runtimeMinutes": "109"
    },
    "2013_665": {
        "plotSummary": "Follow actor J Kimball as he researches what it's like to be old for a role in an upcoming movie. When he meets the residents at The Coconuts convalescent home, he quickly discovers that his perceptions of the elderly may be off from ...See moreFollow actor J Kimball as he researches what it's like to be old for a role in an upcoming movie. When he meets the residents at The Coconuts convalescent home, he quickly discovers that his perceptions of the elderly may be off from today's reality. After being on the wrong end of some pranks, J enlists the help of his Hollywood friends to turn the tides. Mayhem ensues.  Written by AnonymousSee less",
        "runtimeMinutes": "81"
    },
    "2013_666": {
        "plotSummary": "A petty robbery spirals into a tense hostage situation after three gunmen hold up a diner that's a front for the mob.",
        "runtimeMinutes": "88"
    },
    "2013_667": {
        "plotSummary": "After being drugged and raped at a party, a young woman contracts what she thinks is an STD; but, it's actually something much worse.",
        "runtimeMinutes": "84"
    },
    "2013_668": {
        "plotSummary": "At the center of corruption is the Federal Reserve who has gained enormous amounts of control over America's economy, with disastrous effects beginning to show. Standing opposite, is the band of Rebels who have vowed to take back the ...See moreAt the center of corruption is the Federal Reserve who has gained enormous amounts of control over America's economy, with disastrous effects beginning to show. Standing opposite, is the band of Rebels who have vowed to take back the freedom they once knew...and they won't go down without a fight. Monetary mayhem. Explosions. Romance. Silver Circle plans to take liberty filmmaking to a whole other level.  Written by Pasha RobertsSee less",
        "runtimeMinutes": "90"
    },
    "2013_669": {
        "plotSummary": "Jennifer's thirtieth birthday party is supposed to be a special day. But what starts out as a day of celebration quickly spirals into a most ill-fated day Jennifer wishes she could forget, in this ensemble comedy set entirely in a kitchen.",
        "runtimeMinutes": "80"
    },
    "2013_67": {
        "plotSummary": "A New York socialite, deeply troubled and in denial, arrives in San Francisco to impose upon her sister. She looks a million, but isn't bringing money, peace, or love...",
        "runtimeMinutes": "98"
    },
    "2013_670": {
        "plotSummary": "Five days in the life of an American couple immediately following the accidental death of their child. An every day story of tragedy, loss, acceptance, hope and renewal. 'Morning' follows the divergent paths of Mark (Leland Orser) and ...See moreFive days in the life of an American couple immediately following the accidental death of their child. An every day story of tragedy, loss, acceptance, hope and renewal. 'Morning' follows the divergent paths of Mark (Leland Orser) and Alice Munroe (Jeanne Tripplehorn) as they circle each other in a heart-breaking pas-de-deux of grief before finally coming to grips with their shared loss.  Written by AnonymousSee less",
        "runtimeMinutes": "95"
    },
    "2013_671": {
        "plotSummary": "Comic-book artist Jung returns to Seoul for the first time since he was abandoned at the age of 5.",
        "runtimeMinutes": "70"
    },
    "2013_672": {
        "plotSummary": "A documentary that follows the journey of two of China's first citizen reporters as they travel the country chronicling under-reported news and social issues stories.",
        "runtimeMinutes": "87"
    },
    "2013_673": {
        "plotSummary": "Determined to restore her dying father's reputation, Ana travels to the remote town of Rosales. Decades ago, he settled there and opened his first free clinic for cancer research. He launched an illustrious medical career - and fell in ...See moreDetermined to restore her dying father's reputation, Ana travels to the remote town of Rosales. Decades ago, he settled there and opened his first free clinic for cancer research. He launched an illustrious medical career - and fell in love. Ana plans to celebrate her father's scientific and humanitarian achievements by transforming the old family mansion into a world-class museum. She will preserve his legacy, and also breathe new life into the forgotten Rosales. But the townspeople-now destitute and helpless-do not greet her warmly. Neither does the house.  Written by AnonymousSee less",
        "runtimeMinutes": "91"
    },
    "2013_674": {
        "plotSummary": "A boy stands on a station platform as a train is about to leave. Should he go with his mother or stay with his father? Infinite possibilities arise from this decision. As long as he doesn't choose, anything is possible.",
        "runtimeMinutes": "141"
    },
    "2013_675": {
        "plotSummary": "During his 50th birthday party thrown by his wife, Remco's life takes a turn for the worse. His business partners are scheming behind his back to sell him out and his former mistress shows up pregnant.",
        "runtimeMinutes": "55"
    },
    "2013_676": {
        "plotSummary": "Tensions rise between lifelong friends Mitchell and Carter after their truck breaks down on an isolated desert road as they start to attack each other's life decisions with unwavering brutality.",
        "runtimeMinutes": "82"
    },
    "2013_677": {
        "plotSummary": "A poet who starts a health-conscious food stand finds support from his friends, as well as a potential love match with one of his customers. But will unexpected complications jeopardize his dreams of a hot dog-free future?",
        "runtimeMinutes": "85"
    },
    "2013_678": {
        "plotSummary": "Colin happens upon a road accident where he finds a dead man, a beautiful woman, and a suitcase full of money. After trying to do the right thing he soon finds himself caught up in a dangerous scheme.",
        "runtimeMinutes": "86"
    },
    "2013_679": {
        "plotSummary": "Young adults at a first-time offenders' boot camp discover the legend of the giant lumberjack Paul Bunyan is real, but is much more horrifying than they could have imagined.",
        "runtimeMinutes": "90"
    },
    "2013_68": {
        "plotSummary": "From legendary action director Tsui Hark and the creators of international smash hit Detective Dee - Mystery Of The Phantom Flame comes the captivating tale of Dee Renjie's beginnings in the Imperial police force. His very first case, ...See moreFrom legendary action director Tsui Hark and the creators of international smash hit Detective Dee - Mystery Of The Phantom Flame comes the captivating tale of Dee Renjie's beginnings in the Imperial police force. His very first case, investigating reports of a sea monster terrorizing the town, reveals a sinister conspiracy of treachery and betrayal, leading to the highest reaches of the Imperial family.  Written by AnonymousSee less",
        "runtimeMinutes": "134"
    },
    "2013_680": {
        "plotSummary": "A smart teenage girl comes of age in a small town with her self-centered parents who had her when they were teenagers.",
        "runtimeMinutes": "92"
    },
    "2013_681": {
        "plotSummary": "A documentary on legendary movie-poster artist Drew Struzan.",
        "runtimeMinutes": "97"
    },
    "2013_682": {
        "plotSummary": "Reaching far beyond Hollywood's hypersexualized femme fatales, the film candidly explores the modern American woman through intimate portraits encompassing issues of protection, power, feminism, and violence. A Girl and A Gun is a complex ...See moreReaching far beyond Hollywood's hypersexualized femme fatales, the film candidly explores the modern American woman through intimate portraits encompassing issues of protection, power, feminism, and violence. A Girl and A Gun is a complex and thoughtful meditation on a deadly serious issue. The intimate and graphic portrayals in A Girl and A Gun are of women who've carved themselves a home in the gun community, but their personal journeys in one way or another reflect the same issues every woman faces today.  Written by AnonymousSee less",
        "runtimeMinutes": "76"
    },
    "2013_683": {
        "plotSummary": "US Army Staff Sergeant Wesley Kent returns from the war abroad and must now fight the threat of corruption and deception in his hometown at all personal costs.",
        "runtimeMinutes": "86"
    },
    "2013_684": {
        "plotSummary": "A drama centered on a First Nations teenager trying to find his place in the modern world.",
        "runtimeMinutes": "86"
    },
    "2013_685": {
        "plotSummary": "A story centered on an actress who has become agoraphobic who reluctantly allows a plumber into her apartment after her toilet overflows.",
        "runtimeMinutes": "81"
    },
    "2013_686": {
        "plotSummary": "Neddie Nerfhoffer has a dream. He wants to do his part to help save the galaxy from a tyrannical warlord. When Neddie finds an ancient starship, he and his friends take to the stars to stop the evil General Disdain. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2013_687": {
        "plotSummary": "A young man transforms into a brutal warrior as he travels the unforgiving landscape in search of his long lost brother, Hakan the Ferocious, whose people are relying on him to restore order to their kingdom.",
        "runtimeMinutes": "99"
    },
    "2013_688": {
        "plotSummary": "A deaf woman who resurrects the ghost of a murdered young woman is forced by the spirit to a serial killer who turns his female victims into marionette dolls.",
        "runtimeMinutes": "108"
    },
    "2013_689": {
        "plotSummary": "A love triangle - shot in two single 45 minute takes set eighteen months apart: the first over a sunset, the second a sunrise.",
        "runtimeMinutes": "81"
    },
    "2013_69": {
        "plotSummary": "Left for dead on a sun-scorched planet, Riddick finds himself up against an alien race of predators. Activating an emergency beacon alerts two ships: one carrying a new breed of mercenary, the other captained by a man from Riddick's past.",
        "runtimeMinutes": "119"
    },
    "2013_690": {
        "plotSummary": "A paraplegic's friends pay him an unannounced visit to challenge his secluded life.",
        "runtimeMinutes": "90"
    },
    "2013_691": {
        "plotSummary": "The story of \"Lunch atop a Skyscraper,\" the iconic photograph taken during the construction of 30 Rockefeller Plaza.",
        "runtimeMinutes": "75"
    },
    "2013_692": {
        "plotSummary": "A group of young Londoners struggle to find meaning in their lives while masking their discontent with sex, drugs, and rock 'n roll. Read more: Synopsis",
        "runtimeMinutes": "78"
    },
    "2013_693": {
        "plotSummary": "Their relationship on the rocks, a young Brooklyn couple heads to a remote B&B to work things out. But from the moment they arrive at The Happy House it's one disaster after another, and they soon begin to suspect they've wandered into a ...See moreTheir relationship on the rocks, a young Brooklyn couple heads to a remote B&B to work things out. But from the moment they arrive at The Happy House it's one disaster after another, and they soon begin to suspect they've wandered into a real life horror movie. Events escalate from weird to terrifying as they contend with the house's batty owner, her imposing son, a moody Swedish lepidopterist, a pedantic English professor, an extraordinarily rare butterfly, the world's best blueberry muffins, a .44 Magnum, a demented serial killer, and one very strict rulebook.  Written by Happy HouseSee less",
        "runtimeMinutes": "81"
    },
    "2013_694": {
        "plotSummary": "In a world where ghosts, ghouls, and goblins are a common place, the InSpectres are the only exterminators capable of eliminating these supernatural nuisances! After a run in with a zombie, Lucas joins the InSpectres as an agent in ...See moreIn a world where ghosts, ghouls, and goblins are a common place, the InSpectres are the only exterminators capable of eliminating these supernatural nuisances! After a run in with a zombie, Lucas joins the InSpectres as an agent in training. He, his mentor Tracey, and company embark on eerily funny adventure aimed at re-capturing entities freed from a government holding facility by a corporate saboteur. They encounter a variety of released oddities on their path to identifying the saboteur: an invisible Hollywood fan-boy, a party animal wolf-man, and a group of German gremlins who fix 8-Bit arcade machines. The motley crew tracks the culprit across the country to prevent Armageddon. In the end, the Inspectres' heart and persistence prove exactly why they are the ones who \"...fight the forces of darkness so you don't have to!\"  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2013_695": {
        "plotSummary": "Paul Harris works at a small research facility on the outskirts of Boston. After a weekend tryst with a co-worker leaves him wanting more, his unreciprocated desires gradually mold into an acute infatuation. When Danielle takes interest in...See morePaul Harris works at a small research facility on the outskirts of Boston. After a weekend tryst with a co-worker leaves him wanting more, his unreciprocated desires gradually mold into an acute infatuation. When Danielle takes interest in a new scientist at the laboratory, Paul's suppressed resentments and perverse delusions finally become unhinged, triggering a horrific course of events that mercilessly engulf a tortured past and fugitive present.  Written by Alex Karpovsky and Garth DonovanSee less",
        "runtimeMinutes": "83"
    },
    "2013_696": {
        "plotSummary": "A solipsistic filmmaker takes his independent film on tour. Hoping to escape the pain of his recent breakup, he stumbles into a twisting constellation of fear, sex, and tortured illumination. A tragicomedy about death and marriage, RED ...See moreA solipsistic filmmaker takes his independent film on tour. Hoping to escape the pain of his recent breakup, he stumbles into a twisting constellation of fear, sex, and tortured illumination. A tragicomedy about death and marriage, RED FLAG unfurls across six sates, four broken souls, and one very elusive bird.  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2013_697": {
        "plotSummary": "A newlywed couple cancels their honeymoon and returns to the snowy Midwest to make the funeral arrangements for their best man, who died unexpectedly after their ceremony.",
        "runtimeMinutes": "89"
    },
    "2013_698": {
        "plotSummary": "A group of oddball high school students find themselves trapped in detention with their classmates having turned into a horde of Zombies.",
        "runtimeMinutes": "87"
    },
    "2013_699": {
        "plotSummary": "In the film \"You Don't Need Feet to Dance,\" African immigrant Sidiki Conde, having lost the use of his legs to polio at fourteen, balances his career as a performing artist with the almost insurmountable obstacles of life in New York City,...See moreIn the film \"You Don't Need Feet to Dance,\" African immigrant Sidiki Conde, having lost the use of his legs to polio at fourteen, balances his career as a performing artist with the almost insurmountable obstacles of life in New York City, from his fifth-floor walk up apartment in the East village, down the stairs with his hands and navigating in his wheelchair through Manhattan onto buses and into the subway. Sidiki struggles to cope with his disability and to earn a decent living, but he still manages to teach workshops for disabled kids, busk on the street, rehearse with his musical group, bicycle with his hands, and prepare for a baby naming ceremony, where he plays djembe drums, sings, and dances on his hands.  Written by Alan GovenarSee less",
        "runtimeMinutes": "88"
    },
    "2013_7": {
        "plotSummary": "A look at the relationship between Mike Wazowski (Billy Crystal) and James P. \"Sully\" Sullivan (John Goodman) during their days at Monsters University, when they weren't necessarily the best of friends.",
        "runtimeMinutes": "104"
    },
    "2013_70": {
        "plotSummary": "A young woman with a mysterious past lands in Southport, North Carolina where her bond with a widower forces her to confront the dark secret that haunts her.",
        "runtimeMinutes": "115"
    },
    "2013_700": {
        "plotSummary": "A courier for a local crime lord must deliver a mysterious package while being chased by a horde of unusual gangsters.",
        "runtimeMinutes": "95"
    },
    "2013_701": {
        "plotSummary": "The inhabitants of a small town and it's very popular diner have to fend off a nasty infestation of hungry zombies.",
        "runtimeMinutes": "94"
    },
    "2013_702": {
        "plotSummary": "Jesse Sorensen ruled Florida as a pro skateboarder for over a decade. He had it all - a lucrative skateboarding contract, girls, fame and an extravagant lifestyle. Now six years later, past his prime and his usefulness in this youth-driven...See moreJesse Sorensen ruled Florida as a pro skateboarder for over a decade. He had it all - a lucrative skateboarding contract, girls, fame and an extravagant lifestyle. Now six years later, past his prime and his usefulness in this youth-driven culture, Jesse is dropped by his skate team. Broke, he moves in with his elderly grandmother only to discover his 17-year old niece, Samantha, crashing there as well. She is following the same slippery slope Jesse once paved, with the hottest new skater in town. Jesse must confront what he has spent his entire life avoiding - responsibility - and figure out his future once and for all.  Written by Blue Llama StudiosSee less",
        "runtimeMinutes": "87"
    },
    "2013_703": {
        "plotSummary": "After her unborn baby is snatched from her womb, Liz and her husband take a vacation to help them overcome the horrifying and mysterious loss. Her brother documents the trip as Liz continues to be terrorized by an unknown force.",
        "runtimeMinutes": "84"
    },
    "2013_704": {
        "plotSummary": "A rare astronomical event causes a permanent worldwide black out, forcing residents of a middle-class suburb to get by with no modern conveniences.",
        "runtimeMinutes": "94"
    },
    "2013_705": {
        "plotSummary": "A slacker hatches a million-dollar idea. But, in order to see it through, he has to learn to trust his attractive corporate counterpart. Based on Max Barry's novel.",
        "runtimeMinutes": "90"
    },
    "2013_706": {
        "plotSummary": "Triumph of the Wall is a film about expectations. Its the story of two guys who embarked on an eight week journey and spent the next eight years trying to figure out how to finish what they started.",
        "runtimeMinutes": "102"
    },
    "2013_71": {
        "plotSummary": "Five friends head to a remote cabin, where the discovery of a Book of the Dead leads them to unwittingly summon up demons living in the nearby woods.",
        "runtimeMinutes": "91"
    },
    "2013_72": {
        "plotSummary": "In 1947, Jackie Robinson becomes the first African-American to play in Major League Baseball in the modern era when he was signed by the Brooklyn Dodgers and faces considerable racism in the process.",
        "runtimeMinutes": "128"
    },
    "2013_73": {
        "plotSummary": "When her mother disappears, Clary Fray learns that she descends from a line of warriors who protect our world from demons. She joins forces with others like her and heads into a dangerous alternate New York called the Shadow World.",
        "runtimeMinutes": "130"
    },
    "2013_74": {
        "plotSummary": "The merciless 1970s rivalry between Formula One rivals James Hunt and Niki Lauda.",
        "runtimeMinutes": "123"
    },
    "2013_75": {
        "plotSummary": "A man looking for the release of a long-time prisoner takes a police officer, his daughter, and a group of strangers hostage. Read more: Synopsis",
        "runtimeMinutes": "110"
    },
    "2013_76": {
        "plotSummary": "Two salesmen whose careers have been torpedoed by the digital age find their way into a coveted internship at Google, where they must compete with a group of young, tech-savvy geniuses for a shot at employment.",
        "runtimeMinutes": "119"
    },
    "2013_77": {
        "plotSummary": "A wealthy family is held hostage for harboring the target of a murderous syndicate during the Purge, a 12-hour period in which any and all crime is legal.",
        "runtimeMinutes": "85"
    },
    "2013_78": {
        "plotSummary": "When Sahir, a circus entertainer trained in magic and acrobatics, turns into a thief to take down a corrupt bank in Chicago that ruined his father, Indian officers Jai and Ali are called to catch him.",
        "runtimeMinutes": "172"
    },
    "2013_79": {
        "plotSummary": "A trio of bodybuilders in Florida get caught up in an extortion ring and a kidnapping scheme that goes terribly wrong.",
        "runtimeMinutes": "129"
    },
    "2013_8": {
        "plotSummary": "Two astronauts work together to survive after an accident leaves them stranded in space.",
        "runtimeMinutes": "91"
    },
    "2013_80": {
        "plotSummary": "At the age of 21, Tim discovers he can travel in time and change what happens and has happened in his own life. His decision to make his world a better place by getting a girlfriend turns out not to be as easy as you might think.",
        "runtimeMinutes": "123"
    },
    "2013_81": {
        "plotSummary": "In a future where a failed climate-change experiment has killed all life except for the lucky few who boarded the Snowpiercer, a train that travels around the globe, a new class system emerges.",
        "runtimeMinutes": "126"
    },
    "2013_82": {
        "plotSummary": "A shy girl, outcasted by her peers and sheltered by her religious mother, unleashes telekinetic terror on her small town after being pushed too far at her senior prom.",
        "runtimeMinutes": "100"
    },
    "2013_83": {
        "plotSummary": "A woman from Beijing, pregnant with the child of her rich married boyfriend flies to Seattle in order to deliver the baby. There she meets another Chinese immigrant man working as a driver, even as she finds her life beginning to change.",
        "runtimeMinutes": "121"
    },
    "2013_84": {
        "plotSummary": "An ambitious tax attorney decides to represent an old friend in court.",
        "runtimeMinutes": "127"
    },
    "2013_85": {
        "plotSummary": "The Manzoni family, a notorious mafia clan, is relocated to Normandy, France under the Witness Protection Program, where fitting in soon becomes challenging, as their old habits die hard.",
        "runtimeMinutes": "111"
    },
    "2013_86": {
        "plotSummary": "A couple begin to experience some unusual activity after bringing their lost nieces and nephew home. With the help of home-surveillance cameras, they learn they're being stalked by a nefarious demon.",
        "runtimeMinutes": "88"
    },
    "2013_87": {
        "plotSummary": "A recently slain cop joins a team of undead police officers working for the Rest in Peace Department and tries to find the man who murdered him.",
        "runtimeMinutes": "96"
    },
    "2013_88": {
        "plotSummary": "When four best friends try and move forward in their work and personal life, they realize that trying to live their life's dream is more difficult than they imagine -- especially in the high fashion world of Shanghai.",
        "runtimeMinutes": "116"
    },
    "2013_89": {
        "plotSummary": "While subjected to the horrors of World War II Germany, young Liesel finds solace by stealing books and sharing them with others. In the basement of her home, a Jewish refugee is being protected by her adoptive parents.",
        "runtimeMinutes": "131"
    },
    "2013_9": {
        "plotSummary": "An alien child is evacuated from his dying world and sent to Earth to live among humans. His peace is threatened, when other survivors of his home planet invade Earth.",
        "runtimeMinutes": "143"
    },
    "2013_90": {
        "plotSummary": "Astronaut Scorch Supernova finds himself caught in a trap when he responds to an SOS from a notoriously dangerous alien planet.",
        "runtimeMinutes": "89"
    },
    "2013_91": {
        "plotSummary": "A look at the lives of the strong-willed women of the Weston family, whose paths have diverged until a family crisis brings them back to the Oklahoma house they grew up in, and to the dysfunctional woman who raised them.",
        "runtimeMinutes": "121"
    },
    "2013_92": {
        "plotSummary": "When college friends reunite after 15 years over the Christmas holidays, they discover just how easy it is for long-forgotten rivalries and romances to be reignited.",
        "runtimeMinutes": "123"
    },
    "2013_93": {
        "plotSummary": "A lawyer finds himself in over his head when he gets involved in drug trafficking.",
        "runtimeMinutes": "117"
    },
    "2013_94": {
        "plotSummary": "When a veteran 911 operator takes a life-altering call from a teenage girl who has just been abducted, she realizes that she must confront a killer from her past in order to save the girl's life.",
        "runtimeMinutes": "96"
    },
    "2013_95": {
        "plotSummary": "A look at Niall, Zayn, Liam, Louis, and Harry's meteoric rise to fame, from their humble hometown beginnings and competing on the X-Factor, to conquering the world and performing at London's famed O2 Arena.",
        "runtimeMinutes": "92"
    },
    "2013_96": {
        "plotSummary": "A group of Russian soldiers fight to hold a strategic building in their devastated city against a ruthless German army, and in the process become deeply connected to two Russian women who have been living there.",
        "runtimeMinutes": "131"
    },
    "2013_97": {
        "plotSummary": "Thunder, an abandoned young cat seeking shelter from a storm, stumbles into the strangest house imaginable, owned by an old magician and inhabited by a dazzling array of automatons and gizmos.",
        "runtimeMinutes": "85"
    },
    "2013_98": {
        "plotSummary": "The story of martial-arts master Ip Man, the man who trained Bruce Lee.",
        "runtimeMinutes": "130"
    },
    "2013_99": {
        "plotSummary": "A young woman's world unravels when a drug prescribed by her psychiatrist has unexpected side effects.",
        "runtimeMinutes": "106"
    }
}