{
    "2014_1": "When humanity allies with a bounty hunter in pursuit of Optimus Prime, the Autobots turn to a mechanic and his family for help.",
    "2014_10": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
    "2014_100": "Private investigator Matthew Scudder is hired by a drug kingpin to find out who kidnapped and murdered his wife.",
    "2014_101": "The team of people who saved Winter's life reassemble in the wake of her surrogate mother's passing in order to find her a companion so she can remain at the Clearwater Marine Hospital.",
    "2014_102": "A young boy whose parents have just divorced finds an unlikely friend and mentor in the misanthropic, bawdy, hedonistic war veteran who lives next door.",
    "2014_103": "An unstable escaped convict terrorizes a woman who is alone with her two children.",
    "2014_104": "A dying CIA agent trying to reconnect with his estranged daughter is offered an experimental drug that could save his life in exchange for one last assignment.",
    "2014_105": "A chronicle of one woman's one thousand one hundred mile solo hike undertaken as a way to recover from a recent personal tragedy.",
    "2014_106": "A romantic comedy about an Englishman brought in to help unmask a possible swindle. Personal and professional complications ensue.",
    "2014_107": "Follow two couples as they journey from the bar to the bedroom and are eventually put to the test in the real world.",
    "2014_108": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential.",
    "2014_109": "A head chef quits his restaurant job and buys a food truck in an effort to reclaim his creative promise, while piecing back together his estranged family.",
    "2014_11": "A special bond develops between plus-sized inflatable robot Baymax and prodigy Hiro Hamada, who together team up with a group of friends to form a band of high-tech heroes.",
    "2014_110": "The life of Mason, from early childhood to his arrival at college.",
    "2014_111": "Lu and Feng are a devoted couple forced to separate when Lu is arrested and sent to a labor camp as a political prisoner during the Cultural Revolution. He finally returns home only to find that his beloved wife no longer recognizes him.",
    "2014_112": "An unexpected romance blooms after the the youngest daughter of a merchant who has fallen on hard times offers herself to the mysterious beast to which her father has become indebted. Read more: Synopsis",
    "2014_113": "When Louis Bloom, a con man desperate for work, muscles into the world of L.A. crime journalism, he blurs the line between observer and participant to become the star of his own story.",
    "2014_114": "After receiving a bizarre series of encrypted messages, a group of kids embark on an adventure with an alien who needs their help.",
    "2014_115": "Three best friends find themselves where we've all been - at that confusing moment in every dating relationship when you have to decide \"So...where is this going?\"",
    "2014_116": "The story is about 3 young men going after their dream in the movie business in China for a big investment. It reveals the difficulty and despair to get an opportunity there. In the meantime, to get relax from the work of script writing, ...See moreThe story is about 3 young men going after their dream in the movie business in China for a big investment. It reveals the difficulty and despair to get an opportunity there. In the meantime, to get relax from the work of script writing, one of them met a girl through mobile app and start a complicate relationship with her.  Written by Bryan ChengSee less",
    "2014_117": "A woman tries to exonerate her brother, who was convicted of murder, by proving that the crime was committed by a supernatural phenomenon.",
    "2014_118": "Devi Lal Singh, a typical youth with an anomalous standard of living, tries to find pleasure in whatever he does. He eventually becomes a thief and dons a new name, Devil.",
    "2014_119": "A young bank receptionist gets mixed up with Rajveer Nanda, a man who has a mysterious background.",
    "2014_12": "When Hiccup and Toothless discover an ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace.",
    "2014_120": "When a team of explorers ventures into the catacombs that lie beneath the streets of Paris, they uncover the dark secret that lies within this city of the dead.",
    "2014_121": "After their father passes away, four grown siblings are forced to return to their childhood home and live under the same roof for a week, along with their over-sharing mother and an assortment of spouses, exes and might-have-beens.",
    "2014_122": "An ex-C.I.A. operative is brought back in on a very personal mission and finds himself pitted against his former pupil in a deadly game involving high level C.I.A. officials and the Russian President-elect.",
    "2014_123": "Some of Sin City's most hard-boiled citizens cross paths with a few of its more reviled inhabitants.",
    "2014_124": "Literature professor and gambler Jim Bennett's debt causes him to borrow money from his mother and a loan shark. Further complicating his situation, is his relationship with one of his students. Will Bennett risk his life for a second chance?",
    "2014_125": "Senegalese Samba has worked 10 years in France. He's arrested and befriends the woman helping him with legal matters as volunteer after a burnout at work. He's released after being told to leave France. Chemistry?",
    "2014_126": "When a woman decides to take it upon herself to win back the love of her live, she realizes she'll have to sink to using her female prowess -- and becoming what she despises the most -- a woman who flirts.",
    "2014_127": "A pair of former high school sweethearts reunite after many years when they return to visit their small hometown.",
    "2014_128": "A sports agent stages an unconventional recruitment strategy to get talented Indian cricket players to play Major League Baseball.",
    "2014_129": "An Australian man travels to Turkey after the Battle of Gallipoli to try and locate his three missing sons.",
    "2014_13": "Navy S.E.A.L. sniper Chris Kyle's pinpoint accuracy saves countless lives on the battlefield and turns him into a legend. Back home with his family after four tours of duty, however, Chris finds that it is the war he can't leave behind.",
    "2014_130": "1970s Beijing: two school friends, both with different backgrounds and families, lose touch, only to rekindle the romance in New York City, where they must decide between a present love or a future love.",
    "2014_131": "After a mysterious, lost night on their honeymoon, a newlywed couple finds themselves dealing with an earlier-than-planned pregnancy.",
    "2014_132": "A Chechen Muslim illegally immigrates to Hamburg, where he gets caught in the international war on terror.",
    "2014_133": "A period action film centered on a militia group who turn against an unjust nobility.",
    "2014_134": "Due to 12 y.o. Anna's asthma, she's sent to stay with relatives of her guardian in the Japanese countryside. She likes to be alone, sketching. She befriends Marnie. Who is the mysterious, blonde Marnie.",
    "2014_135": "The story of a privileged girl and a charismatic boy whose instant desire sparks a love affair made only more reckless by parents trying to keep them apart.",
    "2014_136": "A chronicle of James Brown's rise from extreme poverty to become one of the most influential musicians in history.",
    "2014_137": "Go-ni's nephew, Ham Dae-gil, enters the gambling underworld only to be used as a scapegoat in a deal gone wrong. Now he's planning his revenge by entering one big fatal game.",
    "2014_138": "A burglar falls for an heiress as she dies in his arms. When he learns that he has the gift of reincarnation, he sets out to save her.",
    "2014_139": "Six short stories that explore the extremities of human behavior involving people in distress.",
    "2014_14": "The world is beset by the appearance of monstrous creatures, but one of them may be the only one who can save humanity.",
    "2014_140": "The journey of legendary football coach Bob Ladouceur, who took the De La Salle High School Spartans from obscurity to a 151-game winning streak that shattered all records for any American sport.",
    "2014_141": "At the NFL Draft, General Manager Sonny Weaver has the opportunity to rebuild his team when he trades for the number one pick. He must decide what he's willing to sacrifice on a life-changing day for a few hundred young men with NFL dreams.",
    "2014_142": "A drama about the awakening of painter Margaret Keane, her phenomenal success in the 1950s, and the subsequent legal difficulties she had with her husband, who claimed credit for her works in the 1960s.",
    "2014_143": "A professional baduk player infiltrates his local underground gambling scene to avenge his brother's death.",
    "2014_144": "A small group of survivors are left behind after millions of people suddenly vanish and the world is plunged into chaos and destruction.",
    "2014_145": "After trying to cover up a car accident that left a man dead, a crooked homicide detective is stalked by a mysterious man claiming to have witnessed the event.",
    "2014_146": "A comedian tries to make it as a serious actor when his reality television star fiancee talks him into broadcasting their wedding on her television show.",
    "2014_147": "An imperial guard and his three traitorous childhood friends ordered to hunt him down get accidentally buried and kept frozen in time. 400 years later passes and they are defrosted continuing the battle they left behind.",
    "2014_148": "Rosie and Alex have been best friends since they were 5, so they couldn't possibly be right for one another...or could they? When it comes to love, life and making the right choices, these two are their own worst enemies.",
    "2014_149": "Having exorcised the demons of his ex, Malcolm is starting fresh with his new girlfriend and her two children. After moving into their dream home, however, Malcolm is once again plagued by bizarre paranormal events.",
    "2014_15": "It's a jungle out there for Blu, Jewel and their three kids after they're hurtled from Rio de Janeiro to the wilds of the Amazon. As Blu tries to fit in, he goes beak-to-beak with the vengeful Nigel, and meets his father-in-law.",
    "2014_150": "A self-absorbed realtor enlists the help of his neighbor when he's suddenly left in charge of the granddaughter he never knew existed until his estranged son drops her off at his home.",
    "2014_151": "A martial arts instructor from the police force gets imprisoned after killing a man by accident. But when a vicious killer starts targeting martial arts masters, the instructor offers to help the police in return for his freedom.",
    "2014_152": "Fioravante decides to become a professional Don Juan as a way of making money to help his cash-strapped friend, Murray. With Murray acting as his \"manager\", the duo quickly finds themselves caught up in the crosscurrents of love and money.",
    "2014_153": "This movie chronicles how Chetan met his wife and the difficulties they faced due to their cultural differences.",
    "2014_154": "An exploration of the last quarter century of the great, if eccentric, British painter J.M.W. Turner's life.",
    "2014_155": "Members of an elite DEA task force find themselves being taken down one by one after they rob a drug cartel safe house.",
    "2014_156": "Shortly after a tornado rips through her Kansas home, Dorothy returns to Oz to save her friends from a villainous jester.",
    "2014_157": "A documentary that follows an Alaskan bear family as its young cubs are taught life's most important lessons.",
    "2014_158": "A look at the life of French designer Yves Saint-Laurent from the beginning of his career in 1958 when he met his lover and business partner, Pierre Berge.",
    "2014_159": "A small-time trafficker working in the Gibraltar Straits.",
    "2014_16": "When a kingpin threatens New York City, a group of mutated turtle warriors must emerge from the shadows to protect their home.",
    "2014_160": "A dutiful cop, guilt-ridden over saving the life of a gang leader, becomes obsessed with bringing down the crime syndicate of the man he saved.",
    "2014_161": "Depressed single mom Adele and her son Henry offer a wounded, fearsome man a ride. As police search town for the escaped convict, the mother and son gradually learn his true story as their options become increasingly limited.",
    "2014_162": "U.S. Olympic wrestling champions and brothers Mark Schultz and Dave Schultz join \"Team Foxcatcher\", led by eccentric multi-millionaire John du Pont, as they train for the 1988 Olympic Games in Seoul, South Korea, but John's ...See moreU.S. Olympic wrestling champions and brothers Mark Schultz and Dave Schultz join \"Team Foxcatcher\", led by eccentric multi-millionaire John du Pont, as they train for the 1988 Olympic Games in Seoul, South Korea, but John's self-destructive behavior threatens to consume them all.See less",
    "2014_163": "Bob Saginowski finds himself at the center of a robbery gone awry and entwined in an investigation that digs deep into the neighborhood's past where friends, families, and foes all work together to make a living - no matter the cost.",
    "2014_164": "The untold story of Mexico's greatest and most beloved comedy film star of all time, from his humble origins on the small stage to the bright lights of Hollywood.See moreThe untold story of Mexico's greatest and most beloved comedy film star of all time, from his humble origins on the small stage to the bright lights of Hollywood.  Written by Pantelion FilmsSee less",
    "2014_165": "A university professor and a team of students conduct an experiment on a young woman, uncovering terrifyingly dark, unexpected forces in the process.",
    "2014_166": "A woman wakes up every day, remembering nothing as a result of a traumatic accident in her past. One day, new terrifying truths emerge that force her to question everyone around her.",
    "2014_167": "A gallerist risks her family and flourishing career when she enters into an affair with a talented painter and slowly loses control of her life.",
    "2014_168": "After he is threatened during a confession, a good-natured priest must battle the dark forces closing in around him.",
    "2014_169": "An archaeological team attempts to unlock the secrets of a lost pyramid only to find themselves hunted by an insidious creature.",
    "2014_17": "An ordinary LEGO construction worker, thought to be the prophesied as \"special\", is recruited to join a quest to stop an evil tyrant from gluing the LEGO universe into eternal stasis.",
    "2014_170": "U.K. gay activists work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984.",
    "2014_171": "The mixed-race daughter, Dido Elizabeth Belle (Gugu Mbatha-Raw), of Royal Navy Captain Sir John Lindsay (Matthew Goode) is raised by aristocratic Great-uncle Lord William Murray, 1st Earl of Mansfield (Tom Wilkinson) in eighteenth century England.",
    "2014_172": "When five struggling single moms put aside their differences to form a support group, they find inspiration and laughter in their new sisterhood, and help each other overcome the obstacles that stand in their way.",
    "2014_173": "Rose Hathaway is a Dhampir, half human-half vampire, a guardian of the Moroi, peaceful, mortal vampires living discreetly within our world. Her calling is to protect the Moroi from bloodthirsty, immortal Vampires, the Strigoi.",
    "2014_174": "In 1970, drug-fueled Los Angeles private investigator Larry \"Doc\" Sportello investigates the disappearance of a former girlfriend.",
    "2014_175": "The pressures of fame have superstar singer Noni on the edge, until she meets Kaz, a young cop who works to help her find the courage to develop her own voice and break free to become the artist she was meant to be.",
    "2014_176": "A story that questions the shaming of the US through revisionist history, lies and omissions by educational institutions, political organizations, Alinsky, Barack Obama, Hillary Clinton and other progressives to destroy America. Read more: Synopsis",
    "2014_177": "A documentary that follows Dr. Patricia C. Wright's mission to help lemurs, the highly evolved creatures who arrived on Madagascar millions of years ago as castaways but are now highly endangered.",
    "2014_178": "Two spoiled brats meet over the purchase of an expensive wedding skirt in Delhi. Thus begins a romance under the shadow of her arranged marriage.",
    "2014_179": "A thriller centered on a con artist, his wife, and a stranger who flee Athens after one of them is caught up in the death of a private detective.",
    "2014_18": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic.",
    "2014_180": "A widowed single mother, raising her violent son alone, finds new hope when a mysterious neighbor inserts herself into their household.",
    "2014_181": "A French police magistrate spends years trying to take down one of the country's most powerful drug rings.",
    "2014_182": "In New York City 1981, an ambitious immigrant fights to protect his business and family during the most dangerous year in the city's history.",
    "2014_183": "Dave Skylark and his producer Aaron Rapaport run the celebrity tabloid show \"Skylark Tonight\". When they land an interview with a surprise fan, North Korean dictator Kim Jong-un, they are recruited by the CIA to assassinate him.",
    "2014_184": "In order to escape crime and clutches of a ruthless mafia, a Bangkok based hit man seeks the help of his lookalike, a Mumbai based goon.",
    "2014_185": "Five married guys secretly share a penthouse loft in the city where they can carry out hidden affairs. But the fantasy becomes a nightmare, when they discover the dead body of a woman in the loft one of the group must be involved.",
    "2014_186": "An American inherits an apartment in Paris that comes with an unexpected resident.",
    "2014_187": "Hardworking mom Allyson has a crazy night out with her friends, while their husbands watch their children.",
    "2014_188": "Seenu and Sunaina fall in love with each other when he saves her from a corrupt policeman who wishes to marry her. Meanwhile, Ayesha, a girl Seenu meets on a train journey, wants to marry him.",
    "2014_189": "A single mother and her child fall into a deep well of paranoia when an eerie children's book titled \"Mister Babadook\" manifests in their home.",
    "2014_19": "Skipper, Kowalski, Rico and Private join forces with undercover organization The North Wind to stop the villainous Dr. Octavius Brine from destroying the world as we know it.",
    "2014_190": "The destinies of two families are irrevocably tied together after a cyclist is hit off the road by a jeep in the night before Christmas Eve.",
    "2014_191": "Liège, Belgium. Sandra is a factory worker who discovers that her workmates have opted for a EUR1,000 bonus in exchange for her dismissal. She has only a weekend to convince her colleagues to give up their bonuses in order to keep her job.",
    "2014_192": "Wallace, who is burned out from a string of failed relationships, forms an instant bond with Chantry, who lives with her longtime boyfriend. Together, they puzzle out what it means if your best friend is also the love of your life.",
    "2014_193": "A divorced couple scheme to recover the retirement money that was stolen from them.",
    "2014_194": "A reporter's dream of becoming a news anchor is compromised after a one-night stand leaves her stranded in downtown L.A. without a phone, car, ID or money - and only 8 hours to make it to the most important job interview of her life.",
    "2014_195": "A spelling bee loser sets out to exact revenge by finding a loophole and attempting to win as an adult.",
    "2014_196": "A man embarks on a road trip to find his lost love.",
    "2014_197": "The daily life of an hospital through the eyes of new intern Benjamin.",
    "2014_198": "Four people meet on New Year's Eve, and form a surrogate family to help one another with the difficulties of their lives.",
    "2014_199": "A cattle herder and his family who reside in the dunes of Timbuktu find their quiet lives -- which are typically free of the Jihadists determined to control their faith -- abruptly disturbed.",
    "2014_2": "Bilbo and company are forced to engage in a war against an array of combatants and keep the Lonely Mountain from falling into the hands of a rising darkness.",
    "2014_20": "A soldier fighting aliens gets to relive the same day over and over again, the day restarting every time he dies.",
    "2014_200": "A veteran postman finds his beliefs challenged after he enters a TV talent show competition.",
    "2014_201": "Returning to her childhood home in Louisiana to recuperate from a horrific car accident, Jessabelle comes face to face with a long-tormented spirit that has been seeking her return -- and has no intention of letting her escape.",
    "2014_202": "Viago, Deacon and Vladislav are vampires who are finding that modern life has them struggling with the mundane - like paying rent, keeping up with the chore wheel, trying to get into nightclubs and overcoming flatmate conflicts.",
    "2014_203": "Nikhil is re-introduced to Meeta nearly ten years after their first meeting. Now, as Nikhil has one week to prove himself worth enough to marry Meeta's sister Karishma, the old acquaintances become quite close to each other.",
    "2014_204": "A biography of the civil-rights activist and labor organizer Cesar Chavez.",
    "2014_205": "A young woman discovers her elite Manhattan preparatory school harbors a dark secret.",
    "2014_206": "Only a short time after the first raid, Rama goes undercover with the thugs of Jakarta and plans to bring down the syndicate and uncover the corruption within his police force.",
    "2014_207": "A psychiatrist searches the globe to find the secret of happiness.",
    "2014_208": "Kotetsu T. Kaburagi, a.k.a. Wild Tiger, and Barnaby Brooks Jr. resume their careers as heroes fighting crime. But their partnership comes to a sudden end when Apollon Media's new owner Mark Schneider fires Kotetsu and moves Barnaby back ...See moreKotetsu T. Kaburagi, a.k.a. Wild Tiger, and Barnaby Brooks Jr. resume their careers as heroes fighting crime. But their partnership comes to a sudden end when Apollon Media's new owner Mark Schneider fires Kotetsu and moves Barnaby back into the First League, pairing him up with Golden Ryan, a new hero with awesome powers and a huge ego to match. When the heroes are sent to investigate a string of strange incidents tied closely to the city's Goddess Legend, they discover three superpowered NEXTs plotting to bring terror and destruction to Stern Bild. With the lives of millions hanging in the balance, Barnaby and Golden Ryan must overcome their differences to contain the approaching doom, while a jobless Kotetsu's resolve as a hero is put to the test as he struggles to help his fellow heroes from the sidelines.  Written by ELEVEN ARTSSee less",
    "2014_209": "Greta moves into her recently deceased aunt's mansion and starts throwing wild parties with her friends; however, what looks to be the best summer of their lives turns into a fight for their lives after Beker, her aunt's prized cat, drowns...See moreGreta moves into her recently deceased aunt's mansion and starts throwing wild parties with her friends; however, what looks to be the best summer of their lives turns into a fight for their lives after Beker, her aunt's prized cat, drowns in the home's pool.See less Read more: Synopsis",
    "2014_21": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
    "2014_210": "Two men, six meals in six different places on a road trip around Italy. Liguria, Tuscany, Rome, Amalfi and ending in Capri.",
    "2014_211": "Meet the Mormons examines the very diverse lives of six devout members of the Church of Jesus Christ of Latter-day Saints. Filmed on location and across the globe, Meet the Mormons takes viewers on a journey into the day-to-day realities ...See moreMeet the Mormons examines the very diverse lives of six devout members of the Church of Jesus Christ of Latter-day Saints. Filmed on location and across the globe, Meet the Mormons takes viewers on a journey into the day-to-day realities of individuals living in the U.S., Costa Rica, Nepal and beyond. From their individual passions to their daily struggles, each story paints a picture as rich and unique as the next while challenging the stereotypes that surround the Mormon faith.  Written by Excel Entertainment GroupSee less",
    "2014_212": "A young woman goes on a 1,700-mile trek across the deserts of West Australia with four camels and her faithful dog. Read more: Synopsis",
    "2014_213": "A disfigured Holocaust survivor sets out to determine if the man she loved betrayed her trust.",
    "2014_214": "Having both coincidentally cheated death on the same day, estranged twins reunite with the possibility of mending their relationship.",
    "2014_215": "A mysterious young woman seduces lonely men in the evening hours in Scotland. However, events lead her to begin a process of self-discovery.",
    "2014_216": "A struggling actor, father and husband finds himself at a major crossroads, which forces him to examine his life, his family and his career.",
    "2014_217": "Beneath Bruce Garrett's under-confident, overweight exterior, the passionate heart of a salsa king lies dormant. Now, one woman is about to reignite his Latin fire.",
    "2014_218": "Set during the Cold War, American chess prodigy Bobby Fischer finds himself caught between two superpowers and his own struggles as he challenges the Soviet Empire.",
    "2014_219": "Dheepan is a Sri Lankan Tamil warrior who flees to France and ends up working as a caretaker outside Paris.",
    "2014_22": "Larry spans the globe, uniting favorite and new characters while embarking on an epic quest to save the magic before it is gone forever.",
    "2014_220": "In Colombia, a young surfer meets the woman of his dreams - and then meets her uncle, Pablo Escobar.",
    "2014_221": "The life and work of photographer Sebastião Salgado, who has spent forty years documenting deprived societies in hidden corners of the world.",
    "2014_222": "Journalist Gary Webb, California 1996, started investigating CIA's role in the 1980s in getting crack cocaine to the black part of LA to get money and weapons to the Contras/freedom fighters in Nicaragua.",
    "2014_223": "A young woman makes a surprising discovery about the husband of her late best friend.",
    "2014_224": "Ramon, a young Mexican boy, tries to cross the border for the fifth time but fails. His friend tells him about his aunt living in Germany and that she has a better life over there. Ramon then goes to Germany to find his friend's aunt.",
    "2014_225": "In Depression-era North Carolina, the future of George Pemberton's timber empire becomes complicated when he marries Serena.",
    "2014_226": "Libby Day was only eight years old when her family was brutally murdered in their rural Kansas farmhouse. Almost thirty years later, she reluctantly agrees to revisit the crime and uncovers the wrenching truths that led up to that tragic night.",
    "2014_227": "Ivan Locke, a dedicated family man and successful construction manager, receives a phone call on the eve of the biggest challenge of his career that sets in motion a series of events that threaten his carefully cultivated existence.",
    "2014_228": "Simon Bolivar fought over 100 battles against the Spanish Empire in South America. He rode over 70,000 miles on horseback. His military campaigns covered twice the territory of Alexander the Great. His army never conquered -- it liberated. Read more: Synopsis",
    "2014_229": "The continuation of Joe's sexually dictated life delves into the darker aspects of her adulthood, obsessions and what led to her being in Seligman's care.",
    "2014_23": "Noah is chosen by God to undertake a momentous mission before an apocalyptic flood cleanses the world.",
    "2014_230": "An ill-fated television reporter is rescued and sent on a voyage across the ocean, but she is followed by the deadly virus that has plagued her and numerous others.",
    "2014_231": "During the Depression, Jimmy Gralton returns home to Ireland after ten years of exile in America. Seeing the levels of poverty and oppression, the activist in him reawakens and he looks to re-open the dance hall that led to his deportation.",
    "2014_232": "For his final assignment, a top temporal agent must pursue the one criminal that has eluded him throughout time. The chase turns into a unique, surprising and mind-bending exploration of love, fate, identity and time travel taboos.",
    "2014_233": "Set in Brazil, three kids who make a discovery in a garbage dump soon find themselves running from the cops and trying to right a terrible wrong.",
    "2014_234": "A film star comes face-to-face with an uncomfortable reflection of herself while starring in a revival of the play that launched her career.",
    "2014_235": "Martin, an ex-Parisian well-heeled hipster passionate about Gustave Flaubert who settled into a Norman village as a baker, sees an English couple moving into a small farm nearby. Not only are the names of the new arrivals Gemma and Charles...See moreMartin, an ex-Parisian well-heeled hipster passionate about Gustave Flaubert who settled into a Norman village as a baker, sees an English couple moving into a small farm nearby. Not only are the names of the new arrivals Gemma and Charles Bovery, but their behavior also seems to be inspired by Flaubert's heroes.  Written by Toronto International Film FestivalSee less",
    "2014_236": "The lives of four black students at an Ivy League college.",
    "2014_237": "A story that exposes the conspiracy of prominent German institutions and government branches to cover up the crimes of Nazis during World War II.",
    "2014_238": "A tour into the heart of a Hollywood family chasing celebrity, one another and the relentless ghosts of their pasts.",
    "2014_239": "In a Russian coastal town, Kolya is forced to fight the corrupt mayor when he is told that his house will be demolished. He recruits a lawyer friend to help, but the man's arrival brings further misfortune for Kolya and his family.",
    "2014_24": "Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow \"runners\" for a shot at escape.",
    "2014_240": "A loving father finds a clown suit for his son's birthday party, only to realize that it's cursed.",
    "2014_241": "To survive, a dying Newfoundland fishing village must convince a young doctor to take up residence by any means necessary.",
    "2014_242": "A historical drama that depicts the relationship between Dietrich von Choltitz, the German military governor of occupied Paris, and Swedish consul-general Raoul Nordling.",
    "2014_243": "Ben, a young Irish boy, and his little sister Saoirse, a girl who can turn into a seal, go on an adventure to free the fairies and save the spirit world.",
    "2014_244": "A family vacationing in the French Alps is confronted with a devastating avalanche.",
    "2014_245": "In the aftermath of his girlfriend's mysterious death, a young man awakens to find strange horns sprouting from his forehead.",
    "2014_246": "Three women who have been driven mad by pioneer life are to be transported across the country by covered wagon by the pious, independent-minded Mary Bee Cuddy, who in turn employs low-life drifter George Briggs to assist her.",
    "2014_247": "A documentarian and a reporter travel to Hong Kong for the first of many meetings with Edward Snowden.",
    "2014_248": "In order to make good with his former employers, a submarine captain takes a job with a shadowy backer to search the depths of the Black Sea for a submarine rumored to be loaded with gold.",
    "2014_249": "Muriel Bayen, a divorced beautician and mother of two, loves to tell stories. She is a huge fan of this singer Vincent Lacroix, in fact she is a dedicated fan. One day Vincent knocks on her door and asks for her help.",
    "2014_25": "Greek general Themistokles leads the charge against invading Persian forces led by mortal-turned-god Xerxes and Artemisia, vengeful commander of the Persian navy.",
    "2014_250": "Three former parapsychology professors set up shop as a unique ghost removal service.",
    "2014_251": "Two first-year students at Oxford University join the infamous Riot Club, where reputations can be made or destroyed over the course of a single evening.",
    "2014_252": "Years after walking away from her past as a young private eye, Veronica Mars gets pulled back to her hometown, just in time for her high school reunion, in order to help her old flame Logan Echolls, who's embroiled in a murder mystery.",
    "2014_253": "A 19th-century drama about a man whose heart was replaced with a clock when he was born. The situation dictates that he should avoid feeling strong emotions -- love, most of all -- but he just can't keep his feelings under wraps.",
    "2014_254": "A man seeks out his exact look-alike after spotting him in a movie.",
    "2014_255": "An art instructor and an English teacher form a rivalry that ends up with a competition at their school in which students decide whether words or pictures are more important.",
    "2014_256": "For several months in 1978 and 1979, inhabitants of Oise live in fright and terror as a serial killer disturbs the peace and quiet.",
    "2014_257": "A group of Sudanese refugees, given the chance to resettle in the U.S., arrive in Kansas City, Missouri, where their encounter with an employment agency counselor forever changes all of their lives.",
    "2014_258": "Slacker Max fell so hard for single mother Alice in college that he developed a website aimed at winning her heart. Years later, after his venture has earned him millions of dollars, Max risks his entire fortune performing an ever more ...See moreSlacker Max fell so hard for single mother Alice in college that he developed a website aimed at winning her heart. Years later, after his venture has earned him millions of dollars, Max risks his entire fortune performing an ever more complicated series of social contortions to get close to Alice, now a politically motivated factory worker.  Written by Rialto PremieresSee less",
    "2014_259": "A twenty-something comedienne's unplanned pregnancy forces her to confront the realities of independent womanhood for the first time.",
    "2014_26": "After making their way through high school (twice), big changes are in store for officers Schmidt and Jenko when they go deep undercover at a local college.",
    "2014_260": "Santiago and Eugenio are more than friends, they are life long business partners. They understand each other without words, they care for each other, they need each other. One day Eugenio disappears without leaving any clues behind. ...See moreSantiago and Eugenio are more than friends, they are life long business partners. They understand each other without words, they care for each other, they need each other. One day Eugenio disappears without leaving any clues behind. Santiago immediately notices his absence, but only realizes what have happened when Eugenio's wife, Laura, lost and hopeless assures him that Eugenio has left. Santiago and Laura begin a journey in order to find him and end up discovering that they prefer to stay together in this quest rather than finding out where he is. 'The Mystery of Happiness' is a film about love, but goes beyond it, it pushes boundaries, it explores the idea of loyalty and estrangement, and it definitely puts dreams over long lost promises.  Written by AnonymousSee less",
    "2014_261": "Yves Saint Laurent's life from 1967 to 1976, during which time the famed fashion designer was at the peak of his career.",
    "2014_262": "Iranian-Canadian journalist Maziar Bahari is detained by Iranian forces who brutally interrogate him under suspicion that he is a spy.",
    "2014_263": "A tax inspector, his new bride and her sister become entwined in a love triangle.",
    "2014_264": "In 1971, a young and disorientated British soldier is accidentally abandoned by his unit following a riot on the deadly streets of Belfast.",
    "2014_265": "Eric Love, 19, is locked up in prison. On first day he assaults another inmate and several guards. He's offered group therapy and his dad, an inmate as well, tries to talk sense into him. Can he be rehabilitated?",
    "2014_266": "After Ben and George get married, George is fired from his teaching post, forcing them to stay with friends separately while they sell their place and look for cheaper housing -- a situation that weighs heavily on all involved.",
    "2014_267": "Twin brothers are unknowingly separated at birth; one of them becomes an iconic rock 'n' roll star, while the other struggles to balance his love for music and pleasing his father.",
    "2014_268": "A comedy concert film that captures the on-stage performance and inspirational success story of Gabriel \"Fluffy\" Iglesias.",
    "2014_269": "His annual Christmas party faltering thanks to his cynical brother-in-law, former Growing Pains star Kirk Cameron attempts to save the day by showing him that Jesus Christ remains a crucial component of the over-commercialized holiday..",
    "2014_27": "Two teenage cancer patients begin a life-affirming journey to visit a reclusive author in Amsterdam.",
    "2014_270": "A family of beekeepers living in the Tuscan countryside finds their household disrupted by the simultaneous arrival of a silently troubled teenage boy and a reality TV show intent on showcasing the family.",
    "2014_271": "A soldier introduces himself to the Peterson family, claiming to be a friend of their son who died in action. After the young man is welcomed into their home, a series of accidental deaths seem to be connected to his presence. Read more: Synopsis",
    "2014_272": "Three interlocking love stories involving three couples in three cities: Rome, Paris, and New York.",
    "2014_273": "On a road trip, Nic and two friends are drawn to an isolated area by a computer genius. When everything suddenly goes dark, Nic regains consciousness - only to find himself in a waking nightmare. Read more: Synopsis",
    "2014_274": "Agnès Le Roux, a young independent woman, returns to Nice in 1976 to have a new start in her life after a failed marriage. All while falling in love with an older lawyer.",
    "2014_275": "10 years after a global economic collapse, a hardened loner pursues the men who stole his only possession, his car. Along the way, he captures one of the thieves' brother, and the duo form an uneasy bond during the dangerous journey.",
    "2014_276": "Between his friends and the family business, Arnaud's summer looks set to be a peaceful one. Peaceful until he runs into Madeleine, as beautiful as she is brusque, a concrete block of tensed muscles and doomsday prophecies.",
    "2014_277": "An ex-con, who is the unlikeliest of role models, meets a 15-year-old boy and is faced with the choice of redemption or ruin.",
    "2014_278": "In the midst of rehearsals for a new play, amateur dramatics proponents Colin and Kathryn receive the shattering news that their friend George is fatally ill and only has a few months to live.",
    "2014_279": "The aristocratic sisters Charlotte and Caroline both fall in love with the controversial young writer and hothead Friedrich Schiller. Defying the conventions of their time, the sisters decide to share their love with Schiller. What begins ...See moreThe aristocratic sisters Charlotte and Caroline both fall in love with the controversial young writer and hothead Friedrich Schiller. Defying the conventions of their time, the sisters decide to share their love with Schiller. What begins playfully, almost as a game among the three of them, soon turns serious as it leads to the end of a pact.  Written by AnonymousSee less",
    "2014_28": "In a world divided by factions based on virtues, Tris learns she's Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.",
    "2014_280": "A documentary on the late Vivian Maier, a nanny whose previously unknown cache of 100,000 photographs earned her a posthumous reputation as one of the most accomplished street photographers.",
    "2014_281": "In the throes of a quarter-life crisis, Megan panics when her boyfriend proposes, then, taking an opportunity to escape for a week, hides out in the home of her new friend, 16-year-old Annika, who lives with her world-weary single dad.",
    "2014_282": "Friends gather at a wedding, but the celebration is shattered by terrifying apocalyptic events forcing them to examine life, love and faith as they must choose between redemption and survival.",
    "2014_283": "Baptiste is a solitary type. A teacher in southern France, he never stays more than three weeks in the same job. One Friday, he finds himself in charge of Mathias, one of his pupils, who hasn't been picked up after school. Mathias takes ...See moreBaptiste is a solitary type. A teacher in southern France, he never stays more than three weeks in the same job. One Friday, he finds himself in charge of Mathias, one of his pupils, who hasn't been picked up after school. Mathias takes the boy to his mother, Sandra. She's a beautiful woman who has led a bit of a wild life and who now works on a beach near Montpellier. Within a day, the trio have formed a bond, like the beginnings of a family for these three people who don't have one. But the magic doesn't last. Sandra owes money and if she doesn't pay up something dire could happen. She must hit the road, flee once again. To help Sandra, Baptiste must take a look back at the origins of his own life, at the most painful and secret parts of himself.  Written by lletaifSee less",
    "2014_284": "With the 1970s behind them, San Diego's top-rated newsman, Ron Burgundy, returns to take New York City's first twenty-four-hour news channel by storm.",
    "2014_285": "Collective screening of the Academy Award nominated short films from the Live Action category for 2014.",
    "2014_286": "An ex-army officer initiates a unique idea of propagating social responsibility among ordinary people and in doing so, crosses paths with a powerful political family.",
    "2014_287": "Writer and musician Nick Cave marks his 20,000th day on the planet Earth.",
    "2014_288": "Eight years after the disappearance of Cassandra, some disturbing incidents seem to indicate that she's still alive. Police, parents and Cassandra herself, will try to unravel the mystery of her disappearance.",
    "2014_289": "Owing to the wrongdoings affiliated with evils similar to black money, an honest but ferocious police officer returns as the Deputy Commissioner of Police with the prospect of wiping out injustice.",
    "2014_29": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
    "2014_290": "Jon, a young wanna-be musician, discovers he's bitten off more than he can chew when he joins an eccentric pop band led by the mysterious and enigmatic Frank. Read more: Synopsis",
    "2014_291": "Unique biopic about Yogananda, telling the story of his life and influence on yoga, religion and science, combining re-enactment, interviews, and verite.",
    "2014_292": "A brash and arrogant podcaster gets more than he bargained for when he travels to Canada to interview a mysterious recluse... who has a rather disturbing fondness for walruses.",
    "2014_293": "A girl with few real prospects joins a gang, reinventing herself and gaining a sense of self confidence in the process. However, she soon finds that this new life does not necessarily make her any happier.",
    "2014_294": "A brilliant but troubled New Zealand chess champion finds purpose by teaching underprivileged children about the rules of chess and life.",
    "2014_295": "A group of high school teenagers and their parents attempt to navigate the many ways the Internet has changed their relationships, their communications, their self-images, and their love lives.",
    "2014_296": "Inventor Tim Jenison seeks to understand the painting techniques used by Dutch Master Johannes Vermeer.",
    "2014_297": "A clerk in a government agency finds his unenviable life takes a turn for the horrific with the arrival of a new co-worker who is both his exact physical double and his opposite - confident, charismatic and seductive with women.",
    "2014_298": "All You Need Is Love focuses on the many thousands of children that exist in and around the Thai-Burma border and specifically through the children of Good Morning School in Mae Sot, Thailand. By introducing you to their lives, their hopes...See moreAll You Need Is Love focuses on the many thousands of children that exist in and around the Thai-Burma border and specifically through the children of Good Morning School in Mae Sot, Thailand. By introducing you to their lives, their hopes and their dreams, we hope that we can show how the power of the positive works in extreme circumstances.  Written by Portfolio FilmsSee less",
    "2014_299": "Lou spends her days eating takeout, playing with her cat and spying on a hunky neighbor, but when her mom falls in love, her life takes a sudden turn.",
    "2014_3": "A group of intergalactic criminals must pull together to stop a fanatical warrior with plans to purge the universe.",
    "2014_30": "The time-travelling adventures of an advanced canine and his adopted son, as they endeavor to fix a time rift they created.",
    "2014_300": "An evangelist finds himself framed for murder and on the run after he refuses to back a senator's proposition calling for sweeping religious reform.",
    "2014_301": "When a protective father meets a murderous ex-con, both need to deviate from the path they are on as they soon find themselves entangled in a downwards spiral of lies and violence while having to confront their own inner psyche.",
    "2014_302": "An examination of America's obesity epidemic and the food industry's role in aggravating it.",
    "2014_303": "A complicated relationship develops between a man and woman after getting married and having a baby.",
    "2014_304": "Sam and Jonathan, a pair of hapless novelty salesman, embark on a tour of the human condition in reality and fantasy that unfold in a series of absurdist episodes.",
    "2014_305": "Two common criminals get more than they bargained for after kidnapping the wife of a corrupt real-estate developer who shows no interest in paying the $1 million dollar ransom for her safe return. Read more: Synopsis",
    "2014_306": "One couple's story as they try to reclaim the life and love they once knew and pick up the pieces of a past that may be too far gone.",
    "2014_307": "When young girls start to go missing within a religious cult, older followers fear a long-told prophecy while the younger members suspect abusive elders are killing them off.",
    "2014_308": "A hugely talented but socially isolated computer operator is tasked by Management to prove the Zero Theorem: that the universe ends as nothing, rendering life meaningless. But meaning is what he already craves. Read more: Synopsis",
    "2014_309": "A young man returns to Kashmir after his father's disappearance to confront his uncle, whom he suspects of playing a role in his father's fate.",
    "2014_31": "After they are forced to live next to a fraternity house, a couple with a newborn baby do whatever they can to take them down.",
    "2014_310": "A military officer uses his intellect and fighting skills to hunt and knock down a terrorist aiming to rip apart Mumbai via the sleeper cells under his command.",
    "2014_311": "A hopelessly romantic physiotherapist meets a handsome young Rajput prince who is the complete opposite of her and engaged to someone else.",
    "2014_312": "After a space merchant vessel receives an unknown transmission as a distress call, one of the crew is attacked by a mysterious life form and they soon realize that its life cycle has merely begun.",
    "2014_313": "In 1870s America, the fury of a notorious gang leader is unleashed when a peaceful American settler avenges the death of his family. Then as his cowardly fellow townspeople betray him, he is forced to hunt down the outlaws alone.",
    "2014_314": "A pregnant teenager flees her abusive mother in search of her father, only to be rejected by her stepmother and forced to survive on the streets until a compassionate stranger offers a hopeful alternative.",
    "2014_315": "In the distant future, a space traveler from Earth breaks a special law and interferes with the history of another, Medieval-like, planet.",
    "2014_316": "In Mumbai, affable Bollywood buff and wanna-be-actor Sunny, who works as an assistant director, fantasizes on becoming a heart-throb star. However, at every audition he is summarily thrown out. Undeterred, he goes with an American crew to ...See moreIn Mumbai, affable Bollywood buff and wanna-be-actor Sunny, who works as an assistant director, fantasizes on becoming a heart-throb star. However, at every audition he is summarily thrown out. Undeterred, he goes with an American crew to remote areas in Rajasthan to work on a documentary. One day an Islamic terrorist group kidnaps him for the American crew-member. Sunny finds himself on enemy border amidst guns and pathani-clad guards, who decide to keep him hostage until they locate their original target. The house In which he is confined belongs to a Pakistani, whose trade stems from pirated Hindi films, which he brings back every time he crosses the border. Soon, the two factions realize that they share a human and cultural bond. The film shows how cinema can be the universal panacea for co-existence.  Written by UTV Motion PicturesSee less",
    "2014_317": "The story of three brothers, the sons of a shepherd, close to the ndrangheta and of their divided soul.",
    "2014_318": "When his wife becomes the latest victim of a serial killer, Guru blurs the line between good and evil in his pursuit of revenge.",
    "2014_319": "After a lukewarm marriage of over twenty years, a woman appeals to her husband's compassion to obtain the desirable divorce document in front of a court, which proves to be more challenging than she would expect.",
    "2014_32": "The defiant leader Moses rises up against Egyptian Pharaoh Ramses II, setting six hundred thousand slaves on a monumental journey of escape from Egypt and its terrifying cycle of deadly plagues.",
    "2014_320": "A man with the ability to enter people's memories takes on the case of a brilliant, troubled sixteen-year-old girl to determine whether she is a sociopath or a victim of trauma.",
    "2014_321": "In their blue hotel room, a clandestine couple of two married lovers plan an impossible future, as death shutters their already frail tranquillity. Now, the noose tightens more and more around innocents and sinners; but, was there a crime?",
    "2014_322": "In 1915 a man survives the Armenian genocide in the Ottoman Empire, but loses his family, speech and faith. One night he learns that his twin daughters may be alive, and goes on a quest to find them.",
    "2014_323": "A saga of revenge undertaken by a son for his father's name and his kingdom.",
    "2014_324": "Leonardo is a blind teenager searching for independence. His everyday life, the relationship with his best friend, Giovana, and the way he sees the world change completely with the arrival of Gabriel.",
    "2014_325": "Christina Noble overcomes the harsh difficulties of her childhood in Ireland to discover her destiny on the streets of Saigon. A true story.",
    "2014_326": "A successful author and spiritual advisor takes on a troubled man as a client, completely unaware that the man's fixation on his mother's death will soon put his life in jeopardy.",
    "2014_327": "Still on the run from a group of Nazi zombies, a man seeks the aid of a group of American zombie enthusiasts, and discovers new techniques for fighting the zombies.",
    "2014_328": "Charlie is an average French suburban teenager, but when she becomes fast friends with Sarah, the rebellious new girl at school, she discovers there's nothing average about how she feels.",
    "2014_329": "A young man, separated from his family in World War II, disguises himself as a Nazi S.S. Officer and uncovers more than just his family whereabouts.",
    "2014_33": "A couple begins to experience terrifying supernatural occurrences involving a vintage doll shortly after their home is invaded by satanic cultists.",
    "2014_330": "Set in 1974, an authentic and uplifting tale of two friends whose horizons are opened up by the discovery of black American soul music.",
    "2014_331": "Based on the inspiring true story of Mine That Bird, a misfit group of New Mexico cowboys find themselves on the journey of a lifetime when their crooked-footed racehorse qualifies for the 2009 Kentucky Derby.",
    "2014_332": "An aspiring singer-songwriter's life and marriage suffer when the song he writes for his wife propels him to stardom.",
    "2014_333": "When a politician disappears, his (mad) twin brother is brought to replace him. Read more: Synopsis",
    "2014_334": "A mysterious outsider's quiet life is turned upside down when he returns to his childhood home to carry out an act of vengeance. Proving himself an amateur assassin, he winds up in a brutal fight to protect his estranged family.",
    "2014_335": "Tensions between two brothers and their families escalate when a video of two teenagers, possibly son of one brother and daughter of the other, beating a homeless woman to death, shows up.",
    "2014_336": "An unflinching portrait of adolescent lust, boredom, and self-destruction that centers around a shy young girl on the cusp of an illicit relationship with her soccer coach.",
    "2014_337": "After his tribe is slaughtered through an act of treachery, the teenage son of a slain Maori chieftain looks to avenge his father's murder and bring peace and honor to the souls of his loved ones.",
    "2014_338": "A drama centered on a classical pianist who has been diagnosed with ALS and the brash college student who becomes her caregiver.",
    "2014_339": "As the Large Hadron Collider is about to be launched for the first time, physicists are on the cusp of the greatest scientific discovery of all time -- or perhaps their greatest failure. Read more: Synopsis",
    "2014_34": "Having endured his legendary twelve labors, Hercules, the Greek demigod, has his life as a sword-for-hire tested when the King of Thrace and his daughter seek his aid in defeating a tyrannical warlord.",
    "2014_340": "In an airport hotel on the outskirts of Paris, a Silicon Valley engineer abruptly chucks his job, breaks things off with his wife, and holes up in his room. Soon, fate draws him and a young French maid together.",
    "2014_341": "Right before her wedding, a young woman finds herself abducted and held for ransom. As the initial days pass, she begins to develop a strange bond with her kidnapper.",
    "2014_342": "Three radical environmentalists look to execute the protest of their lives: the explosion of a hydroelectric dam.",
    "2014_343": "In a post-apocalyptic America, the iron fist of the totalitarian government seeks to crush one mysterious man named John Galt, who has the power and influence to change everything..",
    "2014_344": "The lives of Calcutta's most powerful Gunday, Bikram and Bala, changes when Nandita enters it. Then a counter-force takes charge and a thriller unfolds.",
    "2014_345": "A chronicle of the life of Indian boxer Mary Kom, who went through several hardships before audaciously accomplishing her ultimate dream.",
    "2014_346": "A cryptic phone call sets off a dangerous game of risks for Elliot, a down-on-his-luck salesman. The game promises increasing rewards for completing 13 tasks, each more sinister than the last.",
    "2014_347": "Since the Island Academy Incident, silver clansmen Kuroh Yatogami and Neko have been searching for their master, Yashiro Isana, the Silver King. Their search having turned up fruitless, the two begin to give up hope, until they encounter ...See moreSince the Island Academy Incident, silver clansmen Kuroh Yatogami and Neko have been searching for their master, Yashiro Isana, the Silver King. Their search having turned up fruitless, the two begin to give up hope, until they encounter Anna Kushina and Rikio Kamamoto, two members of the red clan HOMRA being chased by someone.  Written by Eleven ArtsSee less",
    "2014_348": "The life and career of the renowned film critic and social commentator, Roger Ebert.",
    "2014_349": "Two strangers awaken in a room with no recollection of how they got there, and soon discover they're pawns in a deadly game perpetrated by a notorious serial killer.",
    "2014_35": "In 2028 Detroit, when Alex Murphy, a loving husband, father and good cop, is critically injured in the line of duty, the multinational conglomerate OmniCorp sees their chance for a part-man, part-robot police officer.",
    "2014_350": "Shortly after failing to rescue a drowning man, Donato meets Konrad, a friend of the victim. They soon begin a relationship which seems doomed from the start, while Donato's past catches up with him.",
    "2014_351": "This cinematic feature documentary is more than a classic biography. Yalom takes the audience on an existential journey through the many layers of the human mind while he shares his fundamental insights and wisdom.",
    "2014_352": "Forty-something Irene had a dream job that made her life easy: she was indeed a luxury hotel inspector and her work got carried out in a wonderful ever-renewed setting, from Paris to Gstaad to Berlin to Morocco to China... But does a dream...See moreForty-something Irene had a dream job that made her life easy: she was indeed a luxury hotel inspector and her work got carried out in a wonderful ever-renewed setting, from Paris to Gstaad to Berlin to Morocco to China... But does a dream job necessarily mean a dream life? Irene tried not to ask herself the question too openly. Yes she was single but she had manged to remain on good terms with Andrea, her former life companion. For sure she was childless but she occasionally took care of her two little nieces. And it was such fun to play the mystery guest in those magnificent hotels... Things could have gone on that way hadn't one day Irene met Kate Sherman...  Written by Guy BellingerSee less",
    "2014_353": "A pair of former brothers-in-law embark on a road trip through Iceland.",
    "2014_354": "A look at the scandalous love triangle between Victorian art critic John Ruskin (Greg Wise), his teenage bride Euphemia \"Effie\" Gray (Dakota Fanning), and Pre-Raphaelite painter John Everett Millais (Tom Sturridge).",
    "2014_355": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000.",
    "2014_356": "A drama centered on a go-go dancer with multiple personality disorder who struggles to remain her true self and begins working with a psychotherapist to uncover the mystery of the inner ghosts that haunt her.",
    "2014_357": "A Christian girl goes off to college for her freshman year and begins to be influenced by her popular Biology professor who teaches that evolution is the answer to the origins of life. When her father suspects something happening, he ...See moreA Christian girl goes off to college for her freshman year and begins to be influenced by her popular Biology professor who teaches that evolution is the answer to the origins of life. When her father suspects something happening, he begins to examine the situation and what he discovers completely catches him off guard. Now very concerned about his daughter drifting away from the faith, he tries to do something about it.  Written by Rich ChristianoSee less",
    "2014_358": "The story of cult film director Alejandro Jodorowsky's ambitious but ultimately doomed film adaptation of the seminal science fiction novel.",
    "2014_359": "A withdrawn senior experiences life in new ways when he begins spending time with the free-spirited woman who lives across the hall.",
    "2014_36": "During World War II, the English mathematical genius Alan Turing tries to crack the German Enigma code with help from fellow mathematicians.",
    "2014_360": "A documentary that follows the early career of basketball star Dirk Nowitzki, his relationship with coach and mentor Holger Geschwindner, and their path to NBA glory.",
    "2014_361": "A chronicle of Paulo Coelho's rise from his troubled life to become one of the most influential writers in Brazilian history.",
    "2014_362": "The secret lives of five suburban couples living in Sydney reveal both the fetishes and the repercussions that come with sharing them.",
    "2014_363": "A drama based on Jimi Hendrix's life as he left New York City for London, where his career took off.",
    "2014_364": "A troubled couple vacate to a beautiful getaway, but bizarre circumstances further complicate their situation. Read more: Synopsis",
    "2014_365": "Two childhood best friends, one a superficial womanizer and the other a barely functioning bipolar, embark on a road trip back to their hometown after one of them learns his estranged father has died.",
    "2014_366": "Thirteen-year-old Lili fights to protect her dog Hagen. She is devastated when her father eventually sets Hagen free on the streets. Still innocently believing love can conquer any difficulty, Lili sets out to find her dog and save him.",
    "2014_367": "A silent, surreal parallel between a couple and a dog.",
    "2014_368": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate and other historical events unfold through the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
    "2014_369": "A jilted fan soon finds himself pulled into a deadly game of cat-and-mouse after he accepts the opportunity to spy on his favorite actress via his laptop.",
    "2014_37": "An air marshal springs into action during a transatlantic flight after receiving a series of text messages demanding $150 million into an off-shore account, or someone will die every 20 minutes.",
    "2014_370": "When a high school football star is suddenly stricken with irreversible total blindness, he must decide whether to live a safe handicapped life or bravely return to the life he once knew and the sport he still loves.",
    "2014_371": "In the Iranian ghost-town Bad City, a place that reeks of death and loneliness, the townspeople are unaware they are being stalked by a lonesome vampire.",
    "2014_372": "A grieving father in a downward spiral stumbles across a box of his recently deceased son's demo tapes and lyrics. Shocked by the discovery of this unknown talent, he forms a band in the hope of finding some catharsis. Read more: Synopsis",
    "2014_373": "Inspired by Bruce Brown's 1971 documentary, \"On Any Sunday,\" chronicles the international sport of motorcycle racing.",
    "2014_374": "Over two \"typical\" days in the life of The Beatles, the boys struggle to keep themselves and Sir Paul McCartney's mischievous grandfather in check while preparing for a live television performance.",
    "2014_375": "Paul, a teenager in the underground scene of early-nineties Paris, forms a DJ collective with his friends and together they plunge into the nightlife of sex, drugs, and endless music.",
    "2014_376": "A snowstorm forces two people who made an online connection to unwillingly extend their one-night stand as the blizzard goes through the night.",
    "2014_377": "A boy is trying to find out about his family history and stumbles upon a town of lycans.",
    "2014_378": "A molecular biologist and his laboratory partner uncover evidence that may fundamentally change society as we know it.",
    "2014_379": "In 1988, a teenage girl's life is thrown into chaos when her mother disappears.",
    "2014_38": "As his kingdom is being threatened by the Turks, young prince Vlad Tepes must become a monster feared by his own people in order to obtain the power needed to protect his own family, and the families of his kingdom.",
    "2014_380": "During the chaotic final weeks of the Vietnam War, the North Vietnamese Army closes in on Saigon as the panicked South Vietnamese people desperately attempt to escape. On the ground, American soldiers and diplomats confront the same moral ...See moreDuring the chaotic final weeks of the Vietnam War, the North Vietnamese Army closes in on Saigon as the panicked South Vietnamese people desperately attempt to escape. On the ground, American soldiers and diplomats confront the same moral quandary: whether to obey White House orders to evacuate U.S. citizens only--or to risk treason and save the lives of as many South Vietnamese citizens as they can.  Written by AnonymousSee less",
    "2014_381": "A 3D documentary chronicling filmmaker James Cameron's diving expeditions in his Deepsea Challenger submersible.",
    "2014_382": "A criminal bides his time at a seedy motel, waiting for his boss after killing several men and making away with a mystery bag.",
    "2014_383": "Afshin Ghaffarian risks everything to start a dance company amidst his home country of Iran's politically volatile climate and the nation's ban on dancing.",
    "2014_384": "Icelandic artist, Björk, performs songs from her eighth album with evocative visuals provided by designers from around the world.",
    "2014_385": "As Eve begins writing songs as a way to sort through some emotional problems, she meets James and Cassie, two musicians each at crossroads of their own.",
    "2014_386": "Teenager Rick Stevens has a crush on Nina Pennington. They form a friendship and embark on a rock n' roll journey together while Nina deals with her overbearing boyfriend, Kevin.",
    "2014_387": "A documentary that resurrects the buried history of the outrageous, often brilliant women who founded the modern women's movement from 1966 to 1971.",
    "2014_388": "A blue collar worker tries to cover things up when his stepson is killed in a suspicious accident, but a local reporter senses that something's amiss.",
    "2014_389": "Tells the story of the complex relationship between an Israeli Secret Service officer and his teenage Palestinian informant. Shuttling back and forth between conflicting points of view, the film is a raw portrayal of characters torn apart ...See moreTells the story of the complex relationship between an Israeli Secret Service officer and his teenage Palestinian informant. Shuttling back and forth between conflicting points of view, the film is a raw portrayal of characters torn apart by competing loyalties and impossible moral dilemmas, giving an unparalleled glimpse into the dark and fascinating world of human intelligence.  Written by BethlehemSee less",
    "2014_39": "Barney augments his team with new blood for a personal battle: to take down Conrad Stonebanks, the Expendables co-founder and notorious arms trader who is hell bent on wiping out Barney and every single one of his associates.",
    "2014_390": "As he struggles with Alzheimer's disease, country-music legend Glen Campbell embarks on his farewell tour in the U.S., Australia, and Europe.",
    "2014_391": "A self-obsessed young man makes his way to the party-to-end-all-parties on the last day on Earth, but ends up saving the life of a little girl searching for her father. Their relationship ultimately leads him on the path to redemption.",
    "2014_392": "A confused writer goes on the search of inspiration for his next story and falls in love with a best seller author who doesn't believe in love. Read more: Synopsis",
    "2014_393": "A documentary that goes inside one of the great museums of the world: The National Gallery in London.",
    "2014_394": "Marie Heurtin is born both blind and deaf. Sister Marguerette wins her trust and teaches her how to express herself.",
    "2014_395": "The son of a founding leader in the Palestinian organization, Hamas, becomes a spy for the Israelis.",
    "2014_396": "The uncompromising Tony and Emmy Award-winner is showcased both on and off stage via rare archival footage and intimate cinema verite.",
    "2014_397": "Armed only with their cameras, Peabody and Emmy Award-winning conflict Journalist Mike Boettcher, and his son, Carlos, provide unprecedented access into the longest war in U.S. history.",
    "2014_398": "Renowned ball-room dancer Pierre Dulaine takes his program, Dancing Classrooms, back to his city of birth, Jaffa, to teach Jewish and Palestinian Israelis to dance and compete together.",
    "2014_399": "The lives and thoughts of children from all around the world. It weaves together deeply personal and at times hilarious portraits of what it means to stand on the cusp between childhood and adolescence.",
    "2014_4": "A vengeful fairy is driven to curse an infant princess, only to discover that the child may be the one person who can restore peace to their troubled land.",
    "2014_40": "A witch tasks a childless baker and his wife with procuring magical items from classic fairy tales to reverse the curse put on their family tree.",
    "2014_400": "Claudia, a lonely young woman, works in a supermarket. One night, she ends up in the hospital with a severe case of appendicitis. There, she meets Martha, the woman resting in the bed next to hers. Martha, who lives alone with her four ...See moreClaudia, a lonely young woman, works in a supermarket. One night, she ends up in the hospital with a severe case of appendicitis. There, she meets Martha, the woman resting in the bed next to hers. Martha, who lives alone with her four children, gains Claudia's trust. When she gets out of the hospital, she spontaneously offers Claudia to go home with them. Getting to know this family makes Claudia feel at ease. And for the first time she experiences a sense of belonging in this peculiar little tribe. As Martha's health weakens every day the bond Claudia has with each member of the family grows stronger.  Written by FESTSee less",
    "2014_401": "Sisters Olanna and Kainene return home to 1960s Nigeria, where they soon diverge on different paths. As civil war breaks out, political events loom larger than their differences as they join the fight to establish an independent republic. Read more: Synopsis",
    "2014_402": "Former United States Secretary of Defense, Donald Rumsfeld, discusses his career in Washington D.C. from his days as a congressman in the early 1960s to planning the invasion of Iraq in 2003.",
    "2014_403": "A man turns to a mysterious pair and a shackled mental patient for help in combating an ancient family curse.",
    "2014_404": "After a little girl is brutally murdered, a suspect avoids arrest due to lack of evidence. Working separately, her father and a cop decide to do something about it.",
    "2014_405": "Claire is about to get married, but her bachelorette party quickly spirals out of control.",
    "2014_406": "Mr. Devereaux is a powerful man. A man who handles billions of dollars every day. A man who controls the economic fate of nations. A man driven by a frenzied and unbridled sexual hunger. A man who dreamed of saving the world and who cannot...See moreMr. Devereaux is a powerful man. A man who handles billions of dollars every day. A man who controls the economic fate of nations. A man driven by a frenzied and unbridled sexual hunger. A man who dreamed of saving the world and who cannot save himself. A terrified man. A lost man.See less",
    "2014_407": "A visually stunning chronicle of what it is like to live in Antarctica for a full year, including winters isolated from the rest of the world, and enduring months of darkness in the coldest place on Earth.",
    "2014_408": "The last days in the life of legendary Hollywood actor Errol Flynn.",
    "2014_409": "A kindergarten teacher discovers in a five year-old child a prodigious gift for poetry. Amazed and inspired by this young boy, she decides to protect his talent in spite of everyone.",
    "2014_41": "A grizzled tank commander makes tough decisions as he and his crew fight their way across Germany in April, 1945.",
    "2014_410": "A young man's recently deceased girlfriend mysteriously returns from the dead, but he slowly realizes she is not the way he remembered her.",
    "2014_411": "Chapman is an ex-marine in Brazil's slums, battling the yakuza outfit who attacked his sister and left her for dead.",
    "2014_412": "A small-time con man seeks assistance from his mentor with the intention of settling scores with a gangster.",
    "2014_413": "Dan Cohen, founder of the nonprofit organization Music & Memory, fights against a broken healthcare system to demonstrate music's ability to combat memory loss and restore a deep sense of self to those suffering from it.",
    "2014_414": "Tom Berninger chronicles his time spent on the road as a member of the tour crew for The National, the rock & roll band fronted by his brother, Matt.",
    "2014_415": "A young man of Chinese-Cambodian descent dies, leaving behind his isolated mother and his 4-year male lover, who grieve but don't speak a lick of each other's language.",
    "2014_416": "About a series of unsolved disappearances on the Galapagos Island of Floreana in the 1930s.",
    "2014_417": "Naruto and Sakura are captured in a parallel world by Madara, who's intentions are to steal the Nine Tails from Naruto.",
    "2014_418": "When one of the most prolific art forgers in US history is finally exposed, he must confront the legacy of his 30-year con.",
    "2014_419": "An Indian doctor emigrates to Canada in the hope of starting a new life, but bureaucracy confines him to life as a taxi driver. When he cannot suppress his desire to practice medicine, he begins illegally treating patients from his cab.",
    "2014_42": "Fresh from prison, a street racer who was framed by a wealthy business associate joins a cross-country race with revenge in mind. His ex-partner, learning of the plan, places a massive bounty on his head as the race begins.",
    "2014_420": "Alex moves to Los Angeles for a new job; Sergi stays in Barcelona. They love each other, but maintaining a relationship through technology proves challenging.",
    "2014_421": "The life and career of the legendary Hollywood insider, Shep Gordon.",
    "2014_422": "A Queens couple who specialize in robbing mafia social clubs stumble upon a score bigger than they could ever imagine, becoming targets of both the mob and the FBI in the process.",
    "2014_423": "Leo the dishwasher falls in love with a bride on the day of her wedding - to another man.",
    "2014_424": "More than 350,000 people celebrate electronic dance music at the 2013 Electric Daisy Carnival.",
    "2014_425": "Advanced Style examines the lives of seven unique New Yorkers whose eclectic personal style and vital spirit have guided their approach to aging.",
    "2014_426": "Displeased with the intervention of whitefella laws, Charlie takes off to live the old way and sets off a chain reaction of enlightening difficulties.",
    "2014_427": "Anger rages in Philip as he awaits the publication of his second novel. He feels pushed out of his adopted home city by the constant crowds and noise, a deteriorating relationship with his photographer girlfriend Ashley, and his own ...See moreAnger rages in Philip as he awaits the publication of his second novel. He feels pushed out of his adopted home city by the constant crowds and noise, a deteriorating relationship with his photographer girlfriend Ashley, and his own indifference to promoting the novel. When Philip's idol Ike Zimmerman offers his isolated summer home as a refuge, he finally gets the peace and quiet to focus on his favorite subject: himself.  Written by ProductionSee less",
    "2014_428": "A shy maths graduate takes a holiday in Dinard before starting his first job. He hopes his sort-of girlfriend will join him, but soon strikes up a friendship with another girl working in town. She in turn introduces him to a further young ...See moreA shy maths graduate takes a holiday in Dinard before starting his first job. He hopes his sort-of girlfriend will join him, but soon strikes up a friendship with another girl working in town. She in turn introduces him to a further young lady who fancies him. Thus the quiet young lad finds he is having to do some tricky juggling in territory new to him.  Written by Jeremy Perkins {J-26}See less",
    "2014_429": "A notorious trauma bay in an inner-city E.R. earns its keep as the 'hurt locker of medicine' as new, idealistic and adrenaline-seeking doctors train in an environment akin to a war zone. When the hospital moves to a swank new building, the...See moreA notorious trauma bay in an inner-city E.R. earns its keep as the 'hurt locker of medicine' as new, idealistic and adrenaline-seeking doctors train in an environment akin to a war zone. When the hospital moves to a swank new building, the rush fades and bureaucracy gridlocks the state-of-the-art facility, and the doctors are faced with the unexpected realities of life and death in a safety-net health-care system on the brink of overload.  Written by AnonymousSee less",
    "2014_43": "After discovering her boyfriend is married, Carly soon meets the wife he's been betraying. And when yet another love affair is discovered, all three women team up to plot revenge on the three-timing S.O.B.",
    "2014_430": "A documentary that reveals what its subjects do in their respective basements.",
    "2014_431": "When Norwegian scientist Marie attends a seminar in Paris on the actual weight of a kilo, it is her own measurement of disappointment, grief and, not least, love, that ends up on the scale.",
    "2014_432": "A profile of Anita Hill, the African-American lawyer who challenged Clarence Thomas' nomination to the US Supreme Court and thus exposed the problem of sexual harassment to the world.",
    "2014_433": "Of all the great ballerinas, Tanaquil Le Clercq may have been the most transcendent. With a body unlike any before hers, she mesmerized viewers and choreographers alike - her elongated, race-horse physique became the new prototype for the ...See moreOf all the great ballerinas, Tanaquil Le Clercq may have been the most transcendent. With a body unlike any before hers, she mesmerized viewers and choreographers alike - her elongated, race-horse physique became the new prototype for the great George Balanchine. Her unique style, humor and authenticity redefined ballet for all dancers who followed. Amazingly, she was the muse to not one great artist but two; both George Balanchine and Jerome Robbins loved her as a dancer and a woman. Balanchine married her and Robbins created his famous version of Afternoon of a Faun for Tanny. Tanaquil Le Clercq was the foremost dancer of her day until it suddenly all stopped. On a tour of Europe, she was struck down by polio and paralyzed. She never danced again.  Written by Director, Nancy BuirskiSee less",
    "2014_434": "A stroke-afflicted filmmaker is manipulated by a notorious con man.",
    "2014_435": "Follows the passing of the FIFA baton through three association presidents: Jules Rimet, Joao Havelange, and Sepp Blatter.",
    "2014_436": "A prestigious film critic who has lost faith in the art form sparks with a young woman whose tastes run opposite of his. Read more: Synopsis",
    "2014_437": "Time Is Illmatic is a feature length documentary film that delves deep into the making of Nas' 1994 debut album, Illmatic, and the social conditions that influenced its creation. Twenty years after its release, Illmatic has become a ...See moreTime Is Illmatic is a feature length documentary film that delves deep into the making of Nas' 1994 debut album, Illmatic, and the social conditions that influenced its creation. Twenty years after its release, Illmatic has become a hip-hop benchmark that encapsulates the socio-political outlook, enduring spirit, and collective angst of a generation of young black men searching for their voice in America.  Written by AnonymousSee less",
    "2014_438": "A businessman makes a regular arrangement with a Ukrainian prostitute, despite the youngster's involvement in a controlling street gang.",
    "2014_439": "A documentary that follows jazz legend Clark Terry over four years to document the mentorship between Terry and 23-year-old blind piano prodigy Justin Kauflin as the young man prepares to compete in an elite, international competition.",
    "2014_44": "A man believes he has put his mysterious past behind him and has dedicated himself to beginning a new, quiet life, before he meets a young girl under the control of ultra-violent Russian gangsters and can't stand idly by.",
    "2014_440": "When the Sultan's firstborn is taken by an evil sorcerer, Sinbad is tasked with travelling to a desert of magic and creatures to save her.",
    "2014_441": "A documentary that follows the money behind the rise of the Tea Party.",
    "2014_442": "A look at the life and music of Nigerian singer Fela Kuti.",
    "2014_443": "American nuclear weapons testing results in the creation of a seemingly unstoppable, dinosaur-like beast.",
    "2014_444": "A documentary on how water shapes humanity.",
    "2014_445": "Kids For Cash is a riveting look behind the notorious judicial scandal that rocked the nation. Beyond the millions paid and high stakes corruption, Kids For Cash exposes a shocking American secret. In the wake of the shootings at Columbine...See moreKids For Cash is a riveting look behind the notorious judicial scandal that rocked the nation. Beyond the millions paid and high stakes corruption, Kids For Cash exposes a shocking American secret. In the wake of the shootings at Columbine, a small town celebrates a charismatic judge who is hell-bent on keeping kids in line...until one parent dares to question the motives behind his brand of justice. This real life thriller reveals the untold stories of the masterminds at the center of the scandal and the chilling aftermath of lives destroyed in the process - a stunning emotional roller coaster.  Written by Kids for CashSee less",
    "2014_446": "May returns to her childhood home in Jordan for her wedding. Shortly after reuniting with her sisters and their long-since divorced parents, myriad familial and cultural conflicts lead May to question the big step she is about to take.",
    "2014_447": "This is an unashamedly opinionated film. In Gore Vidal's America, the political coup has already happened. The right have triumphed and the human values of the liberals have been consigned to history. But how did this happen and who ...See moreThis is an unashamedly opinionated film. In Gore Vidal's America, the political coup has already happened. The right have triumphed and the human values of the liberals have been consigned to history. But how did this happen and who organized it? In this film Gore Vidal's acerbic, opinionated and informed approach rips away at the facade of the new America. The film dramatizes Gore's political views and his concern at the present state of American democracy using interviews and historical footage of his famous appearances on television and talk shows over the last fifty years. In the recently filmed interviews Gore examines the course of American history and policy making and draws dramatic conclusions on the fate of the nation in the modern age.  Written by AnonymousSee less",
    "2014_448": "Strange things begin to happen when a group of friends gather for a dinner party on an evening when a comet is passing overhead.",
    "2014_449": "Ane's life turns around when, week after week, she receives a bunch of flowers at home. Always at the same time and always without a senders note.",
    "2014_45": "Recently cuckolded and reeling from a messy divorce, a hapless former singer hits the road and the bar with his all-too-helpful best bud.",
    "2014_450": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2014_451": "Good girl Sandy Olsson and greaser Danny Zuko fell in love over the summer. When they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance?",
    "2014_452": "A unit of female Israeli soldiers at a remote desert base bide their time as they count down the minutes until they can return to civilian life.",
    "2014_453": "Marie decides to journey 80 miles on foot to the coast of Oregon to revisit the ocean of her past for the first time in 45 years.",
    "2014_454": "An in-depth look at daily life at one of the most famous cultural institutions in the world, The Kunsthistorisches Museum in Vienna.",
    "2014_455": "The Jewish Cardinal tells the amazing true story of Jean-Marie Lustiger, the son of Polish-Jewish immigrants, who maintained his cultural identity as a Jew even after converting to Catholicism at a young age, and later joining the ...See moreThe Jewish Cardinal tells the amazing true story of Jean-Marie Lustiger, the son of Polish-Jewish immigrants, who maintained his cultural identity as a Jew even after converting to Catholicism at a young age, and later joining the priesthood. Quickly rising within the ranks of the Church, Lustiger was appointed Archbishop of Paris by Pope Jean Paul II - and found a new platform to celebrate his dual identity as a Catholic Jew, earning him both friends and enemies from both groups. When Carmelite nuns settle down to build a convent within the cursed walls of Auschwitz, Lustiger finds himself a mediator between the two communities - and may be forced at last to choose his side.  Written by AnonymousSee less",
    "2014_456": "The life story of Xiao Hong, one of China's most famous essayists and novelists, who reflected the progressive thinking not frequently seen during the 1930s.",
    "2014_457": "Ancient mysteries. Powerful evil. And a fearless hero's quest through a fantastical realm of steam-powered wonders and sinister magic...",
    "2014_458": "Live-action role players conjure up a demon from Hell by mistake and they must deal with the consequences.",
    "2014_459": "Two best friends see their trip of a lifetime take a dark turn when one of them is struck by a mysterious affliction. Now, in a foreign land, they race to uncover the source before it consumes him completely.",
    "2014_46": "A writer encounters the owner of an aging high-class hotel, who tells him of his early years serving as a lobby boy in the hotel's glorious years under an exceptional concierge.",
    "2014_460": "A strait-laced pharmacist's uneventful life spirals out of control when he starts an affair with a trophy-wife customer who takes him on a joyride involving sex, drugs and possibly murder.See moreA strait-laced pharmacist's uneventful life spirals out of control when he starts an affair with a trophy-wife customer who takes him on a joyride involving sex, drugs and possibly murder.  Written by Occupant FilmsSee less",
    "2014_461": "A father and daughter journey from Denmark to an unknown desert that exists in a realm beyond the confines of civilization.",
    "2014_462": "Michael Franzese, the son of John \"Sonny\" Franzese, an underboss of the Colombo crime family, recounts his spiritual transformation.",
    "2014_463": "Full-length documentary about the story of John Penton. An American icon and motorcycle pioneer who along with his family and a band of loyal followers, changed off-road motorcycling forever.",
    "2014_464": "Rich Hill intimately chronicles the turbulent lives of three boys living in an impoverished Midwestern town and the fragile family bonds that sustain them. Read more: Synopsis",
    "2014_465": "Broken, desperate men chase their dreams and run from their demons in the North Dakota oil fields. A local Pastor risks everything to help them.",
    "2014_466": "Duran Duran Unstaged is a multimedia event that takes the audience on a cinematic journey with one of the most successful acts in the world during their performance at the Mayan Theater in Los Angeles. Directed by David Lynch.",
    "2014_467": "A group of friends were separated when one of them died in an accident. Later on she comes back as a ghost trying to get into heaven but to do that her friends must grant her a wish.",
    "2014_468": "The author Michel Houellebecq is abducted by three amateur kidnappers.",
    "2014_469": "Two best friends rise through the ranks of New York's Chinese underworld in the 1980s.",
    "2014_47": "20 years since their first adventure, Lloyd and Harry go on a road trip to find Harry's newly discovered daughter, who was given up for adoption.",
    "2014_470": "A documentary that questions the cost -- and value -- of higher education in the United States.",
    "2014_471": "A retired woman hires a dance instructor to give her private dance lessons at her home -- one per week for six weeks. What begins as an antagonistic relationship turns into a close friendship as they dance together.",
    "2014_472": "Korengal picks up where Restrepo left off; the same men, the same valley, the same commanders, but a very different look at the experience of war.",
    "2014_473": "The accomplishments of a blind surfer that, through the encouragement of his parents, best friend, and surf coach, embarked on a three-year journey of grueling mental and physical training that inspired the best pro-surfers in the world.",
    "2014_474": "A French actress filming an anti-war film in Hiroshima has an affair with a married Japanese architect as they share their differing perspectives on war.",
    "2014_475": "A mysterious man emerges from the Argentinean rainforest to help a poor farmer and his daughter, who are threatened by a band of mercenaries hired to force them to sell their land.",
    "2014_476": "Five friends go out to war and promise each other to be back for Christmas.",
    "2014_477": "A man loves a woman, whose family does not believe in love.",
    "2014_478": "A documentary that tells the story of America's addiction to oil, from its corporate conspiracy beginnings to its current monopoly today, and explains clearly and simply how we can end it - and finally win choice at the pump.",
    "2014_479": "\"The Principle\" brings to light astonishing new scientific observations challenging the Copernican Principle; the foundational assumption underlying the modern scientific world view. The idea that the Earth occupies no special or favored ...See more\"The Principle\" brings to light astonishing new scientific observations challenging the Copernican Principle; the foundational assumption underlying the modern scientific world view. The idea that the Earth occupies no special or favored position in the cosmos has launched the last two scientific revolutions - the Copernican Revolution and Relativity - and, as Lawrence Krauss has said, we could be on the verge of a third, with \"Copernicus coming back to haunt us.\" Interviews with leading cosmologists are interspersed with the views of dissidents and mavericks, bringing into sharp focus the challenges and implications not only for cosmology, but for our cultural and religious view of reality.  Written by Rick DeLano, Producer/Writer, \"The Principle\"See less",
    "2014_48": "Storm trackers, thrill-seekers, and everyday townspeople document an unprecedented onslaught of tornadoes touching down in the town of Silverton.",
    "2014_480": "Director Godfrey Reggio reveals humanity's trance-like relationship with technology, which, when commandeered by extreme emotional states, produces massive effects far beyond the human species.",
    "2014_481": "A wild teenage girl orchestrates a romance between her nanny and her father, who is a recovering addict.",
    "2014_482": "A vacationing family encounters an alien threat in this thriller based on the real-life Brown Mountain Lights phenomenon in North Carolina.",
    "2014_483": "Pug, a young boy growing up on a combative West Baltimore block, finds solace in a group of illegal dirt bike riders known as The 12 O'Clock Boys.",
    "2014_484": "A Los Angeles police chase sends a fame-obsessed man on a wild ride to save his girlfriend from a cybernetic terror.",
    "2014_485": "Twin brothers nicknamed \"Water\" and \"Power\" from the hard scrabble Eastside streets of Los Angeles rise like prince's through the city's political and police ranks to become players in a complex and dangerous web of the powerful and ...See moreTwin brothers nicknamed \"Water\" and \"Power\" from the hard scrabble Eastside streets of Los Angeles rise like prince's through the city's political and police ranks to become players in a complex and dangerous web of the powerful and corrupt of Los Angeles. One a decorated cop - the other a senator, find themselves in a seedy motel room on the eastern edge of Sunset Boulevard on a dark and rainy night. Something has gone very wrong. Can Power exist without Water? The Fixers and Powers of the city need answers. Everybody is looking for the Twins.  Written by AnonymousSee less",
    "2014_486": "A soldier assigned to Guantanamo Bay befriends a man who has been imprisoned there.",
    "2014_487": "A drama based on a true story when the Stirn family lived next to a Nazi POW camp in Wisconsin during W.W.II.",
    "2014_488": "Crunch Calhoun, a semi-reformed art thief, agrees to get his old gang back together to pull off one last heist.",
    "2014_489": "Rithy Panh uses clay figures, archival footage, and his narration to recreate the atrocities Cambodia's Khmer Rouge committed between 1975 and 1979.",
    "2014_49": "After a near-fatal plane crash in WWII, Olympian Louis Zamperini spends a harrowing 47 days in a raft with two fellow crewmen before he's caught by the Japanese navy and sent to a prisoner-of-war camp.",
    "2014_490": "A look at James 'Whitey' Bulger, one of the most infamous criminals in American history.",
    "2014_491": "When a bubbly young artist moves into a couple's tiny Chinatown apartment, their already fragile balance is upset even further.",
    "2014_492": "As war-ravaged South Sudan claims independence from North Sudan and its brutal President, Omar al-Bashir, a tiny, homemade prop plane wings in from France. It is piloted by eagle-eyed documentarian Hubert Sauper, who is mining for stories ...See moreAs war-ravaged South Sudan claims independence from North Sudan and its brutal President, Omar al-Bashir, a tiny, homemade prop plane wings in from France. It is piloted by eagle-eyed documentarian Hubert Sauper, who is mining for stories in a land trapped in the past but careening toward an apocalyptic future.  Written by Sundance Film FestivalSee less",
    "2014_493": "Fourteen-year-old Maria is a fundamentalist Catholic, living her life in a modern fashion, yet her heart belongs to Jesus. She wants to be a saint and go to heaven. No one, not even a nice boy she meets, can stop her in this goal.",
    "2014_494": "A gripping look into the difficulties facing of the women of India and what is being done to counteract generations of oppression against them.",
    "2014_495": "A look at the history and traditions of flamenco music and dance through the live performance of a wide variety of pieces.",
    "2014_496": "After attempting suicide, Claude is recruited for a time travel experiment, but, when the machine goes haywire, he may be trapped hurtling through his memories.",
    "2014_497": "The story of Abraham Lincoln's childhood in the harsh wilderness of Indiana and the hardships that shaped him, the tragedy that marked him for ever and the two women who guided him to immortality.",
    "2014_498": "A Hindi feature film set in the lower depths of Bombay's \"C\" grade film industry. Miss Lovely follows the devastating story of two brothers who produce sleazy horror films in the mid-1980s. Read more: Synopsis",
    "2014_499": "A chain-wallah from Delhi travels across India in search of his missing son, in the hopes that whoever took him, returns him unharmed.",
    "2014_5": "Katniss Everdeen is in District 13 after she shatters the games forever. Under the leadership of President Coin and the advice of her trusted friends, Katniss spreads her wings as she fights to save Peeta and a nation moved by her courage.",
    "2014_50": "An unlikely World War II platoon is tasked to rescue art masterpieces from Nazi thieves and return them to their owners.",
    "2014_500": "A documentary about the soul of American music. The film follows the recording of a new album featuring legends from Stax records and Memphis mentoring and passing on their musical magic to stars and artists of today.",
    "2014_501": "Johnny Depp pays a visit to Ralph Steadman, the renown artist and the last of the original Gonzo visionaries who worked alongside Hunter S. Thompson. Written by Anonymous",
    "2014_502": "A film that explores how African American communities have used the camera as a tool for social change from the invention of photography to the present. This epic tale poetically moves between the present and the past, through contemporary...See moreA film that explores how African American communities have used the camera as a tool for social change from the invention of photography to the present. This epic tale poetically moves between the present and the past, through contemporary photographers and artists whose images and stories seek to reconcile legacies of pride and shame while giving voice to images long suppressed, forgotten, and hidden from sight.  Written by AnonymousSee less",
    "2014_503": "As a man leaves his wife and daughter, a series of brief conversations, observed gestures, chance encounters and impulsive acts, tell the story of the relationships that flounder and thrive in the wake of this decision.",
    "2014_504": "A hit man traumatized from accidentally killing a young girl during a job is given the mission to eliminate her mother, and begins the ultimate fight to save her life.",
    "2014_505": "Berlin, the Romantic Era. Young poet Heinrich wishes to conquer the inevitability of death through love, yet is unable to convince his skeptical cousin Marie to join him in a suicide pact. It is whilst coming to terms with this refusal, ...See moreBerlin, the Romantic Era. Young poet Heinrich wishes to conquer the inevitability of death through love, yet is unable to convince his skeptical cousin Marie to join him in a suicide pact. It is whilst coming to terms with this refusal, ineffably distressed by his cousin's insensitivity to the depth of his feelings, that Heinrich meets Henriette, the wife of a business acquaintance. Heinrich's subsequent offer to the beguiling young woman at first holds scant appeal, that is until Henriette discovers she is suffering from a terminal illness  Written by Cannes Film FestivalSee less",
    "2014_506": "The adventures of an eccentric girl who has strange attitudes towards hygiene and sexuality longs for the reunion of her divorced parents.",
    "2014_507": "Love, science, sex, infidelity, disease and comedy, the wild, mostly true story of the irrepressible Annie Parker and the almost discovery of a cure for cancer. Read more: Synopsis",
    "2014_508": "A former Arizona sheriff's wife is killed while riding on their ranch property. It would appear a Mexican man illegally crossing into the US is at fault. As the former and the current sheriff search for answers, lives are changed forever. Read more: Synopsis",
    "2014_509": "A scheming couple put a struggling family man and his old friend through a series of increasingly twisted dares over the course of an evening at a local bar.",
    "2014_51": "Security guard Ben must prove himself to his girlfriend's brother, top police officer James. He rides along James on a 24-hour patrol of Atlanta.",
    "2014_510": "A singer and songwriter, who gave up his dream is entered into a Reality TV songwriting contest. But after losing the first two rounds, he takes on a win-at-all-costs attitude, even if winning means losing himself.",
    "2014_511": "The Sagrada Família in Barcelona is a unique and fascinating building project by a brilliant, formerly controversial genius, Antoni Gaudi, with an army of workers, a history with many highs and lows and a myriad of questions raised. The ...See moreThe Sagrada Família in Barcelona is a unique and fascinating building project by a brilliant, formerly controversial genius, Antoni Gaudi, with an army of workers, a history with many highs and lows and a myriad of questions raised. The biography of the edifice, which has been under construction since 1882 and is about half completed today, is the starting point for Stefan Haupt's film SAGRADA, el misteri de la creacio.  Written by HauptSee less",
    "2014_512": "A weak-willed Italian man becomes a fascist flunky who goes abroad to arrange the assassination of his old teacher, now a political dissident.",
    "2014_513": "An American doctor travels to Ireland to study the Casey family after 38-year-old Conor suffers a stroke which changes his personality, leaving dynamo wife and mother Vanetia to run the show.",
    "2014_514": "The film's central story follows a small group of American explorers at Dallas-based oil company Kosmos Energy. Between 2007 and 2011, with unprecedented, independent access, Big Men's two-person crew filmed inside the oil company as ...See moreThe film's central story follows a small group of American explorers at Dallas-based oil company Kosmos Energy. Between 2007 and 2011, with unprecedented, independent access, Big Men's two-person crew filmed inside the oil company as Kosmos and its partners discovered and developed the first commercial oil field in Ghana's history. Simultaneously the crew filmed in the swamps of Nigeria's Niger Delta, following the exploits of a militant gang to reveal another side of the economy of oil: people trying to profit in any way possible, because they've given up on waiting for the money to trickle down. So what happens when a group of hungry people discover a massive and exquisitely rare pot of gold in one of the poorest places on earth?  Written by Official siteSee less",
    "2014_515": "When motocross and heavy metal obsessed thirteen-year-old Jacob's increasing delinquent behavior forces CPS to place his little brother, Wes, with his aunt, Jacob and his emotionally absent father, Hollis, must finally take responsibility ...See moreWhen motocross and heavy metal obsessed thirteen-year-old Jacob's increasing delinquent behavior forces CPS to place his little brother, Wes, with his aunt, Jacob and his emotionally absent father, Hollis, must finally take responsibility for their actions and for each other in order to bring Wes home.  Written by AnonymousSee less",
    "2014_516": "A fun weekend turns into madness and horror for a bunch of groupies looking for fun in a beaver infested swamp.",
    "2014_517": "A small group of everyday passengers on a speeding London commuter train battle their warped driver who has a dark plan for everyone on-board.",
    "2014_518": "A look at the life of pianist Joe Albany from the perspective of his young daughter, as she watches him contend with his drug addiction during the 1970s jazz scene.",
    "2014_519": "Two parents fall in love over the course of a single day while playing hooky from their children's college tour. Read more: Synopsis",
    "2014_52": "When Dusty learns that his engine is damaged and he may never race again, he joins a forest fire and rescue unit to be trained as a firefighter, or else his air strip will be shut down.",
    "2014_520": "A family vacation during the summer of 1985 changes everything for a teenage boy obsessed with ping pong.",
    "2014_521": "A look at the many roles played by eclectic actor/activist George Takei, whose wit, humor and grace have helped him to become an internationally beloved figure and Internet phenomenon with 7-million Facebook fans and counting.",
    "2014_522": "In a working class neighborhood in Casablanca, Abdellah, a homosexual teen, tries to build his own life within his big family, caught between an authoritarian mother and an older brother, who he adores.",
    "2014_523": "Five years after losing touch with a summer fling, a woman has difficulty choosing between her two suitors.",
    "2014_524": "On the outskirts of the U.S. Civil War, a boy is sent north by his bounty hunter gang to retrieve a wanted man. Read more: Synopsis",
    "2014_525": "A road movie about a dysfunctional family who embark on a Lewis and Clark re-enactment trek and discover themselves and each other in the process.",
    "2014_526": "Kevin Spacey, Sam Mendes and the Bridge Project Company reveal some of the most intimate moments behind the scenes of their staging of Richard III. Read more: Synopsis",
    "2014_527": "Love has no borders and therein lies the premise of the charming, new Iranian-American romantic comedy \"Shirin in Love.\" Nazanin Boniadi plays Shirin, an absent-minded, young Iranian-American living in \"Tehrangeles\" (the large Iranian ...See moreLove has no borders and therein lies the premise of the charming, new Iranian-American romantic comedy \"Shirin in Love.\" Nazanin Boniadi plays Shirin, an absent-minded, young Iranian-American living in \"Tehrangeles\" (the large Iranian community in Los Angeles) with her overbearing mother and empathetic father. Despite being engaged for years to a successful Iranian plastic surgeon in Beverly Hills, Shirin finds herself breaking loyalty and tradition when she falls in love with a mysterious young man who lives in a lighthouse in northern California. As her secret unravels and cultures clash, Shirin discovers what it ultimately means to be true to herself.  Written by Sideshow ReleasingSee less",
    "2014_528": "A rock journalist is assigned to track down her ex-boyfriend.",
    "2014_529": "The story of programming prodigy and information activist Aaron Swartz, who took his own life at the age of 26.",
    "2014_53": "A story focusing on a conflict between a People's Liberation Army squad and a bandit gang in north-east China during the Chinese revolution.",
    "2014_530": "David Portnoy, a fifteen-year-old birding fanatic, thinks that he's made the discovery of a lifetime. So, on the eve of his father's remarriage, he escapes on an epic road trip with his best friends to solidify their place in birding ...See moreDavid Portnoy, a fifteen-year-old birding fanatic, thinks that he's made the discovery of a lifetime. So, on the eve of his father's remarriage, he escapes on an epic road trip with his best friends to solidify their place in birding history.  Written by Crossroads FilmsSee less",
    "2014_531": "A young girl discovers that America's wild horses are in danger of being wiped off the land they've called home for thousands of years, as American Mustang the Movie unveils the compelling story of the wild mustang.",
    "2014_532": "Fervidly dark lovesick horror inspired by the real-life criminal duo, the Lonely Hearts Killers.",
    "2014_533": "A U.S. secret agent is sent to the distant space city of Alphaville where he must find a missing person and free the city from its tyrannical ruler.",
    "2014_534": "A successful, ego-maniacal architect who has spent a lifetime bullying his wife, employees and mistresses wants to make peace as his life approaches its final act.",
    "2014_535": "Nicholas Vreeland walked away from a worldly life of privilege to become a Tibetan Buddhist monk. Grandson of legendary Vogue editor, Diana Vreeland, and trained by Irving Penn to become a photographer, Nicholas' life changed drastically ...See moreNicholas Vreeland walked away from a worldly life of privilege to become a Tibetan Buddhist monk. Grandson of legendary Vogue editor, Diana Vreeland, and trained by Irving Penn to become a photographer, Nicholas' life changed drastically upon meeting a Tibetan master, one of the teachers of the Dalai Lama. Soon thereafter, he gave up his glamorous life to live in a monastery in India, where he studied Buddhism for fourteen years. In an ironic twist of fate, Nicholas went back to photography to help his fellow monks rebuild their monastery. Recently, the Dalai Lama appointed Nicholas as Abbot of the monastery, making him the first Westerner in Tibetan Buddhist history, to attain such a highly regarded position.  Written by AnonymousSee less",
    "2014_536": "When the Nazis begin killing Jews in Holland, a group of youth fight to save the lives of the innocent.",
    "2014_537": "A documentary reflects on artist Ai Weiwei's battle against the lawsuit thrust upon him by the Chinese government in an effort to silence him.",
    "2014_538": "Filmmaker Joel Gilbert travels across America confronting progressives and exposing their fantasy of Utopia.",
    "2014_539": "A documentary portrait of the late John Wojtowicz, whose attempted robbery of a Brooklyn bank to finance his male lover's sex-reassignment surgery was the real-life inspiration for Dog Day Afternoon.",
    "2014_54": "Admiral Yi Sun-sin faces a tough challenge when he is forced to defend his nation with just 13 battleships against 300 Japanese enemy ships in the Battle of Myeongryang.",
    "2014_540": "Ex-felon, Eugene Brown, establishes a Chess Club for inner city teenagers in Washington, D.C.",
    "2014_541": "Spend a year in the life of one of America's most innovative classrooms.",
    "2014_542": "The power of hope in the face of seemingly insurmountable odds, and an object lesson in what it really means to be a winner in life.",
    "2014_543": "Filmmakers James Franco and Travis Mathews re-imagine the lost 40 minutes from Cruising as a starting point to a broader exploration of sexual and creative freedom.",
    "2014_544": "Teenagers did not always exist. In this living collage of rare archival material, filmed portraits, and voices lifted from early 20th Century diary entries, a struggle erupts between adults and adolescents to define a new idea of youth.",
    "2014_545": "A dispossessed, violent man's disastrous attempt to exist outside the social order.",
    "2014_546": "A grand and adventurous journey of discovery to the last white areas of the world map. But no matter how far we go and how hard we try to find answers, we ultimately meet ourselves and our own transience.",
    "2014_547": "A naive college graduate, Amy, who believes she's destined to be a great poet, begrudgingly accepts a job in a shop while she pursues a mentorship with reclusive writer Rat Billings.",
    "2014_548": "A group of modern day Pittsburgh teenagers spend their Thanksgiving break experiencing a mixture of love, friendship, partying, and sex.",
    "2014_549": "After committing a murder, a man locks himself in his apartment and recollects the events that led him to the killing.",
    "2014_55": "Two struggling pals dress as police officers for a costume party and become neighborhood sensations. But when these newly-minted \"heroes\" get tangled in a real life web of mobsters and dirty detectives, they must put their fake badges on the line.",
    "2014_550": "A documentary that uses a cache of letters, diaries and documents to reveal the life of SS-leader Heinrich Himmler.",
    "2014_551": "A young man comes to the rescue of his girlfriend abducted by thieves and brought to Rio. An extravagant adventure ensues.",
    "2014_552": "A teen drama set during the fall potato harvest in a small northern Maine town.",
    "2014_553": "Roots music icon Chris Strachwitz is a detective of deep American music - music that's the antithesis of the corporate \"mouse music\" dominating pop culture. Since 1960, he has been the guiding force behind legendary Arhoolie Records, ...See moreRoots music icon Chris Strachwitz is a detective of deep American music - music that's the antithesis of the corporate \"mouse music\" dominating pop culture. Since 1960, he has been the guiding force behind legendary Arhoolie Records, bringing Cajun music out of Louisiana, Tex-Mex out of Texas, blues out of the country - and into the living rooms of Middle America. American music has never been the same. Born a German count, Strachwitz fled his homeland after WWII at 16. In the US, he discovered, and shared, a musical landscape that most Americans missed. He takes us on a hip-shaking stomp from Texas to New Orleans, Cajun country to Appalachia, as he continues his passionate quest for the musical soul of America.See less",
    "2014_554": "With Earth now left in ruins following the \"Nano Hazard,\" most of humanity has abandoned the planet they once called home along with their physical bodies and rebuilt their digitalized minds into a society within the cyber universe of \"...See moreWith Earth now left in ruins following the \"Nano Hazard,\" most of humanity has abandoned the planet they once called home along with their physical bodies and rebuilt their digitalized minds into a society within the cyber universe of \"DEVA.\" A.D. 2400, DEVA's central council detects an incident of unauthorized access into their mainframe. Someone on Earth was trying to hack into the system. The only information DEVA was able to retrieve was that the hacker referred to themselves as \"Frontier Setter.\" To investigate the mysterious hacker's motives, the high officials of DEVA dispatch System Security Third Officer Angela Balzac to the Earth's surface. Equipped with a prosthetic \"material body,\" Angela attempts to make contact with a local agent Dingo, but what awaited her instead was a swarm of Sandworms now infesting the Earth's surface. Angela intercepts the gruesome pests with her exoskeletal powered suit Arhan. Will Angela and Dingo be able to find Frontier Setter on this devastated planet? Their journey to explore the secrets of the world will begin now...!See less",
    "2014_555": "Signe Baumane and five women in her family battle with depression and madness.",
    "2014_556": "Lila wants to emulate the sexual exploits of her more experienced best friend. She fixates on a tough older guy who will \"sleep with anyone\" and tries to insert herself into his world, putting herself in a dangerously vulnerable situation.",
    "2014_557": "In a secluded house by the sea with the curtains shut, a screenwriter hides from the world with only his dog as company. The tranquility is abruptly broken one night by the arrival of a young woman fleeing from the authorities. Refusing to...See moreIn a secluded house by the sea with the curtains shut, a screenwriter hides from the world with only his dog as company. The tranquility is abruptly broken one night by the arrival of a young woman fleeing from the authorities. Refusing to leave, she takes refuge in the house. But come dawn, another unexpected presence will change everything.  Written by Variance FilmsSee less",
    "2014_558": "A diverse band of crayons strive to protect not only their magical multihued homeland but the imagination of children everywhere from a terrifying monster.",
    "2014_559": "On New Year's Eve, an insecure, struggling actress (Anna Magnani) has nothing to do. When a colleague invites her to a New Year's party, she jumps at the opportunity. Accidentally she runs into an old acting acquaintance (Toto), who is ...See moreOn New Year's Eve, an insecure, struggling actress (Anna Magnani) has nothing to do. When a colleague invites her to a New Year's party, she jumps at the opportunity. Accidentally she runs into an old acting acquaintance (Toto), who is helping a professional pickpocket (Ben Gazzara) steal from people during the hustle-bustle of New Year's Eve festivities. During the course of the evening, they have numerous crazy, humorous adventures all over Rome at different parties, restaurants, and even the Trevi fountain. Magnani's character (Tortorella) falls for Gazzara's character (Lello) without knowing what he's up to, while Toto tries to placate them both.  Written by Miriam KramerSee less",
    "2014_56": "A foster kid, who lives with her mean foster mom, sees her life change when business tycoon and New York City mayoral candidate Will Stacks makes a thinly-veiled campaign move and takes her in.",
    "2014_560": "Arman is 33 and ready to make a change, starting with a run in the park. When he literally bumps into Amelie - slightly cynical but nevertheless lovely - on the jogging path, he's dead-set on making a connection with her. As a bit of ...See moreArman is 33 and ready to make a change, starting with a run in the park. When he literally bumps into Amelie - slightly cynical but nevertheless lovely - on the jogging path, he's dead-set on making a connection with her. As a bit of contrived fate brings them together, Arman's best friend Benjamin suffers an unexpected stroke, relegating him to the hospital for weeks where he falls for his doting young physical therapist. Over the course of two autumns and three winters, Arman, Amelie and Benjamin share the incidental moments, unexpected accidents, unconventional love stories and unforgettable memories that will define who they are.  Written by AnonymousSee less",
    "2014_561": "In 2011, Pulitzer Prize-winning journalist Jose Antonio Vargas outed himself as an undocumented immigrant in the New York Times Magazine. 'Documented' chronicles his journey to America from the Philippines as a child; his journey through ...See moreIn 2011, Pulitzer Prize-winning journalist Jose Antonio Vargas outed himself as an undocumented immigrant in the New York Times Magazine. 'Documented' chronicles his journey to America from the Philippines as a child; his journey through America as an immigration reform activist/provocateur; and his journey inward as he re-connects with his mother, whom he hasn't seen in 20 years.  Written by AnonymousSee less",
    "2014_562": "After a break up, Jenny moves in with writer Kelly, her filmmaker husband, and their child. Despite a rocky start, Jenny's influence helps Kelly realize that an evolution in her life, career and relationship is necessary for her happiness.",
    "2014_563": "Southern Baptist Sissies is the story of four boys who are gay growing up in the Southern Baptist Church and how they each deal differently with the conflict between the teachings of the church and their sexuality.",
    "2014_564": "A modern day version of The Prodigal Son Parable",
    "2014_565": "A documentary about a group of pilgrims who travel to Nepal to worship at the legendary Manakamana temple.",
    "2014_566": "Yellow Day chronicles a young man's life-changing and inspirational journey through the mysterious Yellow Day. To many, the Yellow Day is simply a fun day celebrating outreach at a kid's camp, but to some, God bestows visions and miracles,...See moreYellow Day chronicles a young man's life-changing and inspirational journey through the mysterious Yellow Day. To many, the Yellow Day is simply a fun day celebrating outreach at a kid's camp, but to some, God bestows visions and miracles, transforming their lives. For this young man, the Yellow Day becomes an imaginative adventure: showing him true heroes, challenging him to face his fears, find love, and inviting him to accept grace, so that he can be shaped into who he is meant to be. On this day, the young man is presented remarkable stories in Faith, Hope, and Love coming from true stories of real life heroes in the special needs, chronic illness, and domestic abuse communities at the extraordinary Camp Grace, a beautiful retreat with the motto: \"Lives are changed and souls are strengthened.\" Guided by a friendly 10-year-old girl, his spiritual journey back to the light, to witness the triumphs of others, face his fears, and fulfill his destiny, will test the strength of both his faith and his courage.  Written by Yellow DaySee less",
    "2014_567": "The Moorish General Othello is manipulated into thinking that his new wife Desdemona has been carrying on an affair with his Lieutenant Michael Cassio when in reality, it is all part of the scheme of a bitter Ensign named Iago.",
    "2014_568": "Stations of the Elevated (1981) is a 45-minute city symphony directed, produced and edited by Manfred Kirchheimer. Shot on lush 16mm color reversal stock, the film weaves together vivid images of graffiti- covered elevated subway trains ...See moreStations of the Elevated (1981) is a 45-minute city symphony directed, produced and edited by Manfred Kirchheimer. Shot on lush 16mm color reversal stock, the film weaves together vivid images of graffiti- covered elevated subway trains crisscrossing the gritty urban landscape of 1970s New York, to a commentary-free soundtrack that combines ambient city noise with jazz and gospel by Charles Mingus and Aretha Franklin. Gliding through the South Bronx, Brooklyn, Queens and Manhattan - making a rural detour past a correctional facility upstate - Stations of the Elevated is an impressionistic portrait of and tribute to a New York that has long since disappeared.See less",
    "2014_569": "A chimney sweep and a shepherdess seek to escape from the clutches of a tyrannical king.",
    "2014_57": "Jack Ryan, as a young covert C.I.A. analyst, uncovers a Russian plot to crash the U.S. economy with a terrorist attack.",
    "2014_570": "When an affluent matriarch gathers her dysfunctional family for a holiday at their Northern California lake house, her carefully constructed weekend begins to come apart at the seams, leading her to question her own role in the family.",
    "2014_571": "The French computer programmer Laura inherits the task of making a computer game of the Battle of Okinawa during World War II. She searches the internet for information on the battle, and interviews Japanese experts and witnesses. The ...See moreThe French computer programmer Laura inherits the task of making a computer game of the Battle of Okinawa during World War II. She searches the internet for information on the battle, and interviews Japanese experts and witnesses. The extraordinary circumstances of the Battle of Okinawa lead Laura to reflect deeply on her own life and humanity in general, particularly the influence of history and memories.  Written by Brian Rawnsley See less",
    "2014_572": "Elena, a young Brazilian woman, travels to New York with the same dream as her mother, to become a movie actress. She leaves behind her childhood spent in hiding during the years of the military dictatorship. She also leaves Petra, her ...See moreElena, a young Brazilian woman, travels to New York with the same dream as her mother, to become a movie actress. She leaves behind her childhood spent in hiding during the years of the military dictatorship. She also leaves Petra, her seven year old sister. Two decades later, Petra also becomes an actress and goes to New York in search of Elena. She only has a few clues about her: home movies, newspaper clippings, a diary and letters. At any moment Petra hopes to find Elena walking in the streets in a silk blouse. Gradually, the features of the two sisters are confused; we no longer know one from the other. When Petra finally finds Elena in an unexpected place, she has to learn to let her go.  Written by Busca Vida FilmesSee less",
    "2014_573": "A marketing executive tries to find Mr. Right on a Christian dating website. When impressing her dream guy ends in disaster, Gwyneth gets in touch with her spiritual side.",
    "2014_574": "Elizabeth Streb vs. Gravity takes us on an exhilarating journey with choreographer Elizabeth Streb - pushing the boundaries between action and art and daring us to join Streb and her dancers in pursuit of human flight.",
    "2014_575": "A newlywed couple finds their lake-country honeymoon descend into chaos after Paul finds Bea wandering and disoriented in the middle of the night.",
    "2014_576": "Trying to navigate love and intimacy in the digital age, a woman and her boyfriend's teenage children become unlikely guides in each others relationships.",
    "2014_577": "A documentary that observes the year after Pennsylvania State University assistant football coach Jerry Sandusky's arrest on child sex abuse charges.",
    "2014_578": "Desperate, broke, and out of ideas, four college seniors start a fake charity to embezzle money for tuition.",
    "2014_579": "'Oxygen for the Ears: Living Jazz' is a story of the trials and triumphs of jazz in America. Every jazz tune has a starting point - a simple note - from which the music starts its journey and rises. 'Oxygen for the Ears' portrays ...See more'Oxygen for the Ears: Living Jazz' is a story of the trials and triumphs of jazz in America. Every jazz tune has a starting point - a simple note - from which the music starts its journey and rises. 'Oxygen for the Ears' portrays Washington D.C. as such a departure point for its documentary story, 'Living Jazz'.  Written by AnonymousSee less",
    "2014_58": "After a bad blind date, a man and woman find themselves stuck together at a resort for families, where their attraction grows as their respective kids benefit from the burgeoning relationship.",
    "2014_580": "Learn how video games are made, marketed, and consumed by looking back at gaming history and culture through the eyes of game developers, publishers, and consumers.",
    "2014_581": "A strange singer with God-given talent drifts through his adopted city of Memphis with its canopy of ancient oak trees, streets of shattered windows, and aura of burning spirituality. Surrounded by beautiful women, legendary musicians, a ...See moreA strange singer with God-given talent drifts through his adopted city of Memphis with its canopy of ancient oak trees, streets of shattered windows, and aura of burning spirituality. Surrounded by beautiful women, legendary musicians, a stone-cold hustler, a righteous preacher, and a wolf pack of kids, the sweet, yet unstable, performer avoids the recording studio, driven by his own form of self-discovery. His journey quickly drags him from love and happiness right to the edge of another dimension.  Written by Sundance Film FestivalSee less",
    "2014_582": "Erin Logan lives with and provides for her twin brother Jacob, who is severely affected by autism. After she stumbles into chances for love and friendship, she is forced to confront what it means to have a good life, and whether she can ...See moreErin Logan lives with and provides for her twin brother Jacob, who is severely affected by autism. After she stumbles into chances for love and friendship, she is forced to confront what it means to have a good life, and whether she can care for her brother and for herself at the same time.  Written by Keaton Wooden, and David MidellSee less",
    "2014_583": "At the dawn of World War III, a man searches for a way to restore peace to the world and finds he must give something in return.",
    "2014_584": "The story of Dinoo and Karishma, who decide to get married in Goa and head to more interior parts of the country fearing that the girl's parents may get her married to a guy of their choice. As life gets tougher, they realize that this ...See moreThe story of Dinoo and Karishma, who decide to get married in Goa and head to more interior parts of the country fearing that the girl's parents may get her married to a guy of their choice. As life gets tougher, they realize that this wasn't what they had bargained for.  Written by Fatima KhalidSee less",
    "2014_585": "The Mississippi River Flood of 1927 was the most destructive river flood in American history. In the spring of 1927, the river broke out of its banks in 145 places and inundated 27,000 square miles to a depth of up to 30 feet. Part of it ...See moreThe Mississippi River Flood of 1927 was the most destructive river flood in American history. In the spring of 1927, the river broke out of its banks in 145 places and inundated 27,000 square miles to a depth of up to 30 feet. Part of it enduring legacy was the mass exodus of displaced sharecroppers. Musically, the Great Migration of rural southern blacks to Northern cities saw the Delta Blues electrified and reinterpreted as the Chicago Blues, Rhythm and Blues, and Rock and Roll. Using minimal text and no spoken dialog, filmmaker Bill Morrison and composer - guitarist Bill Frisell have created a powerful portrait of a seminal moment in American history through a collection of silent images matched to a searing original soundtrack.  Written by AnonymousSee less",
    "2014_586": "A drama centered on a former actress who subjects her 15-year-old daughter to a series of depressed small towns, money woes, failed love affairs, and bouts of depression.",
    "2014_587": "A personal, accessible look at an artist - Kevin Barnes, frontman of the endlessly versatile indie pop band of Montreal - whose pursuit to make transcendent music at all costs drives him to value art over human relationships. As he ...See moreA personal, accessible look at an artist - Kevin Barnes, frontman of the endlessly versatile indie pop band of Montreal - whose pursuit to make transcendent music at all costs drives him to value art over human relationships. As he struggles with all of those around him, family and bandmates alike, he's forced to reconsider the future of the band, begging the question - is this really worth it?  Written by Oscilloscope LaboratoriesSee less",
    "2014_588": "The film centers an aged movie extra who specializes to be killed in samurai movies without ever being lit by the limelight. Using Charlie Chaplin's film Limelight as an underlying theme, the admirable story of Seiichi Kamiyama dealing ...See moreThe film centers an aged movie extra who specializes to be killed in samurai movies without ever being lit by the limelight. Using Charlie Chaplin's film Limelight as an underlying theme, the admirable story of Seiichi Kamiyama dealing with a new generation and fading craftsmanship is told with melancholy and soul.  Written by AnonymousSee less",
    "2014_589": "Set in a parallel universe, Comet bounces back and forth over the course of an unlikely but perfectly paired couple's six-year relationship.",
    "2014_59": "A married couple wake up to discover that the sex tape they made the evening before has gone missing, leading to a frantic search for its whereabouts.",
    "2014_590": "Kyle and Jen, estranged siblings, travel from New York City to rural Pennsylvania to pack up the home of their recently deceased mother. While there, they make a discovery that turns their world upside-down. A Picture of You is a serious ...See moreKyle and Jen, estranged siblings, travel from New York City to rural Pennsylvania to pack up the home of their recently deceased mother. While there, they make a discovery that turns their world upside-down. A Picture of You is a serious movie about life that smashes into a funny movie about death. It's a story about family, loss, secrets, letting go, and starting anew.See less",
    "2014_591": "After the tragic death of his wife, Ray becomes personally responsible for the safety of Vicki, an aspiring model, when due to her father's embezzlement, she is targeted by a human trafficker and vicious criminal.",
    "2014_592": "When Brandy decides to reclaim her life as an actor, the domestic world she's carefully created crumbles around her. Actress is both a present tense portrait of a dying relationship and an exploration of a complicated woman, performing the...See moreWhen Brandy decides to reclaim her life as an actor, the domestic world she's carefully created crumbles around her. Actress is both a present tense portrait of a dying relationship and an exploration of a complicated woman, performing the role of herself as she faces the desires that exist outside of her home.  Written by AnonymousSee less",
    "2014_593": "Filmed with five hidden cameras, The Tightrope is a total immersion into the creative process behind legendary theater director Peter Brook's work -- powerful, intimate, and emotionally thrilling. In this unique and deeply personal film, ...See moreFilmed with five hidden cameras, The Tightrope is a total immersion into the creative process behind legendary theater director Peter Brook's work -- powerful, intimate, and emotionally thrilling. In this unique and deeply personal film, we get a dizzying glimpse from the Tightrope and an inkling of what it takes to make theater real...  Written by AnonymousSee less",
    "2014_594": "Four modern stories of remarkable courage while setting out to uncover the forgotten life of Raphael Lemkin, the man who coined the term 'genocide'. Inspired by Samantha Power's Pulitzer Prize-winning book, 'A Problem From Hell', 'Watchers...See moreFour modern stories of remarkable courage while setting out to uncover the forgotten life of Raphael Lemkin, the man who coined the term 'genocide'. Inspired by Samantha Power's Pulitzer Prize-winning book, 'A Problem From Hell', 'Watchers of the Sky' traverses time and continents to explore genocide and the cycle of violence.  Written by AnonymousSee less",
    "2014_595": "A documentary that unveils the moral tensions that tear at soldiers' psyches through the lens of one highly personal story: Private Adam Winfield was a 21-year-old soldier in Afghanistan when he attempted with the help of his father to ...See moreA documentary that unveils the moral tensions that tear at soldiers' psyches through the lens of one highly personal story: Private Adam Winfield was a 21-year-old soldier in Afghanistan when he attempted with the help of his father to alert the military to heinous war crimes his platoon was committing. But Winfield's pleas went unheeded. Left on his own and with threats to his life, Private Winfield was himself drawn into the moral abyss, forced to make a split-second decision that would change his life forever.  Written by Oscilloscope LaboratoriesSee less",
    "2014_596": "In 1985, a gay dance understudy hopes for his on-stage chance while fearing the growing AIDS epidemic.",
    "2014_597": "Meet the inhabitants of the \"Casa di Riposa\" in Milan, the world's first nursing home for retired opera singers, founded by composer Giuseppe Verdi in 1896. In his documentary film Tosca's Kiss, which has developed an underground cult ...See moreMeet the inhabitants of the \"Casa di Riposa\" in Milan, the world's first nursing home for retired opera singers, founded by composer Giuseppe Verdi in 1896. In his documentary film Tosca's Kiss, which has developed an underground cult following over the years and is a favorite among opera and music lovers worldwide, director Daniel Schmid has captured a world in which these wonderful singers (many of whom had significant careers on the opera stage) re-live and re-enact their triumphant roles of the glorious past. Tosca's Kiss is a touching and often hilarious film on the subject of aging and the power and timeless capacity of music to inspire.  Written by AnonymousSee less",
    "2014_598": "An anonymous body in the Arizona desert sparks the beginning of a real-life human drama. The search for identity leads us back across a continent to seek out the people left behind and the meaning of a mysterious tattoo.",
    "2014_599": "Chantal Akerman followed famous Choreographer Pina Bausch and her company of dancers, The Tanzteater Wuppertal, for five weeks while they were on tour in Germany, Italy and France. Her objective was to capture Pina Bausch's unparalleled ...See moreChantal Akerman followed famous Choreographer Pina Bausch and her company of dancers, The Tanzteater Wuppertal, for five weeks while they were on tour in Germany, Italy and France. Her objective was to capture Pina Bausch's unparalleled art not only on stage but also behind the scenes.  Written by Guy BellingerSee less",
    "2014_6": "The X-Men send Wolverine to the past in a desperate effort to change history and prevent an event that results in doom for both humans and mutants.",
    "2014_60": "A look at the relationship between the famous physicist Stephen Hawking and his wife.",
    "2014_600": "Kelly once played in a punk band, and now, after the birth of her son and moving to a cozy and boring suburb, she can not feel comfortable in the role of the right mom and exemplary wife. Calvin, her seventeen-year-old neighbor, who uses a...See moreKelly once played in a punk band, and now, after the birth of her son and moving to a cozy and boring suburb, she can not feel comfortable in the role of the right mom and exemplary wife. Calvin, her seventeen-year-old neighbor, who uses a wheelchair after an accident, also cannot get used to his new position. A fleeting conversation between two people, for various reasons forced to spend a lot of time at home, gives rise to a tender friendship in which both find what they lacked. Kelly, once a punk-rocker turned suburban mom, is nostalgic for a life she can no longer have and uncertain of a future she doesn't yet fit in. Seventeen-year-old Cal is frustrated at his lack of control over the hand he's been dealt. When the two strike up an unlikely friendship, it's the perfect spark needed to thrust them both back to life.  Written by AmazonSee less",
    "2014_601": "Three homeless teenagers brave Chicago winters, the pressures of high school, and life alone on the streets to build a brighter future.",
    "2014_602": "The story of an autistic youth named Ricky who, after a particularly difficult day at school, escapes into the subways. It's here that he starts his real journey, on a days-long voyage of discovery while, above ground, his mom frantically ...See moreThe story of an autistic youth named Ricky who, after a particularly difficult day at school, escapes into the subways. It's here that he starts his real journey, on a days-long voyage of discovery while, above ground, his mom frantically searches for him.  Written by ProductionSee less",
    "2014_603": "At Oxford, Austrian student Anna von Graz (Jacqueline Sassard) is dating fellow student William (Michael York), whom she plans to marry, but she ends up sleeping with two unhappily married Oxford professors instead.",
    "2014_604": "When his wife unexpectedly informs him that she wants a divorce, well-meaning but oblivious husband Otto Wall finds himself thrust back into bachelorhood, where he searches for the real thing amidst a string of one night stands.",
    "2014_605": "An Indian student in Prague and a lonely New Yorker correspond online through video letters. A voyeuristic love story about aching for human connection in a hyper-connected world.",
    "2014_606": "A look at the life and work of the great theatre, radio and film artist.",
    "2014_607": "The Story of Michael Heizer's Monolithic Sculpture.",
    "2014_608": "Olivia is a 27-year-old grad student who's beginning to suspect she's an asexual. To help clear up her issues, she accepts a friend's offer to try sex with her own boyfriend. But much goes wrong in Olivia's first foray into sex.",
    "2014_609": "The \"black sheep\" son of a wealthy family meets a young psychiatric patient who's been raised in isolation her entire life. He then takes the naive young woman home for his brother's wedding.",
    "2014_61": "An incorrigibly self-serving exiled squirrel finds himself helping his former park brethren survive by raiding a nut store, a location that also happens to be a front for a human gang's bank robbery.",
    "2014_610": "A fictional account of the lives of the men responsible for the suicide bombings in Casablanca in 2003.",
    "2014_611": "An intimate examination of a contemporary artist couple, whose living and working patterns are threatened by the imminent sale of their home.",
    "2014_612": "A tragedy presents Laurel with the chance to reinvent herself as her idolized twin sister, Audrey. As she eases into the life she has always wanted, she must decide between continuing the lie or revealing herself as the perfect fraud.",
    "2014_613": "A documentary on provocative artist Bahman Mohassess, the so-called \"Persian Picasso,\" whose acclaimed paintings and sculptures dominated pre-revolutionary Iran.",
    "2014_614": "An alcoholic man and his two young children barely survive in Taipei. They cross path with a lonely grocery clerk who might help them make a better life. Read more: Synopsis",
    "2014_615": "A retro-futuristic epic of steampunk battle set in 1914. It has been 15 years since the original H.G. Wells Martian invasion. Fearing another attack, the human race has prepared itself. This is the story of the battle tripod 'Goliath' and ...See moreA retro-futuristic epic of steampunk battle set in 1914. It has been 15 years since the original H.G. Wells Martian invasion. Fearing another attack, the human race has prepared itself. This is the story of the battle tripod 'Goliath' and its young crew. 'Goliath' is the vanguard of an army of steam-powered battle walkers, heat-ray biplanes, and armored zeppelins facing a Martian fleet of giant fighting machines and flying wings. Within the cockpit of 'Goliath', courage under fire, conflicted loyalties and the struggle to save earth, in this new War of the Worlds.  Written by AnonymousSee less",
    "2014_616": "Reckless desire wreaks havoc over Memorial Day weekend as a family confronts the volatile and fragile nature of love. Inspired by Anton Chekhov's \"The Seagull,\" set in rural New England in 1984.",
    "2014_617": "Sol LeWitt, one of the most influential artists of the twentieth century, changed art forever.",
    "2014_618": "'Pleasures' profiles legendary jazz critic and civil libertarian Nat Hentoff, whose pioneering career tracks the greatest cultural and political movements of the last 65 years. The film is about an idea as well as a man - the idea of free ...See more'Pleasures' profiles legendary jazz critic and civil libertarian Nat Hentoff, whose pioneering career tracks the greatest cultural and political movements of the last 65 years. The film is about an idea as well as a man - the idea of free expression as the defining characteristic of the individual. Hentoff is a pioneering journalist who raised jazz as an art form and was present at the creation of 'alternative' journalism. 'Pleasures' wraps the themes of liberty and identity around a historical narrative that stretches from the Great Depression to the Patriot Act. With a mix of interviews, archival footage and music, it employs a complex non-linear structure to engage the audience in a life of independent ideas and the creation of an enduring voice.  Written by AnonymousSee less",
    "2014_619": "Following a group of climbers attempting to climb K2 in 2009, on the 100-year anniversary of its landmark 1909 expedition. Experience the adventure, peril and serenity of a group's attempt to climb the most challenging peak on earth.",
    "2014_62": "A slave-turned-gladiator finds himself in a race against time to save his true love, who has been betrothed to a corrupt Roman Senator. As Mount Vesuvius erupts, he must fight to save his beloved as Pompeii crumbles around him.",
    "2014_620": "The most daring moments in the struggle for liberation from colonial rule.",
    "2014_621": "Interwoven stories of people in India and US as they face dilemmas of life time in the months leading to the biggest Industrial disaster in human history that claimed 10,000 innocent lives within a few hours. Inspired by real events.",
    "2014_622": "Paris by night. Alex, 22, wants to become a filmmaker. He is fascinated by first times and his girlfriend, Florence, has just left him for his best friend, Thomas. First break-up, first attempted murder: Alex tries to strangle Thomas, but ...See moreParis by night. Alex, 22, wants to become a filmmaker. He is fascinated by first times and his girlfriend, Florence, has just left him for his best friend, Thomas. First break-up, first attempted murder: Alex tries to strangle Thomas, but gives up and wanders the streets. That evening, Mireille, a girl from provincial France who has come up to Paris to make commercials, is left by her boyfriend. Alex witnesses this separation. These two tormented souls run into each other at a party....See less",
    "2014_623": "Swimming superstar Missy Franklin was destined for greatness at an early age, but it wasn't until the arrival of Veteran Kara Lynn Joyce that those sky-high expectations began to take shape.",
    "2014_624": "Saul Leiter could have been lauded as the great the pioneer of color photography, but was never driven by the lure of success. Instead he preferred to drink coffee and photograph in his own way, amassing an archive of beautiful work that ...See moreSaul Leiter could have been lauded as the great the pioneer of color photography, but was never driven by the lure of success. Instead he preferred to drink coffee and photograph in his own way, amassing an archive of beautiful work that is now piled high in his New York apartment. An intimate and personal film, In No Great Hurry follows Saul as he deals with the triple burden of clearing an apartment full of memories, becoming world famous in his 80s and fending off a pesky filmmaker.  Written by Tomas LeachSee less",
    "2014_625": "Young Queen Margot finds herself trapped in an arranged marriage amidst a religious war between Catholics and Protestants. She hopes to escape with a new lover, but finds herself imprisoned by her powerful and ruthless family.",
    "2014_626": "A family in a house, and a chain of events that take place, on an ordinary evening that they plan to have dinner with relatives.",
    "2014_627": "REVENGE OF THE MEKONS charts the unlikely career of the genre-defying collective notorious for being--as rock critic Greil Marcus notes--\"the band that took punk ideology most seriously.\" Born out of the 1977 British punk scene, the Mekons...See moreREVENGE OF THE MEKONS charts the unlikely career of the genre-defying collective notorious for being--as rock critic Greil Marcus notes--\"the band that took punk ideology most seriously.\" Born out of the 1977 British punk scene, the Mekons progressed from a group of socialist art students with no musical skills to the prolific, raucous progeny of Hank Williams. Joe Angio's exuberant documentary follows their improbable history - a surprising and influential embrace of folk and country music, forays into the art world and consistent bad luck with major record labels. Featuring interviews with celebrated fans, from author Jonathan Franzen to film director Mary Harron to comedian/musician Fred Armisen, REVENGE OF THE MEKONS reveals how, four decades into an ever-evolving career, punk's reigning contrarians continue to make bold, unpredictable music while staying true to the punk ethos.See less",
    "2014_628": "A documentary on the Deepwater Horizon oil rig explosion as seen through the eyes of oil executives, survivors and Gulf Coast residents who experienced it first-hand and then were left to pick up the pieces while the world moved on.",
    "2014_629": "Thirty miles from the Arctic Circle, in the northern Icelandic town of Husavik, stands the Icelandic Phallological Museum - the world's only Penis museum. Over 40 years, the founder and curator has collected every specimen from every ...See moreThirty miles from the Arctic Circle, in the northern Icelandic town of Husavik, stands the Icelandic Phallological Museum - the world's only Penis museum. Over 40 years, the founder and curator has collected every specimen from every mammal except for one elusive penis needed to complete his collection: The Human Specimen. The film follows the curator's incredible, sublimely comic, often shocking quest to complete his eccentric collection, and the two intrepid men who have raised their hands to be the first human donor.  Written by AnonymousSee less",
    "2014_63": "When Mother Malkin, the queen of evil witches, escapes the pit she was imprisoned in by professional monster hunter Spook decades ago and kills his apprentice, he recruits young Tom, the seventh son of the seventh son, to help him.",
    "2014_630": "Vicky wanted to be the godfather of Mumbai underworld. He gains everything and also looses everything. He gains respect, power and leadership but he loses love, friendship.",
    "2014_631": "Driven to make the world better for his baby girl, John Ennis pieces together the cycle of pay-to-play politics that rules America. When insiders control the game, how can an outsider have a voice? Through first-time candidates in Ohio, ...See moreDriven to make the world better for his baby girl, John Ennis pieces together the cycle of pay-to-play politics that rules America. When insiders control the game, how can an outsider have a voice? Through first-time candidates in Ohio, following the money in our elections, and uncovering the secret history of Monopoly, Ennis finds solutions along his surprising journey.  Written by AnonymousSee less",
    "2014_632": "Two New York City girls make a pact to lose their virginity during their first summer out of high school. When they both fall for the same street artist, the friends find their connection tested for the first time.",
    "2014_633": "After the death of the Prophet, a man is called to lead his small religious sect as they anxiously await the end of the world they were promised.",
    "2014_634": "Inside the Mind of Leonardo is based on the artist's private journals dating from the Italian Renaissance. With more than 6,000 pages of handwritten notes and drawings, Da Vinci's private journals are the most comprehensive documents that ...See moreInside the Mind of Leonardo is based on the artist's private journals dating from the Italian Renaissance. With more than 6,000 pages of handwritten notes and drawings, Da Vinci's private journals are the most comprehensive documents that chronicle the work of the world's most renowned inventor, philosopher, painter and genius. Never before has access been granted to capture these works in 3D HD format. Using this precious collection of writings and drawings to recount Da Vinci's story in his own words, the film re-creates the mindscape and ideas of mankind's greatest polymath. In a powerful and haunting performance, actor Peter Capaldi portrays Leonardo, dramatically narrating passages and monologues from his journals. Capaldi captures the passion of Leonardo's genius, his understanding of the workings of the natural world, his insights on art and life and his inner fears and torments.  Written by ProductionSee less",
    "2014_635": "An embittered law student commits a brutal double murder; a family man takes the fall and is forced into a harsh prison sentence; a mother and her two children wander the countryside looking for some kind of redemption.",
    "2014_636": "A father driven into desire, a son coveting that of his father's, and the sorrowful maternity that hovers them into tragedy.",
    "2014_637": "The crown jewel to ten years of Bruce Brown surfing documentaries. Brown follows two young surfers around the world in search of the perfect wave, and ends up finding quite a few in addition to some colorful local characters.",
    "2014_638": "At the lowest point of his life, Richie gets a call from his estranged sister, asking him to look after his eleven-year old niece, Sophia, for a few hours.",
    "2014_639": "A man's personal exploration of the complex and nuanced world of Kabbalah.",
    "2014_64": "New York police officer Ralph Sarchie investigates a series of crimes. He joins forces with an unconventional priest, schooled in the rites of exorcism, to combat the possessions that are terrorizing their city.",
    "2014_640": "Pomme and Pierre have been together a long time. Passion and spontaneity have given way to predictability and cold shoulders. On a hike together one afternoon, Pomme declares her independence by deciding to stay in the woods rather than ...See morePomme and Pierre have been together a long time. Passion and spontaneity have given way to predictability and cold shoulders. On a hike together one afternoon, Pomme declares her independence by deciding to stay in the woods rather than return to an underwhelming life with Pierre. Pierre tries to get back to normal, despite his worry over her whereabouts and the indelible sense that he's missing his better half. Meanwhile, Pomme begins an extended meditation in the forest on where her own life should go next, with or without Pierre. In the end, both are left to contemplate the strength and meaning of each other's commitment.See less",
    "2014_641": "June 1988...Summer Was Never The Same. In the House of Flies tells the story of young lovers whose lives are inadvertently changed forever. An innocent couple, Heather (Lindsay Smith) and Steve (Ryan Kotack) suddenly find themselves ...See moreJune 1988...Summer Was Never The Same. In the House of Flies tells the story of young lovers whose lives are inadvertently changed forever. An innocent couple, Heather (Lindsay Smith) and Steve (Ryan Kotack) suddenly find themselves abducted. By whom? For what purpose? Alone, isolated and locked in an undisclosed, suburban basement, Heather and Steve find themselves pawns in a psychological, mind-game with their diabolical hosts. Surrounded by several mysterious and locked suitcases - each containing valuable clues to their very own survival - Heather and Steve must exploit what remains of their bruised intellect and depleting sanity, to escape the authority of their unidentified and brutal abductors (Henry Rollins, Ryan Barrett). From this day forward, summer was never the same.  Written by Christian BurgessSee less",
    "2014_642": "Berkeley record store clerk Nick Brady (Jonathan Scarfe) begins to experience strange visions from an entity he calls VALIS that cause him to uproot his family and move to Los Angeles where he becomes a successful music company executive. ...See moreBerkeley record store clerk Nick Brady (Jonathan Scarfe) begins to experience strange visions from an entity he calls VALIS that cause him to uproot his family and move to Los Angeles where he becomes a successful music company executive. With the help of best friend, science fiction writer Philip K. Dick himself (Shea Whigam) and a mysterious woman named Silvia (Alanis Morissette), Nick finds himself drawn into a dangerous political-mystical conspiracy of cosmic proportions. The story is set in an alternate reality America circa 1985 under the authoritarian control of President Fremont, a Nixon-like clone (Scott Wilson).  Written by Radio Free LLCSee less",
    "2014_643": "Two eccentric scientists struggle to create eternal youth in a world they call \"blind to the tragedy of old age.\" As they battle their own aging and suffer the losses of loved ones, their scientific journeys ultimately become personal.",
    "2014_644": "A news team trails a man as he travels into the world of Eden Parish to find his missing sister, where it becomes apparent that this paradise may not be as it seems.",
    "2014_645": "A Sadhu who renounced the society, adopts a baby renounced by society.",
    "2014_646": "Hypnotist Dr. Caligari uses a somnambulist, Cesare, to commit murders.",
    "2014_647": "Mark Fisher disappeared from his home in a brilliant flash of blue light almost 2 years ago. His friend Seth Hampton was the last to see him alive. Now a string of grisly, violent murders leads Seth to believe that Mark is back, and ...See moreMark Fisher disappeared from his home in a brilliant flash of blue light almost 2 years ago. His friend Seth Hampton was the last to see him alive. Now a string of grisly, violent murders leads Seth to believe that Mark is back, and something evil is inside of him.  Written by ProductionSee less",
    "2014_648": "When a failed baseball player's ex-girlfriend moves back to the neighborhood with her seven-year-old daughter, he realizes he carries more regrets than how he handled his baseball career.",
    "2014_649": "On the desolated coast of Veracruz, Mexico, 17-year-old Sebastián takes over running his uncle's small & cozy rent-by-the-hour motel. There all by himself much of the time, he meets Miranda, a regular customer who comes to the motel to ...See moreOn the desolated coast of Veracruz, Mexico, 17-year-old Sebastián takes over running his uncle's small & cozy rent-by-the-hour motel. There all by himself much of the time, he meets Miranda, a regular customer who comes to the motel to meet a lover who always keeps her waiting. There together with time to kill, Sebastián and Miranda begin to get to know each other, and an ambiguous game of seduction begins between them.  Written by Strand ReleasingSee less",
    "2014_65": "Three groups of people intertwine and are left stranded in the streets on Purge Night, trying to survive the chaos and violence that occurs.",
    "2014_650": "Singapore, February 1942. An Australian fighter pilot is shot down over the jungle and must find his way back to Allied lines, through Japanese-held territory.",
    "2014_651": "A documentary that examines the films made by the victims of the Hollywood Blacklist and offers a radically difference perspective on a key period in the history of American cinema.",
    "2014_652": "Todd Lucas is a naive songwriter from the Midwest. BJ Fairchild is a brash saxophonist from The Valley. Alone, they are pathetic losers. Together, they form the most mediocre R&B duo of the 1980s - Eternity.",
    "2014_653": "Gringo Trails raises urgent questions about one of the most powerful global industries of our time: tourism. With stunning footage from Bolivia, Thailand, Mali, and Bhutan, the film follows the well-worn 'gringo trail' travel route in ...See moreGringo Trails raises urgent questions about one of the most powerful global industries of our time: tourism. With stunning footage from Bolivia, Thailand, Mali, and Bhutan, the film follows the well-worn 'gringo trail' travel route in Latin America and beyond, revealing a complex web of relationships between cultures that collide yet need one another: host countries looking for financial security and the tourists who provide it in their quest for authentic experiences. Travelers, transformed by new landscapes and beliefs, also have unforeseeable--sometimes catastrophic effects on the places they visit. Through the life-changing stories of travelers and locals, Gringo Trails explores the dramatic impact of tourism around the world over the past three decades and gives examples of sustainable alternatives.  Written by AnonymousSee less",
    "2014_654": "Sasha and Paige's co-dependent friendship is tested as Paige gets serious with a guy for the first time.",
    "2014_655": "Examining life at life's end is the poignant subtext of 'Next Year in Jerusalem,' a poetic journey at once metaphorical and literal. Eight nursing home residents are given one last great adventure, a trip to Israel. The film documents the ...See moreExamining life at life's end is the poignant subtext of 'Next Year in Jerusalem,' a poetic journey at once metaphorical and literal. Eight nursing home residents are given one last great adventure, a trip to Israel. The film documents the intricate planning through the journey itself: a physical and emotional challenge and ultimately, a transformational life experience.  Written by AnonymousSee less",
    "2014_656": "Deep fractures within a family dynamic begin to surface during a getaway to the Isles of Scilly.",
    "2014_657": "Sarah and Josh are married suburbanites. After a car accident, Sarah suffers blackouts. As her life spirals she hides a camera in her home and unlocks a horrific secret with far-reaching consequences.",
    "2014_658": "Set in the future when water is hard to find, a teenage boy sets out to protect his family and survive.",
    "2014_659": "One day, a bad fall forces Edmond to accept Rose's help. Eventually, the two grow closer. The young woman finds relief in confiding painful memories to the older man; things she cannot even bring herself to tell her husband. Meanwhile, ...See moreOne day, a bad fall forces Edmond to accept Rose's help. Eventually, the two grow closer. The young woman finds relief in confiding painful memories to the older man; things she cannot even bring herself to tell her husband. Meanwhile, Edmond, too, opens up, sharing recollections of his beloved wife.  Written by Palm Springs Internation Film FestivalSee less",
    "2014_66": "A young orphaned boy raised by underground cave-dwelling trash collectors tries to save his friends from an evil exterminator.",
    "2014_660": "Raze, a horror/action film, focuses on two abducted women & 50 other women who are forced to fight each other using their bare hands.",
    "2014_661": "Unprecedented access to Muhammad Ali's personal archive of \"audio journals\" as well as interviews and testimonials from his inner circle of family and friends are used to tell the legend's life story.",
    "2014_662": "Returning home from a business trip to discover his wife missing, a man delves deeper and deeper into a surreal kaleidoscope of half-baked leads, seduction, deceit, and murder. Does anyone in the building know something?",
    "2014_663": "Another 26-chapter anthology that showcases death in all its vicious wonder and brutal beauty. Read more: Synopsis",
    "2014_664": "A snobby musical theater camp is terrorized by a blood-thirsty killer who hates musical theater. Read more: Synopsis",
    "2014_665": "When a series of package bombs show up on the doorsteps of prominent politicians and businessmen in the summer of 1919, U.S. Bureau of Investigation Agent William Flynn (Strathairn) is assigned the task of finding those responsible. He ...See moreWhen a series of package bombs show up on the doorsteps of prominent politicians and businessmen in the summer of 1919, U.S. Bureau of Investigation Agent William Flynn (Strathairn) is assigned the task of finding those responsible. He becomes immersed in an investigation that uncovers an anarchist plot to destroy democracy. Inspired by true events of the 20s the film sets the stage for a timely thriller with resoundingly similar parallels to the contemporary war on terrorism and the role government plays to defeat it.  Written by monterey media inc.See less",
    "2014_666": "Three gay seniors navigate the adventures, challenges and surprises of life and love in their golden years. Read more: Synopsis",
    "2014_667": "One year in the life of a family of reindeer herders in Finnish Lapland. A study of hard work, hard earned leisure, and an intricate bond between man and nature.",
    "2014_668": "A documentary that captures fragments of the lives of the Egyptian Jewish community in the first half of the twentieth century until their second grand exodus after the tripartite attack of 1956. An attempt to understand the change in the ...See moreA documentary that captures fragments of the lives of the Egyptian Jewish community in the first half of the twentieth century until their second grand exodus after the tripartite attack of 1956. An attempt to understand the change in the identity of the Egyptian society that turned from a society full of tolerance and acceptance of one another to a rejection of the minorities. How did the Jews of Egypt turn in the eyes of Egyptians from partners in the same country to enemies?  Written by Amir RamsesSee less",
    "2014_669": "Khosrow and Morteza set out on a mission to kill someone. The assassination ought to be arranged as a suicide. At the last minute however, they are obliged to change their initial plans...",
    "2014_67": "Dale, Kurt and Nick decide to start their own business but things don't go as planned because of a slick investor, prompting the trio to pull off a harebrained and misguided kidnapping scheme.",
    "2014_670": "When brokenhearted Stan flies to Austin for the weekend in hopes of \"accidentally\" running into his ex-girlfriend Cathy, he arrives to find their best friends Jeff and Kara in the middle of their own vicious breakup. Before too long, ...See moreWhen brokenhearted Stan flies to Austin for the weekend in hopes of \"accidentally\" running into his ex-girlfriend Cathy, he arrives to find their best friends Jeff and Kara in the middle of their own vicious breakup. Before too long, battle lines are drawn - and with the Air Sex World Championships in town, anything can go down.  Written by Tribeca FilmSee less",
    "2014_671": "Four men share an ex factory loft in LA. Dean is a romantic wannabe screenwriter. The others are cavemen preoccupied with getting laid. Tess is their platonic friend.",
    "2014_672": "A story about a group of ghosts who have lost their shelter due to urbanization. The story starts with a struggling wannabe director who somehow crosses paths with a stranger. The stranger starts to narrate a story to him about a group of ...See moreA story about a group of ghosts who have lost their shelter due to urbanization. The story starts with a struggling wannabe director who somehow crosses paths with a stranger. The stranger starts to narrate a story to him about a group of ghosts that stays together. The story that the stranger narrates shows the communal, social, linguistic and historical differences among the ghosts, as they belong to different eras. But very soon these ghosts face an issue protecting their haunt from the hands of demolition.  Written by Bodhisatya ChatterjeeSee less",
    "2014_673": "In 2011, two brothers documented their murder spree in North Carolina. This is the actual assembled footage.",
    "2014_674": "Masterfully edited from nearly 200 hours of footage, PAPIROSEN represents a decade of filmmaking, and four generations of Argentine director Gastón Solnicki's family history, culled from 8mm home videos, a VHS bar mitzvah, and original ...See moreMasterfully edited from nearly 200 hours of footage, PAPIROSEN represents a decade of filmmaking, and four generations of Argentine director Gastón Solnicki's family history, culled from 8mm home videos, a VHS bar mitzvah, and original observational material. His father, Victor, emerges as the lead figure, but Solnicki highlights the entire clan. Beginning with the birth of his nephew, Mateo, and punctuated throughout by interviews with his grandmother, Pola, a Holocaust survivor, the film's scope is simultaneously epic and intimate. PAPIROSEN is a meditation on family, history, the importance of storytelling, and the power of cinema itself. OFFICIAL SELECTION - New York Jewish Film Festival  Written by AnonymousSee less",
    "2014_675": "An eighteen year old high school drop out and his twenty-seven year old friend start trafficking marijuana across the border of Canada in order to make money and their lives are changed forever. Read more: Synopsis",
    "2014_676": "\"Flexing\" is a dance style forged in far east Brooklyn, at the dead-end of a handful of subway lines. Flex dancers channel the grittiness and crime of East New York into choreographed violence with gun movements, simulated bone-breaking, ...See more\"Flexing\" is a dance style forged in far east Brooklyn, at the dead-end of a handful of subway lines. Flex dancers channel the grittiness and crime of East New York into choreographed violence with gun movements, simulated bone-breaking, and the mimicked ripping of hearts from opponent's chests. Through battles dancers gain respect, craft an artistic identity, and sometimes find a sanctuary from the poverty and violence that saturates their neighborhood. No other style of street-dance is this violent, scary, or beautifully theatrical. In this purely do-it-yourself scene, creativity and ambition bring a community together around frequent dance-battle showcases that have begun to attract an international audience and may catapult the best dancers into careers in theater or film. Following a group of dancers for over two years, Flex is Kings explores the hopes and realities of this under-acknowledged and totally unfunded group of urban artists.  Written by Flex Is KingsSee less",
    "2014_677": "Manipur, a volatile border state in northeast India, defies gun violence, trafficking and HIV/AIDS through love of America's National Pastime - or as Babe Ruth called it \"the only real game in the world.\"",
    "2014_678": "A psychopathic Japanese executive accidentally triggers a journalist's 'dark side'. They begin to connect over the Internet and make a complicated bond.",
    "2014_679": "When the other students begin to undergo mutations, a lesbian couple must solve the mystery and save Tromaville High School.",
    "2014_68": "A professional \"Breakup Guru\" is hired by a client to end a relationship.",
    "2014_680": "A young couple, Kaia and Andrew, are renovating Kaia's secluded family estate. Their lives are violently disrupted upon the unexpected arrival of Kaia's sister, Christine, and her fiance, Ira.",
    "2014_681": "Jill's an artist. Adam's a filmmaker. And their love life is off the chain. There's no experience too wild, no dare too dangerous -- not even when Jill lets Adam strap her to a gurney in the abandoned hospital they're scoping out for their...See moreJill's an artist. Adam's a filmmaker. And their love life is off the chain. There's no experience too wild, no dare too dangerous -- not even when Jill lets Adam strap her to a gurney in the abandoned hospital they're scoping out for their next art show. But he shouldn't have left her alone. Not even as a joke. Now, Jill's hookup with horror has awakened something in that place. Something with a lust for more than flesh.  Written by ProductionSee less",
    "2014_682": "The young Tore seeks in Hamburg a new life among the religious group called The Jesus Freaks. When he by accident meets a family and helps them to repair their car, he believes that a heavenly wonder has helped him. He starts a friendship ...See moreThe young Tore seeks in Hamburg a new life among the religious group called The Jesus Freaks. When he by accident meets a family and helps them to repair their car, he believes that a heavenly wonder has helped him. He starts a friendship with the father of the family, Benno. Soon he moves in with them at their garden plot, not knowing what cruelty is there to come. True to his religious belief he stays with them although the increasing violence by Benno is torturing him. Tore is fighting the torment with his own weapons. So a dangerous struggle between libidinous actions and altruism begins. Inspired by true events.  Written by Katrin GebbeSee less",
    "2014_683": "HALF THE ROAD is a documentary film that explores the world of women's professional cycling, focusing on both the love of sport and the pressing issues of inequity that modern-day female riders face in a male-dominated sport. With footage ...See moreHALF THE ROAD is a documentary film that explores the world of women's professional cycling, focusing on both the love of sport and the pressing issues of inequity that modern-day female riders face in a male-dominated sport. With footage from some of the world's best races to interviews with Olympians, world champs, rookies, coaches, managers, officials, doctors and even the U.S. Surgeon General, HALF THE ROAD offers a unique insight into the drive, dedication and passion it takes for a female cyclist to thrive despite oppression. Both on and off the bike, the voices and advocates of women's pro cycling take the audience on a journey of enlightenment, depth, strength, love, humor and best of all, change and growth.  Written by AnonymousSee less",
    "2014_684": "DEATH METAL ANGOLA follows a loving Angolan couple, Sonia and Wilker, whose love for death metal music is bringing hope to the town and children of Huambo, and Angola as a country. The devastating reality of Angola's history of wars, and ...See moreDEATH METAL ANGOLA follows a loving Angolan couple, Sonia and Wilker, whose love for death metal music is bringing hope to the town and children of Huambo, and Angola as a country. The devastating reality of Angola's history of wars, and civil unrest has left the country's people torn, broken, and starving for something to give them peace. Sonia, and Wilker's dream to put on the first national rock festival ignites the emotions of the Angolan people, and helps them heal from the war stricken path Angola has left behind. This engaging reality of Angola touches the heart of the viewer, and sheds new light on a music genre that is not well understood.  Written by The Vladar CompanySee less",
    "2014_685": "'Smiling Through the Apocalypse' chronicles a man whose editorial instincts produced one of the greatest magazines ever: Harold Hayes, the swinging editor and cultural provocateur of the iconic Esquire Magazine of the Sixties. Through the ...See more'Smiling Through the Apocalypse' chronicles a man whose editorial instincts produced one of the greatest magazines ever: Harold Hayes, the swinging editor and cultural provocateur of the iconic Esquire Magazine of the Sixties. Through the narrative of his son Tom, a journey ensues opening unprecedented access to some of the Esquire magazine's most compelling talents, from Nora Ephron to George Lois, and Tom Wolfe to Gore Vidal. The film is a story of risk, triumph, and challenge told by the people that helped make the magazine great, and a son who only come to understand his father's editorial greatness 23 years after his passing.  Written by AnonymousSee less",
    "2014_686": "A woman in an unhappy relationship takes refuge with a friend's family on holiday in Tuscany.",
    "2014_687": "A troubled girl becomes preoccupied with her mysterious new neighbor, who bears a striking resemblance to her dead mother.",
    "2014_688": "A look at Communist East Germany in its final decade. The story unfolds in 1982, when the cracks in the repressive police state's facade are beginning to surface. Despite the restrictions, the educated few still enjoy some advantages under...See moreA look at Communist East Germany in its final decade. The story unfolds in 1982, when the cracks in the repressive police state's facade are beginning to surface. Despite the restrictions, the educated few still enjoy some advantages under the system. The Hoffmans gather often with family and friends for warm dinner parties rich with derisive political banter, live classical music, and spirited discussions, holding out for a better future. But even as Richard has high hopes and strict demands for studious Christian, he hides a passionate double life and shocking secrets that come back to haunt him. Against this tense climate of fear and mistrust, with the secret police lurking ominously in the background, choices are made and actions taken that have devastating repercussions.  Written by Music Box FilmsSee less",
    "2014_689": "A group of women launch a movement to remove the censor of women's breasts all over America.",
    "2014_69": "A group of friends must confront their most terrifying fears when they awaken the dark powers of an ancient spirit board.",
    "2014_690": "A look at the 2013 and 2014 civil unrest in the Ukrainian capital's central square.",
    "2014_691": "Home for Thanksgiving break after their first semester at college, five friends discover just how much things change (and don't) after high school.",
    "2014_692": "A man's otherwise perfect life is destroyed when his son is kidnapped and murdered. He finds himself torn between avenging his son's death and moving on with his now hollow existence.",
    "2014_693": "Sara, a girl being home-schooled on a goat farm alongside her 11 siblings, finds her devout values challenged after she meets Colby, an amateur bull rider.",
    "2014_694": "After a neighborhood tragedy, two adolescent brothers confront changing relationships, the mystery of nature, and their own mortality.",
    "2014_695": "Tens years after robbing a Bank of America, filmmaker Darius Monroe returns home to examine how his actions affected the lives of family, friends...and victims.",
    "2014_696": "Skip delves into the mysteries of an old locker. His sage supervisor recounts chilling tales that underscore the importance of making the right choice. The stories come into play when Skip faces a life-or-death decision of his own.",
    "2014_697": "Ripped from international headlines, The Hacker Wars takes you to the front lines of the high-stakes battle over the fate of the Internet, freedom and privacy.",
    "2014_698": "A dark comedy about one man's overreaction! Roma's (Anthony Michael Hall) perfect life unravels when his foreman goes missing and he chooses to fire the wrong guy.",
    "2014_699": "Tells the story of a family as they search for a lost fortune around the streets of Dublin.",
    "2014_7": "As Steve Rogers struggles to embrace his role in the modern world, he teams up with a fellow Avenger and S.H.I.E.L.D agent, Black Widow, to battle a new threat from history: an assassin known as the Winter Soldier.",
    "2014_70": "A washed-up superhero actor attempts to revive his fading career by writing, directing, and starring in a Broadway production.",
    "2014_700": "A struggling musician falls for a charismatic burlesque dancer while getting entangled with hired guns and a border town gang bent on killing him.",
    "2014_701": "A chance encounter with a mysterious young woman leads a documentary filmmaker down a very different road than he intended as he works on his latest project.",
    "2014_702": "A documentary that explores the world of U.S. television showrunners and the creative forces aligned around them.",
    "2014_703": "Joaquim Pinto, who has been living with HIV for more than two decades, looks back at his life in cinema, at his friendships and loves, at the mysteries of art and nature - while undergoing an experimental drug treatment.",
    "2014_704": "A married construction worker leads a double life as a male prostitute serving rich ladies.",
    "2014_705": "Haitian born filmmaker Raoul Peck takes us on a 2-year journey inside the challenging, contradictory and colossal rebuilding efforts in post-earthquake Haiti.",
    "2014_706": "After ruthless gangsters wrongfully accuse him of stealing from them, a retired criminal has 24 hours to creep back into his past life and retrieve a bag of coke before his fiancee is killed.",
    "2014_707": "After their parents abandon the family, a young woman works to take care of her younger siblings.",
    "2014_708": "A mysterious girl pursues a young man in her new small town home. Coinciding deaths and a disappearance create a common thread between them as they struggle with young love and loss over the course of one summer.See moreA mysterious girl pursues a young man in her new small town home. Coinciding deaths and a disappearance create a common thread between them as they struggle with young love and loss over the course of one summer.  Written by Eric ChaneySee less",
    "2014_709": "A filmmaker sets out to make a new project in order to figure out how he's screwed up every relationship he's ever had.",
    "2014_71": "A scientist's drive for artificial intelligence takes on dangerous implications when his own consciousness is uploaded into one such program.",
    "2014_710": "Set over the course of one day, a narcotics detective hunts for a seemingly harmless young criminal who knows a truth about the cop's past.",
    "2014_711": "Suspension from school, the loss of a friend, a broken heart and lack of inspiration lead to Maude's downfall in this romp through teenage error.",
    "2014_712": "Two sisters decide to keep their deceased mother in their home after being informed that she will come back to life.",
    "2014_713": "A documentary on how Washington State legalized recreational marijuana and the effects of this decision on the state, the nation and the world.",
    "2014_714": "Katherine is a struggling mother trying to create a better life for her and her son. She meets Elder Brock, a handsome Mormon missionary with a troubled past and they begin an incendiary love affair. But when Katherine reunites with her ...See moreKatherine is a struggling mother trying to create a better life for her and her son. She meets Elder Brock, a handsome Mormon missionary with a troubled past and they begin an incendiary love affair. But when Katherine reunites with her estranged husband, Elder Brock can't accept that things are over - and he will stop at nothing to prove to her that they are meant to be together forever!  Written by Bruce WoodSee less",
    "2014_715": "In India, a group of boys dream of becoming Chess Masters, driven by a man with a vision. But this is no ordinary chess and these are no ordinary players. Algorithms is a documentary on the thriving but little known world of Blind Chess in...See moreIn India, a group of boys dream of becoming Chess Masters, driven by a man with a vision. But this is no ordinary chess and these are no ordinary players. Algorithms is a documentary on the thriving but little known world of Blind Chess in India. Filmed over three years, it follows three talented boys from different parts of India and a totally blind player turned pioneer who not only aims to situate India on a global stage but also wants all blind children to play chess. Algorithms travels with the chess players to competitive tournaments and visits them in their home milieu where they reveal their struggles, anxieties and hopes.  Written by AnonymousSee less",
    "2014_716": "As it chronicles the life and times of street photographer and former cabbie Matt Weber, More Than The Rainbow becomes a vibrant conversation about the photographic medium, artistic expression and NYC. Set to wonderful jazz and drenched in...See moreAs it chronicles the life and times of street photographer and former cabbie Matt Weber, More Than The Rainbow becomes a vibrant conversation about the photographic medium, artistic expression and NYC. Set to wonderful jazz and drenched in evocative images, the film is bittersweet and nostalgic from beginning to end.  Written by More Than the RainbowSee less",
    "2014_717": "Red Crow Mi'kmaq reservation, 1976: By government decree, every Indian child under the age of 16 must attend residential school. In the kingdom of the Crow, that means imprisonment at St. Dymphna's. That means being at the mercy of \"Popper...See moreRed Crow Mi'kmaq reservation, 1976: By government decree, every Indian child under the age of 16 must attend residential school. In the kingdom of the Crow, that means imprisonment at St. Dymphna's. That means being at the mercy of \"Popper\", the sadistic Indian agent who runs the school.See less",
    "2014_718": "A documentary that takes a look at the rising numbers of homeless veterans and the reason why they seem to fall through the cracks after serving the wealthiest nation on earth.",
    "2014_719": "A documentary that tells the stories of ordinary individuals who are transformed by the critical moral and personal challenges they encounter when standing up for what they believe is right.See moreA documentary that tells the stories of ordinary individuals who are transformed by the critical moral and personal challenges they encounter when standing up for what they believe is right.  Written by AnonymousSee less",
    "2014_72": "A small-town father must find the courage and conviction to share his son's extraordinary, life-changing experience with the world.",
    "2014_720": "A reclusive and butterfly-obsessed elderly lady suffering from bipolar disorder develops a disturbing relationship with a mysterious but seemingly innocent youngster.",
    "2014_721": "The Roma (Gypsies) faced annihilation during the Nazi 'Final Solution,' yet have been relegated to a footnote in history. Today, the Roma are victims of extreme and often violent racial persecution. A People Uncounted is a powerful journey...See moreThe Roma (Gypsies) faced annihilation during the Nazi 'Final Solution,' yet have been relegated to a footnote in history. Today, the Roma are victims of extreme and often violent racial persecution. A People Uncounted is a powerful journey exposing the tragedy of Europe's largest minority group.  Written by AnonymousSee less",
    "2014_722": "Terrified and bloody, Oscar Svendsen awakes clinched to a shotgun in a strippers joint. Around him 8 dead men, and police aiming at him. To Oscar it's clear that he is innocent. It all started when four chaps won 1,7 million on the pools...",
    "2014_723": "A brilliant medical researcher in his prime is stricken with cancer. Dr. Pete Peele formulates a potential yet unconventional cure for his illness but the clock is running out. He fears that he'll die before clinical trials prove the ...See moreA brilliant medical researcher in his prime is stricken with cancer. Dr. Pete Peele formulates a potential yet unconventional cure for his illness but the clock is running out. He fears that he'll die before clinical trials prove the efficacy of the treatment so he decides to make himself a human guinea pig. He feels he has nothing to lose. Unfortunately the cure he hoped for yields unspeakable results. His terrifying transformation drives him to madness and wreaks bloody havoc on those closest to him.See less",
    "2014_724": "As a young woman prepares a memorial film retrospective for her late estranged father, his work begins to influence her life in strange and significant ways.",
    "2014_725": "In the sequel to DADDY, I'M A ZOMBIE, the fate of the planet is again in Dixie's hands as she fights to end a battle between the living and the dead, while also balancing her popularity and campaigning for student council.",
    "2014_73": "Alexander's day begins with gum stuck in his hair, followed by more calamities. However, he finds little sympathy from his family and begins to wonder if bad things only happen to him, his mom, dad, brother and sister - who all find ...See moreAlexander's day begins with gum stuck in his hair, followed by more calamities. However, he finds little sympathy from his family and begins to wonder if bad things only happen to him, his mom, dad, brother and sister - who all find themselves living through their own terrible, horrible, no good, very bad day.See less",
    "2014_74": "After getting fired and finding out her husband is cheating, Tammy hits the road with her profane, alcoholic grandmother.",
    "2014_75": "An alien on Earth loses the only device he can use to communicate with his spaceship. His innocent nature and child-like questions force the country to evaluate the impact of religion on its people.",
    "2014_76": "Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart, embarks on an adventure that spans three fantastic worlds where he must face his greatest fears.",
    "2014_77": "Amid the time of Korean War, a young boy's vow to take care of his family marked the beginning of a lifelong promise spanning 60 years.",
    "2014_78": "A drama about a group of school friends growing up in the 1990s and 2000s.",
    "2014_79": "When a young man becomes the target of a malevolent entity, he must uncover its true intentions before it takes complete control of him.",
    "2014_8": "A growing nation of genetically evolved apes led by Caesar is threatened by a band of human survivors of the devastating virus unleashed a decade earlier.",
    "2014_80": "The Kadam family leaves India for France where they open a restaurant directly across the road from Madame Mallory's Michelin-starred eatery.",
    "2014_81": "As a cowardly farmer begins to fall for the mysterious new woman in town, he must put his newly found courage to the test when her husband, a notorious gun-slinger, announces his arrival.",
    "2014_82": "All-stars from the previous Step Up installments come together in glittering Las Vegas, battling for a victory that could define their dreams and their careers.",
    "2014_83": "An ex-hit-man comes out of retirement to track down the gangsters that killed his dog and took everything from him.",
    "2014_84": "Big-city lawyer Hank Palmer returns to his childhood home where his father, the town's judge, is suspected of murder. Hank sets out to discover the truth and, along the way, reconnects with his estranged family.",
    "2014_85": "While on a grand world tour, The Muppets find themselves wrapped into an European jewel-heist caper headed by a Kermit the Frog look-alike and his dastardly sidekick.",
    "2014_86": "Life changes in an instant for young Mia Hall after a car accident puts her in a coma. During an out-of-body experience, she must decide whether to wake up and live a life far different than she had imagined. The choice is hers if she can go on.",
    "2014_87": "Frankenstein's creature finds himself caught in an all-out, centuries old war between two immortal clans.",
    "2014_88": "In the aftermath of a family tragedy, an aspiring author is torn between love for her childhood friend and the temptation of a mysterious outsider. Trying to escape the ghosts of her past, she is swept away to a house that breathes, bleeds...See moreIn the aftermath of a family tragedy, an aspiring author is torn between love for her childhood friend and the temptation of a mysterious outsider. Trying to escape the ghosts of her past, she is swept away to a house that breathes, bleeds - and remembers.See less",
    "2014_89": "An undercover Detroit cop navigates a dangerous neighborhood that's surrounded by a containment wall with the help of an ex-con in order to bring down a crime lord and his plot to devastate the entire city.",
    "2014_9": "When New York is put under siege by Oscorp, it is up to Spider-Man to save the city he swore to protect as well as his loved ones.",
    "2014_90": "The life story of Jesus is told from his humble birth through his teachings, crucifixion and ultimate resurrection. Read more: Synopsis",
    "2014_91": "All the couples are back for a wedding in Las Vegas, but plans for a romantic weekend go awry when their various misadventures get them into some compromising situations that threaten to derail the big event.",
    "2014_92": "The story of four young men from the wrong side of the tracks in New Jersey who came together to form the iconic 1960s rock group The Four Seasons.",
    "2014_93": "In a seemingly perfect community, without war, pain, suffering, differences or choice, a young boy is chosen to learn from an elderly man about the true pain and pleasure of the \"real\" world.",
    "2014_94": "A chronicle of Dr. Martin Luther King, Jr.'s campaign to secure equal voting rights via an epic march from Selma to Montgomery, Alabama, in 1965.",
    "2014_95": "Different generations look at love, romance and commitment, all from a uniquely Beijing perspective; a pregnant woman must choose between her husband and an ex-love who comes back into her life, a couple looks toward a trip to Greece to ...See moreDifferent generations look at love, romance and commitment, all from a uniquely Beijing perspective; a pregnant woman must choose between her husband and an ex-love who comes back into her life, a couple looks toward a trip to Greece to confront their own infidelity, and a young couple must decide whether to listen to their parents' reason or their emotional heart.  Written by China Lion Film DistributionSee less",
    "2014_96": "A band of pirates and a group of bandits fight to catch a gray whale that has swallowed a royal stamp.",
    "2014_97": "College philosophy professor Mr. Radisson's curriculum is challenged by his new student, Josh, who believes God exists.",
    "2014_98": "A chance encounter between a down-and-out music-business executive and a young singer-songwriter, new to Manhattan, turns into a promising collaboration between the two talents.",
    "2014_99": "In 1974, high-wire artist Philippe Petit recruits a team of people to help him realize his dream: to walk the immense void between the World Trade Center towers."
}