{
    "2015_1": {
        "plotSummary": "As a new threat to the galaxy rises, Rey, a desert scavenger, and Finn, an ex-stormtrooper, must join Han Solo and Chewbacca to search for the one hope of restoring peace.",
        "runtimeMinutes": "138"
    },
    "2015_10": {
        "plotSummary": "An astronaut becomes stranded on Mars after his team assume him dead, and must rely on his ingenuity to find a way to signal to Earth that he is alive.",
        "runtimeMinutes": "144"
    },
    "2015_100": {
        "plotSummary": "A group of online chat room friends find themselves haunted by a mysterious, supernatural force using the account of their dead friend.",
        "runtimeMinutes": "83"
    },
    "2015_101": {
        "plotSummary": "An Irish immigrant lands in 1950s Brooklyn, where she quickly falls into a romance with a local. When her past catches up with her, however, she must choose between two countries and the lives that exist within.",
        "runtimeMinutes": "117"
    },
    "2015_102": {
        "plotSummary": "One peaceful day on Earth, two remnants of Freeza's army named Sorube and Tagoma arrive searching for the Dragon Balls with the aim of reviving Freeza. They succeed, and Freeza subsequently seeks revenge on the Saiya-jin.",
        "runtimeMinutes": "93"
    },
    "2015_103": {
        "plotSummary": "Maria Altmann, an octogenarian Jewish refugee, takes on the Austrian government to recover artwork she believes rightfully belongs to her family.",
        "runtimeMinutes": "109"
    },
    "2015_104": {
        "plotSummary": "A boy who has a bad Christmas accidentally summons a festive demon to his family home.",
        "runtimeMinutes": "98"
    },
    "2015_105": {
        "plotSummary": "After breaking up with her boyfriend, a professional woman gets involved with a man who seems almost too good to be true.",
        "runtimeMinutes": "100"
    },
    "2015_106": {
        "plotSummary": "The lead singer in a school band decided to turn his team into a group of ballet dancers in honor of their fellow classmates who passed away in a tragic accident.",
        "runtimeMinutes": "107"
    },
    "2015_107": {
        "plotSummary": "A 70-year old woman living unhappily with her son's family is magically restored to her beauty of 50 years earlier. Complications ensue.",
        "runtimeMinutes": "131"
    },
    "2015_108": {
        "plotSummary": "A young married couple's lives are thrown into a harrowing tailspin when an acquaintance from the husband's past brings mysterious gifts and a horrifying secret to light after more than 20 years.",
        "runtimeMinutes": "108"
    },
    "2015_109": {
        "plotSummary": "In their new overseas house, an American family soon finds themselves caught in the middle of a coup, and they frantically look for a safe escape from an environment where foreigners are being immediately executed.",
        "runtimeMinutes": "103"
    },
    "2015_11": {
        "plotSummary": "Literature student Anastasia Steele's life changes forever when she meets handsome, yet tormented, billionaire Christian Grey.",
        "runtimeMinutes": "125"
    },
    "2015_110": {
        "plotSummary": "A young mother and her twin sons move into a rural house that's marked for death.",
        "runtimeMinutes": "97"
    },
    "2015_111": {
        "plotSummary": "While recovering from an assassination attempt four days before his coronation, a stern prince is replaced by a romantic lookalike.",
        "runtimeMinutes": "164"
    },
    "2015_112": {
        "plotSummary": "A woman, separated from her unfaithful husband, falls for a younger man who has moved in next door, but their torrid affair soon takes a dangerous turn.",
        "runtimeMinutes": "91"
    },
    "2015_113": {
        "plotSummary": "On Christmas Eve, three lifelong friends spend the night in New York City looking for the Holy Grail of Christmas parties.",
        "runtimeMinutes": "101"
    },
    "2015_114": {
        "plotSummary": "When the evil Yo-Kai Kin, Gin, and Do steal the Yo-Kai Watch from Keita one night so they can help their master Tokio Ubaune prevent humans and Yo-Kai from being friends, Keita finds help in the Yo-Kai Fuyunyan, who takes Keita, Whisper, ...See moreWhen the evil Yo-Kai Kin, Gin, and Do steal the Yo-Kai Watch from Keita one night so they can help their master Tokio Ubaune prevent humans and Yo-Kai from being friends, Keita finds help in the Yo-Kai Fuyunyan, who takes Keita, Whisper, and Jibanyan back in time 60 years to when the Yo-Kai Watch was first invented by Keita's own grandfather Keizo while he was a boy. Together, the two boys fight Tokio Ubaune and her evil Kaima Yo-Kai minions to save the world from her evil plans.See less",
        "runtimeMinutes": "97"
    },
    "2015_115": {
        "plotSummary": "An uptight and by-the-book cop tries to protect the outgoing widow of a drug boss as they race through Texas pursued by crooked cops and murderous gunmen.",
        "runtimeMinutes": "87"
    },
    "2015_116": {
        "plotSummary": "Based on true events, renowned mountaineer UM Hong-gil sets out on a mission to Everest to retrieve his late junior climber's body and faces the greatest challenge of his life.",
        "runtimeMinutes": "124"
    },
    "2015_117": {
        "plotSummary": "When a young orphaned boy living on the streets of Shibuya stumbles upon a fantastic world of beasts, he's taken in by a gruff warrior beast looking for an apprentice.",
        "runtimeMinutes": "119"
    },
    "2015_118": {
        "plotSummary": "Surprise follows the day-to-day misadventures of a character called Dachui Wang as he navigates though various modern and classic situations. The little monster Wang Dachui, who was born with sharp ears & simple magic, made him different ...See moreSurprise follows the day-to-day misadventures of a character called Dachui Wang as he navigates though various modern and classic situations. The little monster Wang Dachui, who was born with sharp ears & simple magic, made him different from the ordinaries. The local monster king, he thought he was. But to his surprise, on the one hand, his fate has changed since the encounter with Tang Monk, Monkey King, Piggy & Sand Monk. On the other hand, the meeting with Wang Dachui also should have been the great 82nd disaster to the four.  Written by aryxus-2See less",
        "runtimeMinutes": "96"
    },
    "2015_119": {
        "plotSummary": "Movie star Vincent Chase, together with his boys Eric, Turtle, and Johnny, are back - and back in business with super agent-turned-studio head Ari Gold on a risky project that will serve as Vince's directorial debut.",
        "runtimeMinutes": "104"
    },
    "2015_12": {
        "plotSummary": "When her father unexpectedly dies, young Ella finds herself at the mercy of her cruel stepmother and her scheming stepsisters. Never one to give up hope, Ella's fortunes begin to change after meeting a dashing stranger.",
        "runtimeMinutes": "105"
    },
    "2015_120": {
        "plotSummary": "40 years after the first haunting at Eel Marsh House, a group of children evacuated from WWII London arrives, awakening the house's darkest inhabitant.",
        "runtimeMinutes": "98"
    },
    "2015_121": {
        "plotSummary": "In Pittsburgh, accomplished pathologist Dr. Bennet Omalu uncovers the truth about brain damage in football players who suffer repeated concussions in the course of normal play.",
        "runtimeMinutes": "123"
    },
    "2015_122": {
        "plotSummary": "Juggling angry Russians, the British Mi5, and an international terrorist, debonair art dealer and part-time rogue Charlie Mortdecai races to recover a stolen painting rumored to contain a code that leads to lost gold.",
        "runtimeMinutes": "107"
    },
    "2015_123": {
        "plotSummary": "Wenwen, the owner of a bridal boutique, longs to find Mr. Right and walk down the aisle in one of her beautiful wedding gowns. Yi Wen, a violinist, wavers over her engagement after meeting a mysterious man in a foreign country. Lei Xiao, ...See moreWenwen, the owner of a bridal boutique, longs to find Mr. Right and walk down the aisle in one of her beautiful wedding gowns. Yi Wen, a violinist, wavers over her engagement after meeting a mysterious man in a foreign country. Lei Xiao, an airport employee, tries to force her pilot boyfriend to marry her. And Hai Xin, a successful business woman, finds herself in a broken marriage and unexpectedly pregnant. Based on the hugely popular Chinese TV series of the same name, Let's Get Married follows the lives of four couples looking for love and to find that special someone to say \"I do.\" Stars Yuan Yuan Gao, Wu Jiang, Yi Han Chen, Kai Zheng, Bi Ting Guo, Chen Li, Tao Liu and Zi Jian Wang.See less",
        "runtimeMinutes": "127"
    },
    "2015_124": {
        "plotSummary": "A guy meets a girl and they go on an amazing adventure together.",
        "runtimeMinutes": "109"
    },
    "2015_125": {
        "plotSummary": "Jim White moves his family after losing his last job as a football coach. He sees that some of the students are worth starting a cross-country team and turns seven students with no hope into one of the best cross-country teams.",
        "runtimeMinutes": "129"
    },
    "2015_126": {
        "plotSummary": "A boy and a girl find themselves stuck in a whirlpool of such intense love that they would do anything, go to any extent and face all odds for the one they love.",
        "runtimeMinutes": "145"
    },
    "2015_127": {
        "plotSummary": "A linguistics professor and her family find their bonds tested when she is diagnosed with Alzheimer's Disease.",
        "runtimeMinutes": "101"
    },
    "2015_128": {
        "plotSummary": "A military dog that helped American Marines in Afghanistan returns to the United States and is adopted by his handler's family after suffering a traumatic experience.",
        "runtimeMinutes": "111"
    },
    "2015_129": {
        "plotSummary": "A high school senior instigates a social pecking order revolution after finding out that she has been labeled the DUFF - Designated Ugly Fat Friend - by her prettier, more popular counterparts.",
        "runtimeMinutes": "101"
    },
    "2015_13": {
        "plotSummary": "A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team.",
        "runtimeMinutes": "156"
    },
    "2015_130": {
        "plotSummary": "Identical twin gangsters Ronald and Reginald Kray terrorize London during the 1960s.",
        "runtimeMinutes": "132"
    },
    "2015_131": {
        "plotSummary": "20 years after a horrific accident during a small town school play, students at the school resurrect the failed show in a misguided attempt to honor the anniversary of the tragedy - but soon discover that some things are better left alone.",
        "runtimeMinutes": "81"
    },
    "2015_132": {
        "plotSummary": "The intertwined stories of four generations of Coopers unfold right before the annual family reunion on Christmas Eve. Can they survive the most beautiful time of the year?",
        "runtimeMinutes": "107"
    },
    "2015_133": {
        "plotSummary": "A man forms an unexpected bond with a transient woman living in her van that's parked in his driveway.",
        "runtimeMinutes": "104"
    },
    "2015_134": {
        "plotSummary": "A musician who gave up everything for her dream of rock-and-roll stardom returns home, looking to make things right with her family.",
        "runtimeMinutes": "101"
    },
    "2015_135": {
        "plotSummary": "An aspiring photographer develops an intimate relationship with an older woman in 1950s New York.",
        "runtimeMinutes": "118"
    },
    "2015_136": {
        "plotSummary": "The movies follows the incident known as the second battle of Yeonpyeong which happened in 2002.",
        "runtimeMinutes": "130"
    },
    "2015_137": {
        "plotSummary": "In a last-ditch effort to stop a diabolical plot, a dead CIA operative's memories, secrets, and skills are implanted into a death-row inmate in hopes that he will complete the operative's mission.",
        "runtimeMinutes": "113"
    },
    "2015_138": {
        "plotSummary": "It's been some years since the end of the Shinobi War. Naruto Uzumaki is the 7th Hokage of Konohagakure, in this new era. His son, Boruto Uzumaki, will soon enter the Chûnin exams, alongside Sarada Uchiha and the mysterious Mitsuki.",
        "runtimeMinutes": "95"
    },
    "2015_139": {
        "plotSummary": "A group of medical researchers discover a way to bring dead patients back to life.",
        "runtimeMinutes": "83"
    },
    "2015_14": {
        "plotSummary": "Armed with a super-suit with the astonishing ability to shrink in scale but increase in strength, cat burglar Scott Lang must embrace his inner hero and help his mentor, Dr. Hank Pym, plan and pull off a heist that will save the world.",
        "runtimeMinutes": "117"
    },
    "2015_140": {
        "plotSummary": "After spending two decades in England, Bill Bryson (Robert Redford) returns to the U.S., where he decides the best way to connect with his homeland is to hike the Appalachian Trail with one of his oldest friends, Stephen Katz (Nick Nolte).",
        "runtimeMinutes": "104"
    },
    "2015_141": {
        "plotSummary": "A young programmer is selected to participate in a ground-breaking experiment in synthetic intelligence by evaluating the human qualities of a highly advanced humanoid A.I.",
        "runtimeMinutes": "108"
    },
    "2015_142": {
        "plotSummary": "Adam Jones (Bradley Cooper) is a chef who destroyed his career with drugs and diva behavior. He cleans up and returns to London, determined to redeem himself by spearheading a top restaurant that can gain three Michelin stars.",
        "runtimeMinutes": "101"
    },
    "2015_143": {
        "plotSummary": "Two priests have to find out if a young girl was attacked by an evil spirit or human molester in order to save her life.",
        "runtimeMinutes": "103"
    },
    "2015_144": {
        "plotSummary": "Held captive for 7 years in an enclosed space, a woman and her young son finally gain their freedom, allowing the boy to experience the outside world for the first time.",
        "runtimeMinutes": "118"
    },
    "2015_145": {
        "plotSummary": "A man's epic 14 year search for his son crosses paths with another man who shares a similar story.",
        "runtimeMinutes": "108"
    },
    "2015_146": {
        "plotSummary": "A tight-knit team of rising investigators, along with their supervisor, is suddenly torn apart when they discover that one of their own teenage daughters has been brutally murdered.",
        "runtimeMinutes": "111"
    },
    "2015_147": {
        "plotSummary": "Steve Jobs takes us behind the scenes of the digital revolution, to paint a portrait of the man at its epicenter. The story unfolds backstage at three iconic product launches, ending in 1998 with the unveiling of the iMac.",
        "runtimeMinutes": "122"
    },
    "2015_148": {
        "plotSummary": "Told from Igor's perspective, we see the troubled young assistant's dark origins, his redemptive friendship with the young medical student Viktor Von Frankenstein, and become eyewitnesses to the emergence of how Frankenstein became the man...See moreTold from Igor's perspective, we see the troubled young assistant's dark origins, his redemptive friendship with the young medical student Viktor Von Frankenstein, and become eyewitnesses to the emergence of how Frankenstein became the man - and the legend - we know today.See less",
        "runtimeMinutes": "110"
    },
    "2015_149": {
        "plotSummary": "After escaping an abduction attempt, a blind woman and the young man who witnessed the crime aid the police in trying to identify the man responsible.",
        "runtimeMinutes": "112"
    },
    "2015_15": {
        "plotSummary": "Dracula and his friends try to bring out the monster in his half human, half vampire grandson in order to keep Mavis from leaving the hotel.",
        "runtimeMinutes": "89"
    },
    "2015_150": {
        "plotSummary": "A group of teens discover secret plans of a time machine, and construct one. However, things start to get out of control.",
        "runtimeMinutes": "106"
    },
    "2015_151": {
        "plotSummary": "The siblings of two estranged lovers fall for each other, unaware of the violent past that drove them apart.",
        "runtimeMinutes": "158"
    },
    "2015_152": {
        "plotSummary": "In 1912 London, a young working mother is galvanized into radical political activism supporting the right for women to vote, and is willing to meet violence with violence to achieve this end.",
        "runtimeMinutes": "106"
    },
    "2015_153": {
        "plotSummary": "A dying real estate mogul transfers his consciousness into a healthy young body, but soon finds that neither the procedure nor the company that performed it are quite what they seem.",
        "runtimeMinutes": "117"
    },
    "2015_154": {
        "plotSummary": "Mr. Wu, a Hong Kong movie star, is kidnapped by four unpredictable criminals disguised as police officers. Will he get rescued?",
        "runtimeMinutes": "106"
    },
    "2015_155": {
        "plotSummary": "In a world where giant humanoid Titans prey on humans, Eren joins the scouting legion to get revenge on the monsters who killed everyone in his town.",
        "runtimeMinutes": "98"
    },
    "2015_156": {
        "plotSummary": "Ove, an ill-tempered, isolated retiree who spends his days enforcing block association rules and visiting his wife's grave, has finally given up on life just as an unlikely friendship develops with his boisterous new neighbors.",
        "runtimeMinutes": "116"
    },
    "2015_157": {
        "plotSummary": "In Victorian England, the independent and headstrong Bathsheba Everdene attracts three very different suitors: Gabriel Oak, a sheep farmer; Frank Troy, a reckless Sergeant; and William Boldwood, a prosperous and mature bachelor.",
        "runtimeMinutes": "119"
    },
    "2015_158": {
        "plotSummary": "An aged, retired Sherlock Holmes deals with early dementia, as he tries to remember his final case, and a mysterious woman, whose memory haunts him. He also befriends a fan, the young son of his housekeeper, who wants him to work again.",
        "runtimeMinutes": "104"
    },
    "2015_159": {
        "plotSummary": "In the 60s, Beach Boys leader Brian Wilson struggles with emerging psychosis as he attempts to craft his avant-garde pop masterpiece. In the 80s, he is a broken, confused man under the 24-hour watch of shady therapist Dr. Eugene Landy.",
        "runtimeMinutes": "121"
    },
    "2015_16": {
        "plotSummary": "In the aftermath of a massive earthquake in California, a rescue-chopper pilot makes a dangerous journey with his ex-wife across the state in order to rescue his daughter.",
        "runtimeMinutes": "114"
    },
    "2015_160": {
        "plotSummary": "Based on the real-life event, when a gold and copper mine collapses, it traps 33 miners underground for 69 days.",
        "runtimeMinutes": "127"
    },
    "2015_161": {
        "plotSummary": "A tormented philosophy professor finds a will to live when he commits an existential act.",
        "runtimeMinutes": "95"
    },
    "2015_162": {
        "plotSummary": "Joseon's top detective Kim Min attempts to track down those responsible for circulating massive amounts of counterfeit silver bullion in Joseon. He also tries to find the missing sibling of a young girl.",
        "runtimeMinutes": "124"
    },
    "2015_163": {
        "plotSummary": "A stoner - who is in fact a government agent - is marked as a liability and targeted for extermination. But he's too well-trained and too high for them to handle.",
        "runtimeMinutes": "96"
    },
    "2015_164": {
        "plotSummary": "A celebrated military contractor returns to the site of his greatest career triumphs and reconnects with a long-ago love while unexpectedly falling for the hard-charging Air Force watch-dog assigned to him.",
        "runtimeMinutes": "105"
    },
    "2015_165": {
        "plotSummary": "Toto, a young chick born the run of the litter, rises to the occasion when a rancher threatens his home and his family.",
        "runtimeMinutes": "98"
    },
    "2015_166": {
        "plotSummary": "A cop-turned-bar owner befriends a drunken woman and finds himself pursued by her former lover and the thugs he employs. The chase turns deadly when the bar owner's deadbeat brother and a suitcase full of cash enter the picture.",
        "runtimeMinutes": "120"
    },
    "2015_167": {
        "plotSummary": "A young surfer rallies his friends to stop a billionaire from rewriting history as a way to hoard Helium 3, the clean energy of the future.",
        "runtimeMinutes": "94"
    },
    "2015_168": {
        "plotSummary": "A sniper on a mercenary assassination team, kills the minister of mines of the Congo. Terrier's successful kill shot forces him into hiding. Returning to the Congo years later, he becomes the target of a hit squad himself.",
        "runtimeMinutes": "115"
    },
    "2015_169": {
        "plotSummary": "A glamorous woman returns to her small town in rural Australia. With her sewing machine and haute couture style, she transforms the women and exacts sweet revenge on those who did her wrong.",
        "runtimeMinutes": "119"
    },
    "2015_17": {
        "plotSummary": "When John Connor, leader of the human resistance, sends Sgt. Kyle Reese back to 1984 to protect Sarah Connor and safeguard the future, an unexpected turn of events creates a fractured timeline.",
        "runtimeMinutes": "126"
    },
    "2015_170": {
        "plotSummary": "Archival footage and personal testimonials present an intimate portrait of the life and career of British singer/songwriter Amy Winehouse.",
        "runtimeMinutes": "128"
    },
    "2015_171": {
        "plotSummary": "A retired orchestra conductor is on vacation with his daughter and his film director best friend in the Alps when he receives an invitation from Queen Elizabeth II to perform for Prince Philip's birthday.",
        "runtimeMinutes": "124"
    },
    "2015_172": {
        "plotSummary": "Psychic John Clancy (Sir Anthony Hopkins) works with the F.B.I. in order to hunt down a serial killer.",
        "runtimeMinutes": "101"
    },
    "2015_173": {
        "plotSummary": "A story about three friends, Chiho, Dongwoo, and Gyungjae. Each of them has just turned 20 years old and they must decide what to do with their life.",
        "runtimeMinutes": "115"
    },
    "2015_174": {
        "plotSummary": "An inexperienced college student meets a wealthy businessman whose sexual practices put a strain on their relationship.",
        "runtimeMinutes": "92"
    },
    "2015_175": {
        "plotSummary": "A grieving widower is drawn into a custody battle over his granddaughter, whom he helped raise her entire life.",
        "runtimeMinutes": "121"
    },
    "2015_176": {
        "plotSummary": "A pair of reformed gangsters try to find a husband for their newly discovered sister, but complications arise due to mistaken identities.",
        "runtimeMinutes": "152"
    },
    "2015_177": {
        "plotSummary": "A young woman is followed by an unknown supernatural force after a sexual encounter.",
        "runtimeMinutes": "100"
    },
    "2015_178": {
        "plotSummary": "The story of the film begins after the events of the second season, at the graduation ceremony of the third-year students. Knowing that the graduation of the third-year members means the end of u's, the nine girls take a walk around the ...See moreThe story of the film begins after the events of the second season, at the graduation ceremony of the third-year students. Knowing that the graduation of the third-year members means the end of u's, the nine girls take a walk around the school filled with memories. However, when the students attempt to leave the school gates, a single email is sent to them, and the curtain on a new story for u's begins.See less",
        "runtimeMinutes": "99"
    },
    "2015_179": {
        "plotSummary": "The true story of the Puccio Clan, a family who kidnapped and killed people in the 80s.",
        "runtimeMinutes": "108"
    },
    "2015_18": {
        "plotSummary": "A spy organisation recruits a promising street kid into the agency's training program, while a global threat emerges from a twisted tech genius.",
        "runtimeMinutes": "129"
    },
    "2015_180": {
        "plotSummary": "A lazy youth failing to take up any responsibility is sent to work with his father's friend in Goa where he meets a woman who has problems of her own.",
        "runtimeMinutes": "141"
    },
    "2015_181": {
        "plotSummary": "Two estranged, street-fighting brothers square off against each other in a mixed martial arts tournament.",
        "runtimeMinutes": "156"
    },
    "2015_182": {
        "plotSummary": "A furloughed convict and his American and Chinese partners hunt a high-level cybercrime network from Chicago to Los Angeles to Hong Kong to Jakarta.",
        "runtimeMinutes": "133"
    },
    "2015_183": {
        "plotSummary": "Life changes for Malcolm, a geek who's surviving life in a tough neighborhood, after a chance invitation to an underground party leads him and his friends into a Los Angeles adventure.",
        "runtimeMinutes": "103"
    },
    "2015_184": {
        "plotSummary": "The Mehra family must contemplate over their way of living and their love lives while on a cruise celebrating their 30th wedding anniversary.",
        "runtimeMinutes": "170"
    },
    "2015_185": {
        "plotSummary": "A detective and a psychoanalyst uncover evidence of a satanic cult while investigating a young woman's terrifying past.",
        "runtimeMinutes": "106"
    },
    "2015_186": {
        "plotSummary": "Neerja is the story of the courageous Neerja Bhanot, who sacrificed her life while protecting the lives of 359 passengers on the Pan Am flight 73 in 1986. The flight was hijacked by a terrorist organization. Read more: Synopsis",
        "runtimeMinutes": "122"
    },
    "2015_187": {
        "plotSummary": "An eight-year-old boy is willing to do whatever it takes to end World War II so he can bring his father home. The story reveals the indescribable love a father has for his little boy and the love a son has for his father.",
        "runtimeMinutes": "106"
    },
    "2015_188": {
        "plotSummary": "A middle-aged couple's career and marriage are overturned when a disarming young couple enters their lives.",
        "runtimeMinutes": "97"
    },
    "2015_189": {
        "plotSummary": "Life is an adventure for a young monkey and her son, living among ancient ruins in the jungle. But when her family is forced from their home, she must lead them to safety amidst strange new creatures and surroundings.",
        "runtimeMinutes": "81"
    },
    "2015_19": {
        "plotSummary": "Human and monsters have lived in their separate worlds, but after the birth of Wuba, the last of the monster kings, begins the adventure to bring the two races together.",
        "runtimeMinutes": "117"
    },
    "2015_190": {
        "plotSummary": "Macbeth, the Thane of Glamis, receives a prophecy from a trio of witches that one day he will become King of Scotland. Consumed by ambition and spurred to action by his wife, Macbeth murders his king and takes the throne for himself.",
        "runtimeMinutes": "113"
    },
    "2015_191": {
        "plotSummary": "Jong-Dae and Yong-Ki make a living by picking up paper and empty bottles. Both then join different gangster clan and becomes involved in a struggle of political interests over development in Gangnam, Seoul.",
        "runtimeMinutes": "135"
    },
    "2015_192": {
        "plotSummary": "Three scouts, on the eve of their last camp-out, discover the true meaning of friendship when they attempt to save their town from a zombie outbreak.",
        "runtimeMinutes": "93"
    },
    "2015_193": {
        "plotSummary": "Did you know that God is alive and lives in Brussels with his daughter?",
        "runtimeMinutes": "114"
    },
    "2015_194": {
        "plotSummary": "A decorated detective involved in a taxi driver's death realizes he is caught in a trap and must untangle past mistakes to figure out why he was targeted in the first place.",
        "runtimeMinutes": "102"
    },
    "2015_195": {
        "plotSummary": "A story that revolves around three sisters who live in their grandmother's home and the arrival of their thirteen-year-old half sister.",
        "runtimeMinutes": "127"
    },
    "2015_196": {
        "plotSummary": "A young boy name Eren Jaeger has to use his gift to know about the mystery of the Titans.",
        "runtimeMinutes": "87"
    },
    "2015_197": {
        "plotSummary": "The life of a man with borderline personality disorder is relived in three stages: as a nine-year-old child, a 19-year-old adolescent and a 30-year-old adult.",
        "runtimeMinutes": "139"
    },
    "2015_198": {
        "plotSummary": "A hard-working small business owner and his two associates travel to Europe to close the most important deal of their lives. But what began as a routine business trip goes off the rails in every way imaginable, and unimaginable.",
        "runtimeMinutes": "91"
    },
    "2015_199": {
        "plotSummary": "A married couple preparing to celebrate their wedding anniversary receives shattering news that promises to forever change the course of their lives.",
        "runtimeMinutes": "91"
    },
    "2015_2": {
        "plotSummary": "A new theme park, built on the original site of Jurassic Park, creates a genetically modified hybrid dinosaur, the Indominus Rex, which escapes containment and goes on a killing spree.",
        "runtimeMinutes": "124"
    },
    "2015_20": {
        "plotSummary": "An alien on the run from his own people makes friends with a girl. He tries to help her on her quest, but can be an interference.",
        "runtimeMinutes": "94"
    },
    "2015_200": {
        "plotSummary": "When a pastor is shaken by the visible faith of a street corner preacher, he is reminded that true belief always requires action. His response ignites a journey that impacts everyone it touches in ways that only God could orchestrate.",
        "runtimeMinutes": "120"
    },
    "2015_201": {
        "plotSummary": "A gifted high school football player must learn to embrace his talent and his faith as he battles racial tensions on and off the field.",
        "runtimeMinutes": "123"
    },
    "2015_202": {
        "plotSummary": "A South Korean has a different person's body, changing every morning to a body \"borrowed\" for a day - man, woman, old, child and sometimes a foreigner. \"He\" works as furniture designer. He loves a girl. She loves him for the beauty inside.",
        "runtimeMinutes": "127"
    },
    "2015_203": {
        "plotSummary": "In the backdrop of a destination wedding in London, two families try to save their respective empires, unbeknownst to each other. Read more: Synopsis",
        "runtimeMinutes": "144"
    },
    "2015_204": {
        "plotSummary": "A disgraced Indian soldier carries out a series of assassinations in the hope of restoring his honour.",
        "runtimeMinutes": "136"
    },
    "2015_205": {
        "plotSummary": "An elegant weather reporter on TV and a foul-mouthed boozer off, Hyun-woo juggles three relationships with three men of different personalities. This is the \"love story\" of her life.",
        "runtimeMinutes": "118"
    },
    "2015_206": {
        "plotSummary": "Goblins, elves, fairies and imps, and their misadventures sparked by the battle over a powerful potion.",
        "runtimeMinutes": "99"
    },
    "2015_207": {
        "plotSummary": "When Lou's shot in the groin, Nick and Jacob drag him in the Hot Tub Time Machine to go back in time and save Lou. The three end up 10 years in the future, where they need to go to find the shooter.",
        "runtimeMinutes": "93"
    },
    "2015_208": {
        "plotSummary": "A priest and two Vatican exorcists must do battle with an ancient satanic force to save the soul of a young woman.",
        "runtimeMinutes": "91"
    },
    "2015_209": {
        "plotSummary": "After falling in love, three roommates experience changes in their lives.",
        "runtimeMinutes": "137"
    },
    "2015_21": {
        "plotSummary": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search for her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max.",
        "runtimeMinutes": "120"
    },
    "2015_210": {
        "plotSummary": "Although anticipated, no one is really ready when the mountain pass above the scenic, narrow Norwegian fjord Geiranger collapses and creates an 85-meter high violent tsunami. A geologist is one of those caught in the middle of it.",
        "runtimeMinutes": "105"
    },
    "2015_211": {
        "plotSummary": "A disgraced member of the Russian military police investigates a series of child murders during the Stalin-era Soviet Union.",
        "runtimeMinutes": "137"
    },
    "2015_212": {
        "plotSummary": "A group of student activists travels to the Amazon to save the rain forest and soon discover that they are not alone, and that no good deed goes unpunished.",
        "runtimeMinutes": "100"
    },
    "2015_213": {
        "plotSummary": "A female assassin receives a dangerous mission to kill a political leader in eighth-century China.",
        "runtimeMinutes": "105"
    },
    "2015_214": {
        "plotSummary": "When country boy Oh Geun-tae is thrust into the bustling world of Seoul's iconic folk music cafe-C'est Si Bon, he unwittingly becomes the third member of the yet-to-debut 'C'est Si Bon Trio'.",
        "runtimeMinutes": "122"
    },
    "2015_215": {
        "plotSummary": "In 1947, Dalton Trumbo was Hollywood's top screenwriter, until he and other artists were jailed and blacklisted for their political beliefs.",
        "runtimeMinutes": "124"
    },
    "2015_216": {
        "plotSummary": "An account of the romance between the Maratha general, Baji Rao I and Mastani, princess of Bundelkhand.",
        "runtimeMinutes": "158"
    },
    "2015_217": {
        "plotSummary": "The world\"s climate is changing. Instead of showing the worst that can happen, this documentary focuses on the people suggesting solutions and their actions.",
        "runtimeMinutes": "118"
    },
    "2015_218": {
        "plotSummary": "Caught between a forbidden romance and the expectations of his friends, aspiring DJ Cole Carter attempts to find the path in life that leads to fame and fortune.",
        "runtimeMinutes": "96"
    },
    "2015_219": {
        "plotSummary": "A woman, unhappy with her fiance, travels to Italy to find her true love; and all she knows about him is his name.",
        "runtimeMinutes": "114"
    },
    "2015_22": {
        "plotSummary": "In a world where dinosaurs and humans live side-by-side, an Apatosaurus named Arlo makes an unlikely human friend.",
        "runtimeMinutes": "93"
    },
    "2015_220": {
        "plotSummary": "An aging rock star decides to change his life when he discovers a 40-year-old letter written to him by John Lennon.",
        "runtimeMinutes": "106"
    },
    "2015_221": {
        "plotSummary": "A magnetic field anomaly allows a man to phone back into the past to his wife, who was murdered years ago. But to save her, he must identify the killer now and warn her before the anomaly disappears.",
        "runtimeMinutes": "115"
    },
    "2015_222": {
        "plotSummary": "Two talented landscape artists become romantically entangled while building a garden in King Louis XIV's palace at Versailles.",
        "runtimeMinutes": "112"
    },
    "2015_223": {
        "plotSummary": "High schooler Greg, who spends most of his time making parodies of classic movies with his co-worker Earl, finds his outlook forever altered after befriending a classmate who has just been diagnosed with cancer.",
        "runtimeMinutes": "105"
    },
    "2015_224": {
        "plotSummary": "Julián receives an unexpected visit from his friend Tomás, who lives in Canada. The two men, accompanied by Julián's faithful dog, Truman, will share emotional and surprising moments prompted by Julián's complicated situation.",
        "runtimeMinutes": "108"
    },
    "2015_225": {
        "plotSummary": "It is party day at Marguerite Dumont's castle. She sings wholeheartedly, but terribly out of tune. Marguerite has been living her passion in her own bubble, and the hypocrite audience acts as if she was the diva she believes she is.",
        "runtimeMinutes": "129"
    },
    "2015_226": {
        "plotSummary": "A battle-hardened American political consultant is sent to help re-elect a controversial president in Bolivia, where she must compete with a long-term rival working for another candidate.",
        "runtimeMinutes": "107"
    },
    "2015_227": {
        "plotSummary": "A musical set mainly in a corporate high-rise. Two assistants, Lee Xiang and Kat, start new jobs at the financial firm Jones & Sunn. Lee Xiang is an earnest young man who naively enters the world of high finance with noble intentions. Kat ...See moreA musical set mainly in a corporate high-rise. Two assistants, Lee Xiang and Kat, start new jobs at the financial firm Jones & Sunn. Lee Xiang is an earnest young man who naively enters the world of high finance with noble intentions. Kat on the other hand has a secret.  Written by Mad Dog Down TimeSee less",
        "runtimeMinutes": "119"
    },
    "2015_228": {
        "plotSummary": "Tony is admitted to a rehabilitation center after a serious skiing accident. Dependent of medical staff and painkillers, she takes the time to remember the tumultuous love story she lived with Georgio.",
        "runtimeMinutes": "124"
    },
    "2015_229": {
        "plotSummary": "A group of bright teenagers are recruited for a special college program for young geniuses only to find themselves socially awkward among their more normal peers.",
        "runtimeMinutes": "106"
    },
    "2015_23": {
        "plotSummary": "Accused of a ruthless murder he never committed or witnessed, Bryan Mills goes on the run and brings out his particular set of skills to find the true killer and clear his name.",
        "runtimeMinutes": "108"
    },
    "2015_230": {
        "plotSummary": "Sung-chil is a grumpy 70-year-old man who lives alone and works part-time at the local supermarket. Jang-soo, owner of the supermarket and president of the city's redevelopment project, has been trying in vain to get Sung-chil's signature ...See moreSung-chil is a grumpy 70-year-old man who lives alone and works part-time at the local supermarket. Jang-soo, owner of the supermarket and president of the city's redevelopment project, has been trying in vain to get Sung-chil's signature (he's the last hold-out and the only reason for the project's delay), but Sung-chil stubbornly refuses any change to his lifestyle. Then he meets his new neighbor Geum-nim, a feisty yet friendly elderly lady who runs the flower shop next door. Despite his age, Sung-chil is inexperienced and clumsy at romance so the entire town cheers him on and helps him court her. But Geum-nim's daughter Min-jung disapproves of the relationship.See less",
        "runtimeMinutes": "112"
    },
    "2015_231": {
        "plotSummary": "Margherita, a director in the middle of an existential crisis, has to deal with the inevitable and still unacceptable loss of her mother.",
        "runtimeMinutes": "106"
    },
    "2015_232": {
        "plotSummary": "Violette, a 40-year old workaholic with a career in the fashion industry falls for a provincial computer geek, Jean-Rene, while on a spa retreat with her best friend. Read more: Synopsis",
        "runtimeMinutes": "99"
    },
    "2015_233": {
        "plotSummary": "Frank and Casper's friendship is put to a test, when Casper decides to leave Denmark to pursue a solo career in Los Angeles. Determined to win his best friend back Frank chooses to follow Casper ensuring an eventful trip.",
        "runtimeMinutes": "99"
    },
    "2015_234": {
        "plotSummary": "The friendship between two life-long girlfriends is put to the test when one starts a family and the other falls ill.",
        "runtimeMinutes": "112"
    },
    "2015_235": {
        "plotSummary": "A lawyer and a prosecutor take on a murder case the has no evidence or a body.",
        "runtimeMinutes": "117"
    },
    "2015_236": {
        "plotSummary": "The vacation of a famous rock star and her boyfriend in Italy is disrupted by the unexpected visit of an old friend and his daughter.",
        "runtimeMinutes": "125"
    },
    "2015_237": {
        "plotSummary": "A young teenager camping in the woods helps rescue the President of the United States when Air Force One is shot down near his campsite.",
        "runtimeMinutes": "90"
    },
    "2015_238": {
        "plotSummary": "A widow and former songstress discovers that life can begin anew at any age.",
        "runtimeMinutes": "92"
    },
    "2015_239": {
        "plotSummary": "A teenager facing an unplanned pregnancy seeks help from her acerbic grandmother, a woman who is long estranged from her daughter.",
        "runtimeMinutes": "79"
    },
    "2015_24": {
        "plotSummary": "When a diabolical pirate above the sea steals the secret Krabby Patty formula, SpongeBob and his nemesis Plankton must team up in order to get it back.",
        "runtimeMinutes": "92"
    },
    "2015_240": {
        "plotSummary": "An experienced investigator confronts several conflicting theories about the perpetrators of a violent double homicide.",
        "runtimeMinutes": "132"
    },
    "2015_241": {
        "plotSummary": "In ancient India, an adventurous and daring man becomes involved in a decades old feud between two warring people.",
        "runtimeMinutes": "159"
    },
    "2015_242": {
        "plotSummary": "When a Las Vegas bodyguard with lethal skills and a gambling problem gets in trouble with the mob, he has one last play...and it's all or nothing.",
        "runtimeMinutes": "92"
    },
    "2015_243": {
        "plotSummary": "A Jewish-Hungarian concentration camp prisoner sets out to give a child he mistook for his son a proper burial.",
        "runtimeMinutes": "107"
    },
    "2015_244": {
        "plotSummary": "An unemployed factory worker is trying to make ends meet in working-class France.",
        "runtimeMinutes": "91"
    },
    "2015_245": {
        "plotSummary": "In a dystopian near future, single people, according to the laws of The City, are taken to The Hotel, where they are obliged to find a romantic partner in forty-five days or are transformed into beasts and sent off into The Woods.",
        "runtimeMinutes": "119"
    },
    "2015_246": {
        "plotSummary": "In this tale of love, loss, and growing up, Anthony faces a big move. He's leaving home behind for Australia, in pursuit of a prestigious business degree. Not only is he leaving his family, but also the secret crush of his life, Ying. As ...See moreIn this tale of love, loss, and growing up, Anthony faces a big move. He's leaving home behind for Australia, in pursuit of a prestigious business degree. Not only is he leaving his family, but also the secret crush of his life, Ying. As Anthony grows, finding new loves and hobbies, he finds himself saying goodbye to the only woman he's ever truly loved.See less",
        "runtimeMinutes": "122"
    },
    "2015_247": {
        "plotSummary": "A single woman (Shu Qi) in Shanghai has a mother obsessed with getting her a husband - having her mother's single doctor pushed at her. A handsome young man starts working at her office.",
        "runtimeMinutes": "96"
    },
    "2015_248": {
        "plotSummary": "A group of eccentric aliens confers a human being with the power to do absolutely anything, as an experiment.",
        "runtimeMinutes": "85"
    },
    "2015_249": {
        "plotSummary": "On the set of a playwright's new project, a love triangle forms between his wife, her ex-lover, and the call girl-turned-actress cast in the production. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2015_25": {
        "plotSummary": "After having escaped the Maze, the Gladers now face a new set of challenges on the open roads of a desolate landscape filled with unimaginable obstacles.",
        "runtimeMinutes": "131"
    },
    "2015_250": {
        "plotSummary": "As her marriage dissolves, a Manhattan writer takes driving lessons from a Sikh instructor with marriage troubles of his own. In each other's company they find the courage to get back on the road and the strength to take the wheel.",
        "runtimeMinutes": "90"
    },
    "2015_251": {
        "plotSummary": "A British woman recalls coming of age during World War I - a story of young love, the futility of war, and how to make sense of the darkest times.",
        "runtimeMinutes": "129"
    },
    "2015_252": {
        "plotSummary": "A man crippled by the mundanity of his life experiences something out of the ordinary.",
        "runtimeMinutes": "90"
    },
    "2015_253": {
        "plotSummary": "A Pulitzer-winning writer grapples with being a widower and father after a mental breakdown, while, 27 years later, his grown daughter struggles to forge connections of her own. Read more: Synopsis",
        "runtimeMinutes": "116"
    },
    "2015_254": {
        "plotSummary": "A devoted father helps two stranded young women who knock on his door, but his kind gesture turns into a dangerous seduction and a deadly game of cat and mouse.",
        "runtimeMinutes": "99"
    },
    "2015_255": {
        "plotSummary": "When Rex, a Broken Hill cab driver, is told he doesn't have long to live, he sets out on an epic journey to Darwin in a bid to die on his own terms.",
        "runtimeMinutes": "123"
    },
    "2015_256": {
        "plotSummary": "From the bitter quest of the Queen of Longtrellis, to two mysterious sisters who provoke the passion of a king, to the King of Highhills obsessed with a giant Flea, these tales are inspired by the fairytales by Giambattista Basile.",
        "runtimeMinutes": "134"
    },
    "2015_257": {
        "plotSummary": "An elderly curmudgeon lets out a room in his large apartment rent-free to a young student - on condition that she does everything in her power to ruin his son's marriage.",
        "runtimeMinutes": "98"
    },
    "2015_258": {
        "plotSummary": "Newsroom drama detailing the 2004 CBS 60 Minutes report investigating then-President George W. Bush's military service, and the subsequent firestorm of criticism that cost anchor Dan Rather and producer Mary Mapes their careers.",
        "runtimeMinutes": "125"
    },
    "2015_259": {
        "plotSummary": "When five orphan girls are seen innocently playing with boys on a beach, their scandalized conservative guardians confine them while forced marriages are arranged.",
        "runtimeMinutes": "97"
    },
    "2015_26": {
        "plotSummary": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side.",
        "runtimeMinutes": "119"
    },
    "2015_260": {
        "plotSummary": "When disgraced New York Times reporter Michael Finkel meets accused killer Christian Longo - who has taken on Finkel's identity - his investigation morphs into a game of cat-and-mouse.",
        "runtimeMinutes": "99"
    },
    "2015_261": {
        "plotSummary": "The life of Tao, and those close to her, is explored in three different time periods: 1999, 2014, and 2025.",
        "runtimeMinutes": "126"
    },
    "2015_262": {
        "plotSummary": "When a terrorist escapes custody during a routine handover, Will Holloway must team with disgraced MI5 Intelligence Chief Harry Pearce to track him down before an imminent terrorist attack on London.",
        "runtimeMinutes": "104"
    },
    "2015_263": {
        "plotSummary": "After gaining the power of invisibility; a man becomes a vigilante, in order to take revenge on those who have wronged him.",
        "runtimeMinutes": "133"
    },
    "2015_264": {
        "plotSummary": "In modern Greece, while socioeconomic turmoil ravages Southern Europe, three distinct stories unfold, each representing a different generation of Greeks in love with a foreigner, each story coming together in the end to form a whole.",
        "runtimeMinutes": "113"
    },
    "2015_265": {
        "plotSummary": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the eccentric scientist Doc Brown.",
        "runtimeMinutes": "116"
    },
    "2015_266": {
        "plotSummary": "A man involved in a horrific car crash is pronounced dead, only to come back to life an hour and a half later, claiming to have seen Heaven.",
        "runtimeMinutes": "121"
    },
    "2015_267": {
        "plotSummary": "On V.E. Day in 1945, as peace extends across Europe, Princesses Elizabeth and Margaret are allowed out to join the celebrations. It is a night full of excitement, danger and the first flutters of romance.",
        "runtimeMinutes": "97"
    },
    "2015_268": {
        "plotSummary": "Two outcast brothers, through getting to know their unknown family, discover a horrible truth about themselves and their relatives.",
        "runtimeMinutes": "104"
    },
    "2015_269": {
        "plotSummary": "Burdened with a heavy and ever-increasing debt, a dorayaki baker hires a kind ageing woman, after tasting her delicious surprise. Little by little, she unravels her beautiful inner world. Could she be holding the secret to his success?",
        "runtimeMinutes": "113"
    },
    "2015_27": {
        "plotSummary": "After a humiliating command performance at The Kennedy Center, the Barden Bellas enter an international competition that no American group has ever won in order to regain their status and right to perform.",
        "runtimeMinutes": "115"
    },
    "2015_270": {
        "plotSummary": "Set during the Philippine-American war, a short-tempered Filipino general faces an enemy more formidable than the American army: his own treacherous countrymen.",
        "runtimeMinutes": "118"
    },
    "2015_271": {
        "plotSummary": "An adventurous young koala embarks on a journey across the wild and dangerous Australian outback in the hope of finding his missing father, but he soon discovers that there is more to being a hero than meets the eye.",
        "runtimeMinutes": "93"
    },
    "2015_272": {
        "plotSummary": "A juvenile judge and a special educator are convinced that they can save the young delinquent Malony from himself and his violent ways.",
        "runtimeMinutes": "120"
    },
    "2015_273": {
        "plotSummary": "Tanu and Manu's marriage collapses. What happens when Manu meets Tanu's lookalike Kusum - and when Tanu returns?",
        "runtimeMinutes": "128"
    },
    "2015_274": {
        "plotSummary": "A romantic comedy that follows Maddy and Payal's live-in relationship until a sudden turn of events creates a distance between them.",
        "runtimeMinutes": "135"
    },
    "2015_275": {
        "plotSummary": "A group of aid workers work to resolve a crisis in an armed conflict zone.",
        "runtimeMinutes": "106"
    },
    "2015_276": {
        "plotSummary": "Jafar Panahi is banned from making movies by the Iranian government, he poses as a taxi driver and makes a movie about social challenges in Iran.",
        "runtimeMinutes": "82"
    },
    "2015_277": {
        "plotSummary": "Mrs. Dai, a 70-year old grandmother, suddenly finds that she has been transformed into her 20-year old self. Her old fashioned sense of style and manners cause some trouble, but falling in love could be the biggest problem of them all. Read more: Synopsis",
        "runtimeMinutes": "127"
    },
    "2015_278": {
        "plotSummary": "A young woman moves from the French countryside to Paris and begins a passionate love affair with a feminist leader in this drama set in 1970s France.",
        "runtimeMinutes": "105"
    },
    "2015_279": {
        "plotSummary": "Four Hispanic high school students form a robotics club. With no experience, 800 bucks, used car parts and a dream, this rag tag team goes up against the country's reigning robotics champion, MIT.",
        "runtimeMinutes": "114"
    },
    "2015_28": {
        "plotSummary": "In 1969 PRChina, two men survive a supernatural tomb. They later become tomb raiders with Shirley/Qi Shu. 20 years later in NYC, one is hired to find that tomb again and the 2 friends follow later.",
        "runtimeMinutes": "127"
    },
    "2015_280": {
        "plotSummary": "A long-time married couple who've spent their lives together in the same New York apartment become overwhelmed by personal and real estate-related issues when they plan to move away.",
        "runtimeMinutes": "88"
    },
    "2015_281": {
        "plotSummary": "When aspiring actress Maria Laura's best friend begs her to flirt with her boyfriend to test his fidelity, Maria finds a lucrative new career. After being hired by women across the city, Maria is given a gig that should be business as ...See moreWhen aspiring actress Maria Laura's best friend begs her to flirt with her boyfriend to test his fidelity, Maria finds a lucrative new career. After being hired by women across the city, Maria is given a gig that should be business as usual until she ends up falling head over heels for her latest mark.  Written by Pantelion FilmsSee less",
        "runtimeMinutes": "99"
    },
    "2015_282": {
        "plotSummary": "Legendary thief Alejandro Toledo return to his roots with a new partner to reclaim land stolen from a hard working community by a ruthless family of crooks.",
        "runtimeMinutes": "97"
    },
    "2015_283": {
        "plotSummary": "A look at the events leading up to the Taliban's attack on Pakistani schoolgirl, Malala Yousafzai, for speaking out on girls' education followed by the aftermath, including her speech to the United Nations.",
        "runtimeMinutes": "88"
    },
    "2015_284": {
        "plotSummary": "A down-on-his-luck music manager discovers a teenage girl with an extraordinary voice while on a music tour in Afghanistan and takes her to Kabul to compete on the popular television show, Afghan Star.",
        "runtimeMinutes": "106"
    },
    "2015_285": {
        "plotSummary": "A lonely college freshman's life is turned upside-down by her impetuous, adventurous stepsister-to-be.",
        "runtimeMinutes": "84"
    },
    "2015_286": {
        "plotSummary": "An Irish sports journalist becomes convinced that Lance Armstrong's performances during the Tour de France victories are fueled by banned substances. With this conviction, he starts hunting for evidence that will expose Armstrong.",
        "runtimeMinutes": "99"
    },
    "2015_287": {
        "plotSummary": "A couple tries to repair their marriage while staying at a hotel in France.",
        "runtimeMinutes": "122"
    },
    "2015_288": {
        "plotSummary": "A father is without the means to pay for his daughter's medical treatment. As a last resort, he partners with a greedy co-worker to rob a casino. When things go awry they're forced to hijack a city bus.",
        "runtimeMinutes": "93"
    },
    "2015_289": {
        "plotSummary": "Marc Guermont used to be a very much sought after horse stuntman in films. One day unfortunately, he had a bad fall from his mount during the shooting of a historical movie. And not only has he become a paraplegic but his insurance company...See moreMarc Guermont used to be a very much sought after horse stuntman in films. One day unfortunately, he had a bad fall from his mount during the shooting of a historical movie. And not only has he become a paraplegic but his insurance company tries to rip him off into the bargain. Two good reasons for Marc to feel bitter and enraged. Needless to say that Marc resolutely waits for the coming of his insurance \"advisor\". But when the latter reports to him, the insurance man happens to be a... seductive woman, Florence Kernel.  Written by Guy BellingerSee less",
        "runtimeMinutes": "87"
    },
    "2015_29": {
        "plotSummary": "The film follows Xu Lai, a former artist whose dreams were dashed when the responsibilities of life set in. With his life now revolving around his wife Cai Bo who is obsessed with having children, the quirks of his eccentric family and his...See moreThe film follows Xu Lai, a former artist whose dreams were dashed when the responsibilities of life set in. With his life now revolving around his wife Cai Bo who is obsessed with having children, the quirks of his eccentric family and his mediocre, ordinary existence, Xu Lai hopes to reconnect with his first love Yang YIi on an upcoming vacation. However, his hopes are dashed when he finds himself wrapped up in a murder investigation that proves truth is often stranger than fiction.See less",
        "runtimeMinutes": "114"
    },
    "2015_290": {
        "plotSummary": "A good-natured womanizer and a serial cheater form a platonic relationship that helps reform them in ways, while a mutual attraction sets in.",
        "runtimeMinutes": "101"
    },
    "2015_291": {
        "plotSummary": "The story of the relationship between Karamakate, an Amazonian shaman and last survivor of his people, and two scientists who work together over the course of forty years to search the Amazon for a sacred healing plant.",
        "runtimeMinutes": "125"
    },
    "2015_292": {
        "plotSummary": "A mysterious hunchback abducts a bride on the day of her wedding, holding her hostage as he goes on a revenge spree.",
        "runtimeMinutes": "188"
    },
    "2015_293": {
        "plotSummary": "A young Spanish woman who has recently moved to Berlin finds her flirtation with a local guy turn potentially deadly as their night out with his friends reveals a dangerous secret. Read more: Synopsis",
        "runtimeMinutes": "138"
    },
    "2015_294": {
        "plotSummary": "Kim Min-jae (Shin Ha-kyun), is a brilliant general who's distinguished himself by protecting the borders of the recently established Joseon dynasty. He keeps a close eye on Yi Bang-won (Jang Hyuk), the fifth son of King Taejo (Son Byong-ho...See moreKim Min-jae (Shin Ha-kyun), is a brilliant general who's distinguished himself by protecting the borders of the recently established Joseon dynasty. He keeps a close eye on Yi Bang-won (Jang Hyuk), the fifth son of King Taejo (Son Byong-ho), whom he believes has ambitions of seizing the throne, Jin (Kang Ha-neul), is Kim Min-Jae's son and the King's son-in-law. Due to his position as the King's son-in-law, he is unable to take part in politics and only seeks out pleasure. Yi Bang-won was instrumental in helping his father overthrow the Goryeo dynasty and founding Joseon, but was passed over when Taejo chose his successor. Meanwhile, Kim Min-jae falls in love for the first time with a gisaeng (an artist who worked to entertain others, such as the yangbans and kings. They were also courtesans, providing sexual services) named Ka-hee (Kang Han-na), whom he takes as his concubine, not realizing that she aims to carry out a vendetta against him.See less",
        "runtimeMinutes": "113"
    },
    "2015_295": {
        "plotSummary": "In post-World War II Denmark, a group of young German POWs are forced to clear a beach of thousands of land mines under the watch of a Danish Sergeant who slowly learns to appreciate their plight.",
        "runtimeMinutes": "100"
    },
    "2015_296": {
        "plotSummary": "The story of the man who brought high-ranking German Nazi criminal Adolf Eichmann to justice.",
        "runtimeMinutes": "105"
    },
    "2015_297": {
        "plotSummary": "The story of the five-day interview between Rolling Stone reporter David Lipsky and acclaimed novelist David Foster Wallace, which took place right after the 1996 publication of Wallace's groundbreaking epic novel, 'Infinite Jest.' Read more: Synopsis",
        "runtimeMinutes": "106"
    },
    "2015_298": {
        "plotSummary": "A woman asks her ex-lover for help in order to save her outlaw husband from a gang out to kill him.",
        "runtimeMinutes": "98"
    },
    "2015_299": {
        "plotSummary": "With the aid of a fellow Auschwitz survivor and a hand-written letter, an elderly man with dementia goes in search of the person he believes to be responsible for the death of his family in the death camp to kill him himself.",
        "runtimeMinutes": "94"
    },
    "2015_3": {
        "plotSummary": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.",
        "runtimeMinutes": "137"
    },
    "2015_30": {
        "plotSummary": "Snoopy embarks upon his greatest mission as he and his team take to the skies to pursue their archnemesis, while his best pal Charlie Brown begins his own epic quest back home to win the love of his life.",
        "runtimeMinutes": "88"
    },
    "2015_300": {
        "plotSummary": "When the estranged daughter of a hard-working live-in housekeeper suddenly appears, the unspoken class barriers that exist within the home are thrown into disarray.",
        "runtimeMinutes": "112"
    },
    "2015_301": {
        "plotSummary": "Hinata Hyuga's younger sister has been kidnapped, so Naruto must do what he can to save her.",
        "runtimeMinutes": "112"
    },
    "2015_302": {
        "plotSummary": "A single mother struggling with drug addiction is taken hostage in her own apartment by a man on the run who has broken out of jail and murdered the judge assigned to his case.",
        "runtimeMinutes": "97"
    },
    "2015_303": {
        "plotSummary": "A modern day adaptation of the ancient Greek play Lysistrata by Aristophanes, set against the backdrop of gang violence in Chicago, Illinois.",
        "runtimeMinutes": "127"
    },
    "2015_304": {
        "plotSummary": "A quirky comedy about the relationship between a daughter and her aging father, whose eccentricities drive everyone crazy.",
        "runtimeMinutes": "123"
    },
    "2015_305": {
        "plotSummary": "Collective screening of the Academy Award nominated short films from the Live Action category for 2015.",
        "runtimeMinutes": "118"
    },
    "2015_306": {
        "plotSummary": "The acerbic, hilarious Claire Bennett becomes fascinated by the suicide of a woman in her chronic pain support group. As she uncovers the details of Nina's suicide and develops a poignant relationship with Nina's husband, she also grapples...See moreThe acerbic, hilarious Claire Bennett becomes fascinated by the suicide of a woman in her chronic pain support group. As she uncovers the details of Nina's suicide and develops a poignant relationship with Nina's husband, she also grapples with her own, very raw personal tragedy.See less",
        "runtimeMinutes": "102"
    },
    "2015_307": {
        "plotSummary": "While in medieval Korea, a young girl sets out to revenge the betrayal and the death of her mother. But therefore she must face one of the most powerful men and warriors of the Goryo Dynasty.",
        "runtimeMinutes": "120"
    },
    "2015_308": {
        "plotSummary": "Three elite climbers struggle to find their way through obsession and loss as they attempt to climb Mount Meru, one of the most coveted prizes in the high stakes game of Himalayan big wall climbing.",
        "runtimeMinutes": "90"
    },
    "2015_309": {
        "plotSummary": "As a small-town girl catapults from underground video sensation to global superstar, she and her three sisters begin a journey of discovering that some talents are too special to keep hidden.",
        "runtimeMinutes": "118"
    },
    "2015_31": {
        "plotSummary": "When aliens misinterpret video feeds of classic arcade games as a declaration of war, they attack the Earth in the form of the video games.",
        "runtimeMinutes": "105"
    },
    "2015_310": {
        "plotSummary": "Over 30,000 U.S soldiers committed suicide since 2008.Over 8,000 U.S military veterans committed suicides in the year 2013; and 20,000 soldiers tried to commit suicide in 2013.The Unseen Battleground, The war of ghosts and spirits; ...See moreOver 30,000 U.S soldiers committed suicide since 2008.Over 8,000 U.S military veterans committed suicides in the year 2013; and 20,000 soldiers tried to commit suicide in 2013.The Unseen Battleground, The war of ghosts and spirits; spiritual warfare, mind control, mind attack by using ghosts and spirits? Arab, African and other foreign cultures and traditions. God, The Bible and science,Learn the 6th sense about how and when to protect yourself, family and friends. Middle Eastern Radical Terrorists use ghosts and spirits to brainwash and recruit young westerners?  Written by AnonymousSee less",
        "runtimeMinutes": "117"
    },
    "2015_311": {
        "plotSummary": "Freddie Steinmark, an underdog on the gridiron, faces the toughest challenge of his life after leading his team to a championship season.",
        "runtimeMinutes": "118"
    },
    "2015_312": {
        "plotSummary": "Twin boys move to a new home with their mother after she has face changing cosmetic surgery, but under her bandages is someone the children don't recognize.",
        "runtimeMinutes": "99"
    },
    "2015_313": {
        "plotSummary": "A philanthropist meddles in the lives of newly-married couples in an attempt to relive his past.",
        "runtimeMinutes": "93"
    },
    "2015_314": {
        "plotSummary": "Latiaozi was a Farmer who made a living with shepherding with his wife Jinzhizi. One day, their only son had been condemned for the crime. The couple scrabbled up 50000 Yuan to ask Li Datou, the able person of the town, for help, begging ...See moreLatiaozi was a Farmer who made a living with shepherding with his wife Jinzhizi. One day, their only son had been condemned for the crime. The couple scrabbled up 50000 Yuan to ask Li Datou, the able person of the town, for help, begging if Li Datou could find some big shot to reduce the penalty of their son. But they had been cheated. Latiaozi went to Li Datou's home to argue for his money but he failed. On his way home, he met a fool by accident. He had no choice but to pick him home. After a night spent in sheepfold, the fool was sent back to the town...  Written by AnonymousSee less",
        "runtimeMinutes": "103"
    },
    "2015_315": {
        "plotSummary": "A scheming servant works for a wealthy couple in France during the late 19th century.",
        "runtimeMinutes": "96"
    },
    "2015_316": {
        "plotSummary": "A reformed frat boy opens an antique store in a college town, and falls for the free-spirited girl who moves into the apartment above his shop. In time, this unlikely pair fall into a traditional courtship..",
        "runtimeMinutes": "115"
    },
    "2015_317": {
        "plotSummary": "The battle between the Night's Watch and the wildlings has come.",
        "runtimeMinutes": "51"
    },
    "2015_318": {
        "plotSummary": "A family who moved into a remote mill house in Ireland finds themselves in a fight for survival with demonic creatures living in the woods. Read more: Synopsis",
        "runtimeMinutes": "97"
    },
    "2015_319": {
        "plotSummary": "A recently unemployed single father struggles to get back his foreclosed home by working for the real estate broker who is the source of his frustration.",
        "runtimeMinutes": "112"
    },
    "2015_32": {
        "plotSummary": "Brad Whitaker is a radio host trying to get his stepchildren to love him and call him Dad. But his plans turn upside down when their biological father, Dusty Mayron, returns.",
        "runtimeMinutes": "96"
    },
    "2015_320": {
        "plotSummary": "In a remote Icelandic farming valley, two brothers who haven't spoken in 40 years have to come together in order to save what's dearest to them - their sheep.",
        "runtimeMinutes": "93"
    },
    "2015_321": {
        "plotSummary": "A father struggling with bipolar disorder tries to win back his wife by attempting to take full responsibility of their two young, spirited daughters, who don't make the overwhelming task any easier.",
        "runtimeMinutes": "90"
    },
    "2015_322": {
        "plotSummary": "A teen artist living in 1970s San Francisco enters into an affair with her mother's boyfriend. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2015_323": {
        "plotSummary": "Get inside the storied world of the Christian Dior fashion house with a privileged, behind-the-scenes look at the creation of Raf Simons' first haute couture collection as its new artistic director.",
        "runtimeMinutes": "90"
    },
    "2015_324": {
        "plotSummary": "An Indian-American man who is about to turn 30 gets help from his parents and extended family to start looking for a wife in the traditional Indian way.",
        "runtimeMinutes": "88"
    },
    "2015_325": {
        "plotSummary": "Musician Cat Power narrates this documentary on Janis Joplin's evolution into a star from letters that Joplin wrote over the years to her friends, family, and collaborators.",
        "runtimeMinutes": "103"
    },
    "2015_326": {
        "plotSummary": "As the Bride and the Groom prepare for the wedding in the pale desert, a tale of unappeased desires; forbidden yearnings, and conflicted choices unfolds. Now, three lovers stand powerless before the true nature of man. Is fate unavoidable?",
        "runtimeMinutes": "96"
    },
    "2015_327": {
        "plotSummary": "A drama that explores the life of Mother Teresa (Juliet Stevenson) through letters she wrote to her longtime friend and spiritual advisor, Father Celeste van Exem (Max von Sydow) over a nearly fifty-year period.",
        "runtimeMinutes": "114"
    },
    "2015_328": {
        "plotSummary": "A documentary about fashion icon Iris Apfel, the 93-year-old style maven who has had an out-sized presence on the New York fashion scene for decades, from legendary late 88-year-old documentary filmmaker Albert Maysles.",
        "runtimeMinutes": "79"
    },
    "2015_329": {
        "plotSummary": "A chronicle of Gertrude Bell's life, a traveler, writer, archaeologist, explorer, cartographer, and political attache for the British Empire at the dawn of the twentieth century.",
        "runtimeMinutes": "128"
    },
    "2015_33": {
        "plotSummary": "A desk-bound CIA analyst volunteers to go undercover to infiltrate the world of a deadly arms dealer, and prevent diabolical global disaster.",
        "runtimeMinutes": "120"
    },
    "2015_330": {
        "plotSummary": "Paul is preparing to leave Tajikistan, while thinking back on his adolescent years. His childhood, his mother's madness, the parties, the trip to the USSR where he lost his virginity, the friend who betrayed him and the love of his life.",
        "runtimeMinutes": "123"
    },
    "2015_331": {
        "plotSummary": "A family man begins to question the ethics of his job as a drone pilot.",
        "runtimeMinutes": "102"
    },
    "2015_332": {
        "plotSummary": "New Jersey police lieutenant, Laurel Hester, and her registered domestic partner, Stacie Andree, both battle to secure Hester's pension benefits when she is diagnosed with terminal cancer.",
        "runtimeMinutes": "103"
    },
    "2015_333": {
        "plotSummary": "Confined in an apartment from a New York housing project, the six Angulo brothers learned everything they know about the world through watching films and spend their time reenacting their favorite movies with intricate homemade costumes.",
        "runtimeMinutes": "90"
    },
    "2015_334": {
        "plotSummary": "A teenage girl in the Midwest becomes infected by an outbreak of a disease that slowly turns the infected into cannibalistic zombies. During her transformation, her loving father stays by her side.",
        "runtimeMinutes": "95"
    },
    "2015_335": {
        "plotSummary": "In the aftermath of a tragedy a woman, Magda, reacts with a surge of newfound life that engulfs her circle of family and friends.",
        "runtimeMinutes": "111"
    },
    "2015_336": {
        "plotSummary": "A brutal home-jacking by two brothers goes hopelessly wrong, and one of them goes to prison. Four years later, his brother tries to help him get his life back on track.",
        "runtimeMinutes": "96"
    },
    "2015_337": {
        "plotSummary": "Children who were held hostage in their elementary school tell stories of miraculous things, but many adults are skeptical that the Cokeville Miracle ever truly happened.",
        "runtimeMinutes": "94"
    },
    "2015_338": {
        "plotSummary": "Barney Thomson (Robert Carlyle), awkward, diffident, Glasgow, Scotland barber, lives a life of desperate mediocrity and his uninteresting life is about to go from 0 to 60 in five seconds, as he enters the grotesque and comically absurd ...See moreBarney Thomson (Robert Carlyle), awkward, diffident, Glasgow, Scotland barber, lives a life of desperate mediocrity and his uninteresting life is about to go from 0 to 60 in five seconds, as he enters the grotesque and comically absurd world of the serial killer.See less",
        "runtimeMinutes": "96"
    },
    "2015_339": {
        "plotSummary": "Newport-City 2029: Major, an advanced female cyborg, is in charge of the anti-terrorism etc. unit reporting directly to the government. Taking out terrorists and freeing hostages at an embassy doesn't go smoothly. Major investigates why.",
        "runtimeMinutes": "100"
    },
    "2015_34": {
        "plotSummary": "The Chipmunks believe that Dave plans to propose to his new girlfriend in Miami.--and dump them. They have three days to get to him and save themselves not only from losing Dave but also from gaining a terrible stepbrother.",
        "runtimeMinutes": "92"
    },
    "2015_340": {
        "plotSummary": "In November 1939, Georg Elser's attempt to assassinate Adolf Hitler fails, and he is arrested. During his confinement, he recalls the events leading up to his plot and his reasons for deciding to take such drastic action.",
        "runtimeMinutes": "114"
    },
    "2015_341": {
        "plotSummary": "A German communist flees to Northern France with his son. German troops follow May 1940. The son flees with the village towards Dieppe at the English Channel, as does the separated dad, joined by a Scottish officer.",
        "runtimeMinutes": "114"
    },
    "2015_342": {
        "plotSummary": "When his daughter goes missing from their prairie town east of France, Alain and his young son, Kid, head out to find her. The journey takes the men to some far-off and unsettling places in what begins to feel like an endless quest.",
        "runtimeMinutes": "104"
    },
    "2015_343": {
        "plotSummary": "The daughter of a Scottish farmer comes of age in the early 1900s.",
        "runtimeMinutes": "135"
    },
    "2015_344": {
        "plotSummary": "A young Scottish man travels across America in pursuit of the woman he loves, attracting the attention of an outlaw who is willing to serve as a guide.",
        "runtimeMinutes": "84"
    },
    "2015_345": {
        "plotSummary": "Isabelle and Gerard go to a strange appointment in Death Valley, California. They have not seen each other for years and are here to answer to an invitation from their son Michael, a photographer, which they received after his suicide, six...See moreIsabelle and Gerard go to a strange appointment in Death Valley, California. They have not seen each other for years and are here to answer to an invitation from their son Michael, a photographer, which they received after his suicide, six months ago.  Written by Le PacteSee less",
        "runtimeMinutes": "91"
    },
    "2015_346": {
        "plotSummary": "A British East India Trading Company assassin seeks to redeem his past by thwarting a plot against a young nation's hope for freedom.",
        "runtimeMinutes": "103"
    },
    "2015_347": {
        "plotSummary": "A photographer for LIFE Magazine is assigned to shoot pictures of James Dean.",
        "runtimeMinutes": "111"
    },
    "2015_348": {
        "plotSummary": "Damon Gameau embarks on an experiment to document the effects of a high sugar diet on a healthy body.",
        "runtimeMinutes": "90"
    },
    "2015_349": {
        "plotSummary": "Based on the true story of the Fictitious Dance group; their rise to fame, sudden downfall, and their heroic attempt to seek vindication by regaining their lost pride and glory.",
        "runtimeMinutes": "154"
    },
    "2015_35": {
        "plotSummary": "After attending a wedding of his high school crush Qiuya, Xia Luo (Shen Teng) gets drunk embarrassing himself and angers his wife Ma Dongmei (Ma Li). Read more: Synopsis",
        "runtimeMinutes": "104"
    },
    "2015_350": {
        "plotSummary": "The fractious family of a father and his two sons confront their different feelings and memories of their deceased wife and mother, a famed war photographer.",
        "runtimeMinutes": "109"
    },
    "2015_351": {
        "plotSummary": "A baseball player whose professional career was cut short due to his personal problems is suddenly awakened and invigorated by a young-man with Down syndrome who works at the local grocery store.",
        "runtimeMinutes": "95"
    },
    "2015_352": {
        "plotSummary": "Filmmaker Matthew Heineman examines the state of the ongoing drug problem along the U.S.-Mexican border.",
        "runtimeMinutes": "100"
    },
    "2015_353": {
        "plotSummary": "The story of a Danish commander, who is accused of civil murder in Afghanistan, while trying to save his squad.",
        "runtimeMinutes": "115"
    },
    "2015_354": {
        "plotSummary": "Alex, Emily, and their son, RJ, are new to Los Angeles. A chance meeting at the park introduces them to the mysterious Kurt, Charlotte, and Max. A family \"playdate\" becomes increasingly interesting as the night goes on.",
        "runtimeMinutes": "79"
    },
    "2015_355": {
        "plotSummary": "In the Mojave Desert, a naked and unarmed hunting guide runs from a wealthy hunter who wants to ensure his silence in the death of an old man.",
        "runtimeMinutes": "91"
    },
    "2015_356": {
        "plotSummary": "A socially awkward teenage math prodigy finds new confidence and new friendships when he lands a spot on the British squad at the International Mathematics Olympiad.",
        "runtimeMinutes": "111"
    },
    "2015_357": {
        "plotSummary": "A writer indulging in all that Los Angeles and Las Vegas has to offer undertakes a search for love and self via a series of adventures with six different women.",
        "runtimeMinutes": "118"
    },
    "2015_358": {
        "plotSummary": "In 1992, war rages in Abkhazia, a breakaway region of Georgia. An Estonian man Ivo has decided to stay behind and harvest his crops of tangerines. In a bloody conflict at his door, a wounded man is left behind, and Ivo takes him in.",
        "runtimeMinutes": "87"
    },
    "2015_359": {
        "plotSummary": "In a small town nestled in the Appalachian Mountains of Virginia, self-proclaimed spinster Ave Maria Mulligan finds her life shaken up and forever changed after learning a long-buried family secret.",
        "runtimeMinutes": "103"
    },
    "2015_36": {
        "plotSummary": "Newlywed couple Ted and Tami-Lynn want to have a baby, but in order to qualify to be a parent, Ted will have to prove he's a person in a court of law.",
        "runtimeMinutes": "115"
    },
    "2015_360": {
        "plotSummary": "A mother unexpectedly meets her son's fiancee at a villa in Sicily and gets to know her as she waits for her son to arrive. Read more: Synopsis",
        "runtimeMinutes": "100"
    },
    "2015_361": {
        "plotSummary": "Algeria, 1954. Two very different men thrown together by a world in turmoil are forced to flee across the Atlas mountains. Daru, the reclusive teacher, has to escort Mohamed, a villager accused of murder. Read more: Synopsis",
        "runtimeMinutes": "101"
    },
    "2015_362": {
        "plotSummary": "A history of the Louvre during the Nazi occupation and a meditation on the meaning and timelessness of art.",
        "runtimeMinutes": "88"
    },
    "2015_363": {
        "plotSummary": "Two men embark on a trip to the Vietnam Veterans Memorial guided by the letters their fathers wrote while serving in the war.",
        "runtimeMinutes": "96"
    },
    "2015_364": {
        "plotSummary": "A grief-stricken man takes the law into his own hands when he begins to kidnap and murder corrupt public servants.",
        "runtimeMinutes": "128"
    },
    "2015_365": {
        "plotSummary": "Residents of a retirement home build a machine for self-euthanasia in order to help their terminally ill friend, though they are faced with a series of dilemmas when rumors of the machine begin to spread.",
        "runtimeMinutes": "95"
    },
    "2015_366": {
        "plotSummary": "A teenage special ops agent coveting a \"normal\" adolescence fakes her own death and enrolls in a suburban high school. She quickly learns that surviving the treacherous waters of high school is more challenging than international espionage.",
        "runtimeMinutes": "96"
    },
    "2015_367": {
        "plotSummary": "A Palestinian-Israeli boy named Eyad is sent to a prestigious boarding school in Jerusalem, where he struggles with issues of language, culture, and identity.",
        "runtimeMinutes": "104"
    },
    "2015_368": {
        "plotSummary": "What is the validity of history found in the Bible? Is it fact or fiction? What does the hard evidence really have to say about the foundational story of the Old Testament: the Exodus out of Egypt? An in-depth investigation by documentary ...See moreWhat is the validity of history found in the Bible? Is it fact or fiction? What does the hard evidence really have to say about the foundational story of the Old Testament: the Exodus out of Egypt? An in-depth investigation by documentary filmmaker Tim Mahoney searches for answers to these questions amid startling new finds that may change traditional views of history and the Bible.  Written by AnonymousSee less",
        "runtimeMinutes": "115"
    },
    "2015_369": {
        "plotSummary": "Meet Seymour Bernstein: a beloved pianist, teacher and true inspiration who shares eye-opening insights from an amazing life. Ethan Hawke helms this poignant guide to life.",
        "runtimeMinutes": "84"
    },
    "2015_37": {
        "plotSummary": "Bound by a shared destiny, a teen bursting with scientific curiosity and a former boy-genius inventor embark on a mission to unearth the secrets of a place somewhere in time and space that exists in their collective memory.",
        "runtimeMinutes": "130"
    },
    "2015_370": {
        "plotSummary": "A documentary on the series of televised debates in 1968 between liberal Gore Vidal and conservative William F. Buckley.",
        "runtimeMinutes": "87"
    },
    "2015_371": {
        "plotSummary": "Murphy is an American living in Paris who enters a highly sexually and emotionally charged relationship with the unstable Electra. Unaware of the effect it will have on their relationship, they invite their pretty neighbor into their bed.",
        "runtimeMinutes": "135"
    },
    "2015_372": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2015_373": {
        "plotSummary": "While investigating the disappearance of a chemist, a detective uncovers a larger conspiracy to unsettle Calcutta.",
        "runtimeMinutes": "139"
    },
    "2015_374": {
        "plotSummary": "A hooker tears through Tinseltown on Christmas Eve searching for the pimp who broke her heart. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2015_375": {
        "plotSummary": "Two blundering terrorists with lofty ideologies, but ordinary talent, on a mission to change the world.",
        "runtimeMinutes": "135"
    },
    "2015_376": {
        "plotSummary": "A celebration of the musical work of a group of session musicians known as \"The Wrecking Crew\", a band that provided back-up instrumentals to such legendary recording artists as Frank Sinatra, The Beach Boys and Bing Crosby.",
        "runtimeMinutes": "101"
    },
    "2015_377": {
        "plotSummary": "The story of the Soviet Union's famed Red Army hockey team through the eyes of its players.",
        "runtimeMinutes": "84"
    },
    "2015_378": {
        "plotSummary": "4 criminals steal diamonds from a safe deposit box in Cape Town - including a drive containing a US senator's evil plans. He'll do anything to get it back from Alexis/Olga Kurylenko.",
        "runtimeMinutes": "96"
    },
    "2015_379": {
        "plotSummary": "The head of a high school reunion committee tries to get the most popular guy in school to attend their class' upcoming 20-year reunion.",
        "runtimeMinutes": "101"
    },
    "2015_38": {
        "plotSummary": "The story of New Zealand's Robert \"Rob\" Edwin Hall, who on May 10, 1996, together with Scott Fischer, teamed up on a joint expedition to ascend Mount Everest.",
        "runtimeMinutes": "121"
    },
    "2015_380": {
        "plotSummary": "In the Ottoman province of Hijaz during World War I, a young Bedouin boy experiences a greatly hastened coming-of-age as he embarks on a perilous desert journey to guide a British officer to his secret destination.",
        "runtimeMinutes": "100"
    },
    "2015_381": {
        "plotSummary": "Exiled artist and poet Mustafa embarks on a journey home with his housekeeper and her daughter; together the trio must evade the authorities who fear that the truth in Mustafa's words will incite rebellion.",
        "runtimeMinutes": "85"
    },
    "2015_382": {
        "plotSummary": "An ordinary man goes against all odds and forges his destiny to become a 'Big Shot'.",
        "runtimeMinutes": "149"
    },
    "2015_383": {
        "plotSummary": "A jaded Japanese woman discovers a hidden copy of Fargo on VHS, believing it to be a treasure map indicating the location of a large case of money.",
        "runtimeMinutes": "105"
    },
    "2015_384": {
        "plotSummary": "After losing her father to cancer, a teenage girl reluctantly joins her new stepcousin at a summer camp for Latter-day Saint (Mormon) girls.",
        "runtimeMinutes": "119"
    },
    "2015_385": {
        "plotSummary": "A portrait of a patron of the arts extraordinaire who transformed a modest fortune and impeccable taste into one of the premiere collections of twentieth century art.",
        "runtimeMinutes": "96"
    },
    "2015_386": {
        "plotSummary": "The story of Amos Oz's youth, set against the backdrop of the end of the British Mandate for Palestine and the early years of the State of Israel. The film details the young man's relationship with his mother and his beginnings as a writer...See moreThe story of Amos Oz's youth, set against the backdrop of the end of the British Mandate for Palestine and the early years of the State of Israel. The film details the young man's relationship with his mother and his beginnings as a writer, while looking at what happens when the stories we tell become the stories we live.See less",
        "runtimeMinutes": "95"
    },
    "2015_387": {
        "plotSummary": "A former CIA operative is kidnapped by a group of terrorists. When his son learns there is no plan for his father to be saved, he launches his own rescue operation.",
        "runtimeMinutes": "92"
    },
    "2015_388": {
        "plotSummary": "An authorized documentary on the late musician Kurt Cobain, from his early days in Aberdeen, Washington to his success and downfall with the grunge band Nirvana.",
        "runtimeMinutes": "145"
    },
    "2015_389": {
        "plotSummary": "A married film director falls for a young painter - twice.",
        "runtimeMinutes": "121"
    },
    "2015_39": {
        "plotSummary": "The rap group NWA emerges from the mean streets of Compton in Los Angeles, California, in the mid-1980s and revolutionizes Hip Hop culture with their music and tales about life in the hood.",
        "runtimeMinutes": "147"
    },
    "2015_390": {
        "plotSummary": "An aspiring novelist enters into a relationship with a woman, though there's just one catch: She's married and the couple can only meet between the hours of 5 and 7 each evening.",
        "runtimeMinutes": "95"
    },
    "2015_391": {
        "plotSummary": "In 1971, twenty-four male students are selected to take on randomly assigned roles of prisoners and guards in a mock prison situated in the basement of the Stanford psychology building. Read more: Synopsis",
        "runtimeMinutes": "122"
    },
    "2015_392": {
        "plotSummary": "Bored in her marriage to a country doctor and stifled by life in a small town, the restless Emma Bovary pursues her dreams of passion and excitement, whatever they may cost. Read more: Synopsis",
        "runtimeMinutes": "118"
    },
    "2015_393": {
        "plotSummary": "When Alice Klieg wins the Mega-Millions lottery, she immediately quits her psychiatric meds and buys her own talk show.",
        "runtimeMinutes": "87"
    },
    "2015_394": {
        "plotSummary": "A single mother is swept into a dark underworld, while her teenage son discovers a road that leads him to a secret underwater town.",
        "runtimeMinutes": "95"
    },
    "2015_395": {
        "plotSummary": "After his family is killed by a Serbian gangster with international interests, NYC detective Nick goes to S.E. Asia and teams up with a Thai detective to get revenge and destroy the syndicates human trafficking network.",
        "runtimeMinutes": "96"
    },
    "2015_396": {
        "plotSummary": "On the slopes of an active volcano in Guatemala, a marriage is arranged for seventeen-year-old María by her Kaqchikel parents.",
        "runtimeMinutes": "93"
    },
    "2015_397": {
        "plotSummary": "This documentary tells the rise and fall of the Black Panther Party, one of the 20th century's most alluring and controversial organizations that captivated the world's attention for nearly 50 years.",
        "runtimeMinutes": "115"
    },
    "2015_398": {
        "plotSummary": "It's 1969 at a strict English girls' school where charismatic Abbie and intense and troubled Lydia are best friends. After a tragedy occurs at the school, a mysterious fainting epidemic breaks out threatening the stability of all involved. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2015_399": {
        "plotSummary": "One day, driving aimlessly around the outskirts of town after a trivial domestic quarrel, a writer named Tomas accidentally hits and kills a child. Will he be able to move on?",
        "runtimeMinutes": "118"
    },
    "2015_4": {
        "plotSummary": "When Tony Stark and Bruce Banner try to jump-start a dormant peacekeeping program called Ultron, things go horribly wrong and it's up to Earth's mightiest heroes to stop the villainous Ultron from enacting his terrible plan.",
        "runtimeMinutes": "141"
    },
    "2015_40": {
        "plotSummary": "Seventy-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
        "runtimeMinutes": "121"
    },
    "2015_400": {
        "plotSummary": "A crisis counselor is sent by the Catholic Church to a small Chilean beach town where disgraced Priests and nuns, suspected of crimes ranging from child abuse to baby-snatching from unwed mothers, live secluded, after an incident occurs.",
        "runtimeMinutes": "98"
    },
    "2015_401": {
        "plotSummary": "Jackson, the Kenyan; Carlito, the Argentinian; Zahira, the Moroccan; Samuel, the Indian: four children who live light years away from each other and who have never met but who have a common point: they have to cover tremendously long ...See moreJackson, the Kenyan; Carlito, the Argentinian; Zahira, the Moroccan; Samuel, the Indian: four children who live light years away from each other and who have never met but who have a common point: they have to cover tremendously long distances to reach their school. On foot, on horseback or in a wheelchair, but all with an extraordinary determination...  Written by Guy BellingerSee less",
        "runtimeMinutes": "77"
    },
    "2015_402": {
        "plotSummary": "The relationship of a couple who meet by chance in New York City is put to the test when they encounter a life-or-death circumstance.",
        "runtimeMinutes": "109"
    },
    "2015_403": {
        "plotSummary": "An A&R man working at the height of the Britpop music craze goes to extremes in order to find his next hit.",
        "runtimeMinutes": "103"
    },
    "2015_404": {
        "plotSummary": "A documentary that utilizes hundreds of hours of audio that Marlon Brando recorded over the course of his life to tell the screen legend's story.",
        "runtimeMinutes": "103"
    },
    "2015_405": {
        "plotSummary": "The life and love story of Argentina's famous tango dancers Maria Nieves Rego and Juan Carlos Copes, who met as teenagers and danced together for nearly fifty years until a painful separation tore them apart.",
        "runtimeMinutes": "85"
    },
    "2015_406": {
        "plotSummary": "A look at the history of delicatessens in the United States.",
        "runtimeMinutes": "92"
    },
    "2015_407": {
        "plotSummary": "A single mother finds solace with a wealthy, but lonely hotel magnate, together they find love until her past comes back to confront her.",
        "runtimeMinutes": "129"
    },
    "2015_409": {
        "plotSummary": "In Felix and Meira, an unusual romance blossoms between two lost souls who inhabit the same neighborhood but vastly different worlds.",
        "runtimeMinutes": "105"
    },
    "2015_41": {
        "plotSummary": "A young woman discovers her destiny as an heiress of intergalactic nobility and must fight to protect the inhabitants of Earth from an ancient and destructive industry.",
        "runtimeMinutes": "127"
    },
    "2015_410": {
        "plotSummary": "It's 1941 but France is trapped in the nineteenth century, governed by steam and Napoleon V, where scientists vanish mysteriously. Avril (Marion Cotillard), a teenage girl, goes in search of her missing scientist parents.",
        "runtimeMinutes": "105"
    },
    "2015_411": {
        "plotSummary": "A look at the personal and private life of the late Apple CEO, Steve Jobs.",
        "runtimeMinutes": "128"
    },
    "2015_412": {
        "plotSummary": "A mysterious virus hits an isolated elementary school, transforming the kids into a feral swarm of mass savages. An unlikely hero must lead a motley band of teachers in the fight of their lives.",
        "runtimeMinutes": "88"
    },
    "2015_413": {
        "plotSummary": "Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime.",
        "runtimeMinutes": "104"
    },
    "2015_414": {
        "plotSummary": "Set on the backdrop of Philadelphia's famed Overbrook High School, we track the lives of the nations number one high school basketball player Sergio Taylor as he deals with the early pressures of hood fame.",
        "runtimeMinutes": "89"
    },
    "2015_415": {
        "plotSummary": "Multimedia artist Laurie Anderson reflects on her relationship with her beloved terrier Lolabelle.",
        "runtimeMinutes": "75"
    },
    "2015_416": {
        "plotSummary": "The mysterious disappearance of a kindergarten teacher during a picnic in the north of Iran is followed by a series of misadventures for her fellow travelers.",
        "runtimeMinutes": "119"
    },
    "2015_417": {
        "plotSummary": "Two strangers stuck in Manhattan for the night grow into each other's most trusted confidants when an evening of unexpected adventure forces them to confront their fears and take control of their lives.",
        "runtimeMinutes": "95"
    },
    "2015_418": {
        "plotSummary": "Vincent is an ex-soldier with PTSD who is hired to protect the wife and child of a wealthy Lebanese businessman while he's out of town. Despite the apparent tranquility in Maryland, Vincent perceives an external threat.",
        "runtimeMinutes": "98"
    },
    "2015_419": {
        "plotSummary": "Left heartbroken by the woman he loved and lost many years ago, Manglehorn, an eccentric small-town locksmith, tries to start his life over again with the help of a new friend.",
        "runtimeMinutes": "97"
    },
    "2015_42": {
        "plotSummary": "The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed.",
        "runtimeMinutes": "133"
    },
    "2015_420": {
        "plotSummary": "Rosenwald, by Aviva Kempner, is a documentary about how Chicago philanthropist Julius Rosenwald, the son of an immigrant peddler who rose to head Sears, partnered with Booker T. Washington to build 5,400 Southern schools in African ...See moreRosenwald, by Aviva Kempner, is a documentary about how Chicago philanthropist Julius Rosenwald, the son of an immigrant peddler who rose to head Sears, partnered with Booker T. Washington to build 5,400 Southern schools in African American communities in the early 1900s during the Jim Crow era. Rosenwald also built YMCAs and housing for African Americans to address the pressing needs of the Great Migration. The Rosenwald Fund supported great artists like Marian Anderson, Woody Guthrie, Langston Hughes, Gordon Parks, and Jacob Lawrence. Among those interviewed are civil rights leaders Julian Bond, Ben Jealous and Congressman John Lewis, columnists Eugene Robinson and Clarence Page, Cokie Roberts, Rabbi David Saperstein, Rosenwald school alumni writer Maya Angelou and director George C. Wolfe and Rosenwald relatives.See less",
        "runtimeMinutes": "95"
    },
    "2015_421": {
        "plotSummary": "In an utopian, futuristic world, where humanity has acquired eternal life, a young high ranked agent of the world's leading health company investigates a wave of suicides.",
        "runtimeMinutes": "119"
    },
    "2015_422": {
        "plotSummary": "Down on his luck and facing financial hardship, Gerry teams up with younger charismatic poker player, Curtis, in an attempt to change his luck. The two set off on a road trip through the South with visions of winning back what's been lost.",
        "runtimeMinutes": "108"
    },
    "2015_423": {
        "plotSummary": "Ten stories are woven together by their shared theme of Halloween night in an American suburb, where ghouls, imps, aliens and axe murderers appear for one night only to terrorize unsuspecting residents.",
        "runtimeMinutes": "97"
    },
    "2015_424": {
        "plotSummary": "Inspired by real events, this is a black comedy about 20 years of history of Sicily from 1970s to 1990s, mocking Mafia Bosses and restoring the generosity of the heroes of Antimafia. It's focused on Arturo, a young boy who grows up in ...See moreInspired by real events, this is a black comedy about 20 years of history of Sicily from 1970s to 1990s, mocking Mafia Bosses and restoring the generosity of the heroes of Antimafia. It's focused on Arturo, a young boy who grows up in Palermo and tries to conquer his beloved Flora.See less",
        "runtimeMinutes": "90"
    },
    "2015_425": {
        "plotSummary": "Sixteen mustangs, four men, one dream: to ride border to border, Mexico to Canada, up the spine of the American West. The documentary tracks four fresh-out-of-college buddies as they take on wild mustangs to be their trusted mounts, and ...See moreSixteen mustangs, four men, one dream: to ride border to border, Mexico to Canada, up the spine of the American West. The documentary tracks four fresh-out-of-college buddies as they take on wild mustangs to be their trusted mounts, and set out on the adventure of a lifetime. Their wildness of spirit, in both man and horse, is quickly dwarfed by the wilderness they must navigate: a 3000-mile gauntlet that is equally indescribable and unforgiving.See less",
        "runtimeMinutes": "106"
    },
    "2015_426": {
        "plotSummary": "An innocent man turns brutal when his family gets killed in a bank robbery and one of the perpetrators escapes. 15 years later, he begins his deadly game of vengeance.",
        "runtimeMinutes": "134"
    },
    "2015_427": {
        "plotSummary": "A young woman strikes up a relationship with her ailing brother's favorite musician.",
        "runtimeMinutes": "86"
    },
    "2015_428": {
        "plotSummary": "An expose of rape crimes on U.S. college campuses, their institutional cover-ups, and the devastating toll they take on students and their families.",
        "runtimeMinutes": "103"
    },
    "2015_429": {
        "plotSummary": "Impoverished priest Harihar Ray, dreaming of a better life for himself and his family, leaves his rural Bengal village in search of work.",
        "runtimeMinutes": "125"
    },
    "2015_43": {
        "plotSummary": "Four young outsiders teleport to an alternate and dangerous universe which alters their physical form in shocking ways. The four must learn to harness their new abilities and work together to save Earth from a former friend turned enemy.",
        "runtimeMinutes": "100"
    },
    "2015_430": {
        "plotSummary": "A group of native Liberian missionaries make a desperate cross-country trip through their war torn country to save one of their own.",
        "runtimeMinutes": "113"
    },
    "2015_431": {
        "plotSummary": "Filmmakers discuss how Francois Truffaut's 1966 book \"Cinema According to Hitchcock\" influenced their work.",
        "runtimeMinutes": "79"
    },
    "2015_432": {
        "plotSummary": "In the wake of a disaster that wipes out most of civilization, two men and a young woman find themselves in an emotionally charged love triangle as the last known survivors. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2015_433": {
        "plotSummary": "The life and works of Japanese artist and ukiyo-e painter Katsushika Hokusai, as seen from the eyes of his daughter, Katsushika O-Ei.",
        "runtimeMinutes": "93"
    },
    "2015_434": {
        "plotSummary": "A man in his mid 30's reevaluates his life and priorities after he met someone from his past.",
        "runtimeMinutes": "98"
    },
    "2015_435": {
        "plotSummary": "A thriller centered on a couple who makes an old estate their new home and soon begin to see the spirits of dead children.",
        "runtimeMinutes": "95"
    },
    "2015_436": {
        "plotSummary": "An action/thriller centered on a kidnapped woman who faces down hitmen sent by a mob boss/her captor while trying to protect her family from his wrath.",
        "runtimeMinutes": "92"
    },
    "2015_437": {
        "plotSummary": "Set in early 19th century Romania, a policeman, Costandin, is hired by a nobleman to find a Gypsy slave who has run away from his estate after having an affair with his wife.",
        "runtimeMinutes": "108"
    },
    "2015_438": {
        "plotSummary": "A woman must find out about a crime she is implicated, to prove her innocence.",
        "runtimeMinutes": "93"
    },
    "2015_439": {
        "plotSummary": "From first rehearsal to world premiere, Ballet 422 takes us backstage at New York City Ballet as emerging choreographer Justin Peck crafts a new work.",
        "runtimeMinutes": "75"
    },
    "2015_44": {
        "plotSummary": "During the Cold War, an American lawyer is recruited to defend an arrested Soviet spy in court, and then help the CIA facilitate an exchange of the spy for the Soviet captured American U2 spy plane pilot, Francis Gary Powers.",
        "runtimeMinutes": "142"
    },
    "2015_440": {
        "plotSummary": "An aspiring actor with the inability to speak, joins forces with a man who has a powerful voice. Together they take the film industry by storm, but will their egos get in the way?",
        "runtimeMinutes": "155"
    },
    "2015_441": {
        "plotSummary": "This epic movie follows young shepherd David taking on the mighty warrior Goliath against all odds. Filmed in North Africa and London.",
        "runtimeMinutes": "92"
    },
    "2015_442": {
        "plotSummary": "George seeks refuge at Bellevue Hospital, a Manhattan intake center for homeless men, where his friendship with a fellow client helps him try to repair his relationship with his estranged daughter.",
        "runtimeMinutes": "120"
    },
    "2015_443": {
        "plotSummary": "A documentary that looks at pundits-for-hire who present themselves as scientific authorities as they speak about topics like toxic chemicals, pharmaceuticals and climate change.",
        "runtimeMinutes": "96"
    },
    "2015_444": {
        "plotSummary": "Monsters' reign continues to spread throughout the Earth.",
        "runtimeMinutes": "119"
    },
    "2015_445": {
        "plotSummary": "Two young friends embark on a road trip across France in a vehicle they built themselves.",
        "runtimeMinutes": "105"
    },
    "2015_446": {
        "plotSummary": "On their way to a weekend retreat, a married couple find their dream vacation turn into a nightmare when they cross paths with a dangerous gang.",
        "runtimeMinutes": "115"
    },
    "2015_447": {
        "plotSummary": "Alicia, a designer for a haute couture fashion house, lacks inspiration to create a new collection after a bitter breakup. To save the show, her bitter director quickly comes up with a solution to restore Alicia's creative powers.",
        "runtimeMinutes": "103"
    },
    "2015_448": {
        "plotSummary": "A young man's political awakening and coming of age during the days and weeks leading up to the Stonewall Riots.",
        "runtimeMinutes": "129"
    },
    "2015_449": {
        "plotSummary": "A struggling actress and her novelist lover each illustrate the struggle and deconstruction of their love affair.",
        "runtimeMinutes": "94"
    },
    "2015_45": {
        "plotSummary": "In the midst of veteran con man Nicky's latest scheme, a woman from his past - now an accomplished femme fatale - shows up and throws his plans for a loop.",
        "runtimeMinutes": "105"
    },
    "2015_450": {
        "plotSummary": "Daryl Graham (Lamman Rucker) has just moved into a Jamaica, Queens, apartment building and his neighbors, both male and female alike, can't stop talking about him. From his extreme attractiveness to his undeniable swag, Daryl is the man ...See moreDaryl Graham (Lamman Rucker) has just moved into a Jamaica, Queens, apartment building and his neighbors, both male and female alike, can't stop talking about him. From his extreme attractiveness to his undeniable swag, Daryl is the man every woman wants and every man wants to be. Connie(Brely Evans), an unhappy wife, turns to Daryl for help losing weight, hoping to fix her marriage. But when Daryl starts making Connie feel beautiful again, she questions whether her marriage is worth saving. Benny (Robert Ri\"chard), a spoiled teenager raised by a single father, looks up to Daryl. When an unexpected event occurs, Benny is left questioning everything he's ever known to be true. Krystal (Nafessa Williams), Daryl's first love, wants to make things work with her current boyfriend. Yet having Daryl back in her life sends her happy home spiraling out of control. And Avery (Anthony Montgomery ), Connie's husband, doesn't care about anything or anyone when a financial opportunity comes his way-that is, until he notices how much time his wife is spending with their new neighbor. Everything seems to be going well, until someone is murdered, and everyone becomes a prime suspect.  Written by Petey WarsawSee less",
        "runtimeMinutes": "93"
    },
    "2015_451": {
        "plotSummary": "In 1948, a group of World War II pilots volunteered to fight for Israel in the War of Independence. As members of 'Machal' -- volunteers from abroad -- this ragtag band of brothers not only turned the tide of the war, preventing the ...See moreIn 1948, a group of World War II pilots volunteered to fight for Israel in the War of Independence. As members of 'Machal' -- volunteers from abroad -- this ragtag band of brothers not only turned the tide of the war, preventing the possible annihilation of Israel at the very moment of its birth; they also laid the groundwork for the Israeli Air Force. ABOVE AND BEYOND is their story. The first major feature-length documentary about the foreign airmen in the War of Independence, ABOVE AND BEYOND brings together new interviews with pilots from the '48 War, as well as leading scholars and statesmen, including Shimon Peres, to present an extraordinary, little-known tale with reverberations up to the present day.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2015_452": {
        "plotSummary": "A struggling mother encounters the son she abandoned 20 years earlier.",
        "runtimeMinutes": "112"
    },
    "2015_453": {
        "plotSummary": "A superstar musician falls in love with his manager and struggles to choose between his career and true love.",
        "runtimeMinutes": "98"
    },
    "2015_454": {
        "plotSummary": "Caught in the middle of a lethal unrequited love, an athlete protects a young woman from an unwanted marriage.",
        "runtimeMinutes": "157"
    },
    "2015_455": {
        "plotSummary": "A devoted husband in a marriage of convenience is forced to confront his secret life.",
        "runtimeMinutes": "88"
    },
    "2015_456": {
        "plotSummary": "During the 1980s Carter High School in Dallas, Texas was a football powerhouse. This is the story of four of the student athletes whose off the field activities cost them their future. Read more: Synopsis",
        "runtimeMinutes": "110"
    },
    "2015_457": {
        "plotSummary": "After a young fashion designer runs afoul of her corrupt stepmother and stepsisters, she dons a disguise to help save the family business for her father.",
        "runtimeMinutes": "101"
    },
    "2015_458": {
        "plotSummary": "In 1961, famed social psychologist Stanley Milgram conducted a series of radical behavior experiments that tested ordinary humans' willingness to obey authority.",
        "runtimeMinutes": "98"
    },
    "2015_459": {
        "plotSummary": "A super-powered boy helps a wheelchair-bound policeman in his attempt to bring down a mob kingpin.",
        "runtimeMinutes": "84"
    },
    "2015_46": {
        "plotSummary": "A teenager teams up with the daughter of young adult horror author R. L. Stine after the writer's imaginary demons are set free on the town of Madison, Delaware.",
        "runtimeMinutes": "103"
    },
    "2015_460": {
        "plotSummary": "A night club promoter tries to make a name for himself in New York City.",
        "runtimeMinutes": "87"
    },
    "2015_461": {
        "plotSummary": "A deaf boy joins a boarding school for similar children. Confronted by the violent and criminal antics of some of the other boys and girls, he struggles to conform and join the 'tribe'.",
        "runtimeMinutes": "126"
    },
    "2015_462": {
        "plotSummary": "A captivating look behind the scenes of the remarkable life of a young Swedish girl who became one of the most celebrated actresses of American and World cinema.",
        "runtimeMinutes": "114"
    },
    "2015_463": {
        "plotSummary": "Life for a struggling college student changes in an instant when he meets the owner of a male strip club who convinces him to give amateur night a whirl.",
        "runtimeMinutes": "91"
    },
    "2015_464": {
        "plotSummary": "A woman who studies butterflies and moths tests the limits of her relationship with her lesbian lover.",
        "runtimeMinutes": "104"
    },
    "2015_465": {
        "plotSummary": "A documentary that reveals how the unlikely partnership between aspiring filmmakers Christopher Stamp and Kit Lambert produced one of the greatest rock bands in history: The Who.",
        "runtimeMinutes": "117"
    },
    "2015_466": {
        "plotSummary": "The life and career of the renowned stage magician turned scientific skeptic of the paranormal, James Randi.",
        "runtimeMinutes": "90"
    },
    "2015_467": {
        "plotSummary": "Two distraught mothers, whose children were gunned down in a drive-by, team up to avenge their deaths after local authorities fail to take action.",
        "runtimeMinutes": "94"
    },
    "2015_468": {
        "plotSummary": "Will Henry is a newly single graphic novelist balancing parenting his young twin daughters and a classroom full of students while exploring and navigating the rich complexities of new love and letting go of the woman who left him.",
        "runtimeMinutes": "85"
    },
    "2015_469": {
        "plotSummary": "'All Things Must Pass' is a documentary that explores the rise and fall of Tower Records, and its legacy forged by its rebellious founder, Russ Solomon.",
        "runtimeMinutes": "94"
    },
    "2015_47": {
        "plotSummary": "When a band of brutal gangsters led by a crooked property developer make a play to take over a local school, Master Ip is forced to take a stand.",
        "runtimeMinutes": "105"
    },
    "2015_470": {
        "plotSummary": "Hilarity, romance, and transcendence prevail after a power outage traps six different groups of New Yorkers inside elevators on Christmas Eve.",
        "runtimeMinutes": "95"
    },
    "2015_471": {
        "plotSummary": "A family that survived the genocide in Indonesia confronts the men who killed one of their brothers.",
        "runtimeMinutes": "103"
    },
    "2015_472": {
        "plotSummary": "Two best friends set out to rescue their pal after he's accidentally dragged to hell.",
        "runtimeMinutes": "86"
    },
    "2015_473": {
        "plotSummary": "In this sequel to Hope and Glory, Bill Rohan has grown up and is drafted into the army, where he and his eccentric best mate, Percy, battle their snooty superiors on the base and look for love in town.",
        "runtimeMinutes": "114"
    },
    "2015_474": {
        "plotSummary": "A little boy goes on an adventurous quest in search of his father.",
        "runtimeMinutes": "80"
    },
    "2015_475": {
        "plotSummary": "A behind-the-scenes look at the popular boy band Backstreet Boys.",
        "runtimeMinutes": "101"
    },
    "2015_476": {
        "plotSummary": "Pierre and Manon are a pair of poor documentary makers, who scrape by with odd jobs. When Pierre meets young trainee Elisabeth, he falls for her, but wants to keep Manon at the same time. But the new girl in his life finds out that Manon ...See morePierre and Manon are a pair of poor documentary makers, who scrape by with odd jobs. When Pierre meets young trainee Elisabeth, he falls for her, but wants to keep Manon at the same time. But the new girl in his life finds out that Manon has a lover. When she tells Pierre, the time comes for difficult decisions all round.See less",
        "runtimeMinutes": "73"
    },
    "2015_477": {
        "plotSummary": "With an older brother in jail and living with their single mother on Pine Ridge Reservation, Johnny and his sister Jashuan's lives develop new challenges when their absentee cowboy father suddenly dies. The loss prompts Johnny to strike ...See moreWith an older brother in jail and living with their single mother on Pine Ridge Reservation, Johnny and his sister Jashuan's lives develop new challenges when their absentee cowboy father suddenly dies. The loss prompts Johnny to strike out for Los Angeles, but would mean leaving behind his beloved sister.  Written by Red HaircrowSee less",
        "runtimeMinutes": "98"
    },
    "2015_478": {
        "plotSummary": "Yellow Day chronicles a young man's life-changing and inspirational journey through the mysterious Yellow Day. To many, the Yellow Day is simply a fun day celebrating outreach at a kid's camp, but to some, God bestows visions and miracles,...See moreYellow Day chronicles a young man's life-changing and inspirational journey through the mysterious Yellow Day. To many, the Yellow Day is simply a fun day celebrating outreach at a kid's camp, but to some, God bestows visions and miracles, transforming their lives. For this young man, the Yellow Day becomes an imaginative adventure: showing him true heroes, challenging him to face his fears, find love, and inviting him to accept grace, so that he can be shaped into who he is meant to be. On this day, the young man is presented remarkable stories in Faith, Hope, and Love coming from true stories of real life heroes in the special needs, chronic illness, and domestic abuse communities at the extraordinary Camp Grace, a beautiful retreat with the motto: \"Lives are changed and souls are strengthened.\" Guided by a friendly 10-year-old girl, his spiritual journey back to the light, to witness the triumphs of others, face his fears, and fulfill his destiny, will test the strength of both his faith and his courage.  Written by Yellow DaySee less",
        "runtimeMinutes": "98"
    },
    "2015_479": {
        "plotSummary": "A small-town sheriff sets out to find the two kids who have taken his car on a joy ride.",
        "runtimeMinutes": "88"
    },
    "2015_48": {
        "plotSummary": "In the dead of a Wyoming winter, a bounty hunter and his prisoner find shelter in a cabin currently inhabited by a collection of nefarious characters.",
        "runtimeMinutes": "168"
    },
    "2015_480": {
        "plotSummary": "At the height of his career, Alexandre decides to set off for Italy with the idea of completing of a book on Borromini. Along with his wife Alienor feels her relationship with Alexandre is gradually slipping away. Along the way they meet ...See moreAt the height of his career, Alexandre decides to set off for Italy with the idea of completing of a book on Borromini. Along with his wife Alienor feels her relationship with Alexandre is gradually slipping away. Along the way they meet siblings Goffredo and Lavinia. Gofffredo is about to embark in architectural studies. A story of rediscover the joys of life and overcoming anxiety.  Written by TVSee less",
        "runtimeMinutes": "101"
    },
    "2015_481": {
        "plotSummary": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby.",
        "runtimeMinutes": "86"
    },
    "2015_482": {
        "plotSummary": "Through the eyes, words, and songs of its popular music stars of the 50s, 60s, and 70s, 'Don't Think I've Forgotten: Cambodia's Lost Rock & Roll' examines and unravels Cambodia's tragic past, culminating in the genocidal Khmer Rouge's ...See moreThrough the eyes, words, and songs of its popular music stars of the 50s, 60s, and 70s, 'Don't Think I've Forgotten: Cambodia's Lost Rock & Roll' examines and unravels Cambodia's tragic past, culminating in the genocidal Khmer Rouge's dismantling of the society and murder of two million of its citizens. Combining interviews of the surviving Cambodian musicians themselves (a total of 150 hours of interviews were filmed) with never-before-seen archival material and rare songs, this documentary tracks the twists and turns of Cambodian music as it morphs into rock and roll, blossoms, and is nearly destroyed along with the rest of the country.  Written by AnonymousSee less",
        "runtimeMinutes": "105"
    },
    "2015_483": {
        "plotSummary": "A feature documentary on African American ballerina Misty Copeland that examines her prodigious rise, her potentially career ending injury alongside themes of race and body image in the elite ballet world. Read more: Synopsis",
        "runtimeMinutes": "85"
    },
    "2015_484": {
        "plotSummary": "A detective looks to unravel a mystery surrounding missing children and the prime suspects: two young women who, seven years ago, were put away for an infant's death.",
        "runtimeMinutes": "93"
    },
    "2015_485": {
        "plotSummary": "An aristocratic brother and sister embrace passion and hope as they flee from society. A story of desire, love and death beyond all morality.",
        "runtimeMinutes": "105"
    },
    "2015_486": {
        "plotSummary": "Shirin is struggling to become an ideal Persian daughter, politically correct bisexual and hip young Brooklynite but fails miserably in her attempt at all identities. Being without a cliche to hold onto can be a lonely experience.",
        "runtimeMinutes": "86"
    },
    "2015_487": {
        "plotSummary": "High-school student Ed Wallis enters into a friendship with his neighbor, Ashby, a retired CIA assassin who only has a few months left to live.",
        "runtimeMinutes": "100"
    },
    "2015_488": {
        "plotSummary": "A documentary about the stereotype of the gay voice.",
        "runtimeMinutes": "77"
    },
    "2015_489": {
        "plotSummary": "Jackson Heights, Queens is one of the most culturally diverse communities in the US where 167 languages are spoken. IN JACKSON HEIGHTS explores the conflict between maintaining ties to old traditions and adapting to American values.",
        "runtimeMinutes": "190"
    },
    "2015_49": {
        "plotSummary": "Mortal hero Bek teams with the god Horus in an alliance against Set, the merciless god of darkness, who has usurped Egypt's throne, plunging the once peaceful and prosperous empire into chaos and conflict.",
        "runtimeMinutes": "127"
    },
    "2015_490": {
        "plotSummary": "Delving into the nearly-religious significance of water, this profound rumination on memory and loss bridges the gap between its mystical origins, Pinochet's coup d'etat, and the secret of a mother-of-pearl button at the bottom of the sea.",
        "runtimeMinutes": "82"
    },
    "2015_491": {
        "plotSummary": "The discovery of a bone and a gun send a husband and wife on separate adventures over the course of a weekend.",
        "runtimeMinutes": "85"
    },
    "2015_492": {
        "plotSummary": "While on a mission in Afghanistan, French captain Antarès Bonassieu's men start vanishing one by one without explanation.",
        "runtimeMinutes": "100"
    },
    "2015_493": {
        "plotSummary": "A group of young misfits called The Goonies discover an ancient map and set out on an adventure to find a legendary pirate's long-lost treasure.",
        "runtimeMinutes": "114"
    },
    "2015_494": {
        "plotSummary": "Following an expensive divorce and the cancellation of his TV show, a stand-up comic is forced to go back on the road to provide for his daughter.",
        "runtimeMinutes": "98"
    },
    "2015_495": {
        "plotSummary": "Exactly 100 years after the Armenian Genocide, a theatre director stages a play to bring the ghosts of the past back to life.",
        "runtimeMinutes": "82"
    },
    "2015_496": {
        "plotSummary": "A family finds their dull life in a rural outback town rocked after their two teenage children disappear into the desert, sparking disturbing rumors of their past.",
        "runtimeMinutes": "112"
    },
    "2015_497": {
        "plotSummary": "A naturalist living with big cats in East Africa expects a visit by his family of four from Chicago. A mix-up leaves him searching for his family, who have been left in the clutches of wild lions.",
        "runtimeMinutes": "102"
    },
    "2015_498": {
        "plotSummary": "A bankrupt businessman tries to restore good relations with his sister and her family.",
        "runtimeMinutes": "92"
    },
    "2015_499": {
        "plotSummary": "Years after declaring her eternal virginity and opting to live life as a man in the mountains of Albania, Hana looks to return to living as a woman as she settles into a new existence in modern-day Milan.",
        "runtimeMinutes": "84"
    },
    "2015_5": {
        "plotSummary": "Minions Stuart, Kevin, and Bob are recruited by Scarlet Overkill, a supervillain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
        "runtimeMinutes": "91"
    },
    "2015_50": {
        "plotSummary": "The last witch hunter is all that stands between humanity and the combined forces of the most horrifying witches in history.",
        "runtimeMinutes": "106"
    },
    "2015_500": {
        "plotSummary": "A melancholy poet reflects on three women he loved and lost in the past: a mechanical performing doll, a Venetian courtesan, and the consumptive daughter of a celebrated composer.",
        "runtimeMinutes": "133"
    },
    "2015_501": {
        "plotSummary": "Two mismatched personal trainers' lives are upended by the actions of a new, wealthy client.",
        "runtimeMinutes": "105"
    },
    "2015_502": {
        "plotSummary": "Professional hit-man Charlie Wolfe finds himself in three tales of murder, blackmail and revenge after a botched contract assignment. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2015_503": {
        "plotSummary": "A look at the global culture and appeal of the LEGO building-block toys.",
        "runtimeMinutes": "93"
    },
    "2015_504": {
        "plotSummary": "A mystery outside of San Francisco brings together small-town sheriff Paul Del Moral, Japanese author Aki Akahori, and a traveler from Reno who soon disappears, leaving behind his suitcase and a trail of questions.",
        "runtimeMinutes": "111"
    },
    "2015_505": {
        "plotSummary": "James, a twenty-something New Yorker, struggles to take control of his self-destructive behavior in the face of momentous family challenges.",
        "runtimeMinutes": "85"
    },
    "2015_506": {
        "plotSummary": "A group of soldiers in a small town on the Mekong River in northern Thailand are struck with a bizarre sleeping illness.",
        "runtimeMinutes": "122"
    },
    "2015_507": {
        "plotSummary": "When John returns home to his father after serving time in prison, he is looking forward to starting his life afresh. However, in the local community his crime is neither forgotten nor forgiven.",
        "runtimeMinutes": "102"
    },
    "2015_508": {
        "plotSummary": "A young lawyer travels to an Ethiopian village to represent Hirut, a 14-year-old girl who shot her would-be husband as he and others were practicing one of the nation's oldest traditions: abduction into marriage.",
        "runtimeMinutes": "99"
    },
    "2015_509": {
        "plotSummary": "A heart-racing documentary portrait of Carl Boenish, the father of the BASE jumping movement, whose early passion for skydiving led him to ever more spectacular -and dangerous- feats of foot-launched human flight.",
        "runtimeMinutes": "101"
    },
    "2015_51": {
        "plotSummary": "Having thought that monogamy was never possible, a commitment-phobic career woman may have to face her fears when she meets a good guy.",
        "runtimeMinutes": "125"
    },
    "2015_510": {
        "plotSummary": "Les Blank's first feature-length documentary captures music and other events at Leon Russell's Oklahoma recording studio during a three-year period (1972-1974).",
        "runtimeMinutes": "90"
    },
    "2015_511": {
        "plotSummary": "Two women who grew up together discover they have drifted apart when they retreat to a lake house together.",
        "runtimeMinutes": "90"
    },
    "2015_512": {
        "plotSummary": "A Native American Veteran, burdened by survivor's guilt after a disastrous military tour, is forced to search for his missing grandfather after his ancestral land is mysteriously taken over by an unknown federal organization. Read more: Synopsis",
        "runtimeMinutes": "85"
    },
    "2015_513": {
        "plotSummary": "A drama based on the experiences of Agu, a child soldier fighting in the civil war of an unnamed African country.",
        "runtimeMinutes": "137"
    },
    "2015_514": {
        "plotSummary": "An inspirational true story of a group of friends from a working men's club who decide to take on the elite 'sport of kings' and breed themselves a racehorse",
        "runtimeMinutes": "85"
    },
    "2015_515": {
        "plotSummary": "Three different men, three different worlds, three different wars - all stand at the intersection of modern warfare - a murky world of fluid morality where all is not as it seems.",
        "runtimeMinutes": "120"
    },
    "2015_516": {
        "plotSummary": "Tomas is too much for his lone mother so she sends him to live with his older brother Federico, aka Sombra, in Mexico City.",
        "runtimeMinutes": "106"
    },
    "2015_517": {
        "plotSummary": "The story of matinee idol Tab Hunter from teenage stable boy to closeted Hollywood star of the 1950s.",
        "runtimeMinutes": "90"
    },
    "2015_518": {
        "plotSummary": "A young woman struggles to reconcile her love for her boyfriend and for heroin, as she finds out that suicide is the only way for her boyfriend to forgive her for her misdeed.",
        "runtimeMinutes": "97"
    },
    "2015_519": {
        "plotSummary": "A single mother, and her children, are awoken nightly by an intense presence. She asks her scientist boyfriend to destroy the violent spirit, that paranormal experts are too frightened to take on.",
        "runtimeMinutes": "86"
    },
    "2015_52": {
        "plotSummary": "A well respected man residing in what's left of old-Beijing attempts to exonerate his son from his wrongdoings with his own methods and beliefs.",
        "runtimeMinutes": "134"
    },
    "2015_520": {
        "plotSummary": "A guy gets more than he bargained for after entering into an affair with the wife of an investment banker. Soon, a suspicious death and substantial life insurance policy embroil him in a scandal.",
        "runtimeMinutes": "91"
    },
    "2015_521": {
        "plotSummary": "Set in the world of New York publishing, a young book editor is forced to confront a troubling chapter from her past when a bestselling author re-enters her life.",
        "runtimeMinutes": "86"
    },
    "2015_522": {
        "plotSummary": "A close-knit trio navigates the idea of creating life, while at the same time being confronted with a brutal scenario.",
        "runtimeMinutes": "101"
    },
    "2015_523": {
        "plotSummary": "After recovering from a devastating sickness that brought him to the edge of despair, Eric Gladen would quit his career, move into an RV, and travel the country for years trying to piece together one of the biggest childhood epidemics of ...See moreAfter recovering from a devastating sickness that brought him to the edge of despair, Eric Gladen would quit his career, move into an RV, and travel the country for years trying to piece together one of the biggest childhood epidemics of all time...and he just may have done it.  Written by AnonymousSee less",
        "runtimeMinutes": "97"
    },
    "2015_524": {
        "plotSummary": "A young singer struggles with his sexuality and the treatment of others while coming of age in a small Southern Baptist community. Read more: Synopsis",
        "runtimeMinutes": "99"
    },
    "2015_525": {
        "plotSummary": "A fishing trip in the Aegean Sea among a sextet of friends becomes the perfect setting for a relentless contest of male dominance. Everything can spark a fierce competition; but, only one can wear the precious chevalier. Who will it be?",
        "runtimeMinutes": "105"
    },
    "2015_526": {
        "plotSummary": "A documentary about the fascinating and complicated process of the rebuilding of Holland's most famous museum, The Rijksmuseum. The film shows the people behind the scenes during the years of demolition, restoration, and political and ...See moreA documentary about the fascinating and complicated process of the rebuilding of Holland's most famous museum, The Rijksmuseum. The film shows the people behind the scenes during the years of demolition, restoration, and political and financial debate. We witness their efforts, joys and struggles with one goal in common: the love of art.  Written by AnonymousSee less",
        "runtimeMinutes": "120"
    },
    "2015_527": {
        "plotSummary": "On one day, in one city, the world comes together to grant one 5 year old cancer patient his wish. Batkid Begins looks at the 'why' of this flash phenomenon.",
        "runtimeMinutes": "87"
    },
    "2015_528": {
        "plotSummary": "Left without men in the dying days of the American Civil War, three women must fight to defend their home and themselves from two rogue soldiers who have broken off from the fast-approaching Union Army.",
        "runtimeMinutes": "95"
    },
    "2015_529": {
        "plotSummary": "A rag tag unit of misfits known as the War Pigs must go behind enemy lines to exterminate Nazis by any means necessary.",
        "runtimeMinutes": "91"
    },
    "2015_53": {
        "plotSummary": "A young FBI agent infiltrates an extraordinary team of extreme sports athletes he suspects of masterminding a string of unprecedented, sophisticated corporate heists.",
        "runtimeMinutes": "114"
    },
    "2015_530": {
        "plotSummary": "Alexander, a boy who has been raised in a sequestered commune, finds that his increasing unwillingness to fall in line puts him on a collision course with Gregori, the society's charismatic and domineering leader. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2015_531": {
        "plotSummary": "Lynn is the most thorough chambermaid at the hotel where she works. Crippled by her own shyness, she rummages through the guests' belongings and even hides under their beds, vicariously experiencing their discreet interludes. When she ...See moreLynn is the most thorough chambermaid at the hotel where she works. Crippled by her own shyness, she rummages through the guests' belongings and even hides under their beds, vicariously experiencing their discreet interludes. When she finds herself present during a session with the call girl Chiara, Lynn can't help but let her curiosity get the better of her. Bold and unrestrained, Chiara soon draws Lynn out of her shell, opening her up to a new intimacy Lynn had previously only experienced as an intrepid voyeur.See less",
        "runtimeMinutes": "90"
    },
    "2015_532": {
        "plotSummary": "In the town of Dillford, humans, vampires and zombies were all living in peace - until the alien apocalypse arrived. Now three teenagers - one human, one vampire, and one zombie - have to team up to figure out how to get rid of the visitors.",
        "runtimeMinutes": "92"
    },
    "2015_533": {
        "plotSummary": "Ernie, Julia, and Max accidentally start a time-machine and find themselves back in time 65 million years, where they are adopted by a doting dinosaur mom and a rambunctious dinosaur brother while, back in the present day, their parents plot their rescue.",
        "runtimeMinutes": "86"
    },
    "2015_534": {
        "plotSummary": "After winning a Best Restaurant In The World award in 2010, 2011, 2012, and 2014, chef Rene Redzepi discusses his Copenhagen restaurant Noma and how his culinary philosophy has shaped its success.",
        "runtimeMinutes": "100"
    },
    "2015_535": {
        "plotSummary": "Caroll Spinney has been Sesame Street's Big Bird and Oscar the Grouch since 1969; at 78-years-old, he has no intention of stopping.",
        "runtimeMinutes": "86"
    },
    "2015_536": {
        "plotSummary": "The Messenger is an artful investigation into the causes of songbird mass depletion and the people working to turn the tide. This visually thrilling film reveals how the issues facing birds also pose daunting implications for our planet.",
        "runtimeMinutes": "89"
    },
    "2015_537": {
        "plotSummary": "In a post-apocalyptic wasteland in 1997, a comic book fan adopts the persona of his favourite hero to save his enthusiastic friend and fight a tyrannical overlord.",
        "runtimeMinutes": "93"
    },
    "2015_538": {
        "plotSummary": "In a small Bulgarian town Nadezhda, a young teacher, is looking for the robber in her class so she can teach him a lesson about right and wrong. But when she gets in debt to loan sharks, can she find the right way out herself?",
        "runtimeMinutes": "111"
    },
    "2015_539": {
        "plotSummary": "Paulette lives alone in a housing project in the Paris suburbs. With her meager pension, she can no longer make ends meet.",
        "runtimeMinutes": "87"
    },
    "2015_54": {
        "plotSummary": "In 2006-2007 a group of investors bet against the US mortgage market. In their research they discover how flawed and corrupt the market is.",
        "runtimeMinutes": "130"
    },
    "2015_540": {
        "plotSummary": "Addicted to drugs and alcohol, a housewife's self-destructive behavior starts to take its toll on her husband and two young children.",
        "runtimeMinutes": "85"
    },
    "2015_541": {
        "plotSummary": "A look at the history of the American comedy publication and production company, National Lampoon, from its beginning in the 1970s to 2010, featuring rare and never-before-seen footage.",
        "runtimeMinutes": "98"
    },
    "2015_542": {
        "plotSummary": "A look at the life the dark surrealist Swiss artist, H.R.Giger shot a year before his death.",
        "runtimeMinutes": "95"
    },
    "2015_543": {
        "plotSummary": "Four men plan a technically perfect crime, but the human element intervenes...",
        "runtimeMinutes": "118"
    },
    "2015_544": {
        "plotSummary": "When an aging activist is arrested, the lives of the accused, the lawyers, and the judge intertwine to reveal bigotry that underscores the judicial system.",
        "runtimeMinutes": "116"
    },
    "2015_545": {
        "plotSummary": "En route to meet his estranged daughter and attempting to revive his dwindling career, a broken, middle-aged comedian plays a string of dead-end shows in the Mojave desert.",
        "runtimeMinutes": "103"
    },
    "2015_546": {
        "plotSummary": "A human-rights lawyer conducts conversations with two men whose fathers were indicted as war criminals for their roles in WWII - Nazi Governors and consultants to Adolf Hitler himself.",
        "runtimeMinutes": "96"
    },
    "2015_547": {
        "plotSummary": "Who was General Tso, and why are we eating his chicken? This feature documentary explores the origins and ubiquity of Chinese-American food through the story of an iconic sweet and spicy chicken dish.",
        "runtimeMinutes": "71"
    },
    "2015_548": {
        "plotSummary": "17 years old Sangaile is fascinated by stunt planes. She meets a girl her age at a summer aeronautical show. Sangaile allows Auste to discover her most intimate secret and in the process finds the only person that truly encourages her to fly. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2015_549": {
        "plotSummary": "Narrated by Liam Neeson, Love Thy Nature points to how deeply we've lost touch with nature, and takes viewers on a cinematic journey through the beauty and intimacy of our relationship with the natural world. The film shows that a renewed ...See moreNarrated by Liam Neeson, Love Thy Nature points to how deeply we've lost touch with nature, and takes viewers on a cinematic journey through the beauty and intimacy of our relationship with the natural world. The film shows that a renewed connection with nature is key both to good health and to solving our environmental and climate crises.  Written by Sylvie RokabSee less",
        "runtimeMinutes": "76"
    },
    "2015_55": {
        "plotSummary": "Twelve-year-old orphan Peter is spirited away to the magical world of Neverland, where he finds both fun and danger, and ultimately discovers his destiny -- to become the hero who will be for ever known as Peter Pan.",
        "runtimeMinutes": "111"
    },
    "2015_550": {
        "plotSummary": "This short documentary film reveals the inner workings of the Brothers' studio.",
        "runtimeMinutes": "8"
    },
    "2015_551": {
        "plotSummary": "Comedy troupe The Yes Men stage phony events and press releases in an effort to bring attention to environmental dangers and corporate greed.",
        "runtimeMinutes": "91"
    },
    "2015_552": {
        "plotSummary": "A young man in a personal tailspin flees from US to Italy, where he sparks up a romance with a woman harboring a dark, primordial secret. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2015_553": {
        "plotSummary": "A detective investigating his best friend uncovers an assassin hunting through Las Vegas's power elite.",
        "runtimeMinutes": "91"
    },
    "2015_554": {
        "plotSummary": "Meet the dirtiest cop in NYC history. Michael Dowd stole money and dealt drugs while patrolling the streets of 80s Brooklyn.",
        "runtimeMinutes": "104"
    },
    "2015_555": {
        "plotSummary": "In this non-linear amalgamation, submarine crewmen and a woodsman wend their way through a voyage of odd experiences.",
        "runtimeMinutes": "130"
    },
    "2015_556": {
        "plotSummary": "A '40s period piece which revolves around an American expat who returns to Shanghai in the months before Pearl Harbor due to the death of his friend.",
        "runtimeMinutes": "105"
    },
    "2015_557": {
        "plotSummary": "Two men make the dangerous journey from Africa to Italy for a better life, but then face hostility and violence in this shocking look at the life-and-death struggle of refugees.",
        "runtimeMinutes": "107"
    },
    "2015_558": {
        "plotSummary": "Luc, an architect and married man from Quebec, begins an extramarital affair with Lindsay while on a business trip to Toronto.",
        "runtimeMinutes": "102"
    },
    "2015_559": {
        "plotSummary": "In 2007, Matthew Barney and Jonathan Bepler began a new collaborative project inspired by American author Norman Mailer's 1983 novel Ancient Evenings, set in pharaonic Egypt. The project was conceived as a nontraditional opera with a ...See moreIn 2007, Matthew Barney and Jonathan Bepler began a new collaborative project inspired by American author Norman Mailer's 1983 novel Ancient Evenings, set in pharaonic Egypt. The project was conceived as a nontraditional opera with a series of one-time-only live acts performed across the American landscape. The film River of Fundament combines documentation of these three live acts with scenes set in a reconstruction of Norman Mailer's brownstone apartment in Brooklyn Heights. Barney and Bepler's script reimagines Mailer as his own protagonist who reincarnates three times in three different bodies by magically entering the womb of his wife Hathfertiti. With each incarnation the undead Norman emerges from a river of feces that runs beneath his Brooklyn Heights apartment and enters his own wake. Imagined as a memorial gathering attended by figures in the New York literary world, the wake takes place inside the Mailer apartment as it is ferried down the river. Guests eulogize Mailer and offer condolences to his widow. As the evening wears on, the wake gives way to a scene of carousing and revelry, in which characters from Ancient Evenings play out their incestuous struggles for power and their insatiable appetite for pleasure as the music gains momentum. Each incarnation of Norman joins the wake for a time, haunting the guests and challenging the ancient undead figures of gods and demigods. He endures two rebirths but fails to be reborn a third time, thus ending his attempt to ascend to a higher, more powerful state. The powerful pharaoh Usermare evokes the spirit of Ernest Hemingway and engages Norman's three incarnations in a struggle for dominance. In a parallel narrative, River of Fundament replaces the body of Norman with the body of an automobile in the American landscape. The automobiles' story begins with REN, a live performance staged at a car dealership in south Los Angeles. A 1967 Chrysler Crown Imperial undergoes its first death and is prepared for rebirth as a 1979 Pontiac Firebird Trans Am. The second performance, KHU, unfolds along the River Rouge and Detroit River. KHU brings the Chrysler back to its birthplace Detroit, where it is dismembered and melted in five monumental furnaces. BA, the final live act, takes place at locations along New York City's East River, culminating in a battle at a dry dock in the Brooklyn Navy Yard. At the conclusion of BA, the automobile is further transformed into the 2001 Ford Crown Victoria.  Written by Mike BellonSee less",
        "runtimeMinutes": "319"
    },
    "2015_56": {
        "plotSummary": "After being rejected from the police college, a mannerly man travels to Bangkok where he and an energetic distant relative must solve a murder case.",
        "runtimeMinutes": "136"
    },
    "2015_560": {
        "plotSummary": "Jenny's parents and siblings are always trying to set her up with a man when she visits them. What they don't know is that she's already met the right person, her \"roommate\" Kitty, 5 years ago and she wants to marry her and start a family.",
        "runtimeMinutes": "94"
    },
    "2015_561": {
        "plotSummary": "A look at a frightening condition that plagues thousands; sleep paralysis.",
        "runtimeMinutes": "91"
    },
    "2015_562": {
        "plotSummary": "A young man with Tourette's Syndrome embarks on a road trip with his recently-deceased mother's ashes.",
        "runtimeMinutes": "100"
    },
    "2015_563": {
        "plotSummary": "The 1967 'Six-Day' war ended with Israel's decisive victory; conquering Jerusalem, Gaza, Sinai and the West Bank. It is a war portrayed, to this day, as a righteous undertaking - a radiant emblem of Jewish pride. One week after the war, a ...See moreThe 1967 'Six-Day' war ended with Israel's decisive victory; conquering Jerusalem, Gaza, Sinai and the West Bank. It is a war portrayed, to this day, as a righteous undertaking - a radiant emblem of Jewish pride. One week after the war, a group of young kibbutzniks, led by renowned author Amos Oz, recorded intimate conversations with soldiers returning from the battlefield. The recording revealed an honest look at the moment Israel turned from David to Goliath. The Israeli army censored the recordings, allowing the kibbutzniks to publish only a fragment of the conversations. 'Censored Voices' reveals the original recordings for the first time.  Written by AnonymousSee less",
        "runtimeMinutes": "84"
    },
    "2015_564": {
        "plotSummary": "STEVE MCQUEEN: THE MAN and LE MANS is the story of obsession, betrayal and ultimate vindication. It is the story of how one of the most volatile, charismatic stars of his generation, who seemingly lost so much he held dear in the pursuit ...See moreSTEVE MCQUEEN: THE MAN and LE MANS is the story of obsession, betrayal and ultimate vindication. It is the story of how one of the most volatile, charismatic stars of his generation, who seemingly lost so much he held dear in the pursuit of his dream, nevertheless followed it to the end.See less",
        "runtimeMinutes": "102"
    },
    "2015_565": {
        "plotSummary": "When Warren Jeffs rose to Prophet of the Fundamentalist Church of Latter Day Saints, he took control of a religion with a history of polygamous and underage marriage. In a short time, Warren managed to expand these practices and the power ...See moreWhen Warren Jeffs rose to Prophet of the Fundamentalist Church of Latter Day Saints, he took control of a religion with a history of polygamous and underage marriage. In a short time, Warren managed to expand these practices and the power of his position in unprecedented ways. He bridged the gap between sister wives and ecclesiastically rape, befuddling the moral compass of his entire congregation. The film examines Warren Jeffs' life and shows how he became a worshipped and adored Prophet. Warren has a devout following numbering in the tens of thousands - many of whom would give their life at any moment with just one word from the Prophet. Despite a trail of abuse and ruined lives, Warren has maintained his grip on power.See less",
        "runtimeMinutes": "90"
    },
    "2015_566": {
        "plotSummary": "Black Friday, the day after Thanksgiving November 2012, four boys in a red SUV pull into a gas station after spending time at the mall buying sneakers and talking to girls. With music blaring, one boy exits the car and enters the store, a ...See moreBlack Friday, the day after Thanksgiving November 2012, four boys in a red SUV pull into a gas station after spending time at the mall buying sneakers and talking to girls. With music blaring, one boy exits the car and enters the store, a quick stop for a soda and a pack of gum. A man and a woman pull up next to the boys in the station, making a stop for a bottle of wine. The woman enters the store and an argument breaks out when the driver of the second car asks the boys to turn the music down. 3 1/2 minutes and ten bullets later, one of the boys is dead. 3 1/2 MINUTES dissects the aftermath of this fatal encounter.See less",
        "runtimeMinutes": "98"
    },
    "2015_567": {
        "plotSummary": "Following the May 1968 civil unrest in France, a deaf-mute and a con artist simultaneously stumble upon the remnants of a secret society.",
        "runtimeMinutes": "729"
    },
    "2015_568": {
        "plotSummary": "As a Juilliard professor is interviewed by a woman and her husband for her dissertation on the history of dance in 1960s New York City, it becomes increasingly clear that there are ulterior motives to the couple's visit.",
        "runtimeMinutes": "92"
    },
    "2015_569": {
        "plotSummary": "An old mother and her middle-aged daughter, the aunt and cousin of Jacqueline Kennedy, live their eccentric lives in a filthy, decaying mansion in East Hampton.",
        "runtimeMinutes": "95"
    },
    "2015_57": {
        "plotSummary": "During China's Cultural Revolution, a young urban student is sent to live with Mongolian herders, where he adopts a wolf cub.",
        "runtimeMinutes": "121"
    },
    "2015_570": {
        "plotSummary": "After the death of their mother, three foster sisters - the shrewd business woman, the free spirit, and the caregiver - find themselves fighting for their individual dreams and fighting each other in this tale of love, lust, and tragedy.",
        "runtimeMinutes": "84"
    },
    "2015_571": {
        "plotSummary": "An inner-city high school teacher discovers she is pregnant at the same time as one of her most promising students and the two develop an unlikely friendship while struggling to navigate their unexpected pregnancies.",
        "runtimeMinutes": "90"
    },
    "2015_572": {
        "plotSummary": "When a noted white supremacist moves into their town, the residents of Leith, North Dakota do what they can to prevent him from taking control of the municipality.",
        "runtimeMinutes": "85"
    },
    "2015_573": {
        "plotSummary": "A story about fame, addiction and a custody battle over a man's leg.",
        "runtimeMinutes": "82"
    },
    "2015_574": {
        "plotSummary": "A young man, hoping to write a novel, visits a French guest-house with a friend, he but finds himself distracted by a strange mystery and the stranger inhabitants of the home.",
        "runtimeMinutes": "103"
    },
    "2015_575": {
        "plotSummary": "Pierrot escapes his boring society and travels from Paris to the Mediterranean Sea with Marianne, a girl chased by hit-men from Algeria. They lead an unorthodox life, always on the run.",
        "runtimeMinutes": "110"
    },
    "2015_576": {
        "plotSummary": "Kajaki Dam 2006. A company of young British soldiers encounter an unexpected, terrifying enemy. A dried-out river bed, and under every step the possibility of an anti-personnel mine. A mine that could cost you your leg - or your life.",
        "runtimeMinutes": "108"
    },
    "2015_577": {
        "plotSummary": "The Winding Stream is a 90-minute High Definition music history documentary-in-progress that tells the story of the American roots music dynasty, the Carters and the Cashes. Starting with the Original Carter Family (A.P., Sara, Maybelle), ...See moreThe Winding Stream is a 90-minute High Definition music history documentary-in-progress that tells the story of the American roots music dynasty, the Carters and the Cashes. Starting with the Original Carter Family (A.P., Sara, Maybelle), the film traces the ebb and flow of their influence, the transformation of that act into the Carter Sisters, the marital alliance with legend Johnny Cash and the efforts of present-day family to keep this legacy alive. No one has yet pulled together all the elements of this family saga in one documentary. The goal of The Winding Stream is to honor this multi-generational family where it stands -- at the headwaters of American roots music.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2015_578": {
        "plotSummary": "A man teaches a young woman how to become a complete weapon. Later she is approached by a group of sadistic teens who kill blonde women for unknown reasons. The hunting season begins.",
        "runtimeMinutes": "84"
    },
    "2015_579": {
        "plotSummary": "An army veteran's unlikely romance with an Iraqi immigrant is put to the test when she is faced with the prospect of deportation.",
        "runtimeMinutes": "90"
    },
    "2015_58": {
        "plotSummary": "As his wedding day approaches, Ben heads to Miami with his soon-to-be brother-in-law James to bring down a drug dealer who's supplying the dealers of Atlanta with product.",
        "runtimeMinutes": "102"
    },
    "2015_580": {
        "plotSummary": "A self-professed biblical archaeologist who has fallen on hard times starts to bend the truth in order to continue inspiring the faithful.",
        "runtimeMinutes": "90"
    },
    "2015_581": {
        "plotSummary": "An account of underground resistance fighters in Nazi-occupied France.",
        "runtimeMinutes": "145"
    },
    "2015_582": {
        "plotSummary": "The beauty of the land cannot mask the brutality of a farm town. As harvest draws near, Betty confronts a terrifying new reality and will go to desperate lengths to save her family when they are threatened with being forced from their land.",
        "runtimeMinutes": "90"
    },
    "2015_583": {
        "plotSummary": "Paul Taylor is one of the dance world's most elusive and respected choreographers. For over 50 years he has only given glimpses into his creative process, this film is an unprecedented exploration of how Mr. Taylor creates a single dance. ...See morePaul Taylor is one of the dance world's most elusive and respected choreographers. For over 50 years he has only given glimpses into his creative process, this film is an unprecedented exploration of how Mr. Taylor creates a single dance. The dominant voice is Paul's, between the guarded and unguarded moments we see him with new eyes and new understanding.  Written by filmmakerSee less",
        "runtimeMinutes": "86"
    },
    "2015_584": {
        "plotSummary": "Within the urban gloom of Taipei, four youths face alienation, loneliness, and moments of existential crisis amidst a series of minor crimes.",
        "runtimeMinutes": "106"
    },
    "2015_585": {
        "plotSummary": "Raving through realty on the eve of the economic collapse. A high-velocity journey of an unsuspecting mortgage broker swallowed up in the sex, greed and over indulgence of the mid 2000's Real Estate boom.",
        "runtimeMinutes": "89"
    },
    "2015_586": {
        "plotSummary": "Some of the chapters from Arabian Nights are adapted to a modern Portugal in this epic.",
        "runtimeMinutes": "125"
    },
    "2015_587": {
        "plotSummary": "Surrounded by wealth and living with abundant resources in Manhattan, 12-year-old cello prodigy Reggie, lives a solitary life lacking only frequently absent parents and friends. Estranged from family, having slacker boyfriend troubles, and...See moreSurrounded by wealth and living with abundant resources in Manhattan, 12-year-old cello prodigy Reggie, lives a solitary life lacking only frequently absent parents and friends. Estranged from family, having slacker boyfriend troubles, and fired from her waitressing job, sometimes musician 23-year-old Eleanor needs a new place to live and a new job.See less",
        "runtimeMinutes": "104"
    },
    "2015_588": {
        "plotSummary": "Sharing a small apartment with his sleepy French bulldog, an unmotivated thirty-something slacker lands a job at a Quick Lube, to be close to the shop's beautiful manager. Has he found a new purpose in life? Is there still hope?",
        "runtimeMinutes": "76"
    },
    "2015_589": {
        "plotSummary": "Bikes vs Cars is a documentary about the bike and what an amazing tool for change it can be. It highlights a conflict in city planning between bikes, cars and a growing reliance on fossil fuels.",
        "runtimeMinutes": "90"
    },
    "2015_59": {
        "plotSummary": "When corrupt Roman leader Tiberius arrives with a giant army to claim the Silk Road, Huo An teams up his army with an elite Legion of defected Roman soldiers led by General Lucius to protect his country and his new friends.",
        "runtimeMinutes": "127"
    },
    "2015_590": {
        "plotSummary": "Meet Ousmane Sembene, the African freedom fighter who used stories as his weapon.",
        "runtimeMinutes": "89"
    },
    "2015_591": {
        "plotSummary": "About ten years ago, a group of us produced a fourteen-minute short film, 'Tap Heat', which film contrasted the traditional tap with the contemporary, as it's being created and performed by a new generation of dancers. With 'Tap World', we...See moreAbout ten years ago, a group of us produced a fourteen-minute short film, 'Tap Heat', which film contrasted the traditional tap with the contemporary, as it's being created and performed by a new generation of dancers. With 'Tap World', we wanted to show how this uniquely American art form has been given an exciting resurgence through the global embrace of dancers and audiences around the world. With 'Tap Heat\"s popularity, we decided to reach out and invite dancers, choreographers and dance companies from across the planet to participate in a feature-length global documentary. Along with the U.S., we received 114 submissions from thirteen countries around the world. We asked not only to see the participants dancing, but also to learn their personal stories.See less",
        "runtimeMinutes": "72"
    },
    "2015_592": {
        "plotSummary": "Peace Officer is a documentary about the increasingly militarized state of American police as told through the story of 'Dub' Lawrence, a former sheriff who established and trained his rural state's first SWAT team only to see that same ...See morePeace Officer is a documentary about the increasingly militarized state of American police as told through the story of 'Dub' Lawrence, a former sheriff who established and trained his rural state's first SWAT team only to see that same unit kill his son-in-law in a controversial standoff 30 years later. Driven by an obsessed sense of mission, Dub uses his own investigation skills to uncover the truth in this and other recent officer-involved shootings in his community, while tackling larger questions about the changing face of peace officers nationwide.  Written by Scott Christopherson & Brad BarberSee less",
        "runtimeMinutes": "105"
    },
    "2015_593": {
        "plotSummary": "When Nelly, a woman being just divorced, meets by chance M. Arnaud, a mature salesman just retired, begins a strange and special relationship between the two personalities.See moreWhen Nelly, a woman being just divorced, meets by chance M. Arnaud, a mature salesman just retired, begins a strange and special relationship between the two personalities.  Written by Volker BoehmSee less",
        "runtimeMinutes": "106"
    },
    "2015_594": {
        "plotSummary": "A man in search of joy hires a bondage club to have dominatrices surprise him at random times.",
        "runtimeMinutes": "99"
    },
    "2015_595": {
        "plotSummary": "After suffering a heart attack, retired General Jose Mendieta is haunted by his past as an officer in Operation Condor, the CIA-backed campaign of political repression in Latin America.",
        "runtimeMinutes": "112"
    },
    "2015_596": {
        "plotSummary": "Poetic, riveting and moving, Argentina explores the heart of traditional Argentine folklore and its stunning musical heritage.",
        "runtimeMinutes": "85"
    },
    "2015_597": {
        "plotSummary": "Based on the acclaimed memoir One Train Later by rock guitarist Andy Summers, Can't Stand Losing You: Surviving the Police follows Summers' journey from his early days in the psychedelic '60s music scene, when he played with The Animals, ...See moreBased on the acclaimed memoir One Train Later by rock guitarist Andy Summers, Can't Stand Losing You: Surviving the Police follows Summers' journey from his early days in the psychedelic '60s music scene, when he played with The Animals, to chance encounters with drummer Stewart Copeland and bassist Sting, which led to the formation of a punk trio, The Police. During the band's phenomenal rise and its dissolution at the height of their popularity in the mid-80s, Summers captured history with his candid photographs. Utilizing rare archival footage and insights from the guitarist's side of the stage, Can't Stand Losing You: Surviving the Police brings together past and present as the band members reunite, more than two decades later, for a global reunion tour in 2007.See less",
        "runtimeMinutes": "79"
    },
    "2015_598": {
        "plotSummary": "A group of young upper-class Manhattanites are blithely passing through the gala debutante season, when an unusual outsider joins them and stirs them up.",
        "runtimeMinutes": "98"
    },
    "2015_599": {
        "plotSummary": "Jeff and Anne, two close friends and co-workers, are embarrassingly unlucky at love. They hatch a plan to transform themselves over the course of a sex-and-alcohol-fueled summer.",
        "runtimeMinutes": "96"
    },
    "2015_6": {
        "plotSummary": "A cryptic message from James Bond's past sends him on a trail to uncover the existence of a sinister organisation named SPECTRE. With a new threat dawning, Bond learns the terrible truth about the author of all his pain in his most recent missions.",
        "runtimeMinutes": "148"
    },
    "2015_60": {
        "plotSummary": "Three years after Mike bowed out of the stripper life at the top of his game, he and the remaining Kings of Tampa hit the road to Myrtle Beach to put on one last blow-out performance.",
        "runtimeMinutes": "115"
    },
    "2015_600": {
        "plotSummary": "Grace, a lifelong farm girl now in her early 20s, has dreamed all her life of the day \"Mr. Right\" slips a Princess Cut diamond on her finger and swears to love her forever. Tonight may be that night as Stewart has something special planned...See moreGrace, a lifelong farm girl now in her early 20s, has dreamed all her life of the day \"Mr. Right\" slips a Princess Cut diamond on her finger and swears to love her forever. Tonight may be that night as Stewart has something special planned after 15 months together. But when things don't go as planned and the romance crashes down around her, she launches on a quest, aided by her father, to understand what truly loving another person actually means. Will Grace finally discover love or ruin her chances for happiness forever?  Written by Paul MungerSee less",
        "runtimeMinutes": "97"
    },
    "2015_601": {
        "plotSummary": "ANIMALS tells the story of Jude and Bobbie: a young couple that exist somewhere between homelessness and the fantasy of their imaginations. Though they masterfully con and steal in an attempt to stay one step ahead of their addiction, they...See moreANIMALS tells the story of Jude and Bobbie: a young couple that exist somewhere between homelessness and the fantasy of their imaginations. Though they masterfully con and steal in an attempt to stay one step ahead of their addiction, they are ultimately forced to face the reality of their situation when one of them gets hospitalized.  Written by AnonymousSee less",
        "runtimeMinutes": "90"
    },
    "2015_602": {
        "plotSummary": "Thirty-year-old Alice's occupation is rather unusual for a woman : she works as an engineer on a freighter. She loves her job and does it competently but even in a greasy blue overall a woman will be a woman, with her heart, her desires ...See moreThirty-year-old Alice's occupation is rather unusual for a woman : she works as an engineer on a freighter. She loves her job and does it competently but even in a greasy blue overall a woman will be a woman, with her heart, her desires and her seduction... In such conditions can an all-male crew really remain totally insensitive to her charms? A situation all the more complicated as not only does Alice leave her fiance Felix behind but she also discovers on board the Fidelio that the captain is Gaël, her first love...  Written by Guy BellingerSee less",
        "runtimeMinutes": "97"
    },
    "2015_603": {
        "plotSummary": "When her son's persistent rash won't subside, a mother begins investigating and finds herself pulled into the battle between small town organic farmers and Clonestra, a corporation profiting from GMOs.",
        "runtimeMinutes": "95"
    },
    "2015_604": {
        "plotSummary": "Boy Meets Girl is a funny, tender, sex positive romantic comedy that explores what it means to be a real man or woman, and how important it is to live a courageous life not letting fear stand in the way of going after your dreams.",
        "runtimeMinutes": "95"
    },
    "2015_605": {
        "plotSummary": "A group of lifelong mob movie extras mount a production of Shakespeare's Julius Caesar in their local Staten Island theater in order to finally get some speaking roles. But the theater is the secret hideout of a real-life gangster who ...See moreA group of lifelong mob movie extras mount a production of Shakespeare's Julius Caesar in their local Staten Island theater in order to finally get some speaking roles. But the theater is the secret hideout of a real-life gangster who fancies himself an actor, and whom the FBI are hunting for the recent murder of a Broadway producer. The Feds insert their own undercover agent to audition for the role of Cassius, seeking to determine who is the real gangster among a cast of make-believe criminals. All the while, the oblivious cast seek only to prove to themselves, their families, and friends that they are more than just extras.See less",
        "runtimeMinutes": "97"
    },
    "2015_606": {
        "plotSummary": "A young French girl orphaned in a Nazi air attack is befriended by the son of a poor farmer, and together they try to come to terms with the realities of death.",
        "runtimeMinutes": "86"
    },
    "2015_607": {
        "plotSummary": "A Brooklyn couple suspects foul play when their rent controlled neighbor suddenly drops dead.",
        "runtimeMinutes": "96"
    },
    "2015_608": {
        "plotSummary": "Over fifty very famous American, Canadian, British and Australian funny people (filmmakers, writers, actors and comedians) share life and professional journeys and insights, in an effort to shed light on the thesis: Do you have to be ...See moreOver fifty very famous American, Canadian, British and Australian funny people (filmmakers, writers, actors and comedians) share life and professional journeys and insights, in an effort to shed light on the thesis: Do you have to be miserable to be funny?See less",
        "runtimeMinutes": "94"
    },
    "2015_609": {
        "plotSummary": "'Gabo, The Magic of Reality' is a story about the incredible power of human imagination, which follows the interwoven threads of Gabriel García Márquez's life and work - \"Gabo\" to all of Latin America - with the narrative tension of an investigation.",
        "runtimeMinutes": "90"
    },
    "2015_61": {
        "plotSummary": "A prequel set before the haunting of the Lambert family that reveals how gifted psychic Elise Rainier reluctantly agrees to use her ability to contact the dead in order to help a teenage girl who has been targeted by a dangerous supernatural entity.",
        "runtimeMinutes": "97"
    },
    "2015_610": {
        "plotSummary": "A modern day train hopper fighting to become a successful musician, and a single mom battling to maintain custody of her daughter, defy their circumstances by coming together in a relationship that may change each others lives forever.",
        "runtimeMinutes": "90"
    },
    "2015_611": {
        "plotSummary": "Struggling Bronx mechanic Jaden Miller uses boxing to save himself and his mother from being homeless. With a legendary trainer, and a reality show built around him, Miller goes for the title.",
        "runtimeMinutes": "95"
    },
    "2015_612": {
        "plotSummary": "A murder mystery that opens with the discovery of human body parts stuffed inside a cow on the outskirts of a small channel town in northern France.",
        "runtimeMinutes": "206"
    },
    "2015_613": {
        "plotSummary": "A drama with supernatural influences, The Other One follows a young woman named Amber who has returned to her childhood home, caring for her mother now in the throes of dementia and haunted by the death of her young son who drowned ...See moreA drama with supernatural influences, The Other One follows a young woman named Amber who has returned to her childhood home, caring for her mother now in the throes of dementia and haunted by the death of her young son who drowned mysteriously 30 years prior. Watching her mother slip further away, Amber struggles with her own ghosts as she feels her life crumbling around her. All of the characters in The Other One are haunted in the way that each of us is -- by the pasts that we embrace, we hide from, we lie about, and that we make peace with.  Written by AnonymousSee less",
        "runtimeMinutes": "94"
    },
    "2015_614": {
        "plotSummary": "At first glance, it is not obvious that Abigail Evans lives with a life-threatening skin disease. She is a typical teenager: moody, rebellious, irreverent, and is also strikingly beautiful. But her life is the antithesis of normal. Abbie ...See moreAt first glance, it is not obvious that Abigail Evans lives with a life-threatening skin disease. She is a typical teenager: moody, rebellious, irreverent, and is also strikingly beautiful. But her life is the antithesis of normal. Abbie grew up in hospitals, cared for by her protective mother and father. She then came into her own in honky tonks, selling merchandise for her dad's band. But just like any other 18 year-old, Abbie yearns for a life of her own. Butterfly Girl charts Abbie's journey towards a new understanding of how she must balance her past with her future, her parents with her independence, and her disease with her desires. But what price must she pay for that freedom?  Written by Lytta ProductionsSee less",
        "runtimeMinutes": "78"
    },
    "2015_615": {
        "plotSummary": "A shy genius is employed by his former university to design robot software.",
        "runtimeMinutes": "94"
    },
    "2015_616": {
        "plotSummary": "A look at seven communities around the world with the proposition that we can seize the crisis of climate change to transform our failed economic system into something radically better.",
        "runtimeMinutes": "89"
    },
    "2015_617": {
        "plotSummary": "As former detective Akikazu searches for his missing daughter, Kanako, he soon learns she has a mysterious secret life.",
        "runtimeMinutes": "118"
    },
    "2015_618": {
        "plotSummary": "An examination into the cold case of the Iowa boy, Johnny Gosch, who disappeared on his paper route 30 years earlier.",
        "runtimeMinutes": "81"
    },
    "2015_619": {
        "plotSummary": "Yogi Roth never wanted to say 'I wish I'd spent more time with my Dad.' After realizing he had not dealt with the emotion stemming from his father's battle with prostate cancer, Yogi invites his Dad on a walk along the Camino de Santiago ...See moreYogi Roth never wanted to say 'I wish I'd spent more time with my Dad.' After realizing he had not dealt with the emotion stemming from his father's battle with prostate cancer, Yogi invites his Dad on a walk along the Camino de Santiago that would change their lives forever.See less",
        "runtimeMinutes": "76"
    },
    "2015_62": {
        "plotSummary": "When millionaire James King is jailed for fraud and bound for San Quentin, he turns to Darnell Lewis to prep him to go behind bars.",
        "runtimeMinutes": "100"
    },
    "2015_620": {
        "plotSummary": "Taking inspiration from The Human Centipede films, the warden of a notorious and troubled prison looks to create a 500-person human centipede as a solution to his problems.",
        "runtimeMinutes": "102"
    },
    "2015_621": {
        "plotSummary": "Can You Dig This explores the urban gardening revolution currently taking place in South Central Los Angeles, one of the largest food deserts in the country. We follow the inspirational personal journeys of five 'gangster gardeners,' all ...See moreCan You Dig This explores the urban gardening revolution currently taking place in South Central Los Angeles, one of the largest food deserts in the country. We follow the inspirational personal journeys of five 'gangster gardeners,' all planting the seeds for a better life.See less",
        "runtimeMinutes": "80"
    },
    "2015_622": {
        "plotSummary": "Serena, a young, gay introvert and her controlling older brother Nathan, are forced to endure a dreaded family gathering at the house of their elegant elderly Aunt Irene to hear the reading of her will - setting off an unexpected course of...See moreSerena, a young, gay introvert and her controlling older brother Nathan, are forced to endure a dreaded family gathering at the house of their elegant elderly Aunt Irene to hear the reading of her will - setting off an unexpected course of events that ultimately forces the clan to reevaluate their views on love, forgiveness, and family.See less",
        "runtimeMinutes": "112"
    },
    "2015_623": {
        "plotSummary": "Louise, a young woman, who recently finished her studies in arts, is working as a interior decorator trainee. Playing the game of seduction, her life becomes more and more complicated.See moreLouise, a young woman, who recently finished her studies in arts, is working as a interior decorator trainee. Playing the game of seduction, her life becomes more and more complicated.  Written by See less",
        "runtimeMinutes": "101"
    },
    "2015_624": {
        "plotSummary": "'Every age thinks it's the modern age...'",
        "runtimeMinutes": "88"
    },
    "2015_625": {
        "plotSummary": "In 2012, jihadists took control of Northern Mali, imposing one of the harshest interpretations of sharia law in recent years and, crucially for Mali, banning music. Radio stations were destroyed, instruments were burned and overnight, ...See moreIn 2012, jihadists took control of Northern Mali, imposing one of the harshest interpretations of sharia law in recent years and, crucially for Mali, banning music. Radio stations were destroyed, instruments were burned and overnight, Mali's musicians were forced into hiding or exile where many remain even now. Follow these musicians as they fight to keep music alive. Featuring rare footage of the jihadists, a glimpse at life in refugee camps and the perilous journeys home to war-ravaged cities, THEY WILL HAVE TO KILL US FIRST is a tale of courage in the face of conflict as Malian musicians refuse to give up the fight for their right to sing.See less",
        "runtimeMinutes": "100"
    },
    "2015_626": {
        "plotSummary": "Continuation of the Arabian Nights stories by the structure were adapted to modern life in Portugal in three innings and the third chapter \"The Owners of Dixie\" has three chapters.",
        "runtimeMinutes": "131"
    },
    "2015_627": {
        "plotSummary": "In a fateful bumper car collision, Jake and Ella meet and become the most loving couple in the long history of romance. But when a scheming \"other\" woman drives a wedge of jealousy into their perfect courtship, insecurity and hatred spell ...See moreIn a fateful bumper car collision, Jake and Ella meet and become the most loving couple in the long history of romance. But when a scheming \"other\" woman drives a wedge of jealousy into their perfect courtship, insecurity and hatred spell out an untimely fate. With only the help of a disgraced magician and his forbidden \"soul machine\", Ella takes the form of Jake's numerous lovers, desperately fighting through the malfunction and deceit as they try to reclaim their destiny.  Written by Bill Plympton & Desiree StavracosSee less",
        "runtimeMinutes": "76"
    },
    "2015_628": {
        "plotSummary": "A rebellious and controversial Mexican pop icon becomes a huge success with her style and catchy songs, but a larger than life scandal will rock her world entirely.",
        "runtimeMinutes": "126"
    },
    "2015_629": {
        "plotSummary": "In 1887, at age 23, reporter Nellie Bly, working for Joseph Pulitzer, feigns mental illness to go undercover in notorious Blackwell's Island a woman's insane asylum to expose corruption, abuse and murder. Read more: Synopsis",
        "runtimeMinutes": "111"
    },
    "2015_63": {
        "plotSummary": "Four waves of increasingly deadly alien attacks have left most of Earth in ruin. Cassie is on the run, desperately trying to save her younger brother.",
        "runtimeMinutes": "112"
    },
    "2015_630": {
        "plotSummary": "Paranoia forces small-time scam artist Marty to flee his hometown and hide out in a dangerous Detroit. With nothing but a pocket full of bogus checks, his Power Glove, and a bad temper, the horror metal slacker lashes out.",
        "runtimeMinutes": "97"
    },
    "2015_631": {
        "plotSummary": "Gone Doggy Gone is a comedic feature about a couple stuck in a lack-luster marriage who treat their dog like a baby. Working the grind in LA they leave little time for each other, and what free time they have they spend doting on the dog.....See moreGone Doggy Gone is a comedic feature about a couple stuck in a lack-luster marriage who treat their dog like a baby. Working the grind in LA they leave little time for each other, and what free time they have they spend doting on the dog... until it gets kidnapped. What ensues is an outlandish cat-and-mouse adventure as they hunt down the kidnapper, enlist a schlubby PI, find a renewed love of each other, and conquer their fear of parenthood.  Written by AnonymousSee less",
        "runtimeMinutes": "89"
    },
    "2015_632": {
        "plotSummary": "An urban couple go camping in the woods and find themselves lost in the territory of a predatory black bear.",
        "runtimeMinutes": "92"
    },
    "2015_633": {
        "plotSummary": "A small-time thief is recruited by the police to infiltrate a notorious gang in an effort to thwart an illegal cigarette smuggling scheme.",
        "runtimeMinutes": "154"
    },
    "2015_634": {
        "plotSummary": "In the ruthless underground world of the yakuza, no one is more legendary than boss Kamiura. Rumored to be invincible, the truth is he is a vampire-a bloodsucking yakuza vampire boss! Among Kamiura's gang is Kageyama, his most loyal ...See moreIn the ruthless underground world of the yakuza, no one is more legendary than boss Kamiura. Rumored to be invincible, the truth is he is a vampire-a bloodsucking yakuza vampire boss! Among Kamiura's gang is Kageyama, his most loyal underling. However, the others in the gang view Kageyama with disdain and ridicule him for his inability to get tattooed due to sensitive skin. One day, assassins aware of boss Kamiura's secret arrive from abroad and deliver him an ultimatum: Return to the international syndicate he left years ago, or die. Kamiura refuses and, during a fierce battle with anime-otaku martial-arts expert Kyoken, is torn limb from limb. With his dying breath, Kamiura bites Kageyama, passing on his vampire powers to the unsuspecting yakuza. As he begins to awaken to his newfound abilities, Kageyama's desire to avenge the murder of boss Kamiura sets him on a course for a violent confrontation with Kaeru-kun, the foreign syndicate's mysterious and seemingly unstoppable leader!See less",
        "runtimeMinutes": "115"
    },
    "2015_635": {
        "plotSummary": "What price conscience? Abigail Disney's directorial debut, THE ARMOR OF LIGHT, follows the journey of an Evangelical minister trying to find the courage to preach about the growing toll of gun violence in America. The film tracks Reverend ...See moreWhat price conscience? Abigail Disney's directorial debut, THE ARMOR OF LIGHT, follows the journey of an Evangelical minister trying to find the courage to preach about the growing toll of gun violence in America. The film tracks Reverend Rob Schenck, anti-abortion activist and fixture on the political far right, who breaks with orthodoxy by questioning whether being pro-gun is consistent with being pro-life. Reverend Schenck is shocked and perplexed by the reactions of his long-time friends and colleagues who warn him away from this complex, politically explosive issue. Along the way, Rev. Schenck meets Lucy McBath, the mother of Jordan Davis, an unarmed teenager who was murdered in Florida and whose story has cast a spotlight on \"Stand Your Ground\" laws. Along with McBath's lawyer, John M. Phillips, she is on a difficult journey of her own, trying to make sense of her devastating loss while using her grief to effect some kind of viable and effective political action-where so many before her have failed. ARMOR follows these unlikely allies through their trials of conscience, heartbreak and rejection, as they bravely attempt to make others consider America's gun culture through a moral lens. The film is also a courageous look at our fractured political culture, and an assertion that it is, indeed, possible for people to come together across deep party lines to find common ground.See less",
        "runtimeMinutes": "88"
    },
    "2015_636": {
        "plotSummary": "This feature documentary film shows the past and the future of Wa-Shoku that these men and women created and how they maintained the essential traditional qualities of Japanese food.",
        "runtimeMinutes": "107"
    },
    "2015_637": {
        "plotSummary": "Documentary filmmakers assert that Anthony Porter - a former death-row inmate who was spared the death penalty thanks to the efforts of a college journalism program - was actually guilty, and an innocent man was sent to prison.",
        "runtimeMinutes": "91"
    },
    "2015_638": {
        "plotSummary": "One home, one secret, one man, two sisters. The 20 year old Orsa is madly in love with the lieutenant Spyros Maltabes. As a closed character she won't reveal her secret to anyone. Her little sister, Moscha, dynamic and full of dreams wants...See moreOne home, one secret, one man, two sisters. The 20 year old Orsa is madly in love with the lieutenant Spyros Maltabes. As a closed character she won't reveal her secret to anyone. Her little sister, Moscha, dynamic and full of dreams wants to leave Andros, to escape the fate of the women of the island that marry sailors that are always away or drown at the sea. For their mother, Mina, wife of a captain who prefers the Atlantic Souf than his home, love means only big trouble and pain. Leaving aside the feelings of her daughters, she conspires, uses acquaintances, and marries them with men according to interest. Orsa with marine and captain Nikos and later Moscha with now captain Spyros. Their house is divided into two. Down lives Orsa, up lives Moscha.  Written by alexiakonstantinidiSee less",
        "runtimeMinutes": "132"
    },
    "2015_639": {
        "plotSummary": "As the migratory songbirds are sold by the thousands to the black market, the members of the Committee Against Bird Slaughter wage war against the poachers. But, can they change the world's point of view, freeing one bird at a time?",
        "runtimeMinutes": "78"
    },
    "2015_64": {
        "plotSummary": "After six years of keeping our malls safe, Paul Blart has earned a well-deserved vacation. He heads to Las Vegas with his teenage daughter before she heads off to college. But safety never takes a holiday and when duty calls, Blart answers.",
        "runtimeMinutes": "94"
    },
    "2015_640": {
        "plotSummary": "On the verge of giving up on life, a guy travels to his hometown to make amends.",
        "runtimeMinutes": "95"
    },
    "2015_641": {
        "plotSummary": "A documentary exploring genre based monster art takes an odd turn when the filmmakers are contacted by a man who claims he can prove that monsters are indeed real.",
        "runtimeMinutes": "89"
    },
    "2015_642": {
        "plotSummary": "MARTIN ARMSTRONG, once a US based trillion dollar financial adviser, used the number pi to predict economic turning points with precision. When some big New York bankers asked him to join the club to help them to take over Russia, he ...See moreMARTIN ARMSTRONG, once a US based trillion dollar financial adviser, used the number pi to predict economic turning points with precision. When some big New York bankers asked him to join the club to help them to take over Russia, he refused to join the manipulation. A few days later the FBI stormed his offices accusing him of a 3 billion dollar Ponzi Scheme - an attempt to stop him talking about the real Ponzi Scheme of debts that the US has build up over the years and which he thinks starts to collapse after October 1, 2015, a major pi turning point he is predicting.See less",
        "runtimeMinutes": "100"
    },
    "2015_643": {
        "plotSummary": "A yoga instructor looks to protect her sex-worker sister from her deadbeat boyfriend.",
        "runtimeMinutes": "80"
    },
    "2015_644": {
        "plotSummary": "A documentary about the power of transformation told through the eyes of 9 trans-identifying individuals in Puerto Rico.",
        "runtimeMinutes": "87"
    },
    "2015_645": {
        "plotSummary": "In a small American town still living in the shadow of a terrible coal mine accident, the disappearance of a teenage boy draws together a surviving miner, the lonely wife of a mine executive, and a local boy in a web of secrets.",
        "runtimeMinutes": "105"
    },
    "2015_646": {
        "plotSummary": "When a legendary escape artist comes up for parole after 30 years behind bars, a chance for freedom must be weighed against his infamous past.",
        "runtimeMinutes": "92"
    },
    "2015_647": {
        "plotSummary": "16-year-old Billie's reluctant path to independence is accelerated when her mother reveals plans to gender transition and their time together becomes limited to Tuesday afternoons.",
        "runtimeMinutes": "114"
    },
    "2015_648": {
        "plotSummary": "When seminal documentarian Ed Pincus, considered the father of first person non-fiction film, is diagnosed with a terminal illness, he and collaborator Lucia Small team up to make one last film, much to the chagrin of Jane, Ed's wife of 50...See moreWhen seminal documentarian Ed Pincus, considered the father of first person non-fiction film, is diagnosed with a terminal illness, he and collaborator Lucia Small team up to make one last film, much to the chagrin of Jane, Ed's wife of 50 years. Told from two filmmakers' points of view, ONE CUT, ONE LIFE challenges the form of first person documentary. Ed and Lucia's unique approach to filming offers a vulnerability and intimacy rarely seen in non- fiction, questioning whether some things might be too private to be made public. The film is an intense, raw, and sometimes humorous exploration of the human condition which invites the viewer to contemplate for themselves what is important, not only at the end of life, but also during.  Written by Mary KerrSee less",
        "runtimeMinutes": "107"
    },
    "2015_649": {
        "plotSummary": "In Tel Aviv, six friends who are appalled by the Israeli entry in the UniverSong competition record their own song on a mobile phone, then are shocked to learn their recording is selected as Israel's entry for next year's competition.",
        "runtimeMinutes": "92"
    },
    "2015_65": {
        "plotSummary": "Rusty Griswold takes his own family on a road trip to \"Walley World\" in order to spice things up with his wife and reconnect with his sons.",
        "runtimeMinutes": "99"
    },
    "2015_650": {
        "plotSummary": "A young man begins exploring his attraction to much much older men while working in a nursing home.",
        "runtimeMinutes": "82"
    },
    "2015_651": {
        "plotSummary": "A train travels 4,000 miles across North America with a revolving community of artists and musicians who collaborate on recordings, artworks, films, and 10 \"happenings\" across the country.",
        "runtimeMinutes": "71"
    },
    "2015_652": {
        "plotSummary": "When an underground radio DJ makes fun of a fading pop star who happens to listen to his show, the two begin an unlikely relationship. But difficult life and career crossroads jeopardize their idyllic New York romance.",
        "runtimeMinutes": "97"
    },
    "2015_653": {
        "plotSummary": "The true story of Toni Jo Henry, a woman tried for the crime of murder in 1942 in the state of Louisiana. Toni Jo, a product of childhood abuse and neglect, briefly discovers love and happiness that soon turns to despair when her husband ...See moreThe true story of Toni Jo Henry, a woman tried for the crime of murder in 1942 in the state of Louisiana. Toni Jo, a product of childhood abuse and neglect, briefly discovers love and happiness that soon turns to despair when her husband Cowboy is sent to prison and she embarks on an ill-fated plan with an accomplice Arkie to free him. Because of her beauty, Toni Jo instantly becomes a notorious celebrity, drawing the unparalleled media attention of two highly publicized and sensational murder trials. Her story is a story of hope, a story of love and a story of redemption, as Toni Jo discovers the true strength within herself and, with the help of a priest, Father Richard is able to face her life with a calm and peace that defies explanation.  Written by Sandi RussellSee less",
        "runtimeMinutes": "120"
    },
    "2015_654": {
        "plotSummary": "A group of college students travel to a small Texas town to research the Legend of Blood Lake, an obscure folktale forged by events surrounding the horrible massacre of a Comanche village.",
        "runtimeMinutes": "95"
    },
    "2015_655": {
        "plotSummary": "A comedy centered on a failed American writer who enters into an affair after a chance encounter with a European dancer.",
        "runtimeMinutes": "90"
    },
    "2015_656": {
        "plotSummary": "A nonfiction fairytale about love, death, art and the letting go. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2015_657": {
        "plotSummary": "Fifteen distinct but interconnected chapters, shot in locations from Russia to New York City to Istanbul. Together, these build to a reckoning at the intersection of city symphony, diary, and essay film. Perhaps the most personal of ...See moreFifteen distinct but interconnected chapters, shot in locations from Russia to New York City to Istanbul. Together, these build to a reckoning at the intersection of city symphony, diary, and essay film. Perhaps the most personal of Cohen's documentary works, COUNTING measures street life, light, and time, noting not only surveillance and over-development but resistance and its phantoms as manifested in music, animals and everyday magic.  Written by Gravity HillSee less",
        "runtimeMinutes": "111"
    },
    "2015_658": {
        "plotSummary": "Children are able to communicate and control fantastic creatures, but they are unknowingly being used in an evil plan to collect negative energy.",
        "runtimeMinutes": "101"
    },
    "2015_659": {
        "plotSummary": "Gourmet road trip looking for the best steak in the world. Breeders, farmers, butchers, cooks, historians and business men all around the world (France, Italy, Spain, Sweden, Belgium, UK,USA, Canada, Japan, Argentina, Brazil) help us ...See moreGourmet road trip looking for the best steak in the world. Breeders, farmers, butchers, cooks, historians and business men all around the world (France, Italy, Spain, Sweden, Belgium, UK,USA, Canada, Japan, Argentina, Brazil) help us understand the (r)evolution taking place right now and the challenges ahead.  Written by AnonymousSee less",
        "runtimeMinutes": "135"
    },
    "2015_66": {
        "plotSummary": "In the early 1960s, CIA agent Napoleon Solo and KGB operative Illya Kuryakin participate in a joint mission against a mysterious criminal organization, which is working to proliferate nuclear weapons.",
        "runtimeMinutes": "116"
    },
    "2015_660": {
        "plotSummary": "A forlorn teenager abandoned in New York City spirals out of control, from a troubled kid to an accidental addict, after he mistakes the welcoming embrace of a Lower East Side drug dealer for the love of family. Offering a humorous take on...See moreA forlorn teenager abandoned in New York City spirals out of control, from a troubled kid to an accidental addict, after he mistakes the welcoming embrace of a Lower East Side drug dealer for the love of family. Offering a humorous take on the absurdity of the junky lifestyle, STRAIGHT OUTTA TOMPKINS also presents a fearlessly honest portrayal of the violence and danger that come with teen drug use.See less",
        "runtimeMinutes": "92"
    },
    "2015_661": {
        "plotSummary": "Josh's girlfriend wants to get married. Molly's boyfriend is married. Josh and Molly fly together to the wedding in Chicago, pretending to be engaged to make their parents happy. Comedy follows. Romance?",
        "runtimeMinutes": "105"
    },
    "2015_662": {
        "plotSummary": "In the early morning hours, two elderly whores go back to their hovels. They are not tired from working. They are tired of not doing do. One has problems at home with her teenage daughter and her cross dressing husband. The other, with her...See moreIn the early morning hours, two elderly whores go back to their hovels. They are not tired from working. They are tired of not doing do. One has problems at home with her teenage daughter and her cross dressing husband. The other, with her loneliness. But that night, they have a date to celebrate the victory in the ring of two wrestlers, twin midgets wearing masks. At the hourly hotel, in order to rob the tiny men of their earnings, they drug them with eye drops. But the dose proves fatal. They murder them unintentionally. Scared and confused, they decide to hide from the police and run away together to live, as they always have, on Bleak Street.See less",
        "runtimeMinutes": "99"
    },
    "2015_663": {
        "plotSummary": "Markov and Hamilton are fellow French Legionnaire's at the end of their posting in Afghanistan. An ambush results in an abdication of duty-despite it stemming from an act of fidelity. Markov joined the Legion as a foreign refugee, hoping ...See moreMarkov and Hamilton are fellow French Legionnaire's at the end of their posting in Afghanistan. An ambush results in an abdication of duty-despite it stemming from an act of fidelity. Markov joined the Legion as a foreign refugee, hoping to gain his French citizenship and provide a better life for his young son. Ultimately, the complications of immigration and legal status takes a heartbreaking turn but also a primal urge to do right by those who have committed their lives to saving others'.  Written by TVSee less",
        "runtimeMinutes": "107"
    },
    "2015_664": {
        "plotSummary": "Three young conspiracy theorists attempt to uncover the mysteries of Area 51, the government's secret location rumored to have hosted encounters with alien beings. What they find at this hidden facility exposes unimaginable secrets.",
        "runtimeMinutes": "91"
    },
    "2015_665": {
        "plotSummary": "Through archival footage Nicholson tells the story of the real Warriors that walked the streets of New York City in the 1970s and the harsh reality of gang life in a city that seemed to be falling apart.",
        "runtimeMinutes": "71"
    },
    "2015_666": {
        "plotSummary": "In 2014, scientists declared West Antarctic ice sheet melt unstoppable, threatening the future of our planet. A group of world-class researchers is in a race to understand climate change in the fastest winter-warming place on earth: the ...See moreIn 2014, scientists declared West Antarctic ice sheet melt unstoppable, threatening the future of our planet. A group of world-class researchers is in a race to understand climate change in the fastest winter-warming place on earth: the West Antarctic Peninsula. Trekking through dangerous and uncharted landscape, these scientists push the limits of their research and come to terms with the sacrifices necessary to understand this rapidly changing world.  Written by Dena SeidelSee less",
        "runtimeMinutes": "72"
    },
    "2015_667": {
        "plotSummary": "A troubled young man searches obsessively for his first love, risking everything in an increasingly desperate pursuit.",
        "runtimeMinutes": "85"
    },
    "2015_668": {
        "plotSummary": "When a teenage girl says she's the victim of a secret network called The Sisterhood of Night, a quiet suburban town becomes the backdrop for a modern-day Salem witch trial.",
        "runtimeMinutes": "104"
    },
    "2015_669": {
        "plotSummary": "The final trilogy of adaptation of Arabian Nights story by the structure in Portugal modern life between 2013-2014 in three chapter.",
        "runtimeMinutes": "125"
    },
    "2015_67": {
        "plotSummary": "When Shaun decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to ...See moreWhen Shaun decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to return everyone safely to the green grass of home.See less",
        "runtimeMinutes": "85"
    },
    "2015_670": {
        "plotSummary": "\"The time is now, a numbing and timeless present of hospital stays, bureaucratic questioning, and wandering through remembered spaces... and suddenly it is also then, the mid '70s and the time of Portugal's Carnation Revolution, when ...See more\"The time is now, a numbing and timeless present of hospital stays, bureaucratic questioning, and wandering through remembered spaces... and suddenly it is also then, the mid '70s and the time of Portugal's Carnation Revolution, when Ventura got into a knife fight with his friend Joaquim.\" This is the synopsis from the press notes. The film is a sequel of sorts to Costa's \"Colossal Youth\" with Ventura again playing himself.  Written by imnotcocteau@aol.comSee less",
        "runtimeMinutes": "103"
    },
    "2015_671": {
        "plotSummary": "A mother travels cross-country to California to be with her son after he decides to drop out of school and become a surfer.",
        "runtimeMinutes": "93"
    },
    "2015_672": {
        "plotSummary": "While her parents are away, a young woman and her friend are hanging out for the summer, and are joined by her brother and his bandmates.",
        "runtimeMinutes": "93"
    },
    "2015_673": {
        "plotSummary": "A suicidal man hires a demented killer to assist him in suicide, but for some reason, miraculously survives each attempt on his life.",
        "runtimeMinutes": "98"
    },
    "2015_674": {
        "plotSummary": "In 1944, the residents of a small Italian town under Axis control flee their homes to seek out the liberating Allied forces.",
        "runtimeMinutes": "107"
    },
    "2015_675": {
        "plotSummary": "A German Marquise has to deal with a pregnancy she cannot explain and an infatuated Russian Count.",
        "runtimeMinutes": "102"
    },
    "2015_676": {
        "plotSummary": "Eli McAllister, our eleven-year-old hero, is on a quest. He is also setting out to win The Fiesta Cup, a local bowling tournament. Joining him is his famous fashion designer uncle, Sean McAllister.",
        "runtimeMinutes": "92"
    },
    "2015_677": {
        "plotSummary": "A daring and lyrical exploration of alienation and desperation through the intimate observation of a family's inner lives and their relationship to each other and their environment. Without moral judgment, it probes the boundaries of human...See moreA daring and lyrical exploration of alienation and desperation through the intimate observation of a family's inner lives and their relationship to each other and their environment. Without moral judgment, it probes the boundaries of human behavior and the lengths to which people can be driven for love and self-preservation. Middle aged couple, Ennis and Christine, a deaf-mute woman have five children. He devoted his whole life to his farm and his family, but over time, their relationship began to collapse. She was becoming more and more withdrawn. This led to the fact that she increasingly moved away from her husband and spent less and less time with her children. He tried his best to maintain a relationship, but this will lead to a tragic outcome.  Written by AmazonSee less",
        "runtimeMinutes": "97"
    },
    "2015_678": {
        "plotSummary": "Three teenagers' quest to qualify for the 2012 US Olympic table tennis team.",
        "runtimeMinutes": "80"
    },
    "2015_679": {
        "plotSummary": "Narrated by Academy Award® winning actress Meryl Streep, SHOUT GLADI GLADI celebrates the extraordinary people who rescue African women and girls from obstetric fistula, a medical condition that can turn them into reviled outcasts. ...See moreNarrated by Academy Award® winning actress Meryl Streep, SHOUT GLADI GLADI celebrates the extraordinary people who rescue African women and girls from obstetric fistula, a medical condition that can turn them into reviled outcasts. Directed by Adam Friedman and Iain Kennedy, and filmed in Malawi and Sierra Leone, the film spotlights the quest of Ann Gloag, the indefatigable philanthropist and former nurse who drives the movement to save these vulnerable women, and presents the patients as they tell stirring tales of their struggles and triumphs. Everything culminates with the exuberant Gladi Gladi ceremony, a singing and dancing blowout that marks the day the women and girls return home cured.See less",
        "runtimeMinutes": "100"
    },
    "2015_68": {
        "plotSummary": "Two sisters decide to throw one last house party before their parents sell their family home.",
        "runtimeMinutes": "118"
    },
    "2015_680": {
        "plotSummary": "Inspired by true events, an oil-rich Nigerian community wages war against an oil corporation to protect their land from being destroyed. Rebels kidnap an American oil executive and demand that his corporation end the destruction.",
        "runtimeMinutes": "95"
    },
    "2015_681": {
        "plotSummary": "A small Palestinian village bought 18 cows and stopped buying Israeli milk.",
        "runtimeMinutes": "75"
    },
    "2015_682": {
        "plotSummary": "Meeting the right person at the wrong time can be the best thing that ever happened to you. Read more: Synopsis",
        "runtimeMinutes": "86"
    },
    "2015_683": {
        "plotSummary": "The events of the Iranian Hostage Crisis and Canada's involvement, especially concerning Ambassador Ken Taylor, are explored.",
        "runtimeMinutes": "85"
    },
    "2015_684": {
        "plotSummary": "A man hires an ex-con to kill his sister's abusive husband, but the desperate act sets into motion a shocking series of events in this intense indie drama. Written by Shooting Films",
        "runtimeMinutes": "89"
    },
    "2015_685": {
        "plotSummary": "The professional and personal life of a sexual surrogate begins to unravel when she starts working with a new client.",
        "runtimeMinutes": "90"
    },
    "2015_686": {
        "plotSummary": "In the late 1800's, Franz Ferdinand, heir to the Austro-Hungarian empire, falls for Sophie Chotek, a Czech countess. He's already a problem to the Crown because of his political ideas; this love affair with someone not of royal blood ...See moreIn the late 1800's, Franz Ferdinand, heir to the Austro-Hungarian empire, falls for Sophie Chotek, a Czech countess. He's already a problem to the Crown because of his political ideas; this love affair with someone not of royal blood breeches protocol. The Crown allows the union only after the couple agrees to a morganatic marriage. The emperor further neutralizes Franz by making him inspector general of the army, sending him afield for months at a time. In June of 1914, fearing for his safety, Sophie seeks permission to accompany Franz to Sarajevo; protocol dictates that no army troops attend Franz while she is present. An assassin strikes. Their deaths spark World War I.  Written by See less",
        "runtimeMinutes": "95"
    },
    "2015_687": {
        "plotSummary": "A year after his father's death in Mexico, Victor returns to Buenos Aires with a twofold mission. On the one hand, he brings with him a new project for his former theater company; on the other, he abandons his part as The Princess of ...See moreA year after his father's death in Mexico, Victor returns to Buenos Aires with a twofold mission. On the one hand, he brings with him a new project for his former theater company; on the other, he abandons his part as The Princess of France and takes up a new role in front of five actresses who know him all too well, but who don't know that time to work will soon become a time to think again about lost loves.  Written by AnonymousBSee less",
        "runtimeMinutes": "67"
    },
    "2015_688": {
        "plotSummary": "Four strangers on a drunken wedding dash from LA to Vegas hit a mysterious woman in the desert and must overcome injuries, the elements, and ultimately each other to survive. Read more: Synopsis",
        "runtimeMinutes": "88"
    },
    "2015_689": {
        "plotSummary": "After a freak accident, Burt finds himself locked in a coffin overnight. After surviving the ordeal, he decides to live his life purely for pleasure, but ultimately he finds himself in a bizarre war of the sexes. Starring Lea Seydoux (BLUE...See moreAfter a freak accident, Burt finds himself locked in a coffin overnight. After surviving the ordeal, he decides to live his life purely for pleasure, but ultimately he finds himself in a bizarre war of the sexes. Starring Lea Seydoux (BLUE IS THE WARMEST COLOR).See less",
        "runtimeMinutes": "130"
    },
    "2015_69": {
        "plotSummary": "In the near future, crime is patrolled by a mechanized police force. When one police droid, Chappie, is stolen and given new programming, he becomes the first robot with the ability to think and feel for himself.",
        "runtimeMinutes": "120"
    },
    "2015_690": {
        "plotSummary": "A film 35 years in the making. One man's journey to become a legend of the Boardwalk by claiming the title of World Champion in the fast paced sport of professional Skeeball.",
        "runtimeMinutes": "84"
    },
    "2015_691": {
        "plotSummary": "Fabricating credentials to score a last-ditch job as a high school guidance counsellor, a boozing, drug-addled former child star becomes an improbable hit with his students by dispensing the worst advice possible.",
        "runtimeMinutes": "81"
    },
    "2015_692": {
        "plotSummary": "Miss Hill: Making Dance Matter tells the inspiring and largely unknown story of a woman whose life was defined by her love for dance. Martha Hill emerges as dance's secret weapon, someone who fought against great odds to establish dance as...See moreMiss Hill: Making Dance Matter tells the inspiring and largely unknown story of a woman whose life was defined by her love for dance. Martha Hill emerges as dance's secret weapon, someone who fought against great odds to establish dance as a legitimate art form in America. Through archival footage, lively interviews with friends and intimates, and rare footage of the spirited subject, the film explores Hills's arduous path from a Bible Belt childhood in Ohio to the halls of academe at NYU and Bennington College to a position of power and influence as Juilliard's founding director of dance (1952-1985). Peppered with anecdotal material delivered by dance notables who knew her, this revelatory story depicts her struggles and successes, including the battle royal that accompanied her move to the Lincoln Center campus.  Written by AnonymousSee less",
        "runtimeMinutes": "84"
    },
    "2015_693": {
        "plotSummary": "A WWII pilot, bombardier, and radioman find themselves adrift on a lifeboat without food or water after being forced to ditch their plane during a scouting mission.",
        "runtimeMinutes": "100"
    },
    "2015_694": {
        "plotSummary": "SEEDS OF TIME follows agriculture pioneer Cary Fowler's global journey to save the eroding foundation of our food supply in a new era of climate change. Read more: Synopsis",
        "runtimeMinutes": "77"
    },
    "2015_695": {
        "plotSummary": "A documentary about the outcome of a decision made by a brother and sister in 1945. One missed meeting, two families, and three generations.",
        "runtimeMinutes": "96"
    },
    "2015_696": {
        "plotSummary": "Mexico City. 2002, 2006, 2010. A cop. A hostage. A wife. Corruption, violence, vengeance. Three destinies, during 30 days, during three Soccer World Cups. Three ways to fight in order to survive.",
        "runtimeMinutes": "133"
    },
    "2015_697": {
        "plotSummary": "An aspiring poet in 1950s New York has his ordered world shaken when he embarks on a week-long retreat to save his hell raising hero, Dylan Thomas.",
        "runtimeMinutes": "97"
    },
    "2015_698": {
        "plotSummary": "The fate of an arm wrestling match leads two brothers to a house party where the younger one hopes to lose his virginity, but when things get out of hand the boys must overcome their sibling rivalry if they are going to save the day.",
        "runtimeMinutes": "99"
    },
    "2015_699": {
        "plotSummary": "A married couple's romantic weekend is turned upside down when the husband's ex-girlfriend, a woman he's secretly obsessed with, is running the ski lodge where they're staying.",
        "runtimeMinutes": "86"
    },
    "2015_7": {
        "plotSummary": "After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school.",
        "runtimeMinutes": "95"
    },
    "2015_70": {
        "plotSummary": "Joy is the story of the title character, who rose to become founder and matriarch of a powerful family business dynasty.",
        "runtimeMinutes": "124"
    },
    "2015_700": {
        "plotSummary": "Filmed over three years on what will soon be the world's largest railway network, 'The Iron Ministry' traces the vast interiors of a country on the move: flesh and metal, clangs and squeals, light and dark, language and gesture.",
        "runtimeMinutes": "82"
    },
    "2015_701": {
        "plotSummary": "A lesbian daughter fights off an arranged marriage in India while a religious fundamentalist targets an anti-extremist scholar in New York.",
        "runtimeMinutes": "102"
    },
    "2015_702": {
        "plotSummary": "Pastor Douglas Wilson was invited to Indiana University to deliver a series of lectures on traditional marriage and family. Wilson was warned about possible protests and potential violence over his \"dissenting\" opinion but stood behind the...See morePastor Douglas Wilson was invited to Indiana University to deliver a series of lectures on traditional marriage and family. Wilson was warned about possible protests and potential violence over his \"dissenting\" opinion but stood behind the lectern anyway. The Free Speech Apocalypse documents the intensity that ensued on April 13, 2012, when a group of Midwest college students decided that Wilson's traditional views are now to be considered \"hate speech\" and that hurling insults, profanity, and disrupting his attempt to rationally present his views was acceptable. Darren Doane, director of the ground-breaking documentary, Collision, and box-office smash-hit Unstoppable, returns with his most bold, uncensored, and provocative film to date. The Free Speech Apocalypse exposes the strategies of the anti-God, anti-traditional, hyper-liberal elite and offers perspective on the cultural decay that has accelerated over the three years since Wilson's visit to Indiana University. Worst yet, The Free Speech Apocalypse demonstrates clearly the erosion of free speech and religious liberty in America. The right to hold your own opinions is vanishing at an alarming rate, and it's time for ordinary Americans to wake up and speak out.  Written by -The Liberty AllianceSee less",
        "runtimeMinutes": "94"
    },
    "2015_703": {
        "plotSummary": "Good policing doesn't necessarily mean doing everything by the book. But as the business of crime in London turns to favour the Albanians and Turks, how does a \"good\" policeman survive?",
        "runtimeMinutes": "112"
    },
    "2015_704": {
        "plotSummary": "A hate-crime has been committed in a the small city of Braxton, N.Y. Five migrant laborers have been beaten, shot, then ditched. This will upset the delicate balance of an ethnically diverse populace.",
        "runtimeMinutes": "90"
    },
    "2015_705": {
        "plotSummary": "A film about finding hope, written and acted by a group of New York City foster care teenagers from the stories of their lives and directed by first-time director Juan Carlos Pineiro Escoriaza. 'Know How' reveals the dynamic journeys of 5 ...See moreA film about finding hope, written and acted by a group of New York City foster care teenagers from the stories of their lives and directed by first-time director Juan Carlos Pineiro Escoriaza. 'Know How' reveals the dynamic journeys of 5 teenagers confronting the realities of life in and around the NYC foster care system. Using a multi-protagonist structure with songs and music, the narrative film weaves a powerful, eye-opening tale of loss, devastation, struggle, and redemption as each character must learn, must know how, to survive. 'Know How' shines a spotlight on the unseen national crisis that is foster care through the authentic voice and real-life view of those living inside it.  Written by Paul GriffinSee less",
        "runtimeMinutes": "106"
    },
    "2015_706": {
        "plotSummary": "John and Elissa's perfect destination wedding is derailed when their college friends get drunk on tequila.",
        "runtimeMinutes": "81"
    },
    "2015_707": {
        "plotSummary": "River Miller, a mentally unstable actor haunted by the past, moves to Hollywood to start his life over, only to find his inner demons are inescapable.",
        "runtimeMinutes": "90"
    },
    "2015_708": {
        "plotSummary": "A reformed, hot-tempered bounty hunter, finds his new harmonious life as a Fugitive Recovery Agent threatened. He must track down a group of cyber hackers before they are assassinated by a rival bounty hunter while also trying to prevent a...See moreA reformed, hot-tempered bounty hunter, finds his new harmonious life as a Fugitive Recovery Agent threatened. He must track down a group of cyber hackers before they are assassinated by a rival bounty hunter while also trying to prevent a massive viral attack, which could collapse America's economic foundation.  Written by Bennie SwintSee less",
        "runtimeMinutes": "104"
    },
    "2015_709": {
        "plotSummary": "Filmmaker Robert J. Flaherty presents a docufictional account of a family living in a Samoan village in the early 1920s.",
        "runtimeMinutes": "77"
    },
    "2015_71": {
        "plotSummary": "The true story of Whitey Bulger, the brother of a state senator and the most infamous violent criminal in the history of South Boston, who became an FBI informant to take down a Mafia family invading his turf.",
        "runtimeMinutes": "123"
    },
    "2015_710": {
        "plotSummary": "A neo-noir revenge thriller centering on Julia Shames, who after suffering a brutal trauma, falls prey to an unorthodox form of therapy to restore herself. Written by Anonymous",
        "runtimeMinutes": "95"
    },
    "2015_711": {
        "plotSummary": "A French woman returns to her childhood home in Cameroon - formerly a colonial outpost - where she's flooded by memories, particularly of Protee, her servant.",
        "runtimeMinutes": "105"
    },
    "2015_712": {
        "plotSummary": "A night out turns deadly when three girls break into a seemingly empty mansion.",
        "runtimeMinutes": "75"
    },
    "2015_713": {
        "plotSummary": "The end of one journey only marks the beginning of another as Detective Loomis returns to uncover the truth behind the Legend of Pitchfork.",
        "runtimeMinutes": "92"
    },
    "2015_714": {
        "plotSummary": "A blend of interviews, concert footage, and personal moments chronicle the making of the band Arcade Fire's album, Reflektor.",
        "runtimeMinutes": "75"
    },
    "2015_715": {
        "plotSummary": "Driven to rage over the tawdry excesses of reality television, a self-appointed cultural crusader kidnaps several very famous nobodies to make his point- but his crimes only generate more tabloid frenzy.",
        "runtimeMinutes": "84"
    },
    "2015_716": {
        "plotSummary": "A Korean American man meets his Chinese American girlfriend's parents for the first time. Drama, cultural struggles, and laughter ensue.",
        "runtimeMinutes": "84"
    },
    "2015_717": {
        "plotSummary": "A womanizing yet lovable loser, Charlie, a waiter in his early 30's who dreams of selling his book entitled \"7 STEPS OF HEALING THE MALE BROKEN HEART\" finds himself still working in restaurants to survive in the Big Apple. Low on cash, ...See moreA womanizing yet lovable loser, Charlie, a waiter in his early 30's who dreams of selling his book entitled \"7 STEPS OF HEALING THE MALE BROKEN HEART\" finds himself still working in restaurants to survive in the Big Apple. Low on cash, he's left with no other choice but to look for a roommate to share his tiny studio. Surprisingly, the first person to answer the ad is his ex and only love of his life Pam, who broke his heart and disappeared without reason and the inspiration behind his book. The Pam he remembered was a youthful spirit with lots of money who is now broke and disheveled. A new story begins and it is up to Charlie to find out why she ran out on him and what's happened to her over the past three years. With a potential new love in his life, he must gather the strength to help Pam get back on her feet without rekindling old feelings.  Written by AnonymousSee less",
        "runtimeMinutes": "93"
    },
    "2015_718": {
        "plotSummary": "An in-depth look into the exploding subculture of sneaker collecting and the widespread influence it has had on popular culture around the world.",
        "runtimeMinutes": "73"
    },
    "2015_719": {
        "plotSummary": "F.W. de Klerk was the last president of apartheid South Africa. He went from Mandela's jailer to his subordinate and together they changed history. Rossier explores the fascinating political journey and legacy of this complicated figure.",
        "runtimeMinutes": "75"
    },
    "2015_72": {
        "plotSummary": "The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core.",
        "runtimeMinutes": "129"
    },
    "2015_720": {
        "plotSummary": "A weekend camping trip turns into a fight for survival.",
        "runtimeMinutes": "75"
    },
    "2015_721": {
        "plotSummary": "Troubled 13-year-old Julie loses her mother and must go to Indiana to live with her grandmother Karen who has the early stages of Alzheimer's and wants to pass on all she knows to her granddaughter before it's too late.",
        "runtimeMinutes": "110"
    },
    "2015_722": {
        "plotSummary": "Three surf lifesavers on a big night out. Jealousy, homophobic fears and unrequited lust culminate in a tragic booze-fueled episode of near-fatal bullying.",
        "runtimeMinutes": "93"
    },
    "2015_723": {
        "plotSummary": "An ex-convict is trying to make a new life for himself in a new city. But his new life is challenged when his foreboding and charismatic former cell mate arrives in town.",
        "runtimeMinutes": "94"
    },
    "2015_724": {
        "plotSummary": "Alice is a young investigative reporter. She suffers a sorrowful loss but finds an enigmatic commune where she starts to find her will to live and love again.",
        "runtimeMinutes": "94"
    },
    "2015_725": {
        "plotSummary": "Life and death in a cardiac critical care unit. We follow two amazing doctors for a month as they make their rounds. Their approach to treating patients shows a path toward solving the healthcare crisis in the US.",
        "runtimeMinutes": "64"
    },
    "2015_726": {
        "plotSummary": "Two young people from different parts of the world, their vastly different cultures and their journey of self-discovery during the drive to the largest music festival in California.",
        "runtimeMinutes": "108"
    },
    "2015_727": {
        "plotSummary": "THE BIG CHILL meets THE GRADUATE. What could have been? What might have been? Reunions can be exciting, frustrating, exhilarating, nostalgic, one life given over to practicality while another chases lost dreams. Set against the majestic ...See moreTHE BIG CHILL meets THE GRADUATE. What could have been? What might have been? Reunions can be exciting, frustrating, exhilarating, nostalgic, one life given over to practicality while another chases lost dreams. Set against the majestic landscape of the desert, three estranged friends and former band mates \"celebrate\" turning 30, carrying their hopes, unresolved wounds and intertwined romantic baggage, in this hysterically funny and poignant look at lost loves, forgotten dreams and missed opportunity of three young adults in the final stages of giving up their youth.  Written by monterey media inc.See less",
        "runtimeMinutes": "90"
    },
    "2015_728": {
        "plotSummary": "Katherine is a typical teenager. Today's her funeral. The four adults in her life have a lot on their mind - and it's not all about Katherine either. With a frankness that's strikingly disarming as well as frequently self-serving, the ...See moreKatherine is a typical teenager. Today's her funeral. The four adults in her life have a lot on their mind - and it's not all about Katherine either. With a frankness that's strikingly disarming as well as frequently self-serving, the grown-ups struggle with being... well... grown-up.See less",
        "runtimeMinutes": "90"
    },
    "2015_729": {
        "plotSummary": "Can a family separated by the transatlantic slave trade sing and dance its way back together? In Perico, Cuba is an Afro-Cuban group that has kept alive songs and dances brought aboard a slave ship by their ancestor, known only as Josefa. ...See moreCan a family separated by the transatlantic slave trade sing and dance its way back together? In Perico, Cuba is an Afro-Cuban group that has kept alive songs and dances brought aboard a slave ship by their ancestor, known only as Josefa. They preserved them proudly despite slavery, poverty and repression. Through years of searching, filmmaker Emma Christopher tried to find their origins. Then, in a remote village in Sierra Leone, people watched a recording of the Cubans' songs and dances, joyously declared 'They are We!' and joined in with the songs. They had never forgotten their lost family, and now their descendants were coming home. So began preparations for the biggest festival in the village's history, a welcoming home for their cousins.  Written by AnonymousSee less",
        "runtimeMinutes": "77"
    },
    "2015_73": {
        "plotSummary": "An unscrupulous troublemaker suffering from erectile dysfunction has his world turned sideways, as an angel from above teaches him the consequences of sex and love, and why the two cannot be forced.",
        "runtimeMinutes": "124"
    },
    "2015_730": {
        "plotSummary": "Martha Barlow, a modern-day outlaw, must reconcile her dark past after her teenage son commits a horrible crime.",
        "runtimeMinutes": "104"
    },
    "2015_731": {
        "plotSummary": "A middle aged farmer, living with his old and bedridden father, tries to find truth in life.",
        "runtimeMinutes": "93"
    },
    "2015_732": {
        "plotSummary": "When twelve cartoons depicting the Prophet Muhammad were published by Denmark's largest newspaper in 2005, European muslim groups denounced the cartoons as insulting and sacrilegious. To everyone's surprise, the protests against the ...See moreWhen twelve cartoons depicting the Prophet Muhammad were published by Denmark's largest newspaper in 2005, European muslim groups denounced the cartoons as insulting and sacrilegious. To everyone's surprise, the protests against the Muhammad drawings took a worldwide scale, even leading to violent demonstrations in several Muslim countries. In France, the satirical news magazine Charlie Hebdo joined the conversation and reprinted the controversial cartoons, causing an uproar among the country's growing Muslim population. Months later, the Great Mosque of Paris, the World Muslim League and the Union of Islamic Organizations of France took Charlie Hebdo's editor Philippe Val to court for defamation and incitement of hatred. Tough Being Loved by Jerks offers a real-time account of the ensuing trial, arguably one most divisive and heated legal proceedings in recent French history. The film features lawyers, witnesses, journalists, editorial conferences, demonstrations of support, as well as the reactions of the prosecutors and Muslim leaders around the world. Given new relevance after the January 7, 2015, attacks at the Charlie Hebdo offices, which left 12 dead and 11 wounded, Tough Being Loved by Jerks also features candid interviews (and rarely seen behind-the-scenes moments) with acclaimed Charlie Hebdo cartoonists, such as Cabu, Charb, Tignous and Wolinski, who were killed on January 7, 2015. As such, the film offers a unique perspective into the current debate around France's founding ideals and its current realities.See less",
        "runtimeMinutes": "110"
    },
    "2015_733": {
        "plotSummary": "Successful businesswoman Maria has achieved everything except what she wants the most - a baby of her own. She decides to deal with the matter by herself and embarks on a desperate and dangerous journey in order to make her dream come true.",
        "runtimeMinutes": "97"
    },
    "2015_734": {
        "plotSummary": "'Chicas Paranoicas' is the first Spanish comedy about the world of fashion in a fictional work, though with dramatic elements. It tells the story of three girls (Ana, Paula and Veronica) who enter it by chance, seeing a way to earn a ...See more'Chicas Paranoicas' is the first Spanish comedy about the world of fashion in a fictional work, though with dramatic elements. It tells the story of three girls (Ana, Paula and Veronica) who enter it by chance, seeing a way to earn a little easy money, and soon become fascinated.See less",
        "runtimeMinutes": "100"
    },
    "2015_735": {
        "plotSummary": "Paris, 1830: Octave, betrayed by his mistress, sinks into despair and debauchery. His father's death leads him to the country where he meets Brigitte, a widow who is ten years his elder. Octave falls in love passionately, but will he have ...See moreParis, 1830: Octave, betrayed by his mistress, sinks into despair and debauchery. His father's death leads him to the country where he meets Brigitte, a widow who is ten years his elder. Octave falls in love passionately, but will he have the courage to believe in it?  Written by ProductionSee less",
        "runtimeMinutes": "120"
    },
    "2015_74": {
        "plotSummary": "Two siblings become increasingly frightened by their grandparents' disturbing behavior while visiting them on vacation.",
        "runtimeMinutes": "94"
    },
    "2015_75": {
        "plotSummary": "A little girl lives in a very grown-up world with her mother, who tries to prepare her for it. Her neighbor, the Aviator, introduces the girl to an extraordinary world where anything is possible, the world of the Little Prince.",
        "runtimeMinutes": "108"
    },
    "2015_76": {
        "plotSummary": "While Korea is occupied by the Japanese Army in 1933, the resistance plans to kill the Japanese Commander. But their plan is threatened by a traitor within their group and also the enemies' forces are hunting them down.",
        "runtimeMinutes": "140"
    },
    "2015_77": {
        "plotSummary": "A family whose suburban home is haunted by evil forces must come together to rescue their youngest daughter after the apparitions take her captive.",
        "runtimeMinutes": "93"
    },
    "2015_78": {
        "plotSummary": "A honest cop seeks justice for a common man against all odds. A rich boy seeks revenge on the cop.",
        "runtimeMinutes": "123"
    },
    "2015_79": {
        "plotSummary": "A recounting of a New England whaling ship's sinking by a giant whale in 1820, an experience that later inspired the great novel Moby-Dick.",
        "runtimeMinutes": "122"
    },
    "2015_8": {
        "plotSummary": "Ethan and his team take on their most impossible mission yet when they have to eradicate an international rogue organization as highly skilled as they are and committed to destroying the IMF.",
        "runtimeMinutes": "131"
    },
    "2015_80": {
        "plotSummary": "While undercover officer Kit is taken prisoner by the syndicate, he befriends his keeper and discovers an organ trafficking ring.",
        "runtimeMinutes": "120"
    },
    "2015_81": {
        "plotSummary": "A champion boxer fights to get his daughter back from child protective services as well as revive his professional career, after a fatal incident sends him on a rampant path of destruction.",
        "runtimeMinutes": "124"
    },
    "2015_82": {
        "plotSummary": "As the Best Exotic Marigold Hotel has only a single remaining vacancy, posing a rooming predicament for two fresh arrivals, Sonny Kapoor (Dev Patel) pursues his expansionist dream of opening a second hotel.",
        "runtimeMinutes": "122"
    },
    "2015_83": {
        "plotSummary": "After an all-night adventure, Quentin's lifelong crush, Margo, disappears, leaving behind clues that Quentin and his friends follow on the journey of a lifetime.",
        "runtimeMinutes": "109"
    },
    "2015_84": {
        "plotSummary": "An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico.",
        "runtimeMinutes": "121"
    },
    "2015_85": {
        "plotSummary": "An assassin teams up with a woman to help her find her father and uncover the mysteries of her ancestry.",
        "runtimeMinutes": "96"
    },
    "2015_86": {
        "plotSummary": "An imaginative woman copes with a debilitating form of cancer by remaining optimistic and spending time with her friends.",
        "runtimeMinutes": "85"
    },
    "2015_87": {
        "plotSummary": "Two weeks shy of his wedding, a socially awkward guy enters into a charade by hiring the owner of a company that provides best men for grooms in need.",
        "runtimeMinutes": "101"
    },
    "2015_88": {
        "plotSummary": "Using a special camera that can see spirits, a family must protect their daughter from an evil entity with a sinister plan.",
        "runtimeMinutes": "88"
    },
    "2015_89": {
        "plotSummary": "An Indian man with a magnanimous heart takes a young mute Pakistani girl back to her homeland to reunite her with her family.",
        "runtimeMinutes": "163"
    },
    "2015_9": {
        "plotSummary": "Katniss and a team of rebels from District 13 prepare for the final battle that will decide the fate of Panem.",
        "runtimeMinutes": "137"
    },
    "2015_90": {
        "plotSummary": "A seemingly perfect family looks to fix their problems with the help of Miss Clara, an older, wiser woman.",
        "runtimeMinutes": "120"
    },
    "2015_91": {
        "plotSummary": "In the south of France, former special-ops mercenary Frank Martin enters into a game of chess with a femme-fatale and her three sidekicks who are looking for revenge against a sinister Russian kingpin.",
        "runtimeMinutes": "96"
    },
    "2015_92": {
        "plotSummary": "Mobster and hit man Jimmy Conlon has one night to figure out where his loyalties lie: with his estranged son, Mike, whose life is in danger, or his longtime best friend, mob boss Shawn Maguire, who wants Mike to pay for the death of his own son.",
        "runtimeMinutes": "114"
    },
    "2015_93": {
        "plotSummary": "During an attack on a U.S. compound in Libya, a security team struggles to make sense out of the chaos.",
        "runtimeMinutes": "144"
    },
    "2015_94": {
        "plotSummary": "",
        "runtimeMinutes": "88"
    },
    "2015_95": {
        "plotSummary": "A young woman, born at the turn of the 20th century, is rendered ageless after an accident. After many solitary years, she meets a man who complicates the eternal life she has settled into.",
        "runtimeMinutes": "112"
    },
    "2015_96": {
        "plotSummary": "Legendary Chinese anti-hero Zhong Kui, a young man endowed with mysterious powers who is forced into a battle among the realms of Heaven, Earth and Hell in the course of his attempt to save his countrymen and the woman he loves.",
        "runtimeMinutes": "118"
    },
    "2015_97": {
        "plotSummary": "A fictitious love story loosely inspired by the lives of Danish artists Lili Elbe and Gerda Wegener. Lili and Gerda's marriage and work evolve as they navigate Lili's groundbreaking journey as a transgender pioneer.",
        "runtimeMinutes": "119"
    },
    "2015_98": {
        "plotSummary": "An American nanny is shocked that her new English family's boy is actually a life-sized doll. After she violates a list of strict rules, disturbing events make her believe that the doll is really alive.",
        "runtimeMinutes": "97"
    },
    "2015_99": {
        "plotSummary": "The lives of a young couple intertwine with a much older man, as he reflects back on a past love.",
        "runtimeMinutes": "123"
    }
}