{
    "2017_1": "Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares for battle with the First Order.",
    "2017_10": "When a pilot crashes and tells of conflict in the outside world, Diana, an Amazonian warrior in training, leaves home to fight a war, discovering her full powers and true destiny.",
    "2017_100": "When a crime organization from North Korea crosses borders and enters South Korean soil, a South Korean detective must cooperate with a North Korean detective to investigate their whereabouts.",
    "2017_101": "Tells the true and untold story of prolific rapper, actor, poet and activist Tupac Shakur.",
    "2017_102": "A social satire in which a man realizes he would have a better life if he were to shrink himself to five inches tall, allowing him to live in wealth and splendor.",
    "2017_103": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the activity is thrown into doubt when her ex-husband intervenes.",
    "2017_104": "Two brothers attempt to pull off a heist during a NASCAR race in North Carolina.",
    "2017_105": "Madea, Bam, and Hattie venture to a haunted campground and the group must run for their lives when monsters, goblins, and the boogeyman are unleashed.",
    "2017_106": "Set in 1950s London, Reynolds Woodcock is a renowned dressmaker whose fastidious life is disrupted by a young, strong-willed woman, Alma, who becomes his muse and lover.",
    "2017_107": "Things go terribly wrong for a group of girlfriends who hire a male stripper for a bachelorette party in Miami.",
    "2017_108": "A teenage boy journeys to find his missing father only to discover that he's actually Bigfoot.",
    "2017_109": "A group of warriors protect the world from a monster invasion.",
    "2017_11": "Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer.",
    "2017_110": "During the Japanese colonial era, roughly 400 Korean people, who were forced onto Battleship Island (\"Hashima Island\") to mine for coal, attempt to a dramatic escape.",
    "2017_111": "Five medical students, obsessed by what lies beyond the confines of life, embark on a daring experiment: by stopping their hearts for short periods, each triggers a near-death experience - giving them a firsthand account of the afterlife.",
    "2017_112": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
    "2017_113": "A veteran hunter helps an FBI agent investigate the murder of a young woman on a Wyoming Native American reservation.",
    "2017_114": "After undergoing a procedure to erase his memories, a successful author begins having unexplained recollections relating to a series of unsolved murders.",
    "2017_115": "Detective Harry Hole investigates the disappearance of a woman whose scarf is found wrapped around an ominous-looking snowman.",
    "2017_116": "Frank, a single man raising his child prodigy niece Mary, is drawn into a custody battle with his mother.",
    "2017_117": "In a story depicted in oil painted animation, a young man comes to the last hometown of painter Vincent van Gogh (Robert Gulaczyk) to deliver the troubled artist's final letter and ends up investigating his final days there.",
    "2017_118": "Based on \"The Little Broomstick\" by Mary Stewart, a strange flower grants a girl magic powers.",
    "2017_119": "In 1980s Italy, romance blossoms between a seventeen-year-old student and the older man hired as his father's research assistant.",
    "2017_12": "Captain Jack Sparrow is pursued by old rival Captain Salazar and a crew of deadly ghosts who have escaped from the Devil's Triangle. They're determined to kill every pirate at sea...notably Jack.",
    "2017_120": "After 20 years abroad, Mark Renton returns to Scotland and reunites with his old friends Sick Boy, Spud, and Begbie.",
    "2017_121": "When one school teacher unwittingly causes another teacher's dismissal, he is challenged to an after-school fight.",
    "2017_122": "A woman lands a dream job at a powerful tech company called the Circle, only to uncover an agenda that will affect the lives of all of humanity.",
    "2017_123": "A Heffley family road trip to attend Meemaw's 90th birthday party goes hilariously off course thanks to Greg's newest scheme to get to a video gaming convention.",
    "2017_124": "In the Ming dynasty of China, Shen Lian (starring Chang Chen), a secret police of corrupt government, is trapped by the conspiracy on a mission. To prove the innocence, he seeks the truth with a girl called Bei Zhai (starring Yang Mi).",
    "2017_125": "Ash Ketchum from Pallet Town is 10 years old today. This means he is now old enough to become a Pokemon Trainer. Ash dreams big about the adventures he will experience after receiving his first Pokemon from Professor Oak.",
    "2017_126": "Life for a single mom in Los Angeles takes an unexpected turn when she allows three young guys to move in with her.",
    "2017_127": "The world's top thieves join forces to pull off the heist of a lifetime. But when they find themselves pursued across Europe by a legendary French detective, they'll have to take their game to the next level.",
    "2017_128": "Tad Jones, the most awkward explorer, must rescue his beloved Sara from a millionaire who is looking for King Midas' necklace.",
    "2017_129": "In 1892, a legendary Army Captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.",
    "2017_13": "In the summer of 1989, a group of bullied kids band together to destroy a shape-shifting monster, which disguises itself as a clown and preys on the children of Derry, their small Maine town.",
    "2017_130": "When three runaways shack up in an abandoned general store, a supernatural correspondence connects them to many lives that were all touched by the owner of the store years before they were born.",
    "2017_131": "A mother stops at nothing to recover her kidnapped son.",
    "2017_132": "After the town takes away their daughter's college scholarship, a couple start an illegal casino in their friend's house to make back the money.",
    "2017_133": "A high school student discovers one of his classmates, Sakura Yamauchi, is suffering from a terminal illness. This secret brings the two together, as she lives out her final moments.",
    "2017_134": "Seven lifelong friends, a dinner, a blood red moon eclipse, a game involving to read the seven cell phones' incoming messages. A night where anything that can be bad will be very bad.",
    "2017_135": "A cop with a connection to the criminal underworld scours a nightclub in search of his kidnapped son.",
    "2017_136": "An obsessive CEO of a company meets a ragged chef by chance. They are drawn closer together because of their love for delicacies, yet their personalities clash big time.",
    "2017_137": "When her son is kidnapped, the inventor of a time machine teams up with multiple versions of her future self to rescue him.",
    "2017_138": "Three friends stumble upon the horrific origins of a mysterious figure they discover is the root cause of the evil behind unspeakable acts.",
    "2017_139": "When Greg Sestero, an aspiring film actor, meets the weird and mysterious Tommy Wiseau in an acting class, they form a unique friendship and travel to Hollywood to make their dreams come true.",
    "2017_14": "Fueled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne enlists the help of his new-found ally, Diana Prince, to face an even greater enemy.",
    "2017_140": "Unlikely allies from different sides of the law must work together to achieve a common goal -- trapping the world's most legendary con man.",
    "2017_141": "Kirito uncovers a conspiracy within Ordinal Scale, a popular AR game developed for a new system called The Augma.",
    "2017_142": "Prem and Raja are twin brothers who are seperated at birth but are uniquely connected to eachother via their reflexes. They reunite as adults and set out to take down the underground smuggling world.",
    "2017_143": "In 1636, King Injo hides in the mountains to avoid being part of the Qing dynasty.",
    "2017_144": "Despite the title, the Wishbone family are far from happy. In an attempt to reconnect as a family, Mum and Emma plan a fun night out. However, her plan backfires when an evil witch curses them, and they're all turned into Monsters.",
    "2017_145": "The unexpected arrival of a wounded Union soldier at a girls school in Virginia during the American Civil War leads to jealousy and betrayal.",
    "2017_146": "A rookie officer is teamed with a hardened pro at the California Highway Patrol, though the newbie soon learns his partner is really an undercover Fed investigating a heist that may involve some crooked cops.",
    "2017_147": "An ambitious young executive is sent to retrieve his company's CEO from an idyllic but mysterious \"wellness center\" at a remote location in the Swiss Alps, but soon suspects that the spa's treatments are not what they seem.",
    "2017_148": "Based on the true story of the Granite Mountain Hotshots, a group of elite firefighters who risk everything to protect a town from a historic wildfire.",
    "2017_149": "Keepers of the Warsaw Zoo, Antonina and Jan Zabinski, must save hundreds of people and animals during the Nazi invasion in WWII Poland.",
    "2017_15": "In a future where mutants are nearly extinct, an elderly and weary Logan leads a quiet life. But when Laura, a mutant child pursued by scientists, comes to him for help, he must get her to safety.",
    "2017_150": "Badrinath Bansal from Jhansi and Vaidehi Trivedi from Kota belong to small towns but have diametrically opposite opinions on everything. This leads to a clash of ideologies, despite both of them recognizing the goodness in each other. Read more: Synopsis",
    "2017_151": "Schoolchildren Norimichi, Yûsuke and Jun'ichi want to know if fireworks look round or flat from the side. They make a plan to find the answer at a fireworks display, while Nazuna schemes to run away with Norimichi or Yûsuke, whoever wins at the pool.",
    "2017_152": "Upon learning that their mother has been lying to them for years about their allegedly deceased father, two fraternal twin brothers hit the road in order to find him.",
    "2017_153": "Moscow, 1953. After being in power for nearly thirty years, Soviet dictator Joseph Vissarionovich Stalin (Adrian McLoughlin) takes ill and quickly dies. Now the members of the Council of Ministers scramble for power.",
    "2017_154": "Jolly is a clumsy lawyer who is faced with representing the most critical court case of his career.",
    "2017_155": "The film tells the story of an elderly woman (played by Na Moon Hee) who constantly files complaints with the local office about the wrongs that she sees around her each day. Along the way, she forms an unlikely friendship with a junior ...See moreThe film tells the story of an elderly woman (played by Na Moon Hee) who constantly files complaints with the local office about the wrongs that she sees around her each day. Along the way, she forms an unlikely friendship with a junior civil service officer (played by Lee Je Hoon) who begins to teach her English. Though the film is a comedy, the genre serves as a vehicle to discuss the deeper topic of Korean comfort women during World War II.  Written by subratjain1See less",
    "2017_156": "A teenage girl discovers a box that carries magic powers and a deadly price for using them.",
    "2017_157": "Fact-based drama set during the 1967 Detroit riots in which a group of rogue police officers respond to a complaint with retribution rather than justice on their minds.",
    "2017_158": "An undercover police officer attempts to take down a drug trafficking syndicate from the inside.",
    "2017_159": "A young girl comes of age in a dysfunctional family of nonconformist nomads with a mother who's an eccentric artist and an alcoholic father who would stir the children's imagination with hope as a distraction to their poverty.",
    "2017_16": "A deadly threat from Earth's history reappears and a hunt for a lost artifact takes place between Autobots and Decepticons, while Optimus Prime encounters his creator in space.",
    "2017_160": "An orphan girl dreams of becoming a ballerina and flees her rural Brittany for Paris, where she passes for someone else and accedes to the position of pupil at the Grand Opera house.",
    "2017_161": "A troubled ex-cop imprisoned for a hit-and-run accident discovers that the entire penitentiary is controlled by an inmate who has been running a crime syndicate with the help of the warden and guards which provides them 100% alibi.",
    "2017_162": "Secure within a desolate home as an unnatural threat terrorizes the world, a man has established a tenuous domestic order with his wife and son. Then a desperate young family arrives seeking refuge.",
    "2017_163": "A true-life drama, centering on British explorer Major Percival Fawcett, who disappeared whilst searching for a mysterious city in the Amazon in the 1920s.",
    "2017_164": "A former serial killer with Alzheimer's fights to protect his daughter from her psychotic boyfriend.",
    "2017_165": "The true story of the 1973 tennis match between World number one Billie Jean King and ex-champ and serial hustler Bobby Riggs.",
    "2017_166": "After Kwon, an exceptional gamer, is wrongly framed for murder, he along with his allies decides to find the real culprit and prove his innocence.",
    "2017_167": "An investigative journalist and self-proclaimed atheist sets out to disprove the existence of God after his wife becomes a Christian.",
    "2017_168": "A woman sets out to make life a living hell for her ex-husband's new fiancee.",
    "2017_169": "A woman threatens to leave her husband unless he installs a toilet in their home. To win back her love and respect, he heads out on a journey to fight against the backward society.",
    "2017_17": "After the Vietnam war, a team of scientists explores an uncharted island in the Pacific, venturing into the domain of the mighty Kong, and must fight to escape a primal Eden.",
    "2017_170": "Movie adaptation of the third route of Fate/Stay Night.",
    "2017_171": "A royal descendant of an ancient winged tribe embarks on a quest to find magical pearls. When they fall into the hands of a human, he joins a team of unlikely heroes in a race against time to prevent the destruction of his people.",
    "2017_172": "February 12 is just another day in Sam's charmed life, until it turns out to be her last. Stuck reliving her last day over and over, Sam untangles the mystery around her death and discovers everything she's losing.",
    "2017_173": "The first human born on Mars travels to Earth for the first time, experiencing the wonders of the planet through fresh eyes. He embarks on an adventure with a street-smart girl to discover how he came to be.",
    "2017_174": "On Coney Island in the 1950s, a lifeguard tells the story of a middle-aged carousel operator, his beleaguered wife, and the visitor who turns their lives upside-down.",
    "2017_175": "A depressed middle-aged tour guide who lives in his own bubble gets another chance to experience and face reality through a chirpy girl.",
    "2017_176": "Kenny Wells, a prospector desperate for a lucky break, teams up with a similarly eager geologist and sets off on a journey to find gold in the uncharted jungle of Indonesia.",
    "2017_177": "In 1920s France an orphan is adopted by a rustic couple who work for a rural landowner. Left to himself, he soon comes under the spell of the local poacher.",
    "2017_178": "Based on the true life story of a young Marine corporal whose unique discipline and bond with her military combat dog saved many lives during their deployment in Iraq.",
    "2017_179": "Raúl, Eduardo and Santiago have led a happy and \"straight\" life since their childhood, until, one day, Santiago confesses to them that he is gay.",
    "2017_18": "A suit-wearing, briefcase-carrying baby pairs up with his 7-year old brother to stop the dastardly plot of the CEO of Puppy Co.",
    "2017_180": "A courtroom drama centered around the murder of a factory president.",
    "2017_181": "A look at the life of Roh Moo-hyun, South Korea's president from 2003-2008.",
    "2017_182": "The wife of a successful movie producer takes a car trip from the south of France to Paris with one of her husband's associates.",
    "2017_183": "Roman J. Israel, Esq., a driven, idealistic defense attorney, finds himself in a tumultuous series of events that lead to a crisis and the necessity for extreme action.",
    "2017_184": "Join Karan and Charan in a very crazy yet chaotic marriage of the year.",
    "2017_185": "From BBC Earth Films, the studio that brought you Earth, comes the sequel - Earth: One Amazing Day, an astonishing journey revealing the awesome power of the natural world. Over the course of one single day, we track the sun from the ...See moreFrom BBC Earth Films, the studio that brought you Earth, comes the sequel - Earth: One Amazing Day, an astonishing journey revealing the awesome power of the natural world. Over the course of one single day, we track the sun from the highest mountains to the remotest islands to exotic jungles. Breakthroughs in filmmaking technology bring you up close with a cast of unforgettable characters. Told with humour, intimacy and a jaw-dropping sense of cinematic splendour, Earth: One Amazing Day highlights how every day is filled with more wonders than you can possibly imagine- until now.See less",
    "2017_186": "As a 1950s suburban community self-destructs, a home invasion has sinister consequences for one seemingly normal family.",
    "2017_187": "A former secretary, newly appointed as a scriptwriter for propaganda films, joins the cast and crew of a major production while the Blitz rages around them.",
    "2017_188": "Set during the last days of the Ottoman Empire, The Promise follows a love triangle between Michael, a brilliant medical student, the beautiful and sophisticated Ana, and Chris - a renowned American journalist based in Paris.",
    "2017_189": "A young man and his three younger siblings, who have kept secret the death of their beloved mother in order to remain together, are plagued by a sinister presence in the sprawling manor in which they live.",
    "2017_190": "England 1959. In a small East Anglian town, Florence Green decides, against polite but ruthless local opposition, to open a bookshop.",
    "2017_191": "The final Viceroy of India, Louis Francis Albert Victor Nicholas Mountbatten, 1st Earl Mountbatten of Burma (Hugh Bonneville), is tasked with overseeing the transition of British India to independence, but meets with conflict as different ...See moreThe final Viceroy of India, Louis Francis Albert Victor Nicholas Mountbatten, 1st Earl Mountbatten of Burma (Hugh Bonneville), is tasked with overseeing the transition of British India to independence, but meets with conflict as different sides clash in the face of monumental change.See less",
    "2017_192": "After a 10 year absence, Jean returns to his hometown when his father falls ill. Reuniting with his sister Juliette and his brother Jeremie, they have to re-build their relationship and trust as a family again.",
    "2017_193": "A clever King and his brilliant chronicle keeper hunt for the truth behind a crime that threatens the throne and the stability of the country.",
    "2017_194": "In a twisted social experiment, eighty Americans are locked in their high-rise corporate office in Bogotá, Colombia, and ordered by an unknown voice coming from the company's intercom system to participate in a deadly game of kill or be killed.",
    "2017_195": "Set over one summer, the film follows precocious six-year-old Moonee as she courts mischief and adventure with her ragtag playmates and bonds with her rebellious but caring mother, all while living in the shadows of Walt Disney World.",
    "2017_196": "The adventure of a Jewish boy and his brother escaping Nazi persecution in occupied France.",
    "2017_197": "A runaway couple go on an unforgettable journey in the faithful old RV they call \"The Leisure Seeker\".",
    "2017_198": "In the 13th century, an amnesiac soldier vows to get his revenge on the Mongol army that ransacked his village.",
    "2017_199": "The story of Thurgood Marshall, the crusading lawyer who would become the first African-American Supreme Court Justice, as he battles through one of his career-defining cases.",
    "2017_2": "A selfish Prince is cursed to become a monster for the rest of his life, unless he learns to fall in love with a beautiful young woman he keeps prisoner.",
    "2017_20": "After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind.",
    "2017_200": "A group of U.S. soldiers returning from Iraq struggle to integrate back into family and civilian life, while living with the memory of a war that threatens to destroy them long after they've left the battlefield.",
    "2017_201": "An arthritic Nova Scotia woman works as a housekeeper while she hones her skills as an artist and eventually becomes a beloved figure in the community.",
    "2017_202": "Two car thief brothers, who journey to the south of France for new opportunities, wind up in the cross hairs of the local crime boss.",
    "2017_203": "During the 16th century, Japanese pirates proliferate along the Chinese coastline. In 1557, the pirates take over Cengang in Zhejiang. After months of futile advances, Commander Yu (Sammo Hung) finally defeats them under the leadership of ...See moreDuring the 16th century, Japanese pirates proliferate along the Chinese coastline. In 1557, the pirates take over Cengang in Zhejiang. After months of futile advances, Commander Yu (Sammo Hung) finally defeats them under the leadership of newly promoted General Qi (Vincent Zhao). The Pirates, however, manage to escape.See less",
    "2017_204": "A prestigious Stockholm museum's chief art curator finds himself in times of both professional and personal crisis as he attempts to set up a controversial new exhibit.",
    "2017_205": "In Japanese-occupied Hong Kong, a school teacher and her would-be-fiance link up with Chinese guerrilla fighters, forging their own path to freedom.",
    "2017_206": "For the first time in Korean history, the mayor of Seoul attempts a third term in office.",
    "2017_207": "Whoever thinks that the countryside is calm and peaceful is mistaken. In it we find especially agitated animals, a Fox that thinks it's a chicken, a Rabbit that acts like a stork, and a Duck who wants to replace Father Christmas. If you ...See moreWhoever thinks that the countryside is calm and peaceful is mistaken. In it we find especially agitated animals, a Fox that thinks it's a chicken, a Rabbit that acts like a stork, and a Duck who wants to replace Father Christmas. If you want to take a vacation, keep driving past this place.See less",
    "2017_208": "A traumatized veteran, unafraid of violence, tracks down missing girls for a living. When a job spins out of control, Joe's nightmares overtake him as a conspiracy is uncovered leading to what may be his death trip or his awakening.",
    "2017_209": "An artist falls for a young married woman while he's commissioned to paint her portrait during the Tulip mania of seventeenth century Amsterdam.",
    "2017_21": "Celebrates the birth of show business and tells of a visionary who rose from nothing to create a spectacle that became a worldwide sensation.",
    "2017_210": "A young Englishman plots revenge against his late cousin's mysterious, beautiful wife, believing her responsible for his death. But his feelings become complicated as he finds himself falling under the beguiling spell of her charms.",
    "2017_211": "A young musician from a small town in China tries to save his town's treasured Rock Park by organizing a charity rock concert.",
    "2017_212": "Dr. Seung-hoon sedates his landlord before medical check-up, when the old man begins telling him a convincing murder confession.",
    "2017_213": "A female assassin leaves a trail of bodies behind her as she seeks revenge.",
    "2017_214": "Stronger is the inspiring real life story of Jeff Bauman, an ordinary man who captured the hearts of his city and the world to become a symbol of hope after surviving the 2013 Boston Marathon bombing.",
    "2017_215": "A desperate single mother moves with her three children into the notorious, supposedly haunted, real-life Amityville house to try and use its dark powers to cure her comatose son. Things go horribly wrong.",
    "2017_216": "Condorito embarks in a hilarious adventure to save the planet and his loved ones from an evil alien.",
    "2017_217": "A bootlegger sets out to improve his community as a promising leader but falls in a political trap.",
    "2017_218": "Writer James Baldwin tells the story of race in modern America with his unfinished novel, Remember This House.",
    "2017_219": "The journey that led to Charles Dickens' creation of \"A Christmas Carol,\" a timeless tale that would redefine Christmas.",
    "2017_22": "After the Kingsman's headquarters are destroyed and the world is held hostage, an allied spy organisation in the United States is discovered. These two elite secret organisations must band together to defeat a common enemy.",
    "2017_220": "A group of friends embark on a fun adventure determined to find a college roommate who disappeared without a trace on graduation day.",
    "2017_221": "Zhao Xudong is a blaster technician. When an explosion happens in the mine and kills four workers, Zhao survives. He suspects that the explosion is not an accident, and when he investigates further, two miners and the mine owner are ...See moreZhao Xudong is a blaster technician. When an explosion happens in the mine and kills four workers, Zhao survives. He suspects that the explosion is not an accident, and when he investigates further, two miners and the mine owner are murdered. As the body count increases, Zhao becomes the prime suspect, and he has to clear his own name.See less",
    "2017_222": "Members of the advocacy group ACT UP Paris demand action by the government and pharmaceutical companies to combat the AIDS epidemic in the early 1990s.",
    "2017_223": "A two-hander action comedy in the vein of Midnight Run (1988), about an ex-F.B.I. Agent (Tommy Lee Jones) and an ex-mob lawyer in the Witness Protection Program (Morgan Freeman) having to put aside their petty rivalry on the golf course to...See moreA two-hander action comedy in the vein of Midnight Run (1988), about an ex-F.B.I. Agent (Tommy Lee Jones) and an ex-mob lawyer in the Witness Protection Program (Morgan Freeman) having to put aside their petty rivalry on the golf course to fend off a mob hit.See less",
    "2017_224": "A holistic medicine practitioner attends a wealthy client's dinner party after her car breaks down.",
    "2017_225": "The relationship between writer AA Milne and his son, Christopher Robin, and how this became the inspiration for Winnie the Pooh.",
    "2017_226": "A midwife gets unexpected news from her father's old mistress.",
    "2017_227": "An atheist goes through a near-death experience in a car accident before converting to Christianity.",
    "2017_228": "Set against the backdrop of 1960s San Francisco, BIRTH OF THE DRAGON is a modern take on the classic movies that Bruce Lee was known for. It takes its inspiration from the epic and still controversial showdown between an up-and-coming ...See moreSet against the backdrop of 1960s San Francisco, BIRTH OF THE DRAGON is a modern take on the classic movies that Bruce Lee was known for. It takes its inspiration from the epic and still controversial showdown between an up-and-coming Bruce Lee and kung fu master Wong Jack Man - a battle that gave birth to a legend.See less",
    "2017_229": "Cursed with a life of immortality, a samurai is tasked by a young girl to help avenge the death of her father. Based on the manga series by Hiroaki Samura.",
    "2017_23": "An ancient Egyptian princess is awakened from her crypt beneath the desert, bringing with her malevolence grown over millennia, and terrors that defy human comprehension.",
    "2017_230": "Steven, a charismatic surgeon, is forced to make an unthinkable sacrifice after his life starts to fall apart, when the behavior of a teenage boy he has taken under his wing turns sinister.",
    "2017_231": "Ninety-six hours before the World War II invasion of Normandy, British Prime Minister Winston Churchill struggles with his severe reservations with Operation Overlord and his increasingly marginalized role in the war effort.",
    "2017_232": "A successful and single career woman asks her co-worker to pose as her boyfriend at a family wedding back home in Mexico. Her situation gets complicated when her ex shows up at the ceremony.",
    "2017_233": "International art dealer Ron Hall must befriend a dangerous homeless man in order to save his struggling marriage to his wife, a woman whose dreams will lead all three of them on the journey of their lives.",
    "2017_234": "An American widow finds unexpected love with a man living wild on Hampstead Heath when they take on the developers who want to destroy his home.",
    "2017_235": "A young street artist in East Los Angeles is caught between his father's obsession with lowrider car culture, his ex-felon brother and his need for self-expression.",
    "2017_236": "Norman Oppenheimer is a small time operator who befriends a young politician at a low point in his life. Three years later, when the politician becomes an influential world leader, Norman's life dramatically changes for better and worse.",
    "2017_237": "When a group of Burmese refugees join the congregation, the pastor of a failing Anglican church attempts to aid them by planting crops and enlisting the help of the community.",
    "2017_238": "A man must marry a tree to ward off threats to his love-life, but the tree turns out to have more spirit than the man bargained for.",
    "2017_239": "Based on the true story of acclaimed music icon \"Dalida\" born in Cairo, who gained celebrity in the 50s, singing in French, Spanish, Arabic, Hebrew, German, Italian, playing in awarded Youssef Chahine's picture \"Le Sixième Jour\", and who ...See moreBased on the true story of acclaimed music icon \"Dalida\" born in Cairo, who gained celebrity in the 50s, singing in French, Spanish, Arabic, Hebrew, German, Italian, playing in awarded Youssef Chahine's picture \"Le Sixième Jour\", and who later committed suicide in 1987 in Paris, after selling more than 130 million records worldwide  Written by Lisa AzuelosSee less",
    "2017_24": "Lightning McQueen sets out to prove to a new generation of racers that he's still the best race car in the world.",
    "2017_240": "Janet (Dame Kristin Scott Thomas) hosts a party to celebrate her new promotion, but once the guests arrive, it becomes clear that not everything is going to go down as smoothly as the red wine.",
    "2017_241": "A crown prince emerges as a leader during the war between Korea and Japan in 1592.",
    "2017_242": "Adi and Tara move to Mumbai to pursue their dreams. A chance meeting sparks off a heady, no strings attached romance until their careers pull them apart. Will ambition prevail over matters of the heart?",
    "2017_243": "A decade after An Inconvenient Truth brought climate change to the heart of popular culture, the follow-up shows just how close we are to a real energy revolution.",
    "2017_244": "In 19th-century rural England, a young bride who has been sold into marriage discovers an unstoppable desire within herself as she enters into an affair with a worker on her estate.",
    "2017_245": "A rich man's fortune cookie: \"Tonight you'll meet someone special.\" He meets a maid, made aristocrat for the evening to avoid 13 at the dinner party in Paris. They spend the night together. while the hostess stalks them.",
    "2017_246": "Katja's life collapses after the death of her husband and son in a bomb attack. After a time of mourning and injustice, Katja seeks revenge.",
    "2017_247": "A man becomes haunted by his past and is presented with a mysterious legacy that causes him to re-think his current situation in life.",
    "2017_248": "Eloise, having been relieved of maid of honor duties after being unceremoniously dumped by the best man via text, decides to attend the wedding anyway, only to find herself seated with five fellow unwanted guests at the dreaded Table 19.",
    "2017_249": "A profile of an ancient city and its unique people, seen through the eyes of the most mysterious and beloved animal humans have ever known, the Cat.",
    "2017_25": "While Christian wrestles with his inner demons, Anastasia must confront the anger and envy of the women who came before her.",
    "2017_250": "The inspiring true love story of Robin (Andrew Garfield) and Diana Cavendish (Claire Foy), an adventurous couple who refuse to give up in the face of a devastating disease. Their heartwarming celebration of human possibility marks the ...See moreThe inspiring true love story of Robin (Andrew Garfield) and Diana Cavendish (Claire Foy), an adventurous couple who refuse to give up in the face of a devastating disease. Their heartwarming celebration of human possibility marks the directorial debut of Andy Serkis.See less",
    "2017_251": "Chloe, a fragile young woman, falls in love with her psychoanalyst, Paul. A few months later she moves in with him, but soon discovers that her lover is concealing a part of his identity.",
    "2017_252": "The early years of Karl Marx, Friedrich Engels and Jenny Marx, between Paris, Brussels and London.",
    "2017_253": "When the evil Dr Hell attacks the Earth, the mighty giant mecha Mazinger Z is formed to stop him.",
    "2017_254": "A CIA interrogator is lured into a ruse that puts London at risk of a biological attack. Read more: Synopsis",
    "2017_255": "A story of two brothers set during the Sino-Indian war, 1962: the younger one who's at war at the borders and the elder who's at war with his own world.",
    "2017_256": "With instructions from her genius son's carefully crafted notebook, a single mother sets out to rescue a young girl from the hands of her abusive stepfather.",
    "2017_257": "Gloria is an out-of-work party girl forced to leave her life in New York City and move back home. When reports surface that a giant creature is destroying Seoul, she gradually comes to the realization that she is somehow connected to this phenomenon.",
    "2017_258": "Two American Soldiers are trapped by a lethal sniper, with only an unsteady wall between them.",
    "2017_259": "After Japan's attack on Pearl Harbor Dec. 7, 1941, USA bombs Tokyo to boost morale. A pilot survives thanks to a Chinese woman's help.",
    "2017_26": "When a murder occurs on the train on which he's travelling, celebrated detective Hercule Poirot is recruited to solve the case.",
    "2017_260": "The story of Mark Felt, who under the name \"Deep Throat\" helped journalists Bob Woodward and Carl Bernstein uncover the Watergate scandal in 1972.",
    "2017_261": "A poker-playing restaurateur and former traveling salesman befriends a group of refugees newly arrived to Finland.",
    "2017_262": "Isabelle, Parisian artist, divorced mother, is looking for love, true love at last.",
    "2017_263": "Women are left behind to work a family farm during the Great War.",
    "2017_264": "An ailing movie star comes to terms with his past and mortality.",
    "2017_265": "A romance sparks between a young actor and a Hollywood leading lady.",
    "2017_266": "Sheriff Dan Tashtego and a team of creeper hunters enlist the help of officer Davis Tubbs to help stop the monster's eating spree.",
    "2017_267": "Director Agnes Varda and photographer/muralist J.R. journey through rural France and form an unlikely friendship.",
    "2017_268": "A young street magician (Jacob Latimore) is left to care for his little sister after their parents' passing, and turns to illegal activities to keep a roof over their heads. When he gets in too deep, his sister is kidnapped, and he is ...See moreA young street magician (Jacob Latimore) is left to care for his little sister after their parents' passing, and turns to illegal activities to keep a roof over their heads. When he gets in too deep, his sister is kidnapped, and he is forced to use his magic and brilliant mind to save her.  Written by BlumhouseSee less",
    "2017_269": "A maid witnesses a murder at an upscale hotel and a policeman is assigned to the case, but it soon becomes clear that important people don't want the case solved.",
    "2017_27": "Xander Cage is left for dead after an incident, though he secretly returns to action for a new, tough assignment with his handler Augustus Gibbons.",
    "2017_270": "A man's life is derailed when an ominous pattern of events repeats itself in exactly the same manner every day, ending at precisely 2:22 p.m.",
    "2017_271": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her teenage son, John Connor, from a more advanced and powerful cyborg.",
    "2017_272": "A couple going through a divorce must team up to find their son who has disappeared during one of their bitter arguments.",
    "2017_273": "The story of the titular girl known only as \"Otome\" and her insanely long night of partying and drinking-complete with a book fair, festival, and many adventures in between. It is also the story of \"Senpai,\" her upper class man who has ...See moreThe story of the titular girl known only as \"Otome\" and her insanely long night of partying and drinking-complete with a book fair, festival, and many adventures in between. It is also the story of \"Senpai,\" her upper class man who has been attempting to get closer to her by \"coincidentally\" running into her again and again. However, on this night, meeting up with her may be the greatest challenge of his life.See less",
    "2017_274": "The story of Django Reinhardt, famous guitarist and composer, and his flight from German-occupied Paris in 1943.",
    "2017_275": "A father takes his son to tour colleges on the East Coast and meets up with an old friend who makes him feel inferior about his life's choices.",
    "2017_276": "Set in Boston in 1978, a meeting in a deserted warehouse between two gangs turns into a shoot-out and a game of survival.",
    "2017_277": "Marina, a transgender woman who works as a waitress and moonlights as a nightclub singer, is bowled over by the death of her older boyfriend.",
    "2017_278": "In Agatha Christie's most twisted tale, a spy-turned-private-detective is lured by his former lover to catch her grandfather's murderer before Scotland Yard exposes dark family secrets.",
    "2017_279": "After an emotional exchange between a Lebanese Christian and a Palestinian refugee escalates, the men end up in a court case that gets national attention.",
    "2017_28": "A cooler-than-ever Bruce Wayne must deal with the usual suspects as they plan to rule Gotham City, while discovering that he has accidentally adopted a teenage orphan who wishes to become his sidekick.",
    "2017_280": "Two decades after three teenagers disappeared in the wake of mysterious lights appearing above Phoenix, Arizona, unseen footage from that night has been discovered, chronicling the final hours of their fateful expedition.",
    "2017_281": "A father goes all out to clear his daughter from any wrong doing in the murder of his fiance. When all evidence points to her, he takes matters into to his own hands to save his daughter and outwit the judiciary system.",
    "2017_282": "Michael and Madison Roland had planned to spend the rest of their lives together, until one day Michael's controlling ways turned their perfect marriage. With the help of her best friend, Madison decides to get away. After adopting a new ...See moreMichael and Madison Roland had planned to spend the rest of their lives together, until one day Michael's controlling ways turned their perfect marriage. With the help of her best friend, Madison decides to get away. After adopting a new identity, she meets Alex Stone and learns to love again. All is well, until Michael discovers Madison's whereabouts, and recreates the nightmare she once lived all over again.  Written by ProductionSee less",
    "2017_283": "Gaurav, a simple hard working guy for a white collar job visits Mumbai for a meeting where his doppelganger is about to bring chaos in his life.",
    "2017_284": "The story of the 1980 tennis rivalry between the placid Björn Borg and the volatile John McEnroe.",
    "2017_285": "Focused on French painter Paul Gauguin's affair with a younger lady in Tahiti.",
    "2017_286": "Tells the tale of two children separated by fifty years. In 1927, Rose searches for the actress whose life she chronicles in her scrapbook; in 1977, Ben runs away from home to find his father.",
    "2017_287": "After a botched bank robbery lands his younger brother in prison, Connie Nikas embarks on a twisted odyssey through New York City's underworld to get his brother Nick out of jail.",
    "2017_288": "After dominating boxing for over two decades, Floyd Mayweather decides to challenge Conor McGregor, the king of MMA, to a boxing bout to determine once and for all who is the king of fighting.",
    "2017_289": "An unhinged social media stalker moves to LA and insinuates herself into the life of an Instagram star.",
    "2017_29": "A couples relationship is tested by the untimely appearances of their exes!",
    "2017_290": "Roy Neary, an electric lineman, watches how his quiet and ordinary daily life turns upside down after a close encounter with a UFO.",
    "2017_291": "A young woman, studying to be a vet, develops a craving for human flesh.",
    "2017_292": "The story follows a filmmaker whose life is sent into a tailspin by the return of a former lover just as he is about to embark on the shoot of a new film.",
    "2017_293": "Harriet is a retired businesswoman who tries to control everything around her. When she decides to write her own obituary, a young journalist takes up the task of finding out the truth resulting in a life-altering friendship.",
    "2017_294": "Collective screening of the Academy Award nominated short films from the Live Action category for 2017.",
    "2017_295": "An intimate look at the life and work of Greek-American opera singer Maria Callas, as told in her own words.",
    "2017_296": "An isolated community of superhumans fight to protect themselves.",
    "2017_297": "Lucky follows the spiritual journey of a 90-year-old atheist and the quirky characters that inhabit his off the map desert town.",
    "2017_298": "A student in Amsterdam tries to win over a young woman by chasing after a packet of drugs, which happens to belong to the Dutch mafia.",
    "2017_299": "Dying prematurely in a car crash, a woman first returns as a wife and mother of 2 for a week, before returning to be the single lawyer again. However, there's no name or body switch so is it real or just a dream? Will she learn something?",
    "2017_3": "When a mysterious woman seduces Dominic Toretto into the world of terrorism and a betrayal of those closest to him, the crew face trials that will test them as never before.",
    "2017_30": "Twelve years after the tragic death of their little girl, a doll-maker and his wife welcome a nun and several girls from a shuttered orphanage into their home, where they become the target of the doll-maker's possessed creation, Annabelle.",
    "2017_300": "A well-to-do French family deals with a series of setbacks and crises.",
    "2017_301": "Life of three men comes in trouble when their photos appear on advertisement for sterilization.",
    "2017_302": "When tragedy strikes three families, their destiny forces them on a converging path to discover God's love, grace and mercy as the challenges of their fate could also resurrect their beliefs.",
    "2017_303": "Explore the world to see how it intersects with the stories related in Genesis. Del Tackett of \"The Truth Project\" hikes through canyons, climbs mountains, and dives below the sea to examine two competing views - one compelling truth.",
    "2017_304": "Spring. Yorkshire. Young farmer Johnny Saxby numbs his daily frustrations with binge drinking and casual sex, until the arrival of a Romanian migrant worker for lambing season ignites an intense relationship that sets Johnny on a new path.",
    "2017_305": "Adrift in New York City, a recent college graduate's life is upended by his father's mistress.",
    "2017_306": "Filmed live on stage at the Pantages Theatre in Hollywood, CA, this is a not-to-be-missed high energy show starring Original Broadway cast members.",
    "2017_307": "Two sets of wealthy parents meet for dinner to decide what to do about a crime their sons have committed.",
    "2017_308": "Produced by CBN Documentaries and Biblical Productions, \"In Our Hands\" tells the story of the Battle of Jerusalem in the Six-Day War through the eyes of the IDF's 55th Paratrooper Brigade, highlighting their role in the liberation of ...See moreProduced by CBN Documentaries and Biblical Productions, \"In Our Hands\" tells the story of the Battle of Jerusalem in the Six-Day War through the eyes of the IDF's 55th Paratrooper Brigade, highlighting their role in the liberation of Jerusalem. The docudrama combines dramatic reenactments with interviews of veterans of the Six-Day War and archival footage and photos.See less",
    "2017_309": "A detective seeks out the truth between two different stories of a crime scene.",
    "2017_31": "Based on the New York Times bestseller, this movie tells the incredibly inspiring and heartwarming story of August Pullman, a boy with facial differences who enters the fifth grade, attending a mainstream elementary school for the first time.",
    "2017_310": "Lyndon B. Johnson aligns himself with John F. Kennedy, rises to the Presidency, and deals with the civil rights struggles of the 1960s.",
    "2017_311": "A washed-up former child star, forced to do community service at a local megachurch, pretends to be a Christian to land the part of Jesus in their annual Passion Play, only to discover that the most important role of his life is far from Hollywood.",
    "2017_312": "Jin-hong is a coldhearted prosecutor who's obsessed with catching the man who murdered his mother. He quickly becomes the prime suspect when the deceased woman returns from the grave to avenge her death.",
    "2017_313": "Debra Winger and Tracy Letts play a long-married, dispassionate couple who are both in the midst of serious affairs. But on the brink of calling it quits, a spark between them suddenly reignites, leading them into an impulsive romance.",
    "2017_314": "The story of Nisha, daughter of a Pakistani-Norwegian family, who is kidnapped to Pakistan by her parents when her father finds her in bed with a man.",
    "2017_315": "A psychoanalyst named Elia goes to the gym and meets a personal trainer who changes his life.",
    "2017_316": "An experience about the highest peaks around the world.",
    "2017_317": "A housewife struggles with her husband after he is possessed by a ghost.",
    "2017_318": "Fiona visits Paris for the first time to assist her myopic Aunt Martha. Catastrophes ensue, mainly involving Dom, a homeless man who has yet to have an emotion or thought he was afraid of expressing.",
    "2017_319": "The gang encounters with some spiritual bodies and finds out the truth about the Jamnadas Orphanage where they were brought up.",
    "2017_32": "After Ferdinand, a bull with a big heart, is mistaken for a dangerous beast, he is captured and torn from his home. Determined to return to his family, he rallies a misfit team on the ultimate adventure.",
    "2017_320": "Actors Steve Coogan and Rob Brydon embark on a six-part episodic road trip through Europe. This time they're in Spain, sampling the restaurants, eateries, and sights along the way.",
    "2017_321": "After her mother's death, six-year-old Frida is sent to her uncle's family to live with them in the countryside. But Frida finds it hard to forget her mother and adapt to her new life.",
    "2017_322": "Within Brooklyn's ultra-orthodox Jewish community, a widower battles for custody of his son. A tender drama performed entirely in Yiddish, the film intimately explores the nature of faith and the price of parenthood.",
    "2017_323": "In this singular exploration of legacy, love, loss, and the enormity of existence, a recently deceased, white-sheeted ghost returns to his suburban home to try to reconnect with his bereft wife.",
    "2017_324": "Follows the famous physicist and chemist Marie Curie and her struggle for recognition in the male-dominated science community in early 20th century France.",
    "2017_325": "The life and work of the renowned primatology scientist, Jane Goodall, especially on her research about chimpanzees.",
    "2017_326": "The story of psychologist William Moulton Marston, and his polyamorous relationship with his wife and their mistress who would inspire his creation of the superheroine, Wonder Woman.",
    "2017_327": "Thirty years after they served together in Vietnam, a former Navy Corpsman Larry \"Doc\" Shepherd re-unites with his old buddies, former Marines Sal Nealon and Reverend Richard Mueller, to bury his son, a young Marine killed in the Iraq War.",
    "2017_328": "Human Flow is director and artist Ai Weiwei's detailed and heartbreaking exploration into the global refugee crisis.",
    "2017_329": "Two intersecting love triangles. Obsession and betrayal set against the music scene in Austin, Texas.",
    "2017_33": "Three girls are kidnapped by a man with a diagnosed 23 distinct personalities. They must try to escape before the apparent emergence of a frightful new 24th.",
    "2017_330": "Award-winning filmmaker Dome Karukoski brings to screen the life and work of artist Touko Valio Laaksonen (aka Tom of Finland), one of the most influential and celebrated figures of twentieth century gay culture.",
    "2017_331": "Allied soldiers from Belgium, the British Empire, and France are surrounded by the German Army and evacuated during a fierce battle in World War II.",
    "2017_332": "Wrongfully accused and sent to prison, a former basketball star prepares for the national slam dunk competition while finding redemption in himself and in those he loves.",
    "2017_333": "The story of Swiss painter and sculptor Alberto Giacometti.",
    "2017_334": "In the Middle Ages, a young servant fleeing from his master takes refuge at a convent full of emotionally unstable nuns. Introduced as a deaf mute man, he must fight to hold his cover as the nuns try to resist temptation.",
    "2017_335": "A headhunter whose life revolves around closing deals in a survival-of-the-fittest boiler room, battles his top rival for control of their job placement company -- his dream of owning the company clashing with the needs of his family.",
    "2017_336": "'Walk With Me' is a meditative film about a community of Zen Buddhist monks and nuns who have dedicated their lives to mastering the art of mindfulness with their world-famous teacher Thich Nhat Hanh.",
    "2017_337": "This 2017 movie follows the original dance academy TV show and tracks where the characters are in their lives now.",
    "2017_338": "A young father takes his nine-year-old son, the family dog, and two of his son's friends backpacking in the mountains of Colorado only for all five of them to be struck by lightning.",
    "2017_339": "If there is one part of the Bible that has undergone more scrutiny and abuse than any other, it is the very beginning-GENESIS. Both from within and without the church, assaults on GENESIS continue to question the Creation and ultimately ...See moreIf there is one part of the Bible that has undergone more scrutiny and abuse than any other, it is the very beginning-GENESIS. Both from within and without the church, assaults on GENESIS continue to question the Creation and ultimately the Creator. So, what exactly happened at the \"Creation,\" at the \"Beginning?\" Creation Today and Seven Fold Films is proud to announce that for the first time ever, using stunning visual effects and the latest in scientific research, GENESIS will come to life right before your very eyes. We have heard the phrase \"In the beginning\" many times; now we get to see it on the big screen.See less",
    "2017_34": "Young Blade Runner K's discovery of a long-buried secret leads him to track down former Blade Runner Rick Deckard, who's been missing for thirty years.",
    "2017_340": "Love, ambition, treason and death clash in a neverending search for a city built with gold.",
    "2017_341": "A homeless orphan in Kenya becomes a lucrative businessman, only to give it all up and open an orphanage that today serves over 2000 Kenyan children.",
    "2017_342": "PATTI CAKE$ is centered on aspiring rapper Patricia Dombrowski, a.k.a. Killa P, a.k.a. Patti Cake$, who is fighting an unlikely quest for glory in her downtrodden hometown in New Jersey. Read more: Synopsis",
    "2017_343": "A confused religious girl tries to deny her feelings for a female friend who's in love with her. This causes her suppressed subconsciously-controlled psychokinetic powers to reemerge with devastating results.",
    "2017_344": "A young Jeffrey Dahmer struggles to belong in high school. Read more: Synopsis",
    "2017_345": "In the new film, based on the Hiro Mashima's manga, Natsu Dragneel and his friends travel to the island Kingdom of Stella, where they will reveal dark secrets, fight the new enemies and once again save the world from destruction.",
    "2017_346": "In 1967, during the making of \"La Chinoise,\" film director Jean-Luc Godard falls in love with 19-year-old actress Anne Wiazemsky and marries her.",
    "2017_347": "A bar mitzvah mishap causes a major rift in a devout Orthodox community in Jerusalem. Read more: Synopsis",
    "2017_348": "Stand-up comedian Chonda Pierce, known as the \"Queen of Clean\", continues to share her emotional journey and story in this sequel to her 2015 award winning documentary \"Chonda Pierce: Laughing In The Dark\".",
    "2017_349": "A sleep doctor tries to protect a family from a demon that feeds on people in their nightmares.",
    "2017_35": "Two professors team up to locate a lost treasure and embark on an adventure that takes them from a Tibetan ice cave to Dubai, and to a mountain temple in India.",
    "2017_350": "12 August 1945, 11 AM. Two mysterious strangers dressed in black appear at the railway station of a Hungarian village. Within a few hours, everything changes.",
    "2017_351": "A charismatic drug lord tries to start a new life after he falls for a young woman from Philadelphia.",
    "2017_352": "Steve McQueen truly is an American Icon. One of America's most endearing and intriguing movie stars, he \"is still the King of Cool\" according to Esquire Magazine-50 years after the zenith of his career. The strangest thing about him, ...See moreSteve McQueen truly is an American Icon. One of America's most endearing and intriguing movie stars, he \"is still the King of Cool\" according to Esquire Magazine-50 years after the zenith of his career. The strangest thing about him, however, is barely known, despite countless biographies and articles. Steve McQueen was a believer in Jesus Christ. On the surface McQueen had everything he could want-fame, cars, homes, more money than he could spend in a lifetime. An avid fan of the actor (and owner of a replica of McQueen's car in the classic film Bullitt), Pastor Greg Laurie hits the road in his mint Mustang, traveling the country in search of the true, untold story of McQueen's redemption-filled final chapters.  Written by Greg LaurieSee less",
    "2017_353": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
    "2017_354": "In this remake of Kalyana Samayal Saadham, a couple fall in love but then the groom discovers that he suffers from erectile dysfunction.",
    "2017_355": "In the near future, a high school senior discovers that events in her waking life begin to parallel events in her dreams.",
    "2017_356": "Join Jagga, a gifted teenage detective, who along with a female companion, is on a quest to find his missing father.",
    "2017_357": "STEP documents the senior year of a girls' high-school step dance team against the background of inner-city Baltimore.",
    "2017_358": "An adrenaline seeking snowboarder gets lost in a massive winter storm in the back country of the High Sierras where he is pushed to the limits of human endurance and forced to battle his own personal demons as he fights for survival....\"",
    "2017_359": "A Korean-born man finds himself stuck in Columbus, Indiana, where his architect father is in a coma. The man meets a young woman who wants to stay in Columbus with her mother, a recovering addict, instead of pursuing her own dreams.",
    "2017_36": "A young African-American visits his white girlfriend's parents for the weekend, where his simmering uneasiness about their reception of him eventually reaches a boiling point.",
    "2017_360": "The life and career of the hailed Hollywood movie star and underappreciated genius inventor, Hedy Lamarr.",
    "2017_361": "Spark, a teenage monkey and his friends, Chunk and Vix, are on a mission to regain Planet Bana, a kingdom overtaken by the evil overlord Zhong.",
    "2017_362": "A cynical American expatriate struggles to decide whether or not he should help his former lover and her fugitive husband escape French Morocco.",
    "2017_363": "A young couple go on an adventurous vacation to Thailand only to find themselves haunted by a malevolent spirit after naively disrespecting a Ghost House.",
    "2017_364": "The scene is set one Summer in La Ciotat, a town near Marseille which used to be prosperous thanks to its huge dockyard but has been in decline since its closing 25 years before. It is in this context of quiet desperation that a writing ...See moreThe scene is set one Summer in La Ciotat, a town near Marseille which used to be prosperous thanks to its huge dockyard but has been in decline since its closing 25 years before. It is in this context of quiet desperation that a writing workshop has been set up to help a group of seven young people integrate into the world of work. Under the guidance of well-known novelist Olivia Dejazet, the participants are asked to write a noir fiction connected with the industrial past of their hometown. Session after session, one of them, a boy named Antoine, stands out. Provocative and aggressive, he gets noticed by his systematic opposition to all, including Olivia. Even more alarming, the story he has devised and that he reads aloud, the cold description of a mass murder seen through the eyes of its perpetrator, proves very disturbing. Antoine understands the killer too well. At this point, Olivia starts experiencing a feeling of attraction repulsion to Antoine.  Written by Guy BellingerSee less",
    "2017_365": "A tough-as-nails detective embarks on a relentless pursuit to free his son from a nightmarish alien warship.",
    "2017_366": "When Baldwin and Inga's next door neighbours complain that a tree in their backyard casts a shadow over their sundeck, what starts off as a typical spat between neighbours in the suburbs unexpectedly and violently spirals out of control.",
    "2017_367": "The life of celebrated but reclusive author, J.D. Salinger, who gained worldwide fame with the publication of his novel, \"The Catcher in the Rye\".",
    "2017_368": "The story of charismatic painter Wladyslaw Strzeminski, who opposed social realism and maintained his own artistic freedom in spite of political obstacles.",
    "2017_369": "In 1995, a teenager living with her sister and parents in Manhattan discovers that her father is having an affair.",
    "2017_37": "When Shiva, the son of Bahubali, learns about his heritage, he begins to look for answers. His story is juxtaposed with past events that unfolded in the Mahishmati Kingdom.",
    "2017_371": "Set in 1930s Ukraine, as Stalin advances the ambitions of communists in the Kremlin, young artist Yuri battles to save his lover Natalka from the Holodomor, the death-by-starvation program that ultimately killed millions of Ukrainians.",
    "2017_372": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
    "2017_373": "A lonely, neurotic, and hilariously honest middle-aged man reunites with his estranged wife, and meets his teenage daughter for the first time.",
    "2017_374": "A German soldier tries to determine if the Dutch resistance has planted a spy to infiltrate the home of Kaiser Wilhelm in Holland during the onset of World War II, but falls for a young Jewish Dutch woman during his investigation.",
    "2017_375": "A woman in her third trimester of pregnancy is stalked by a stranger who is obsessed with her unborn child.",
    "2017_376": "Bryan Cranston gives the performance of a lifetime as Howard Wakefield, a lawyer on the edge of madness who has decided to disassociate himself from his own life.",
    "2017_377": "Allegiance illuminates one of American history's lesser known chapters as it tells the story of Sam Kimura, transported back nearly six decades to when his younger self and his sister Kei fought to stay connected to their heritage, their ...See moreAllegiance illuminates one of American history's lesser known chapters as it tells the story of Sam Kimura, transported back nearly six decades to when his younger self and his sister Kei fought to stay connected to their heritage, their family and themselves after Japanese Americans were wrongfully imprisoned during World War II. An important story told with great resonance and intimacy, Allegiance explores the ties that bind us, the struggle to persevere and the overwhelming power of forgiveness and, most especially, loveSee less",
    "2017_378": "A behind-the-scenes look at the Paris Opera, under the direction of Stephane Lissner.",
    "2017_379": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
    "2017_38": "A monk and his three disciples continue on their journey to battle demons.",
    "2017_380": "In every generation, a torch passes from father to son. And that timeless dynamic is the beating heart of Tommy's Honour - an intimate, powerfully moving tale of the real-life founders of the modern game of golf.",
    "2017_381": "An intimate documentary following acclaimed North Carolina band the Avett Brothers, as they create their 2016 hit album \"True Sadness.\"",
    "2017_382": "By French law, anyone admitted into the hospital without their consent must be seen by a judge within 12 days. That judge must decide whether these psychiatric hospital patients can be allowed back into society.",
    "2017_383": "Kirk Cameron hosts a \"family meeting\" to discuss unity in a time when political, racial, economic, and religious tensions are increasing every day.",
    "2017_384": "Plot summary includes televised PPV Fight feature Canelo VS. GGG.",
    "2017_385": "Revisit with the remaining original members of the Buena Vista Social Club and explore their contribution to the unknown history of Cuba.",
    "2017_386": "A woman keeps a diary of her extended stay at a mental hospital.",
    "2017_387": "A compelling and never-before-scene look at Chris Brown's controversial life and career.",
    "2017_388": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.",
    "2017_389": "Before Dawn charts the years of exile in the life of famous Jewish Austrian writer Stefan Zweig, his inner struggle for the \"right attitude\" toward the events in war torn Europe, and his search for a new home.",
    "2017_39": "The crew of a colony ship, bound for a remote planet, discover an uncharted paradise with a threat beyond their imagination, and must attempt a harrowing escape.",
    "2017_390": "After being freed from his life in an underground bunker, a man sets out to make a movie of the only TV show he has ever known.",
    "2017_391": "A blind woman's relationship with her husband changes when she regains her sight and discovers disturbing details about themselves.",
    "2017_392": "Scottish islanders try to plunder cases of whisky from a stranded ship.",
    "2017_393": "'The Black Prince' is a story of Queen Victoria and the Last King of Punjab, Maharajah Duleep Singh. His character as it evolves, torn between two cultures and facing constant dilemmas as a result. His relationship with Queen Victoria will...See more'The Black Prince' is a story of Queen Victoria and the Last King of Punjab, Maharajah Duleep Singh. His character as it evolves, torn between two cultures and facing constant dilemmas as a result. His relationship with Queen Victoria will be the most impactful relationship in the film, the Queen representing the English culture he was drawn into. The Black Prince begins a lifelong struggle to regain his Kingdom. It takes him on an extraordinary journey across the world.See less",
    "2017_394": "Larger than life, wild, scary and androgynous - Grace Jones plays all these parts. Yet here we also discover her as a lover, daughter, mother, sister and even grandmother, as she submits herself to our gaze and allows us to understand what...See moreLarger than life, wild, scary and androgynous - Grace Jones plays all these parts. Yet here we also discover her as a lover, daughter, mother, sister and even grandmother, as she submits herself to our gaze and allows us to understand what constitutes her mask. The stage is where her most extreme embodiments are realised and her theatrical imagination lets loose: this is where the musical of her life is played out. The film includes Grace's unique performances singing iconic hits such as Slave To The Rhythm, Pull Up To The Bumper, as well as the more recent autobiographical tracks Williams' Bloods and Hurricane. These personal songs also link to Grace's family life, as the film takes us on a holiday road trip across Jamaica, where her family roots and the story of her traumatic childhood are uncovered. In Jamaican patois, 'Bloodlight' is the red light that illuminates when an artist is recording and 'Bami' means bread, the substance of daily life. Grace Jones: Bloodlight and Bami weaves together the layers of Grace Jones' public and private life, as she moves effortlessly between different facets: she is gypsy, artist and partying hedonist, warm and funny but also a fierce and tenacious businesswoman. The performance continues to move thematically though the film, with Love Is The Drug acting like an aria, bringing the film to its final and most touching scenes. This is a Grace we have not seen before, someone who reminds us of what it is to dare to be truly alive.See less",
    "2017_395": "In this filmed stage play, the prophet Jonah receives a long-awaited fresh word from God, but is dismayed to realize that God wants to show mercy to the Ninevites, whom Jonah hates.",
    "2017_396": "Abraham Bursztein, an 88 year-old Jewish tailor, runs away from Buenos Aires to Poland, where he proposes to find a friend who saved him from certain death at the end of World War II. After seven decades without any contact with him, ...See moreAbraham Bursztein, an 88 year-old Jewish tailor, runs away from Buenos Aires to Poland, where he proposes to find a friend who saved him from certain death at the end of World War II. After seven decades without any contact with him, Abraham will try to find his old friend and keep his promise to return one day.See less",
    "2017_397": "A Lakota elder summons a white writer to visit him and help him write a book about his people.",
    "2017_398": "Set in the early 1960s and during the era of Vatican II, a young woman in training to become a nun struggles with issues of faith, the changing church and sexuality.",
    "2017_399": "Five friends are terrorized by a supernatural entity after downloading a mysterious app. Read more: Synopsis",
    "2017_4": "Gru meets his long-lost, charming, cheerful, and more successful twin brother Dru, who wants to team up with him for one last criminal heist.",
    "2017_40": "Paddington (Ben Whishaw), now happily settled with the Brown family and a popular member of the local community, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy's (Imelda Staunton's) 100th birthday, only for the ...See morePaddington (Ben Whishaw), now happily settled with the Brown family and a popular member of the local community, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy's (Imelda Staunton's) 100th birthday, only for the gift to be stolen.See less",
    "2017_400": "Johnny is a successful bank executive who lives quietly in a San Francisco townhouse with his fiancee, Lisa. One day, putting aside any scruple, she seduces Johnny's best friend, Mark. From there, nothing will be the same again.",
    "2017_401": "A Christian relief organization is met with the challenge of fighting the Ebola epidemic in west Africa, through this enormous challenge their faith grew.",
    "2017_402": "In the 1950's, a working-class wife and mother of eleven children helps to establish a farmer's union, which later develops into a platform for feminism and gender equality.",
    "2017_403": "A man looks to find a way to escape the criminal ways of his outlaw family.",
    "2017_404": "A young lord and his demon butler board a luxury cruise ship to investigate claims of the dead being returned to life, and are faced with various complications.",
    "2017_405": "A woman confronts an older man, her former neighbour, to find out why he abandoned her after they had a sexual relationship.",
    "2017_406": "Before entering a prestigious American university, Gabriel Buchmann decided to travel the world for one year, his backpack full of dreams. After ten months on the road, he arrived in Kenya determined to discover the African continent. ...See moreBefore entering a prestigious American university, Gabriel Buchmann decided to travel the world for one year, his backpack full of dreams. After ten months on the road, he arrived in Kenya determined to discover the African continent. Until he reached the top of Mount Mulanje, Malawi, his last destination.See less",
    "2017_407": "Gertrude Bell, the most powerful woman in the British Empire in her day, shaped the destiny of Iraq after WWI in ways that still reverberate today.",
    "2017_408": "A drama inspired by the life of heavyweight boxer Chuck Wepner, who had a once-in-a-lifetime bout with Muhammad Ali that would inspire the film Rocky.",
    "2017_409": "A killer is entrusted with a sacred mission.",
    "2017_41": "A look at the lives of members of a Military Cultural Troupe in the 1970s.",
    "2017_410": "Based on the novel by Antonio Di Benedetto written in 1956, on Don Diego de Zama, a Spanish officer of the seventeenth century settled in Asunción, who awaits his transfer to Buenos Aires.",
    "2017_411": "A Brooklyn teenager spends his days experimenting with drugs and looking online for older men to meet with.",
    "2017_412": "During the 2006 Northern Ireland peace talks, Sinn Fein leader Martin McGuinness (Colm Meaney) and Democratic Unionist Party leader Ian Paisley (Timothy Spall) are forced to travel by car together.",
    "2017_413": "",
    "2017_414": "A look at the life and work of guitarist Eric Clapton, told by those who have known him best, including BB King, Jimi Hendrix, and George Harrison.",
    "2017_415": "Fiore, an old friend from Mamoru's lonely childhood who couldn't survive on Earth, returns with flowers he promised Mamoru. But, the evil flower Kisenian overpowered Fiore's weak mind and manipulated him into spreading Kisenian's seeds ...See moreFiore, an old friend from Mamoru's lonely childhood who couldn't survive on Earth, returns with flowers he promised Mamoru. But, the evil flower Kisenian overpowered Fiore's weak mind and manipulated him into spreading Kisenian's seeds over Earth in an effort to drain energy from everyone on Earth. Kisenian manages to do this because he's deceived Fiore using Fiore's long-lost friendship with Mamoru. It is up to Sailor Moon and the Sailor Senshi to stop Kisenian.  Written by Ondre Lombard See less",
    "2017_416": "A pop singer gives up her career to become an actress, but she slowly goes insane when she starts being stalked by an obsessed fan and what seems to be a ghost of her past.",
    "2017_417": "Concert film centering on the rock band Pearl Jam's August 2016 shows at Chicago's Wrigley Field.",
    "2017_418": "Three aliens travel to Earth in preparation for a mass invasion, taking possession of human bodies.",
    "2017_419": "An actress wanders around a seaside town, pondering her relationship with a married man.",
    "2017_42": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
    "2017_420": "Cate Blanchett performs manifestos as a series of striking monologues.",
    "2017_421": "This movie is a love story between an idealistic American nurse and a Turkish officer in World War I.",
    "2017_422": "A teenage girl copes with her diagnosis of terminal juvenile Batten disease.",
    "2017_423": "An exploration of the global power and impact of the music of John Coltrane where the passions, experiences and forces that shaped his life and revolutionary sounds are revealed.",
    "2017_424": "Set against the background of a brutal crime gang in Brussels, a tragic love story between Gigi, a high-flying gangster, and Bibi, a young racing driver with very upper-class roots.",
    "2017_425": "A passionate holiday romance leads to an obsessive relationship, when an Australian photojournalist wakes one morning in a Berlin apartment and is unable to leave.",
    "2017_426": "Joe Marshall and Frank Washington are two tenacious police detectives who seek at all costs to stop the Katana, a renegade Yakuza gang composed of violent and sadistic killers who want to lead the drug trade in Los Angeles.",
    "2017_427": "Homeostasis is trying to maintain harmony but considers Meicoomon's power to be an existential threat to both worlds. While the DigiDestined return to the Real World alienated by the abnormal state of the Digital World.",
    "2017_428": "It all started with three little words. I'll Push You is an up-close and personal look into the dynamics of a life-long friendship between of two best friends - Justin Skeesuck and Patrick Gray - as they travel across El Camino de Santiago...See moreIt all started with three little words. I'll Push You is an up-close and personal look into the dynamics of a life-long friendship between of two best friends - Justin Skeesuck and Patrick Gray - as they travel across El Camino de Santiago. This feature-length documentary covers the struggle of the 34-day, 500-mile hike across mountains, deserts, hills, and valleys and features perspectives from family and friends. Even though the story begins with the challenges that come with Patrick's answering of the invitation to push Justin in a wheelchair across northern Spain, it also explores the struggles related to Justin's rare neurological disease. The parallel paths of Patrick's experience in Spain and Justin's life journey come together in a singular moment to reveal to Patrick something unezpected. The story's beautiful cinematography is set to poignant music tracks that underscore, perfectly, the inspiring example of generosity and vulnerability on display. The film is an intimate portrait of an epic journey and explores the true meaning of friendship, generosity, and vulnerability. It's a one-of-a-kind documentary chronicling their pilgrimage, which will resonate with viewers craving stories of faith, hope, love, and the power of community. Their trek in 2014 captured the imagination of the world and was featured in the Huffington Post, The Meredith Vieira Show, Der Spiegel, Fox and Friends, and many other outlets. Since their return from Spain, the subjects of the film are sharing their message of hope, faith, and community worldwide.  Written by Terry ParishSee less",
    "2017_429": "Four friends break into an abandoned insane asylum in search of a death certificate which will grant one of them a large inheritance. However, finding it soon becomes the least of their worries in a place haunted by dark memories.",
    "2017_43": "A dark force threatens Alpha, a vast metropolis and home to species from a thousand planets. Special operatives Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe.",
    "2017_430": "Shortly after delivering a patient to an understaffed hospital, a police officer experiences strange and violent occurrences seemingly linked to a group of mysterious hooded figures.",
    "2017_431": "The history of the Boston Marathon from its humble origins starting with only 15 runners, to the first female runners, through the tragedy in 2013, and ultimately the triumph of 2014.",
    "2017_432": "In 2001, Afghanistan is under the control of the Taliban. When her father is captured, a determined young girl disguises herself as a boy in order to provide for her family.",
    "2017_433": "Mickey Mouse and his pals Minnie, Pluto, Goofy, Daisy, and Donald take their unique transforming vehicles on humorous high-spirited races around the globe as well as hometown capers in Hot Dog Hills.",
    "2017_434": "The third film in Ram Gopal Varma's Sarkar trilogy, which chronicles the exploits of a powerful political figure.",
    "2017_435": "A look at the 30-year career of The Grateful Dead.",
    "2017_436": "In their desperate search for freedom and happiness, four young people from Tehran, Iran are forced to break the taboos of a restrictive, islamic society.",
    "2017_437": "Two estranged sisters are forced to rob a bank in order to save their brother. But this is no ordinary bank. Read more: Synopsis",
    "2017_438": "Televised PPV Fight feature Canelo VS. Chavez Jr.",
    "2017_439": "An evening of drunken prank calls becomes a nightmare for two teenagers when a stranger turns their own game against them, with deadly consequences. Read more: Synopsis",
    "2017_44": "When the network of satellites designed to control the global climate starts to attack Earth, it's a race against the clock for its creator to uncover the real threat before a worldwide Geostorm wipes out everything and everyone.",
    "2017_440": "Writer and urban activist Jane Jacobs fights to save historic New York City during the ruthless redevelopment era of urban planner Robert Moses in the 1960s.",
    "2017_441": "Based on the Iranian Embassy siege of 1980, this action-thriller dramatizes a six-day standoff between armed Iranian Arabs and SAS soldiers ready for a counterattack.",
    "2017_442": "Writers and editors from the New York Times discuss their unique approach to writing the obituaries of public figures.",
    "2017_443": "Artist and filmmaker David Lynch discusses his early life and the events that shaped his outlook on art and the creative process.",
    "2017_444": "An ensemble comedy about the meaning of matrimony.",
    "2017_445": "Born 1861, Lou Andreas Salome shuns tradition in pursuit of intellectual perfection, inflaming the hearts and minds of the 19th century's greatest thinkers, including Friedrich Nietzsche, Rainer Maria Rilke, and Sigmund Freud.",
    "2017_446": "The life of pioneering singer Chavela Vargas, from her birth in Costa Rica in 1919 to her death in Mexico in 2012.",
    "2017_447": "A guide leads two men through an area known as the Zone to find a room that grants wishes.",
    "2017_448": "A successful writer Abhimanyu Roy, stuck with writers block, returns to his roots to write an old-fashioned love story.",
    "2017_449": "Felicite sings in a bar in Kinshasa. When her 14-year-old son has a motorcycle accident, she goes on a frantic search through the streets of Kinshasa, a world of music and dreams. And her path crosses that of Tabu.",
    "2017_45": "Gene, a multi-expressional emoji, sets out on a journey to become a normal emoji.",
    "2017_450": "Madhav meets a girl named Riya and falls in love. After stuggling to convince her to be his girlfriend, she half heartedly agrees to be his \"Half Girlfriend\"",
    "2017_451": "A comedy about loss, grief, and the redemptive power of love. Dean is a NY illustrator who falls hard for an LA woman while trying to prevent his father from selling the family home in the wake of his mother's death.",
    "2017_452": "2 Korean American brothers run a shoe store in LA county. Their friend, black 11 y.o. Kamilla, drops in and helps. This day, the Rodney King verdict ignites the 1992 LA riots.",
    "2017_453": "A couple who can't stop fighting embark on a last-ditch effort to save their marriage: turning their fights into songs and starting a band.",
    "2017_454": "When Colin Warner is wrongfully convicted of murder, his best friend Carl King devotes his life to proving Colin's innocence.",
    "2017_455": "A young rock band, half of its members from England and half from the U.S., drops out of college and moves to the Sunset Strip to chase their dreams.",
    "2017_456": "A nerdy florist finds his chance for success and romance with the help of a giant man-eating plant who demands to be fed.",
    "2017_457": "A documentary that follows the efforts of \"Raqqa Is Being Slaughtered Silently,\" a handful of anonymous activists who banded together after their homeland was taken over by ISIS in 2014. With deeply personal access, this is the story of a ...See moreA documentary that follows the efforts of \"Raqqa Is Being Slaughtered Silently,\" a handful of anonymous activists who banded together after their homeland was taken over by ISIS in 2014. With deeply personal access, this is the story of a brave group of citizen journalists as they face the realities of life undercover, on the run, and in exile, risking their lives to stand up against one of the greatest evils in the world today.  Written by ProductionSee less",
    "2017_458": "This documentary profiles an influential chef who played a pivotal role in the invention of a revolutionary new American cuisine.",
    "2017_459": "A documentary about the role of Native Americans in popular music history.",
    "2017_46": "A dog looks to discover his purpose in life over the course of several lifetimes and owners.",
    "2017_460": "This is the remarkable story of an American icon who changed the sport of big wave surfing forever. Transcending the surf genre, this in-depth portrait of a hard-charging athlete explores the fear, courage and ambition that push a man to ...See moreThis is the remarkable story of an American icon who changed the sport of big wave surfing forever. Transcending the surf genre, this in-depth portrait of a hard-charging athlete explores the fear, courage and ambition that push a man to greatness--and the cost that comes with it.See less",
    "2017_461": "California Typewriter is a story about people whose lives are connected by typewriters. The film is a meditation on creativity and technology featuring Tom Hanks, John Mayer, Sam Shepard, David McCullough and others.",
    "2017_462": "The story of WikiLeak's editor-in-chief Julian Assange as seen by documentary filmmaker Laura Poitras.",
    "2017_463": "A service that provides holographic recreations of deceased loved ones allows a woman to come face-to-face with the younger version of her late husband.",
    "2017_464": "Xolani, a lonely factory worker, travels to the rural mountains with the men of his community to initiate a group of teenage boys into manhood.",
    "2017_465": "In the last store in a defunct shopping mall, 91-year-old Sonia Warshawski - great-grandmother, businesswoman, and Holocaust survivor - runs the tailor shop she's owned for more than thirty years. But when she's served an eviction notice, ...See moreIn the last store in a defunct shopping mall, 91-year-old Sonia Warshawski - great-grandmother, businesswoman, and Holocaust survivor - runs the tailor shop she's owned for more than thirty years. But when she's served an eviction notice, the specter of retirement prompts Sonia to revisit her harrowing past as a refugee and witness to genocide. A poignant story of generational trauma and healing, BIG SONIA also offers a laugh-out-loud-funny portrait of the power of love to triumph over bigotry, and the power of truth-telling to heal us all.See less",
    "2017_466": "A journey through the vastness of the Argentine desert and what appeared to be the end of the road will become the beginning of a new life.",
    "2017_467": "Against a heavy cloak of secrecy, a 12-year-old girl smitten with her handsome classmate ventures deeper and deeper into the enchanted Sicilian forests to find him, unaware of just how thick is the mystery behind his strange disappearance.",
    "2017_468": "On a chance encounter, a disenchanted architect bumps into his long-lost elephant on the streets of Bangkok. Excited, he takes his elephant on a journey across Thailand, in search of the farm where they grew up together.",
    "2017_469": "In a desert dystopia, a young woman is kidnapped by cannibals.",
    "2017_47": "In this fully animated, all-new take on the Smurfs, a mysterious map sets Smurfette and her friends Brainy, Clumsy, and Hefty on an exciting race through the Forbidden Forest, leading to the discovery of the biggest secret in Smurf history.",
    "2017_470": "Five people find themselves trapped in an elevator during the September 11 attacks. They soon work together, never giving up hope, to try to escape before the unthinkable happens.",
    "2017_471": "A look within the walls of the New York Public Library.",
    "2017_472": "After her daughter is sexually assaulted at a party, a furious mother sets out to destroy the lives of the four perpetrators who walked away free.",
    "2017_473": "In 1971, a young housewife organizes the women of her town to petition for the right to vote.",
    "2017_474": "Past Life tracks the daring late 1970s odyssey of two sisters - an introverted classical musician and a rambunctious scandal sheet journalist - as they unravel a shocking wartime mystery that has cast a dark shadow on their entire lives.",
    "2017_475": "A young man, tries to follow the footsteps of his idol, The King of Pop, Michael Jackson.",
    "2017_476": "A look at the cinematic art of the film musical score, and the artists who create them.",
    "2017_477": "An unflinching look at how the police killing of 18-year-old Mike Brown inspired a community to fight back and sparked a global movement.",
    "2017_478": "In a remote Zambian community a girl is denounced as a witch and sent on a trajectory of exploitation, as a tethered member of a witches' camp, a witch for hire and a tourist exhibit.",
    "2017_479": "David Berman and his friends, all Holocaust survivors, have only one purpose: to go to America as soon as possible. For this they need money. Close to his aim, David is not only deprived of his savings but also overtaken by his shady past.",
    "2017_48": "At a top secret research facility in the 1960s, a lonely janitor forms a unique relationship with an amphibious creature that is being held in captivity.",
    "2017_480": "On a quiet suburban street, a babysitter must defend a twelve-year-old boy from intruders, only to discover it's far from a normal home invasion.",
    "2017_481": "In the supercharged world of dirt track racing, a single mistake causes the lives of two men to change forever. One must fight for his family, the other must fight to forgive.",
    "2017_482": "An account of the famous French sculptor's romance with Camille Claudel.",
    "2017_483": "A disgraced paleontologist struggling to raise her son is tipped off to a groundbreaking dig site in the Badlands by a recovering meth addict, but his tie to the cartel threatens to bury them both under the weight of their criminal pasts.",
    "2017_484": "A college student seeks help after a brutal assault but faces a bureaucratic nightmare when she reveals that her perpetrators are police officers.",
    "2017_485": "The married Bongwan leaves home in the dark morning and sets off to work. The memories of the woman who left weigh down on him. That day Bongwan's wife finds a love note, bursts into the office, and mistakes Areum for the woman who left.",
    "2017_486": "An urban teenager journeys to Montana to hunt big game with his estranged father. Father and son struggle to connect, until a brutal encounter in the heart of the wilderness changes everything.",
    "2017_487": "Toshio hires Yasaka in his workshop. This old acquaintance, who has just been released from prison, begins to meddle in Toshio's family life.",
    "2017_488": "A dashing thief, his gang of desperadoes and an intrepid policeman struggle to free a princess from an evil count's clutches, and learn the hidden secret to a fabulous treasure that she holds part of a key to.",
    "2017_489": "Documentary on the great American Ballerina Wendy Whelan",
    "2017_49": "Following their win at the world championship, the now separated Bellas reunite for one last singing competition at an overseas USO tour, but face a group who uses both instruments and voices.",
    "2017_490": "A portrait of the 14th Dalai Lama, featuring interviews with his family and the people he has inspired since his exile from Tibet in 1959.",
    "2017_491": "Roundabout Theatre Company's live stage production or Irving Berlin's musical about a singer who leaves show business and converts an old Connecticut farmhouse into a performance venue.",
    "2017_492": "",
    "2017_493": "\"Hare Krishna!\" is a documentary on the life of Srila Prabhupada, the 70-year-old Indian Swami who arrives in America without support or money and ignites a worldwide spiritual phenomenon, now known as the Hare Krishna Movement.",
    "2017_494": "An exploration of the relationship between jazz trumpeter Lee Morgan and his common-law wife Helen, who was implicated in his murder in 1972.",
    "2017_495": "A look at the life and work of photographer Elsa Dorfman.",
    "2017_496": "A twist on the slasher genre, following two death-obsessed teenage girls who use their online show about real-life tragedies to send their small mid-western town into a frenzy, and cement their legacy as modern horror legends.",
    "2017_497": "Somerset, October 2014. When Clover Catto (Ellie Kendrick) receives a call telling her that her younger brother Harry (Joe Blakemore) is dead, she must return to her family farm and face the man she hasn't spoken to in years: her father ...See moreSomerset, October 2014. When Clover Catto (Ellie Kendrick) receives a call telling her that her younger brother Harry (Joe Blakemore) is dead, she must return to her family farm and face the man she hasn't spoken to in years: her father Aubrey (David Troughton). She is shocked to discover her home changed forever by the devastating floods that destroyed the area six months earlier, and Aubrey a tormented shadow of his former self. As she learns what has been going on in her long absence she and her father forge a new understanding, but can it withstand the troubles that they face on the ravaged farm as well as the truth of what drove Harry to take his own life?See less",
    "2017_498": "Readers across the world are in love with author Sally Carmichael's series of romance novels that chronicle the epic love story between a human girl and a merman. But no one knows that Sally Carmichael is really Simon Hayes, a bitter, ...See moreReaders across the world are in love with author Sally Carmichael's series of romance novels that chronicle the epic love story between a human girl and a merman. But no one knows that Sally Carmichael is really Simon Hayes, a bitter, serious novelist - and Simon would like to keep it that way.  Written by Daryn TuftsSee less",
    "2017_499": "A small financial institution called Abacus becomes the only company criminally indicted in the wake of the United States' 2008 mortgage crisis.",
    "2017_5": "Four teenagers are sucked into a magical video game, and the only way they can escape is to work together to finish the game.",
    "2017_50": "Having finally gotten used to each other's existence, Brad and Dusty must now deal with their intrusive fathers during the holidays.",
    "2017_500": "When five friends vacation at a remote lake house they expect nothing less than a good time, unaware that planet Earth is under an alien invasion and mass-abduction.",
    "2017_501": "Hoping to claim his newly vacated apartment, a young man travels across Russia with his aging gangster father to admit him into a nursing home.",
    "2017_502": "Average teenager Terkel's life takes a turn for the worse when an unknown maniac starts stalking him.",
    "2017_503": "In the colorful future, a cab driver unwittingly becomes the central figure in the search for a legendary cosmic weapon to keep Evil and Mr. Zorg at bay.",
    "2017_504": "Nonso continues his romance with Deirdre, the bridesmaid from London. While on a dinner date, Nonso proposes to Deirdre by accident and sets off a chain of events too powerful to stop. Deirdre's upper-crust British family are against the ...See moreNonso continues his romance with Deirdre, the bridesmaid from London. While on a dinner date, Nonso proposes to Deirdre by accident and sets off a chain of events too powerful to stop. Deirdre's upper-crust British family are against the match, as are members of the Nigerian clan, but Deirdre's determination can't be contained, setting us on another colourful, chaotic journey to everlasting love.See less",
    "2017_505": "In Warsaw, a pair of mermaid sisters are adopted into a cabaret. While one seeks love with humans the other hungers to dine on the human population of the city.",
    "2017_506": "Respected photographer, artist and set designer, Cecil Beaton. was best known for his Academy Award-winning work, designing for such award-winning films such as Gigi and My Fair Lady. The film features archive footage and interviews with ...See moreRespected photographer, artist and set designer, Cecil Beaton. was best known for his Academy Award-winning work, designing for such award-winning films such as Gigi and My Fair Lady. The film features archive footage and interviews with various models, artists and filmmakers who worked closely with Beaton during his illustrious career. Beaton was not only a dazzling chronicler of his time, but a supreme arbiter of its tastes. From the Bright Young Things, to the front lines of World War II, and from the international belle monde and the pages of Vogue to a role as the Queen's official photographer, Beaton embodied the cultural and political schisms of the twentieth century. In this warm - though critical - portrait, which blends archival footage and photographs with voice over from Beaton's famed diaries to capture his legacy as a complex and unique creative force. Dynamic and lyrical, Love, Cecil is an examination of Beaton's singular sense of the visual, which dictated a style and set standards of creativity that continue to resonate and inspire today.See less",
    "2017_507": "After the early death of his wife, a mourning father moves with his teenage son across the country for a private school teaching job. Their lives begin to transform due to two unique women, who help them embrace life and love again.",
    "2017_508": "In A CIAMBRA, a small Romani community in Calabria, Pio Amato is desperate to grow up fast. At 14, he drinks, smokes and is one of the few to easily slide between the region's factions - the local Italians, the African refugees and his ...See moreIn A CIAMBRA, a small Romani community in Calabria, Pio Amato is desperate to grow up fast. At 14, he drinks, smokes and is one of the few to easily slide between the region's factions - the local Italians, the African refugees and his fellow Romani. Pio follows his older brother Cosimo everywhere, learning the necessary skills for life on the streets of their hometown. When Cosimo disappears and things start to go wrong, Pio sets out to prove he's ready to step into his big brother's shoes but soon finds himself faced with an impossible decision that will show if he is truly ready to become a man.  Written by GSee less",
    "2017_509": "In Gracefield, three couples are spending a long weekend in a luxurious cabin when suddenly an uninvited guest in the form of a meteorite, comes crashing the party... Read more: Synopsis",
    "2017_51": "A cover-up spanning four U.S. Presidents pushes the country's first female newspaper publisher and her editor to join an unprecedented battle between press and government.",
    "2017_510": "Family secrets, lies, high drama and generations of contemporary history unspool in this international story that begins with World War II and concludes with an emotional 21st-century family reunion. Izak was born inside the Bergen-Belsen ...See moreFamily secrets, lies, high drama and generations of contemporary history unspool in this international story that begins with World War II and concludes with an emotional 21st-century family reunion. Izak was born inside the Bergen-Belsen displaced persons camp in 1945 and sent for adoption in Israel. Secret details of his birth mother, an unknown brother in Canada and his father's true identity slowly emerge in this extremely personal investigative film. Timely questions of identity, resilience, compassion and the plight of displaced persons are brought to life as Izak and Shep, the almost 70-year-old brothers, finally meet in Canada, then head to a nursing home in Quebec to introduce Shep to his elderly mother, Aida, for the first time.  Written by Chris McDonaldSee less",
    "2017_511": "A novelist blinded in a car crash which killed his wife rediscovers his passion for both life and writing when he embarks on an affair with the neglected wife of an indicted businessman.",
    "2017_512": "An irresponsible Utah student body president faces impeachment as he attempts to sweet-talk his way into Yale.",
    "2017_513": "An eccentric suburban woman and a Walmart door greeter navigate their evolving relationship in this unconventional love story.",
    "2017_514": "A family become imprisoned in their home by intruders who force them to play a life and death game where the mysterious rules become clear as the night unfolds.",
    "2017_515": "Two high-school couples explore friendship and dating along dissimilar lines, leading to courage and transformation for one teen and a personal crisis for another.",
    "2017_516": "Jake and Mati are two outsiders in Porto who once experienced a brief connection. A mystery remains about the moments they shared, and in searching through memories, they relive the depths of a night uninhibited by the consequences of time.",
    "2017_517": "A ragtag group of Pennsylvanians barricade themselves in an old farmhouse to remain safe from a bloodthirsty, flesh-eating breed of monsters who are ravaging the East Coast of the United States.",
    "2017_518": "A reclusive Bulgarian railway trackman finds millions of cash spilled on the tracks and turns them in to the police. When the transport ministry's head of PR Julia Staikova decides to use him as a diversion from a corruption scandal, his ...See moreA reclusive Bulgarian railway trackman finds millions of cash spilled on the tracks and turns them in to the police. When the transport ministry's head of PR Julia Staikova decides to use him as a diversion from a corruption scandal, his simple life falls victim to the grinder of bureaucracy.  Written by John DetchSee less",
    "2017_519": "Earth 2020, 3/4 of it's households have a robot. The AI supercomputer, Kronos, considers humans the biggest threat to Earth. A century later, few humans are left. Calia seeks the last human stronghold as does Kronos.",
    "2017_52": "Devoted lifeguard Mitch Buchannon butts heads with a brash new recruit, as they uncover a criminal plot that threatens the future of the bay.",
    "2017_520": "Long careers are drawing to a close for John and Amanda, who teach Latin, English, and guitar at a stately home-turned-school, where they are legends with a mantra: \"Reading. 'Rithmetic. Rock 'n' roll!\" But leaving is the hardest lesson.",
    "2017_521": "Two men return home from World War II to work on a farm in rural Mississippi, where they struggle to deal with racism and adjusting to life after war.",
    "2017_522": "Set in the 1980s, an estranged family hires a cult deprogrammer to take back their teenage son from a murderous cult, but find themselves under siege when the cultists surround their cabin, demanding the boy back.",
    "2017_523": "Upon his return from serving a eight-year sentence in prison, reformed gang leader, S. Lance Ingram, struggles to adapt to a changed Harlem. Unable to use the technological skills he acquired in jail, Lance is forced to accept a position ...See moreUpon his return from serving a eight-year sentence in prison, reformed gang leader, S. Lance Ingram, struggles to adapt to a changed Harlem. Unable to use the technological skills he acquired in jail, Lance is forced to accept a position delivering meals for a local food bank. It is here that he befriends Ms. Maddy, 75, a past beauty with a irreverent and hardened shell to whom he delivers dinners. Through her, Lance finds hope, relearning the joys of life and living despite the outwardly bedeviled society in which they find themselves.See less",
    "2017_524": "Harold and Lillian eloped to Hollywood in 1947, where they became the film industry's secret weapons. Nobody talked about them, but everybody wanted them. Theirs is the greatest story never told-until now.",
    "2017_525": "A famous television personality struggles to restore science to its rightful place in a world hostile to evidence and reason.",
    "2017_526": "Rose Marie, the untold story of fame, love, tragedy and 90 years of American entertainment through the eyes of the woman who did it all.",
    "2017_527": "A group of strangers come to the aid of a single mother seeking to bring her rapists to justice.",
    "2017_528": "Te Ata set her sights on Broadway and what she thought was her life's dream. Audition after audition she was rejected and began to wonder if she was cut out for the bright lights.",
    "2017_529": "A family man's chance encounter with a conspiracy-obsessed drifter leaves him on the run from the police and an impending event known as the Inversion.",
    "2017_53": "The world's top bodyguard gets a new client, a hitman who must testify at the International Criminal Court. They must put their differences aside and work together to make it to the trial on time.",
    "2017_530": "Uwais plays a young man who washes ashore, an amnesiac with a serious head injury whose past comes back to haunt him shortly after being nursed back to health by a young doctor. Violence ensues. Sweet, sweet violence.",
    "2017_531": "A documentary spanning over 30 years of the California Bay Area's punk music history with a central focus on the emergence of Berkeley's inspiring 924 Gilman Street music collective.",
    "2017_532": "An earthquake causes a high school to float into the sea, where it slowly sinks like a shipwreck.",
    "2017_533": "Alive and Kicking gives the audience an intimate, insider's view into the culture of the current swing dance world while shedding light on issues facing modern society.",
    "2017_534": "Like countless others, Philippe, Michel, Andre and Patrick were labeled 'idiots', locked away and forgotten in violent asylums, until the 1960s, when the young philosopher Jean Vanier took a stand and secured their release - the first time...See moreLike countless others, Philippe, Michel, Andre and Patrick were labeled 'idiots', locked away and forgotten in violent asylums, until the 1960s, when the young philosopher Jean Vanier took a stand and secured their release - the first time in history that anyone had beaten the system. Together they created L'Arche, a commune at the edge of a beautiful forest near Paris. A quiet revolution was born. Now in his 80s, still at L'Arche and revered by some as a living saint, Jean has discovered something that most of us have forgotten - what it is to be human, to be foolish, and to be happy. SUMMER IN THE FOREST invite us to abandon the rat race and forge new friendships. Amid the ancient trees, Philippe, Patrick, Jean and the others welcome us into their lives. If there are rules to break, they will be broken. And if there is a truth to be told, they will tell it. Michel reveals his war-torn past, Andre is desperate for a date, and young David will prove himself a hero in the fight against the forces of evil.See less",
    "2017_535": "Though both the historical and modern-day persecution of Armenians and other Christians is relatively uncovered in the mainstream media and not on the radar of many average Americans, it is a subject that has gotten far more attention in ...See moreThough both the historical and modern-day persecution of Armenians and other Christians is relatively uncovered in the mainstream media and not on the radar of many average Americans, it is a subject that has gotten far more attention in recent years. It was during and after World War I that the Ottoman Empire carried out the systematic mass murder of 1.5 million Christian Armenian citizens, but also 950,000 Greek and 750,000 Assyrian Christians. To this day, the Armenian people are persecuted in the Middle East for their beliefs - and many are kept from their true home. Turkey, which is the successor state to the Ottoman Empire, still denies the extent and the systematic nature of the atrocities and doesn't use the word genocide for these well-documented events. Other governments officially deny the Armenian Genocide as well because of political pressure by their ally Turkey. \"Architects of Denial\" not only digs into the persecution of Armenians and other Christians in the Middle East, both past and present, but it also sheds light on those politicians who refuse to acknowledge an event scholars accept as a sad reality and historical fact.See less",
    "2017_536": "An in-depth portrait of MANOLO BLAHNIK, self-confessed 'cobbler' and the man regarded by most influential fashion figures as 'the best shoe-maker of the 20th and 21st centuries. A film for anyone who has ever looked longingly at a pair of... 'Manolos'",
    "2017_537": "A young Indian man relocates to 1970s Chicago to become an engineer, but when his job falls through, resorts to an elaborate charade with misfit friends in order to woo his childhood sweetheart.",
    "2017_538": "With sudden passing of his grandmother, Peter Latang returns to his hometown and encounters his long lost, childhood friend, Donald Treebeck. What begins as a simple favor, turns into a long day's journey into the past.",
    "2017_539": "After falling victim to a humiliating prank by the high school Queen Bee, best friends and world-class geeks, Mindy and Jodi, decide to get their revenge by uniting the outcasts of the school against her and her circle of friends.",
    "2017_54": "After returning to the criminal underworld to repay a debt, John Wick discovers that a large bounty has been put on his life.",
    "2017_540": "A couple in a troubled marriage locate a meteorite, initiating an encounter with a mysterious creature. Their lives are turned upside down by the discovery of the creature, which is a source of both pleasure and destruction.",
    "2017_541": "At the dawn of World War III, a man searches for a way to restore peace to the world and finds he must give something in return.",
    "2017_542": "A film about the most controversial form of medicine ever invented. Homeopathy",
    "2017_543": "THE FORCE goes inside an embattled urban police department struggling to rebuild trust in one of America's most violent yet promising cities.",
    "2017_544": "Music meets the Mob in this biography of '60s hitmaker and 2016 Rock and Roll Hall of Fame inductee Bert Berns.",
    "2017_545": "During the economic boom of Italy a man tries desperately to maintain a high standard of living for his family.",
    "2017_546": "In rural Iowa, a beloved history teacher uncovers the century-old showreels of one of America's first motion picture impresarios and sets out to premiere the films at the world's oldest continuously operating movie theatre.",
    "2017_547": "Luc Bondy's final feature film as director draws talent from both stage and screen to bring Pierre de Marivaux's 1737 play into 21st century Paris. Isabelle Huppert commands the screen as Araminte, the wealthy widow who unwittingly hires ...See moreLuc Bondy's final feature film as director draws talent from both stage and screen to bring Pierre de Marivaux's 1737 play into 21st century Paris. Isabelle Huppert commands the screen as Araminte, the wealthy widow who unwittingly hires the smitten Dorante (Louis Garrel) as her accountant. Secrets and lies accumulate as Dorante and his accomplice, Araminte's manservant Dubois (Yves Jacques), manipulate not only the good-hearted Araminte, but also her friend and confidante, Marton (Manon Combes). Dorante, by turns pitiable and proficient, but always deferential to his social better, walks a fine line in his quest to arouse an equal desire in the object of his affections. Bulle Ogier delivers a memorable turn as Araminte's mother, who suspects the young man's intentions, but wants to push her daughter into the arms of an aged, hard-up Count (Jean-Pierre Malo). Filmed in part on-site at the Theâtre de l'Odeon-and shot during the daytime, while the same cast performed the play there at night-the film blurs the distinction between stage and screen, offering a new turn on this classic take on the psychology of love.  Written by Big World PicturesSee less",
    "2017_548": "Four short horror films that are directed and written by women.",
    "2017_549": "This Spin-off from Baby (2015) provides the back-story of intelligence agent Shabana, and chronicles how she becomes a spy.",
    "2017_55": "In the near future, Major Mira Killian is the first of her kind: A human saved from a terrible crash, who is cyber-enhanced to be a perfect soldier devoted to stopping the world's most dangerous criminals.",
    "2017_550": "An estimated 200,000 Chinese women were forced into prostitution by the Japanese army during WWII. Only 22 of them remain today to speak out publicly. This documentary is not a film for political gains or narrow nationalistic purposes. For...See moreAn estimated 200,000 Chinese women were forced into prostitution by the Japanese army during WWII. Only 22 of them remain today to speak out publicly. This documentary is not a film for political gains or narrow nationalistic purposes. For the director and the crew, each and every one of those elderly women is a brave and strong individual with similar yet distinctive experiences. This is a group that deserves to be known and correctly understood by more people and a history worth being preserved in a most accurate yet sensitive way. In the documentary, the current situation of those 22 elderly women will be presented in an impersonal way. There's no interrogation, sympathy, nor exaggeration in our film. You will hear them talk about their own experiences, and you will also learn about their perspectives on life, sufferings and happiness. Now all over 80 or 90 years old, those elderly ladies are at the very last stage of their life. This is probably the last chance for the public to actually see their situations and hear their own words while they are still alive. It should not be a history just written on pages.See less",
    "2017_551": "Three children decide to leave their homes looking for a better life.",
    "2017_552": "While the Egyptian revolution of 2011 is underway, surgeon turned comedian Bassem Youssef airs a television show that makes him popular to his countrymen but disliked by the government.",
    "2017_553": "An anti-Semitic far-right politician's astonishing transformation after finding out he is Jewish.",
    "2017_554": "A husband and wife live in an impoverished neighborhood in north Philadelphia while they raise their daughter and run a recording studio in their basement.",
    "2017_555": "Follows a variety of New York characters as they navigate personal relationships and unexpected problems over the course of one day.",
    "2017_556": "Internationally known graffiti artist, Banksy, left his mark on San Francisco in April 2010. Little did he know that this act of vandalism would spark a chain of events that includes one of his rats being removed from a wall, Museums ...See moreInternationally known graffiti artist, Banksy, left his mark on San Francisco in April 2010. Little did he know that this act of vandalism would spark a chain of events that includes one of his rats being removed from a wall, Museums ignorantly turning down a free Banksy street work, and a NY gallerist who has made it his business model to remove Banksy street works from all over the globe doing whatever it takes to get the rat in his possession.  Written by AnonymousSee less",
    "2017_557": "A young girl named Heidi, who lives with her mentally disabled mother, travels across the country to find out about her and her mother's past. Read more: Synopsis",
    "2017_558": "An unprecedented look at the iconic shower scene in Alfred Hitchcock's Psycho, the \"man behind the curtain\", and the screen murder that profoundly changed the course of world cinema.",
    "2017_559": "After an elderly maid is murdered, opinions are manipulated, evidence is planted, violence erupts, and panic ensues.",
    "2017_56": "A mother personally challenges the local authorities to solve her daughter's murder when they fail to catch the culprit.",
    "2017_560": "After his lover rejects him, a young man trapped by the oppressiveness of Edwardian society tries to come to terms with and accept his sexuality.",
    "2017_561": "It is one of humankind's greatest achievements. More than 12 billion miles away a tiny spaceship is leaving our Solar System and entering the void of deep space - the first human-made object ever to do so.",
    "2017_562": "Set during occupied France, a faithless woman finds herself falling in love with a young priest.",
    "2017_563": "Hermia & Helena is a film of dead ends and new beginnings, navigating different hemispheres and languages with amorous detours, where the written words of Shakespeare clash with the entanglements of modern, digital life.",
    "2017_564": "A haunted young woman spirals in the wake of profound loss, torn between her fractured emotional state and the reality-altering effects of a potent cannabinoid drug.",
    "2017_565": "An intimate look at life inside the Jewish settlements in the West Bank.",
    "2017_566": "A filmmaker journey through the former East Germany looking into her father's 1999 suicide.",
    "2017_567": "Standing on the edge of adulthood, Andrew yearns to find his purpose as a young black man in today's America. With his mother longing to find more to her life than parenting, Andrew is forced to take on the mounting pressure of family ...See moreStanding on the edge of adulthood, Andrew yearns to find his purpose as a young black man in today's America. With his mother longing to find more to her life than parenting, Andrew is forced to take on the mounting pressure of family responsibility. His search for connection with an absent father, leads him to a dangerous crossroads.  Written by Film ConstellationSee less",
    "2017_568": "A frigid young housewife decides to spend her midweek afternoons as a prostitute.",
    "2017_569": "When Harvard Ph.D. student Jennifer Brea is struck down by a fever that leaves her bedridden, she sets out on a virtual journey to document her story as she fights a disease that medicine forgot.",
    "2017_57": "In the near-death after an accident, a sports car driver time-travelled back to the 1990s to meet his severe father and never-seen mother in a small Chinese town.",
    "2017_570": "Two girls must battle a mysterious evil force when they get left behind at their boarding school over winter break.",
    "2017_571": "The boss of a publishing company is a womanizer and a jerk, but what would happen if he suddenly disappeared?",
    "2017_572": "A tour of the juke joints and other venues of the legendary Chitlin Circuit in the Mississippi Delta, including performances by aging blues musicians in their eighties who used to play the circuit.",
    "2017_573": "The extraordinary doctors and activists whose work 30 years ago to save lives in a rural Haitian village grew into a global battle in the halls of power for the right to health for all.",
    "2017_574": "Ecstatic ritual, danger and the absolute beauty of fireworks.",
    "2017_575": "Charlie is an unmotivated man in his mid 20s still living at home with his mother and stepfather who falls for a young woman who has a serious boyfriend.",
    "2017_576": "In 1979, an Indian family moves to America with hopes of living the American Dream. While their 10-year-old boy Smith falls head-over-heels for the girl next door, his desire to become a \"good old boy\" propels him further away from his ...See moreIn 1979, an Indian family moves to America with hopes of living the American Dream. While their 10-year-old boy Smith falls head-over-heels for the girl next door, his desire to become a \"good old boy\" propels him further away from his family's ideals than ever before.See less",
    "2017_577": "Across walls, fences, and alleys, rats not only expose our boundaries of separation but make homes in them. \"Rat Film\" is a feature-length documentary that uses the rat--as well as the humans that love them, live with them, and kill them--...See moreAcross walls, fences, and alleys, rats not only expose our boundaries of separation but make homes in them. \"Rat Film\" is a feature-length documentary that uses the rat--as well as the humans that love them, live with them, and kill them--to explore the history of Baltimore. \"There's never been a rat problem in Baltimore, it's always been a people problem\".See less",
    "2017_578": "Seeking shelter from a storm, five travelers are in for a bizarre and terrifying night when they stumble upon the Femm family estate.",
    "2017_579": "Autumn of 1941 in Salty Creek, a fishing village in South Carolina, two interracial lovers are swept up in the tides of history.",
    "2017_58": "In May 1940, the fate of World War II hangs on Winston Churchill, who must decide whether to negotiate with Adolf Hitler, or fight on knowing that it could mean the end of the British Empire.",
    "2017_580": "In prison four long-sentence inmates planning an elaborate escape cautiously induct a new inmate to join in their scheme which leads to distrust and uncertainty.",
    "2017_581": "Dave, an artist who has yet to complete anything significant in his career, builds a fort in his living room out of pure frustration, only to wind up trapped by the fantastical pitfalls, booby traps, and critters of his own creation.",
    "2017_582": "An unexpected affair quickly escalates into a heart-stopping reality for two women whose passionate connection changes their lives forever.",
    "2017_583": "Through the eyes of famous chefs, audiences will see how they make the most of every kind of food, transforming what most people consider scraps into incredible dishes that create a more secure food system.",
    "2017_584": "Love & Taxes is a riveting comic tale of seven years of tax avoidance. Following the possibly real-life exploits of Josh Kornbluth, an autobiographical monologist, Love & Taxes is a comedy that blends solo performance and scripted scenes ...See moreLove & Taxes is a riveting comic tale of seven years of tax avoidance. Following the possibly real-life exploits of Josh Kornbluth, an autobiographical monologist, Love & Taxes is a comedy that blends solo performance and scripted scenes to bring the subjective reality of the storyteller hilariously to life. A tale of procrastination, making movies and growing up, Love & Taxes is a middle-aged coming-of-age story that is also, quite possibly, the first ever pro-tax romantic comedy.See less",
    "2017_585": "Teenagers Zach and Josh have been best friends their whole lives, but when a gruesome accident leads to a cover-up, the secret drives a wedge between them and propels them down a rabbit hole of escalating paranoia and violence.",
    "2017_586": "Once upon a time there was a tiny hill town in Tuscany that found a remarkable way to confront their issues - they turned their lives into a play. \"Spettacolo\" is a portrait of this 50-year-old tradition, where their piazza becomes their ...See moreOnce upon a time there was a tiny hill town in Tuscany that found a remarkable way to confront their issues - they turned their lives into a play. \"Spettacolo\" is a portrait of this 50-year-old tradition, where their piazza becomes their stage and every villager from 6 to 90 plays a part - the role of themselves.  Written by spettacolofilm.comSee less",
    "2017_587": "Zaynab, a thirty-something Pakistani, Muslim, lesbian in Chicago takes care of her sweet and TV-obsessed mother. As Zaynab falls for Alma, a bold and very bright Mexican woman, she searches for her identity in life, love and wrestling.",
    "2017_588": "SIDEMEN - Long Road To Glory is an intimate look at the incredible lives and legacies of piano player Pinetop Perkins, drummer Willie 'Big Eyes' Smith and guitarist Hubert Sumlin, all Muddy Waters and Howlin' Wolf sidemen. The film ...See moreSIDEMEN - Long Road To Glory is an intimate look at the incredible lives and legacies of piano player Pinetop Perkins, drummer Willie 'Big Eyes' Smith and guitarist Hubert Sumlin, all Muddy Waters and Howlin' Wolf sidemen. The film captures some of the last interviews and their final live performances together, before their deaths in 2011. The historic live shows are accompanied by performances and personal insights from many of the blues and rock stars these legendary sidemen inspired including; Bonnie Raitt, Gregg Allman, Derek Trucks, Shemekia Copeland, Robby Krieger, Kenny Wayne Shepherd, Joe Perry, Joe Bonamassa and Johnny Winter.See less",
    "2017_589": "Carnage, death, and despair await the ignoble remnants of a persecuted family who assemble for the wedding of their daughter on the eve of an evil 100-year-old curse.",
    "2017_59": "Robbed of his birthright, Arthur comes up the hard way in the back alleys of the city. But once he pulls the sword from the stone, he is forced to acknowledge his true legacy - whether he likes it or not.",
    "2017_590": "Sixty-two year old Richard Turner is renowned as one of the world's greatest card magicians, yet he is completely blind. This is an in-depth look at a complex character who is one of magic's greatest hidden treasures.",
    "2017_592": "No Greater Love explores a combat deployment through the eyes of an Army chaplain, as he and his men fight their way through a hellish tour in one of the most dangerous places in Afghanistan and then as they struggle to reintegrate home.",
    "2017_593": "Uncertain is a visually stunning and disarmingly funny portrait of the literal and figurative troubled waters of Uncertain, Texas, a 94-resident town so tucked away \"you've got to be lost to find it\".",
    "2017_594": "A man watches his life unravel after he is left by his girlfriend of 10 years.",
    "2017_595": "When troubled teen Milo, who has a fascination with vampire lore, meets the equally alienated Sophie, the two form a bond that begins to blur Milo's fantasy into reality.",
    "2017_596": "A person of high intelligence struggles to make sense of the world as it relates to morality, relationships, sex and leaving her apartment.",
    "2017_597": "Mysterious events surround two travelers as they make their way across a remote American landscape. On the surface all seems normal, but what appears to be a simple vacation soon gives way to a dark and complex web of secrets.",
    "2017_598": "A wounded young soldier and a psychologically damaged girl get caught in the crossfire between her estranged family and an Armenian hitman.",
    "2017_599": "A brilliant and misunderstood Iranian writer struggles to pursue his ambitious goal of bringing together Metallica and Kabul Dreams, Afghanistan's first rock band.",
    "2017_6": "Peter Parker balances his life as an ordinary high school student in Queens with his superhero alter-ego Spider-Man, and finds himself on the trail of a new menace prowling the skies of New York City.",
    "2017_60": "A humble businessman with a buried past seeks justice when his daughter is killed in an act of terrorism. A cat-and-mouse conflict ensues with a government official, whose past may hold clues to the killers' identities.",
    "2017_600": "In the 1980s a bunch of underground cartoonists parodied a popular doll. The resulting commercial product tapped into the international kid zeitgeist. That young generation felt that this product spoke to the revulsion they had for the ...See moreIn the 1980s a bunch of underground cartoonists parodied a popular doll. The resulting commercial product tapped into the international kid zeitgeist. That young generation felt that this product spoke to the revulsion they had for the corporate pop culture that was being fed to them.See less",
    "2017_601": "From director Andrew Rossi (Page One: Inside the New York Times, The First Monday in May) comes an electrifying portrait of writer and performer Okwui Okpokwasili and her acclaimed one-woman show, Bronx Gothic. Rooted in memories of her ...See moreFrom director Andrew Rossi (Page One: Inside the New York Times, The First Monday in May) comes an electrifying portrait of writer and performer Okwui Okpokwasili and her acclaimed one-woman show, Bronx Gothic. Rooted in memories of her childhood, Okwui - who's worked with conceptual artists like Ralph Lemon and Julie Taymor - fuses dance, song, drama and comedy to create a mesmerizing space in which audiences can engage with a story about two 12-year-old black girls coming of age in the 1980s. With intimate verite access to Okwui and her audiences off the stage, Bronx Gothic allows for unparalleled insight into her creative process as well as the complex social issues embodied in it.See less",
    "2017_602": "Mali's Music defines the country's cultural identity. Radical Islamists are threatening the musicians. Together with the stars of Malian Global Pop - Fatoumata Diawara, Bassekou Kouyate Master Soumy and Ahmed Ag Kaedi - we embark on a ...See moreMali's Music defines the country's cultural identity. Radical Islamists are threatening the musicians. Together with the stars of Malian Global Pop - Fatoumata Diawara, Bassekou Kouyate Master Soumy and Ahmed Ag Kaedi - we embark on a musical journey to Mali's agitated heart. Can their music reconcile the country?See less",
    "2017_603": "Legislators debate legislation that allows for adult charges for juvenile offenders.",
    "2017_604": "Women Like Us is a story about women who are changing the world. Read more: Synopsis",
    "2017_605": "A shy small-town Ohio girl who loves movies but dislikes reality, discovers the delightfully bizarre films of Federico Fellini, and sets off on a strange, beautiful journey across Italy to find him.",
    "2017_606": "A young charismatic preacher and his hot Latina girlfriend travel Route 66 scamming the small churches along the way only to find that the bogus healing powers he portrays become real. The healing powers serve as a blessing and a curse.",
    "2017_607": "A tale of ambition, family, love, and war set in the midst of the Japanese Civil Wars of the sixteenth century.",
    "2017_608": "A British Intelligence Officer in Naples at the end of World War II: Norman Lewis's acknowledged masterpiece about a war-torn city and its unforgettable humanity.",
    "2017_609": "Marius is faced with a choice whether to fulfill his passion by sailing the seas or stay and marry the woman he loves.",
    "2017_61": "A group of high-school students, who are infused with unique superpowers, harness their abilities in order to save the world.",
    "2017_610": "Follows three people whose paths cross during a terrible time of war: Olga, a Russian aristocratic emigrant and member of the French Resistance; Jules, a French collaborator; and Helmut, a high-ranking German SS officer.",
    "2017_611": "A Buddhist monk asks what we owe one another & provides experiences to help us find answers. Documentary.",
    "2017_612": "A year after his wife's murder, once-successful Hong Kong businessman Leonard To (Jason Tobin) is still reeling from the tragedy. Having lost his job, friends, and all sense of order in his life, Leonard becomes obsessed with a mysterious ...See moreA year after his wife's murder, once-successful Hong Kong businessman Leonard To (Jason Tobin) is still reeling from the tragedy. Having lost his job, friends, and all sense of order in his life, Leonard becomes obsessed with a mysterious stranger he sees at his wife's grave, believing him to be responsible for her death.  Written by AnonymousSee less",
    "2017_613": "An obliviously modern college student gets into a near-fatal bus accident, but is reborn through hybrid technology by her biotech father and his advanced lab.",
    "2017_614": "A small town loner and a rebellious punk rocker unexpectedly fall in love as they are forced on the run and soon discover violence follows them everywhere.",
    "2017_615": "An exhausted, workaholic actress, Anna Baskin, 44, abruptly extricates herself from a successful but mind-numbing TV role, returning to her past life in New York to reinvent herself.",
    "2017_616": "A junior high school student sees her chances of a better future jeopardized after she gets in a fight and is expelled.",
    "2017_617": "FINDING OSCAR is a feature length documentary about the search for justice in the devastating case of the Dos Erres massacre in Guatemala. That search leads to the trail of two little boys who were plucked from a nightmare and offer the ...See moreFINDING OSCAR is a feature length documentary about the search for justice in the devastating case of the Dos Erres massacre in Guatemala. That search leads to the trail of two little boys who were plucked from a nightmare and offer the only living evidence that ties the Guatemalan government to the massacre.See less",
    "2017_618": "Ex-inmate and wandering musician Jake travels to a small town in Arkansas intent on exacting revenge from his father, but begins to unravel a complicated family history as he befriends the locals.",
    "2017_619": "This in-depth look into the powerhouse industries of big-game hunting, breeding and wildlife conservation in the U.S. and Africa unravels the complex consequences of treating animals as commodities.",
    "2017_62": "When four lifelong friends travel to New Orleans for the annual Essence Festival, sisterhoods are rekindled, wild sides are rediscovered, and there's enough dancing, drinking, brawling and romancing to make the Big Easy blush.",
    "2017_620": "She's always sitting there with her husband. He's always getting up to take a meeting. The other man always comes and sits, the stranger, who always insists on his account of their past affair, and every time he does, it's more convincing.",
    "2017_621": "Two American bank robbers and their three local hostages take shelter in a mysterious manor in the woods. As the hostages try to escape, they all begin to realize no one is safe from the evil lurking inside the house.",
    "2017_622": "During the height of the social revolution, a young dancer searches for salvation when she chooses to leave paradise.",
    "2017_623": "In 1431, Jeanne d'Arc is placed on trial on charges of heresy. The ecclesiastical jurists attempt to force Jeanne to recant her claims of holy visions.",
    "2017_624": "A young woman must save herself and her friends from an ancient evil that stalks its victims through the real-life phenomenon of sleep paralysis.",
    "2017_625": "Acclaimed filmmaker Pat Collins brings the dramatic life story of legendary seannós singer Joe Heaney to the screen in Song of Granite, an audacious exploration of the man and his music. With an approach that marries traditional narrative ...See moreAcclaimed filmmaker Pat Collins brings the dramatic life story of legendary seannós singer Joe Heaney to the screen in Song of Granite, an audacious exploration of the man and his music. With an approach that marries traditional narrative episodes with documentary footage, the film will celebrate the music Joe Heaney created while painting an unflinching portrait of Heaney, the man.See less",
    "2017_626": "Through diary entries, this documentary follows the life and death of homeless woman Linda Bishop and her struggles with starvation, sanity and God.",
    "2017_627": "A hardware store employee's first night on the job is disrupted by the discovery of a dead body and a duffel bag full of cash.",
    "2017_628": "\"A Beginners Guide To Snuff\" is a pitch black comedy thriller in the vein of early Coen Brothers films.",
    "2017_629": "A reclusive conspiracy theorist enlists people from his small town to help him make a low-budget movie about his experience encountering aliens while working as a geologist for the US government.",
    "2017_63": "The story of Barry Seal, an American pilot who became a drug-runner for the CIA in the 1980s in a clandestine operation that would be exposed as the Iran-Contra Affair.",
    "2017_630": "A new era is coming, and Warsaw stands uncomfortably at its edge. Art school classmates Christopher and Michal, on the precipice of their own coming of age, restlessly roam their city's streets in search of living forever inside the ...See moreA new era is coming, and Warsaw stands uncomfortably at its edge. Art school classmates Christopher and Michal, on the precipice of their own coming of age, restlessly roam their city's streets in search of living forever inside the beautiful moment. Never content with answers, they push each experience to its breaking point, testing what it might mean to be truly awake in a world that seems satisfied to be asleep.See less",
    "2017_631": "Set inside a single room in Folsom Prison, three men from the outside participate in a four-day group-therapy retreat with a group of incarcerated men for a real look at the challenges of rehabilitation.",
    "2017_632": "A probing portrait of Chris Burden, an artist who took creative expression to the limits and risked his life in the name of art.",
    "2017_633": "As sadomasochistic yakuza enforcer Kakihara searches for his missing boss he comes across Ichi, a repressed and psychotic killer who may be able to inflict levels of pain that Kakihara has only dreamed of achieving.",
    "2017_634": "A failing script writer is given one last chance to save his career, yet at what cost?",
    "2017_635": "Anne is investigating the life of her grand-aunt Olivia, whose destiny has always been shrouded with scandal. As Anne delves into the history of her grand-aunt, she is led to reconsider her own life.",
    "2017_636": "In this story inspired by real characters, three girls from America, Nigeria and India are trafficked through an elaborate global network and enslaved in a Texas brothel, and must together attempt a daring escape to reclaim their freedom.",
    "2017_638": "MANSFIELD 66/67 is about the last two years of movie goddess Jayne Mansfield's life, and the rumours swirling around her untimely death.",
    "2017_639": "Servais Mont, a photographer, meets Nadine Chevalier who earns her money starring in cheap soft-core movies. Trying to help her, he borrows the money from the loan sharks to finance the theatrical production of 'Richard III' and gives ...See moreServais Mont, a photographer, meets Nadine Chevalier who earns her money starring in cheap soft-core movies. Trying to help her, he borrows the money from the loan sharks to finance the theatrical production of 'Richard III' and gives Nadine a part. Nadine is torn apart between Servais, for whom she is falling in love, and her husband Jacques, to whom she has moral obligations.  Written by Yuri German See less",
    "2017_64": "As their own mothers drop in unexpectedly, our three under-appreciated and over-burdened moms rebel against the challenges and expectations of the Super Bowl for mothers: Christmas.",
    "2017_640": "A love story portraying the dilemmas and inevitable consequences of ambition. It is a film about a woman's fight for independence, trying to succeed with her own art in the extremely competitive world of dance.",
    "2017_641": "America is experiencing an epidemic of pain. One man has the answer to the problem yet the medical establishment has ignored him. For nearly 50 years, Dr. John Sarno has been single-handedly battling the pain epidemic by focusing on the ...See moreAmerica is experiencing an epidemic of pain. One man has the answer to the problem yet the medical establishment has ignored him. For nearly 50 years, Dr. John Sarno has been single-handedly battling the pain epidemic by focusing on the mind-body connection and the nature of stress and the manifestation of physical ailments. With a renowned practice in rehabilitative medicine at NYU he is also a bestselling author of numerous books that deal with psychosomatic disorders. Filmmaker Michael Galinsky's family has a long history with Dr. Sarno and their experience will be woven into the fabric of the film, alongside well known patients, including Howard Stern, John Stossel, Jonathan Ames, Larry David, and many others.See less",
    "2017_642": "A homicide detective goes undercover as a patient to investigate a psychotherapist he believes is linked to a strange double murder. As his therapy sessions continue the line between fantasy and reality begins to blur.",
    "2017_644": "A joyride that delves deep into the mind of rock and roll's greatest living photographer: Mick Rock.",
    "2017_645": "James gives himself 12 months before he has 'a license to kill himself', he sets off to the amazon rainforest with hopes of finding a shaman who can save his life.",
    "2017_646": "A documentary chronicling the life of actor and Blade Runner screenwriter Hampton Fancher.",
    "2017_647": "Møre than 40 filmmakers travelled the globe to witness religious celebrations and interview people from all sorts of background.",
    "2017_648": "Four grandmothers accidentally kill a con man. When his partner shows up, things go south quickly.",
    "2017_649": "Using the controversy over genetically-modified foods as its entry point, 'Food Evolution' shows how easily fear and misinformation can overwhelm objective, evidence-based analysis.",
    "2017_65": "A college student must relive the day of her murder over and over again, in a loop that will end only when she discovers her killer's identity.",
    "2017_650": "SWIM TEAM chronicles the overwhelming struggles and extraordinary triumphs of 3 young athletes with autism and shows how a swim team can bring hope to a community.",
    "2017_651": "Over the last four decades, the concept of same-sex couples marrying went from a 'preposterous notion' to the national law. The Freedom to Marry movement is now known as one of the most successful civil rights campaigns in the modern ...See moreOver the last four decades, the concept of same-sex couples marrying went from a 'preposterous notion' to the national law. The Freedom to Marry movement is now known as one of the most successful civil rights campaigns in the modern history, but change did not arrive by happenstance. This victory was carefully planned and orchestrated over decades. THE FREEDOM TO MARRY, a new documentary film, offers the untold, inside story of this historic movement. This is a riveting ride alongside Evan Wolfson and Mary Bonauto, the architect and the main litigator of the movement, and their key colleagues from earliest days of their journey to their final frenetic dash to the US Supreme Court.See less",
    "2017_652": "A comedy about a small New Jersey town on the night of Orson Welles' legendary 1938 \"War of the Worlds\" radio broadcast, which led millions of listeners to believe the U.S. was being invaded by Martians.",
    "2017_653": "An unprecedented journey into the world of Freemasonry.",
    "2017_654": "At the heart of the Apollo program was the special team in Mission Control who put a man on the moon and helped create the future.",
    "2017_655": "Dying to Know is an intimate portrait celebrating two very complex controversial characters in an epic friendship that shaped a generation. In the early 1960s Harvard psychology professors Timothy Leary and Richard Alpert began probing the...See moreDying to Know is an intimate portrait celebrating two very complex controversial characters in an epic friendship that shaped a generation. In the early 1960s Harvard psychology professors Timothy Leary and Richard Alpert began probing the edges of consciousness through their experiments with psychedelics. Leary became the LSD guru, asking us to think for ourselves, igniting a global counter-cultural movement and landing in prison after Nixon called him 'the most dangerous man in America'. Alpert journeyed to the East becoming Ram Dass, a spiritual teacher for an entire generation who continues in his 80s teaching service through compassion. With interviews spanning 50 years the film invites us into the future encouraging us to ponder questions about life, drugs & the biggest mystery of all: death.  Written by AnonymousSee less",
    "2017_656": "An engaged but apolitical nurse gets involved in a far-right political party. Based on numerous recent events in France, it becomes about how Front National operates and how it is perceived by the French.",
    "2017_657": "In 2012, Crundwell was arrested as the largest municipal fraud perpetrator in the nation's history, embezzling upwards of $50 million as the comptroller and treasurer of Dixon, a city in the heart of Illinois. Rita Crundwell became one of ...See moreIn 2012, Crundwell was arrested as the largest municipal fraud perpetrator in the nation's history, embezzling upwards of $50 million as the comptroller and treasurer of Dixon, a city in the heart of Illinois. Rita Crundwell became one of the nation's leading quarter horse breeders, traveled the world, and threw lavish parties, all while forcing staff cuts, police budget slashing, and leaving public infrastructure in disrepair. All the Queen's Horses aims to illuminate this landmark case and bring to light the blatant negligence of auditors and bankers the public relied on to keep their tax dollars safe.See less",
    "2017_658": "Charged with 2400 volts of electricity, Eduardo Garcia lost an arm, ribs, muscle mass and nearly his life, but more important than what he lost is what he found.",
    "2017_659": "We aren't dying the way we used to. We have ventilators, dialysis machines, ICUs-technologies that can \"fix\" us and keep our bodies alive-which have radically changed how we make medical decisions. In our death-denying culture, no matter ...See moreWe aren't dying the way we used to. We have ventilators, dialysis machines, ICUs-technologies that can \"fix\" us and keep our bodies alive-which have radically changed how we make medical decisions. In our death-denying culture, no matter how sick we get, there is always \"hope.\" Defining Hope tells the story of patients dealing with life-threatening illness as they move between ICUs, operating rooms, hospice care and home. Diane is a nurse caring for end-stage cancer patients when she is diagnosed with ovarian cancer herself. 23-year-old Alena undergoes a risky brain surgery that destroys her short-term memory. 95-year-old Berthold lives with his elderly wife who struggles to honor his wish of dying peacefully at home. Defining Hope follows these patients and others- and the nurses that guide them along the way- as they face death, embrace hope, and ultimately redefine what makes life worth living.See less",
    "2017_66": "Two overly imaginative pranksters named George and Harold hypnotize their principal into thinking he's a ridiculously enthusiastic, incredibly dimwitted superhero named Captain Underpants.",
    "2017_660": "A brilliant scientist is plucked out of the company lab and sent to India to sell the genetically modified rice she created - which she doesn't realize will destroy the farmers she thinks she's helping.",
    "2017_661": "In the summer of 2015, legendary musician David Byrne staged an event at Brooklyn's Barclays Center to celebrate the art of Color Guard: synchronized dance routines involving flags, rifles, and sabers. Recruiting performers that include ...See moreIn the summer of 2015, legendary musician David Byrne staged an event at Brooklyn's Barclays Center to celebrate the art of Color Guard: synchronized dance routines involving flags, rifles, and sabers. Recruiting performers that include the likes of Saint Vincent, Nelly Furtado, Ad-Rock, and Ira Glass to collaborate on original pieces with 10 color guard teams from across the US and Canada, Contemporary Color is a beautifully filmed snapshot of a one-of-a-kind live event.See less",
    "2017_662": "Rebels on Pointe is the first-ever, cinema verite documentary film celebrating Les Ballets Trockadero de Monte Carlo -- the all male, drag ballet company founded over 40 years ago on the heels of New York's Stonewall riots. The company has...See moreRebels on Pointe is the first-ever, cinema verite documentary film celebrating Les Ballets Trockadero de Monte Carlo -- the all male, drag ballet company founded over 40 years ago on the heels of New York's Stonewall riots. The company has performed in over 500 cities and 33 countries, and has a cult following around the world. The film juxtaposes exclusive, behind-the-scenes access and intimate, character-driven stories of its dancers, highlighted by amazing performances shot around the world. Rebels on Pointe ultimately celebrates our shared humanity through universal themes of identity, dreams, family, love, loss, determination and resilience... proving that a ballerina is not merely a woman dancing, but an act of revolution in a tutu.See less",
    "2017_663": "Bandleader Vince Giordano keeps the Jazz Age alive with his 11-member band The Nighthawks, vintage musical instruments, and a collection of more than 60,000 original arrangements from the 1920s and '30s.",
    "2017_664": "A former rodeo champ befriends a young man with a propensity for violence.",
    "2017_665": "Khaled, Mahmoud and Subhi volunteer with the White Helmets trying to save lives of hundreds of victims in the besieged city of Aleppo during the Syrian Civil War.",
    "2017_666": "A documentary about global warming.",
    "2017_667": "Director Rahul Jain presents an intimate, observantly portrayal of the rhythm of life and work in a gigantic textile factory in Gujarat, India. Moving through the corridors and bowels of the enormous and disorientating structure, the ...See moreDirector Rahul Jain presents an intimate, observantly portrayal of the rhythm of life and work in a gigantic textile factory in Gujarat, India. Moving through the corridors and bowels of the enormous and disorientating structure, the camera takes the viewer on a journey to a place of dehumanising physical labor and intense hardship, provoking cause for thought about persistent pre-industrial working conditions and the huge divide between first world and developing countries. Since the 1960s the area of Sachin in western India has undergone unprecedented, unregulated industrialisation, exemplified in its numerous textile factories. MACHINES portraits only one of these factories, while at the same time representing the thousands of labourers working, living and suffering in an environment they can't escape without unity. With strong visual language, memorable images and carefully selected interviews of the workers themselves, Jain tells a story of inequality and oppression, humans and machines.See less",
    "2017_668": "After serving his conviction, a former gunman returns to his town planning to live a quiet life, however, the sons of a man he killed have other plans.",
    "2017_669": "Traces a family's journey as one of only twelve Jewish families to survive the Nazi occupation of Prague during World War II.",
    "2017_67": "Shunned by everyone for being the son of an evil warlord, a teenager seeks to defeat him with the help of his fellow ninjas.",
    "2017_670": "Richard Hambleton was a founder of the street art movement before succumbing to drugs and homelessness. Rediscovered 20 years later, he gets a second chance. But will he take it?",
    "2017_671": "A psychologist is sent to a station orbiting a distant planet in order to discover what has caused the crew to go insane.",
    "2017_672": "Filmmaker Joe Berlinger meets with historians and scholars to discuss the Armenian Genocide and the continuing denial by the Turkish government of it ever happening.",
    "2017_673": "The true story of the infamous prison break of Gary Tison and Randy Greenwalt from the Arizona State prison in Florence, AZ, in the summer of 1978.",
    "2017_674": "Lung is a former member of the national Little League team who lives with his old childhood sweetheart Ah-chin, a traditional family woman. Although they live together, Ah-chin is weary of Lung's past liaison with another girl.",
    "2017_675": "Permanent is a comedy about bad hair, adolescence, and socially awkward family members. It involves life-altering permanents and poorly-made toupees. Obstacles to daily survival ensue.",
    "2017_676": "Set against a backdrop of the Israeli-Palestinian conflict, Palestinian rapper Kareem and his singer girlfriend Manar struggle, love and make music in their crime-ridden ghetto and Tel Aviv's hip-hop club scene.",
    "2017_677": "A documentary film that takes us on a scientific and spiritual journey where we discover that by changing one's perceptions, the human body can heal itself from any dis-ease.",
    "2017_678": "The defense of honor, a strong value in Neapolitan society, and its effects on the life of everyman Pasquale Frafuso.",
    "2017_679": "A man leaves his home unannounced, and spends four days wandering around France.",
    "2017_68": "A talented teenage singer-songwriter living amid domestic abuse becomes a YouTube sensation after a video in which she hides her identity goes viral.",
    "2017_680": "A married daughter who longs for her mother's love is visited by the latter, a successful concert pianist.",
    "2017_681": "In his own words, Frank Serpico tells the story of his one-man crusade for police reform in the NYPD during the early 1970s.",
    "2017_682": "When the situation at her idyllic Palos Verdes home turns volatile, young Medina attempts to surf her way to happiness.",
    "2017_683": "The story of Mick Ronson, the guitar great who helped to create the sound of David Bowie's hugely influential glam rock years.",
    "2017_684": "Saigon Bodyguards follows the intense and hilarious journey of two professional bodyguards tasked with their most important assignment ever.",
    "2017_685": "In the center of the recent Tribeca Film Festival scandal surrounding his film VAXXED: From Cover-up to Controversy stands Andrew Wakefield, discredited and stripped of his medical license for his infamous study suggesting a link between ...See moreIn the center of the recent Tribeca Film Festival scandal surrounding his film VAXXED: From Cover-up to Controversy stands Andrew Wakefield, discredited and stripped of his medical license for his infamous study suggesting a link between the MMR vaccine, bowel disease, and autism. THE PATHOLOGICAL OPTIMIST takes us into the inner sanctum of Wakefield and his family from 2011- 2016 as he fights for his day in court in a little known defamation case against the British Medical Journal. Wakefield attempts to clear his name as the media-appointed Father of the Anti-vaccine movement. Director Miranda Bailey weaves a delicate portrait of a man who is THE PATHOLOGICAL OPTIMIST utilizing a never-before-seen, full access look at the man at the center of one of the biggest medical and media controversies of our times.See less",
    "2017_686": "Focused on the world of wealthy Qatari sheikhs with a passion for amateur falconry, 'The Challenge' combines cinematic beauty with rare access and trailblazing form. Here, the opulence of Qatar is on full display, as the men race SUVs up ...See moreFocused on the world of wealthy Qatari sheikhs with a passion for amateur falconry, 'The Challenge' combines cinematic beauty with rare access and trailblazing form. Here, the opulence of Qatar is on full display, as the men race SUVs up and down sand dunes, fly their prized falcons around on private jets, and take their pet cheetahs out for desert spins in their souped-up Ferraris.  Written by Kino LorberSee less",
    "2017_687": "A woman with a troubled past sets out to find her missing brother.",
    "2017_688": "The relationship between two friends deepens during an impromptu road trip.",
    "2017_689": "After fifty years of being away from academia, an 85-year-old African-American WWII Vet returns to the University of WI - Milwaukee to fulfill his biggest regret-not earning his Bachelor's Degree.",
    "2017_69": "An action-thriller in which an insurance salesman/ex-cop is caught up in a life-threatening conspiracy during his daily commute home.",
    "2017_690": "Julie's time with her benefactor, Kyle Allison, is coming to a dangerous close, but she is given two chances of escape from two very different men - a hired assassin and a wayward horse trainer with a dark past. Which man will save her?",
    "2017_691": "When the husband of a dying woman is approached by a corporation pioneering a new program to extend life through robotics, they get caught in a public debate over human's relationship with technology.",
    "2017_692": "The story of Nicholas Sand and Tim Scully, the unlikely duo at the heart of 1960s American drug counter-culture.",
    "2017_693": "When his wife dies, Lassefar (Max von Sydow) takes his 12-year-old son, Pelle (Pelle Hvenegaard), from their home in Sweden to Denmark in search of a better life. Signing on as laborers at a large farm, father and son undergo numerous ...See moreWhen his wife dies, Lassefar (Max von Sydow) takes his 12-year-old son, Pelle (Pelle Hvenegaard), from their home in Sweden to Denmark in search of a better life. Signing on as laborers at a large farm, father and son undergo numerous trials, including prejudice against immigrants and run-ins with those more powerful than themselves in both the physical and the social sense. Over the course of a year, young Pelle learns what it takes to survive in a harsh and unforgiving world.  Written by yusufpiskinSee less",
    "2017_694": "When a young man is diagnosed with a debilitating autoimmune disease with no cure, he and his father go on a journey to find answers and hope.",
    "2017_695": "Immigrant children have to find their way in a new classroom, with a new teacher and a language they don't understand. An ode to the teacher every child deserves.",
    "2017_696": "Gina, an American flight attendant, falls in with a Parisian bartender on a layover only to find herself tangled in a web of deception, delusion and unrequited amour fou.",
    "2017_697": "When six college kids in a sleepy Southern town are assigned a group project to rediscover a moment in history, one of them sets in motion a horrific fate when he proposes they head into the Georgia backwoods to tackle the legend of Emily ...See moreWhen six college kids in a sleepy Southern town are assigned a group project to rediscover a moment in history, one of them sets in motion a horrific fate when he proposes they head into the Georgia backwoods to tackle the legend of Emily Burt, the Talbot County werewolf. \"Lycan\" is a Hitchcockian tale of horror set in 1986 that delves into a hundred year old fable where our students are met with very real consequences that go beyond any classroom lessons.  Written by Bev Land and Michael MordlerSee less",
    "2017_698": "6 strangers are kidnapped and through governmental technology have proof they have all killed before and are told 5 will die this night, one may walk, and the six have 2 hours to decide who gets to live.",
    "2017_699": "A look at the personal life and public career of New York artist Julian Schnabel.",
    "2017_7": "China's deadliest special forces operative settles into a quiet life on the sea. When sadistic mercenaries begin targeting nearby civilians, he must leave his newfound peace behind and return to his duties as a soldier and protector.",
    "2017_70": "A boy haunted by visions of a dark tower from a parallel reality teams up with the tower's disillusioned guardian to stop an evil warlock known as the Man in Black who plans to use the boy to destroy the tower and open the gates of Hell.",
    "2017_700": "An amnesiac US soldier's in a cell next to a cute, French doctor. Earth is under attack by big, alien robots. Kenyan soldiers come to rape, torture and kill but the 2 fight back. They find a car and head west.",
    "2017_701": "Jo has come to Ibiza to be a DJ in the club Amnesia. He befriends a solitary woman who's trying to forget her past. As Jo draws her into techno music, Martha puts everything she had previously lived by into question.",
    "2017_702": "A serial killer is targeting women in the seedy district of Montmartre.",
    "2017_703": "After wandering a ruined city for years in search of food and shelter, two siblings find their way into one of the last remaining buildings. Inside, they find a man who will make them a dangerous offer to survive the outside world.",
    "2017_704": "GILBERT is a wildly funny and unexpectedly poignant portrait of the life and career of one of comedy's most iconic figures, Gilbert Gottfried.",
    "2017_705": "A forbidden romance between a 16-year-old Russian Jewish immigrant kid in Toronto and his cousin by marriage, a 14-year-old girl from Moscow with a scandalous past.",
    "2017_706": "\"Mr. Chibbs\" is an observational feature length documentary that follows NBA All-Star Kenny Anderson, in the midst of a mid life crisis, dealing with drinking issues, attempting to get a job, and on a journey to find himself ten years post...See more\"Mr. Chibbs\" is an observational feature length documentary that follows NBA All-Star Kenny Anderson, in the midst of a mid life crisis, dealing with drinking issues, attempting to get a job, and on a journey to find himself ten years post retirement. Everything came easy, but when he lost it all, he had to figure out who he was minus his famous handle. A story about society and its prodigies. Featuring Kenny Anderson, Natasha Anderson, David Falk,Kenny Smith, Vince Smith, Coach Bobby Cremins, Coach Bobby Hurley, Pierre Turner and Kenny Anderson Jr.See less",
    "2017_707": "Director Lysa Heslov's documentary, \"Served Like a Girl, provides a candid look at several American women as they transition from active duty to civilian life after serving tours of duty in Iraq and Afghanistan. Our wounded U.S. female ...See moreDirector Lysa Heslov's documentary, \"Served Like a Girl, provides a candid look at several American women as they transition from active duty to civilian life after serving tours of duty in Iraq and Afghanistan. Our wounded U.S. female service personnel often return to a stark reality, one that is rarely discussed or considered. Struggling with PTSD, homelessness, broken families, serious illness, physical injuries, and the aftermath of military sexual abuse, these amazing women find ways to adapt and overcome debilitating challenges through participation in the \"Ms. Veteran America\" competition. Guided by event founder and veteran, Jas Boothe, the women leverage their experiences gained through competition to recover the parts of themselves and their personal identities they had lost on the battlefield. Called \"Engaging, Honest and Powerful,\" this film is a beautiful tapestry interlaced with poignant moments, social commentary, and humor.See less",
    "2017_708": "In June 1944, twelve Japanese seaman are stranded on an abandoned-and-forgotten island called An-ta-han for seven years.",
    "2017_709": "Three undocumented Bronx teenagers are graduating from high school while navigating the treacherous waters of trying to get their papers to stay in the US.",
    "2017_71": "In an effort to save his house, a man accompanies the son of a recently deceased CEO to India to recover his will.",
    "2017_710": "A trip into the Mediterranean sea becomes a trip into the discovery of how society's frameworks of the rich and poor are delicate and temporary.",
    "2017_711": "A thrilling and action-packed Western, The Ballad of Lefty Brown is a story about loyalty, friendship, and the relentless pursuit of justice.",
    "2017_712": "An art world upstart, provocative and elusive artist Maurizio Cattelan made his career on playful and subversive works that send up the artistic establishment, until a retrospective at the Guggenheim in 2011 finally solidified his place in...See moreAn art world upstart, provocative and elusive artist Maurizio Cattelan made his career on playful and subversive works that send up the artistic establishment, until a retrospective at the Guggenheim in 2011 finally solidified his place in the contemporary art canon. Axelrod's equally playful profile leaves no stone unturned in trying to figure out: who is Maurizio Cattelan?See less",
    "2017_713": "Two friends, Ram Bharose and tech genius Cyberjeet, create a website that helps lovers to elope. The site is an instant hit; young couples line up for the opportunity to escape strict families and run away with the ones they love.",
    "2017_714": "In the feature documentary The Wrong Light, a charismatic activist leads a globally-regarded NGO that provides shelter and education for girls rescued from brothels in Northern Thailand. But as the filmmakers meet the girls and their ...See moreIn the feature documentary The Wrong Light, a charismatic activist leads a globally-regarded NGO that provides shelter and education for girls rescued from brothels in Northern Thailand. But as the filmmakers meet the girls and their families, discrepancies begin to emerge and the story takes an unexpected turn.  Written by Shine GlobalSee less",
    "2017_715": "Women are being jailed, physically violated and at risk of dying as a radical movement tightens its grip across America.",
    "2017_716": "BIG TIME follows Bjarke Ingels during the course of 7 years (2009-2016), while he struggles to finish his biggest project so far. We are let into Bjarke's creative processes as well as the endless compromises that his work entails.",
    "2017_717": "Alcoholic werewolf cop Lou Garou springs into action when an eccentric businessman with evil intentions seduces Woodhaven's residents with a new brewery and hockey team in this outrageous horror-comedy sequel.",
    "2017_718": "Made up entirely of archival news and White House footage, this documentary captures the pageantry, absurdity, and mastery of the made-for-TV politics of Ronald Reagan.",
    "2017_719": "A father and son head to New Orleans to overcome their women trouble.",
    "2017_72": "After a heroic death, a firefighter navigates the afterlife with the help of three guides.",
    "2017_720": "A woman struggles for survival beneath a frozen lake while a serial killer stalks her from the surface.",
    "2017_721": "After his girlfriend's pregnancy forces him to marry her, a young man must adjust to his new life and contend with his domineering mother-in-law.",
    "2017_722": "Inspired by the films of Jacques Demy and Stanley Donen, this musical comedy follows a young woman who must dance between a budding romance, a scheming boss, and co-workers on strike at her new job in a luxury shoe factory.",
    "2017_723": "After being wrongly accused of stealing from his former boss, an Iranian gangster with girl problems must hunt down stolen drugs in this neon-noir fever dream set in the bizarre Persian and Russian Los Angeles underworld where obscene reigns supreme.",
    "2017_724": "A young woman, recently released from a mental hospital, is coping with ongoing episodes of schizophrenia.",
    "2017_725": "An uncompromising story of life in a British juvenile offender institution in the 70's. Read more: Synopsis",
    "2017_726": "After five citizens of the Virgin Islands are convicted in the 1970s of a massacre at one of the island's fancy country clubs, their ostensible leader stages a skyjacking and escapes to Cuba.",
    "2017_727": "Dancers from the Trisha Brown Dance Company, teach the ballerinas from the Ballet de l'Opera in Paris one of Brown's most representative works \"Glacial Decoy\" (1979).",
    "2017_728": "Based on the early events of psychic Lazaro Ruben Torres, clinically declared dead five times. In the process of trying to reconnect with his daughter, Lazaro discovers the man who killed her.",
    "2017_729": "Murphy Dunn, a down and out private detective, is trying to get his life together after his last case. His luck changes when he's hired by his ex to find her missing son and stolen heirlooms. Instead, Murphy soon finds himself embroiled in...See moreMurphy Dunn, a down and out private detective, is trying to get his life together after his last case. His luck changes when he's hired by his ex to find her missing son and stolen heirlooms. Instead, Murphy soon finds himself embroiled in a mystery of mayhem, music and murder surrounding the whereabouts of an obscure 1970's rock record that people are willing to kill for.  Written by Luke DanielsSee less",
    "2017_73": "Bodies are turning up around the city, each having met a uniquely gruesome demise. As the investigation proceeds, evidence points to one suspect: John Kramer, the man known as Jigsaw, who has been dead for over 10 years.",
    "2017_730": "Eric Liddell - China's first gold medalist and one of Scotland's greatest athletes - returns to war-torn China.",
    "2017_731": "Teenage girls consigned to the Iranian \"Correctional and Rehabilitation Centre\" discuss their troubled lives and reveal what brought them there.",
    "2017_732": "A small group of French students are studying Mao, trying to find out their position in the world and how to change the world to a Maoistic community using terrorism.See moreA small group of French students are studying Mao, trying to find out their position in the world and how to change the world to a Maoistic community using terrorism.  Written by Stephan Eichenberg See less",
    "2017_733": "A film shaped like a shamanic journey, steeped in a psychoactive brew, exploring fear and destiny in the jungle of the mind.",
    "2017_734": "A 14,000-year-old college professor notices that he has finally started showing signs of aging. Meanwhile, four of his students get suspicious of him and start investigating his past.",
    "2017_735": "It's Not Yet Dark tells the ground breaking story of Simon Fitzmaurice, a talented young Irish film maker with ALS (MND), as he embarks on directing his first feature film through the use of his eyes and eye gaze technology.",
    "2017_736": "After accidentally killing a bearded goat with their father's truck, two incompatible siblings in their teenage years, embark on a journey of reconciliation.",
    "2017_737": "In 2307, a soldier is sent on a mission to hunt down the leader of the humanoid rebellion.",
    "2017_738": "A group of unlikely friends get together for an epic trading card tournament only to have a beautiful outsider turn everything on its head.",
    "2017_739": "A company is killing a company town.",
    "2017_74": "A team of scientists aboard the International Space Station discover a rapidly evolving life form that caused extinction on Mars and now threatens all life on Earth.",
    "2017_740": "One bullet. Three lives. Everyone pays. On an average Los Angeles day, a couple on the verge of divorce and a bullied teenager find their lives desperately changed when the teen's illegal gun accidentally goes off.",
    "2017_741": "A documentary about three students determined to graduate from their high school in Indianapolis, despite the fact that the institution has one of the lowest graduation rates in the country.",
    "2017_742": "Krystal and her twin brother/roommate confront twenty-eight years of their codependency when they start dating the same guy.",
    "2017_743": "The story of a family troupe of English actors in India. They travel around the towns and villages giving performances of Shakespearean plays. Through their travels we see the changing face of India as the old is replaced by the new, ...See moreThe story of a family troupe of English actors in India. They travel around the towns and villages giving performances of Shakespearean plays. Through their travels we see the changing face of India as the old is replaced by the new, Maharajas become hotel owners, sports become more important than culture and the theater is replaced by Bolliwood movies. Based on the travels of Geoffrey Kendal with his daughter Felicity Kendal.  Written by Steve Crook See less",
    "2017_744": "After his wife dies of cancer, an overworked engineer struggles to care for his son with autism. His son in response to bullying regresses into a fantasy world escape.",
    "2017_745": "The history of the Pulitzer Prize the most prestigious award in journalism is explored in this informative and entertaining documentary.",
    "2017_746": "Cameramen from Britain's Army Film Unit capture footage of concentration camps in German in 1945.",
    "2017_747": "Filmmaker Vlad Yudin follows several body builders as they struggle to find success in a competitive industry.",
    "2017_748": "When his wife dies during childbirth, a man takes up her favorite sport, tennis, in an effort to hold onto her memory. He focuses on winning tournaments and neglects his newborn daughter. A family tug-of-war begins for control of his baby.",
    "2017_749": "After 30 years of wrongful imprisonment, a woman plans to take revenge on her former lover.",
    "2017_75": "An undercover MI6 agent is sent to Berlin during the Cold War to investigate the murder of a fellow agent and recover a missing list of double agents.",
    "2017_750": "Deaf since having his hearing knocked out at the age of 12, Asher has been training for almost two decades to avenge himself on Ivan, the man that killed his older brother, 21 years ago. And now that his nemesis is out of prison, he gets ...See moreDeaf since having his hearing knocked out at the age of 12, Asher has been training for almost two decades to avenge himself on Ivan, the man that killed his older brother, 21 years ago. And now that his nemesis is out of prison, he gets his chance. But Asher's target also happens to be his father.See less",
    "2017_751": "A violent greaser gang is ripped apart when their leader finds love and is determined to leave Badsville - a town where love doesn't exist.",
    "2017_752": "A young married couple struggles to stay together after the husband suffers a crisis of faith.",
    "2017_753": "Once a year, the Dream Boat sets sail - a cruise only for gay men. Far from their families and political restrictions, we follow five men from five countries on a quest for their dreams. The cruise promises seven days of sunshine, love and...See moreOnce a year, the Dream Boat sets sail - a cruise only for gay men. Far from their families and political restrictions, we follow five men from five countries on a quest for their dreams. The cruise promises seven days of sunshine, love and freedom - but on board are also their personal stories, their doubts and uncertainties.  Written by NigelSee less",
    "2017_754": "A woman and man compete in an unusual race for mayor when gender roles magically reverse.",
    "2017_755": "In an effort to determine their sustainability as a food source, two chefs travel throughout the world tasting insects. Read more: Synopsis",
    "2017_756": "The former famous painter Frenhofer revisits an abandoned project using the girlfriend of a young visiting artist. Questions about truth, life, and artistic limits are explored.",
    "2017_757": "Patients from an insane asylum find refuge at a farmhouse after escaping from a bus.",
    "2017_758": "Dr. Pamela Dee is on a mission to \"Save The Menopausal Vaginas of America!\" Her goal is to de-stigmatize Menopause and start the \"Menopause Romance Revolution.\"",
    "2017_759": "The Speed Sisters are the first all-women race car driving team in the Middle East. They're bold. They're fearless. And they're tearing up tracks all over Palestine.",
    "2017_76": "A grieving man receives a mysterious, personal invitation to meet with God at a place called \"The Shack.\"",
    "2017_760": "With his marriage and career against the ropes, dejected author Jack Spencer travels with his wife, Amanda, to an isolated glamping retreat in search of a spark. When a surprise double booking finds their private retreat anything but ...See moreWith his marriage and career against the ropes, dejected author Jack Spencer travels with his wife, Amanda, to an isolated glamping retreat in search of a spark. When a surprise double booking finds their private retreat anything but private, Jack spins into a comedic exploration of love, lost dreams, small-town-wisdom, and friendship with a miniature donkey to get over himself before he loses all he holds dear.See less",
    "2017_761": "An internet-dating playboy's life spirals out of control after meeting a woman online.",
    "2017_762": "A U.S. Marshal seeking justice for his brother's murder defends a small town from a corrupt Mayor and his henchmen with intents to revive the civil war.",
    "2017_763": "An 11 year-old girl searches for a missing rare book from her grandmother's (Holland Taylor) library and tries to understand why her family is fractured the way it is during a memorable summer at an isolated New Mexico adobe. While her ...See moreAn 11 year-old girl searches for a missing rare book from her grandmother's (Holland Taylor) library and tries to understand why her family is fractured the way it is during a memorable summer at an isolated New Mexico adobe. While her mother (Kelly Lynch), like astronaut Michael Collins, goes to the dark side of the moon for a leukemia treatment, Ella must journey on her own to the strange moon of her grandmother's world. Ella's father, (Sean Patrick Flanery) orbits his daughter, as Ella befriends Miguel and Rosie to find acceptance of her mother's fate. Emotional connections are reshaped, and the music of Patrick Neil Doyle helps tell this unusual story. In an era when many actresses are speaking about the dearth of women in various production roles, behind the scenes of this family film were many women - the director, the DoP, the Editor, the PPS, and 3 of the 4 credited screenwriters. This was the result of finding the best people for the project. Additionally, there was a great range of roles for women of all ages in Kepler's Dream.See less",
    "2017_764": "Celebrated fiction writer and former priest, Colin Hampstead, and his wife, Kayleigh, are tormented by the ghost of her late sister, as the details of her grisly death are slowly uncovered.",
    "2017_765": "When a language dies, a unique vision of the world is lost forever.",
    "2017_766": "A Dutch couple, Martin and Margo Verfondern, move to a remote Spanish village of Santoalla to start a new life. There is conflict with the Spanish residents, resulting in the disappearance of Martin.",
    "2017_767": "The eldest daughter of a broken and troubled family works to keep the family together and look after her younger siblings, who are slipping into a life of crime.",
    "2017_768": "Ray is a fledgling entrepreneur who specializes in high-end simulated abductions. He jumps at the chance when a mysterious client contracts him for a weekend kidnapping with a handsome payday at the end. But the job isn't all that it seems.",
    "2017_769": "A kid from middle America, desperate to move to Chicago, joins the volleyball team to get a scholarship - the only catch is that his high school only has a girls team.",
    "2017_77": "An illegal immigrant from Mainland China sneaks into corrupt British-colonized Hong Kong in 1963, transforming himself into a ruthless and emerging drug lord.",
    "2017_770": "A mother must protect her family on Christmas Day from a demented stranger who is hell-bent on tearing them apart.",
    "2017_771": "Etheria is the world's most respected showcase of the best new horror, comedy, science fiction, fantasy, action, and thriller films made by emerging women directors.",
    "2017_772": "In the wake of his older brother's death, 13-year-old Dayveon spends the sweltering summer days roaming his rural Arkansas town. When he falls in with a local gang, he becomes drawn to the camaraderie and violence of their world.",
    "2017_773": "Daryl Davis is an accomplished musician who was played all over the world. He also has an unusual hobby, particularly for a middle aged black man. When not displaying his musical chops, Daryl likes to meet and befriend members of the Ku ...See moreDaryl Davis is an accomplished musician who was played all over the world. He also has an unusual hobby, particularly for a middle aged black man. When not displaying his musical chops, Daryl likes to meet and befriend members of the Ku Klux Klan. When many of these people eventually leave the Klan with Daryl's support, Daryl keeps their robes and hoods; building his collection piece by piece, story by story, person by person, in hopes of one day opening a museum of the Klan.See less",
    "2017_774": "A young law student blindly enters into a pact with a hoodlum who offers to kill his stepfather - a man he feels is responsible for the accident that sent his mother into a coma.",
    "2017_775": "As an awkward idealistic high school teacher begins her first job in the city, things turn out to be much tougher than she had imagined.",
    "2017_776": "In North Dakota an Indian nation finds itself at a critical moment in its long history. The Three Affiliated Tribes face catastrophic damage to their land and culture as a result of the recent oil boom on the Fort Berthold Reservation.",
    "2017_777": "Armed with low tech gear and high minded notions that penguin populations hold the key to human survival, Ron Naveen lays bare his 30 year love affair with the world's most pristine scientific laboratory: Antarctica. Famed as a place that ...See moreArmed with low tech gear and high minded notions that penguin populations hold the key to human survival, Ron Naveen lays bare his 30 year love affair with the world's most pristine scientific laboratory: Antarctica. Famed as a place that wants you dead, this film follows a rag tag team of field biologists to some of the harshest corners of the planet, where they track the impact of climate change and ocean health by counting penguin populations. From the tip of Argentina to the ominous Deception Island, 'The Penguin Counters' is a treacherous, heart warming journey by a 21st century Dr. Doliitle who dreams of conserving this stunning but fragile region for future generations.  Written by AnonymousSee less",
    "2017_778": "A celebration of the cultures of the world living and thriving in the United States, Extraordinary Ordinary People is a music-fueled journey across America.",
    "2017_779": "Japan's oldest major movie studio asks a batch of venerable filmmakers to revive its high-brow soft-core Roman Porno series.",
    "2017_78": "When a group of Indian and Pakistani nurses are held hostage in Iraq by a terrorist organization, a secret agent is drawn out of hiding to rescue them.",
    "2017_780": "When a successful, but tired Tokyo-based playwright who has sworn off easy women and casual encounters takes refuge in the countryside, his plans are disrupted by a horny woman who pedals fast into his life and is unrelenting.",
    "2017_79": "A widowed father and taxi driver who drives a German reporter from Seoul to Gwangju to cover the 1980 uprising, soon finds himself regretting his decision after being caught in the violence around him.",
    "2017_8": "The Guardians struggle to keep together as a team while dealing with their personal family issues, notably Star-Lord's encounter with his father the ambitious celestial being Ego.",
    "2017_80": "Desperate to pay the bills and come through for their loved ones, three lifelong pals risk it all by embarking on a daring bid to knock off the very bank that absconded with their money.",
    "2017_81": "A young woman finds herself on the receiving end of a terrifying curse that threatens to take her life in 7 days.",
    "2017_82": "An immortal woman reconnects with a love from her past life.",
    "2017_83": "In 2002, an artistically inclined seventeen-year-old girl comes of age in Sacramento, California.",
    "2017_84": "Following the events of the first movie, Surly and his friends must stop Oakton City's Mayor from destroying their home to make way for a dysfunctional amusement park.",
    "2017_85": "After the death of his girlfriend at the hands of terrorists, Mitch Rapp is drawn into the world of counterterrorism, mentored by tough-as-nails former U.S. Navy S.E.A.L. Stan Hurley.",
    "2017_86": "Queen Victoria strikes up an unlikely friendship with a young Indian clerk named Abdul Karim.",
    "2017_87": "Stranded after a tragic plane crash, two strangers must forge a connection to survive the extreme elements of a remote snow-covered mountain. When they realize help is not coming, they embark on a perilous journey across the wilderness.",
    "2017_88": "A small but brave donkey and his animal friends become the unsung heroes of the first Christmas.",
    "2017_89": "Finding himself dumped after twenty-five years of marriage, a man who made a career of seducing rich older women must move in with his estranged sister, where he begins to learn the value of family.",
    "2017_9": "Imprisoned on the planet Sakaar, Thor must race against time to return to Asgard and stop Ragnarök, the destruction of his world, at the hands of the powerful and ruthless villain Hela.",
    "2017_90": "Two sisters vacationing in Mexico are trapped in a shark cage at the bottom of the ocean. With less than an hour of oxygen left and great white sharks circling nearby, they must fight to survive.",
    "2017_91": "A teenager who's spent her whole life confined to her home falls for the boy next door.",
    "2017_92": "When her boyfriend dumps her before their exotic vacation, a young woman persuades her ultra-cautious mother to travel with her to paradise, with unexpected results.",
    "2017_93": "After a dark force conquers Canterlot, the Mane 6 embark on an unforgettable journey beyond Equestria where they meet new friends and exciting challenges on a quest to use the magic of friendship to save their homeland.",
    "2017_94": "The true story of Molly Bloom, an Olympic-class skier who ran the world's most exclusive high-stakes poker game and became an FBI target.",
    "2017_95": "A murder mystery that follows a cat-and-mouse relationship between a relentless detective and his equally clever former classmate who's protecting the guilty.",
    "2017_96": "When a terrorist who specializes in explosives takes hold of an underground tunnel, he threatens to kill hostages if his demands are not met.",
    "2017_97": "A quirky internet star, a pair of retired gangsters, and the black sheep of a prolific family of herbalists are a few of the oddball tenants that call the dilapidated apartments of Humble Grove home. Fearful of being locked out by a ...See moreA quirky internet star, a pair of retired gangsters, and the black sheep of a prolific family of herbalists are a few of the oddball tenants that call the dilapidated apartments of Humble Grove home. Fearful of being locked out by a ruthless property developer with his eye on the building, they've stayed inside for years. So, when supernatural incidents befall them all on one night, instead of running, they turn to flamboyant ghost hunter Golden Ling to perform a most unusual exorcism.  Written by Well Go USASee less",
    "2017_98": "The story of the kidnapping of 16-year-old John Paul Getty III and the desperate attempt by his devoted mother to convince his billionaire grandfather Jean Paul Getty to pay the ransom.",
    "2017_99": "Pakistan-born comedian Kumail Nanjiani and grad student Emily Gardner fall in love but struggle as their cultures clash. When Emily contracts a mysterious illness, Kumail finds himself forced to face her feisty parents, his family's ...See morePakistan-born comedian Kumail Nanjiani and grad student Emily Gardner fall in love but struggle as their cultures clash. When Emily contracts a mysterious illness, Kumail finds himself forced to face her feisty parents, his family's expectations, and his true feelings.See less"
}