{
    "2018_1": {
        "plotSummary": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.",
        "runtimeMinutes": "149"
    },
    "2018_10": {
        "plotSummary": "The second installment of the \"Fantastic Beasts\" series featuring the adventures of Magizoologist Newt Scamander.",
        "runtimeMinutes": "134"
    },
    "2018_100": {
        "plotSummary": "Set at the dawn of time, when prehistoric creatures and woolly mammoths roamed the earth, Early Man tells the story of Dug, along with sidekick Hognob as they unite his tribe against a mighty enemy Lord Nooth and his Bronze Age City to save their home.",
        "runtimeMinutes": "89"
    },
    "2018_101": {
        "plotSummary": "Five years after her husband and daughter are killed in a senseless act of violence, a woman comes back from self-imposed exile to seek revenge against those responsible and the system that let them go free.",
        "runtimeMinutes": "101"
    },
    "2018_102": {
        "plotSummary": "A villain's maniacal plan for world domination sidetracks five teenage superheroes who dream of Hollywood stardom.",
        "runtimeMinutes": "84"
    },
    "2018_103": {
        "plotSummary": "In a small town in Massachusetts, a group of friends, fascinated by the internet lore of the Slender Man, attempt to prove that he doesn't actually exist - until one of them mysteriously goes missing.",
        "runtimeMinutes": "93"
    },
    "2018_104": {
        "plotSummary": "A woman fights to protect her family during a home invasion.",
        "runtimeMinutes": "88"
    },
    "2018_105": {
        "plotSummary": "Simmba, a Corrupt Officer, enjoys all the perks of being an immoral and unethical police officer until a life-changing event forces him to choose the righteous path.",
        "runtimeMinutes": "158"
    },
    "2018_107": {
        "plotSummary": "Dr. Paul Kersey is an experienced trauma surgeon, a man who has spent his life saving lives. After an attack on his family, Paul embarks on his own mission for justice.",
        "runtimeMinutes": "107"
    },
    "2018_108": {
        "plotSummary": "A group of mercenaries come together to pull of an epic heist.",
        "runtimeMinutes": "100"
    },
    "2018_109": {
        "plotSummary": "Mary Stuart's (Saoirse Ronan's) attempt to overthrow her cousin Elizabeth I (Margot Robbie), Queen of England, finds her condemned to years of imprisonment before facing execution.",
        "runtimeMinutes": "124"
    },
    "2018_11": {
        "plotSummary": "As Scott Lang balances being both a superhero and a father, Hope van Dyne and Dr. Hank Pym present an urgent new mission that finds the Ant-Man fighting alongside The Wasp to uncover secrets from their past.",
        "runtimeMinutes": "118"
    },
    "2018_110": {
        "plotSummary": "An anti-ageist comedy about a man's dream to win the Rucker Classic street ball tournament in Harlem.",
        "runtimeMinutes": "103"
    },
    "2018_111": {
        "plotSummary": "A faithful wife, tired of standing by her devious husband, is enraged when it becomes clear she has been betrayed.",
        "runtimeMinutes": "120"
    },
    "2018_112": {
        "plotSummary": "Getafix/Panoramix decides it's time to pass the magic potion recipe on to a young, trustworthy druid. He looks all over Gaul with Asterix and Obelix as Demonix is out to get the recipe.",
        "runtimeMinutes": "87"
    },
    "2018_113": {
        "plotSummary": "Ensconced in her sprawling San Jose, California mansion, eccentric firearm heiress Sarah Winchester (Dame Helen Mirren) believes she is haunted by the souls of people killed by the Winchester repeating rifle.",
        "runtimeMinutes": "99"
    },
    "2018_114": {
        "plotSummary": "A biologist signs up for a dangerous, secret expedition into a mysterious zone where the laws of nature don't apply.",
        "runtimeMinutes": "115"
    },
    "2018_115": {
        "plotSummary": "When a cop who is just out of rehab takes the graveyard shift in a city hospital morgue, she faces a series of bizarre, violent events caused by an evil entity in one of the corpses.",
        "runtimeMinutes": "86"
    },
    "2018_116": {
        "plotSummary": "A man went back to Guizhou, found the tracks of a mysterious woman. He recalls the summer he spent with her twenty years ago.",
        "runtimeMinutes": "138"
    },
    "2018_117": {
        "plotSummary": "A small group of American soldiers find horror behind enemy lines on the eve of D-Day.",
        "runtimeMinutes": "110"
    },
    "2018_118": {
        "plotSummary": "A historical film about the siege of Ansi Fortress and the epic eighty-eight day battle that Yang Man-chun and his Goguryeo troops fought against 500,000 invading Tang dynasty men to defend it.",
        "runtimeMinutes": "136"
    },
    "2018_119": {
        "plotSummary": "Imprisoned by an adult world that now fears everyone under 18, a group of teens form a resistance group to fight back and reclaim control of their future.",
        "runtimeMinutes": "104"
    },
    "2018_12": {
        "plotSummary": "When the creator of a virtual reality called the OASIS dies, he makes a posthumous challenge to all OASIS users to find his Easter Egg, which will give the finder his fortune and control of his world.",
        "runtimeMinutes": "140"
    },
    "2018_120": {
        "plotSummary": "A humorous take on Sir Arthur Conan Doyle's classic mysteries featuring Sherlock Holmes and Doctor Watson. Read more: Synopsis",
        "runtimeMinutes": "90"
    },
    "2018_121": {
        "plotSummary": "Recruited by the East India Company, a local thug infiltrates a troop of patriotic bandits who plan to overthrow the British regime and reclaim their independence.",
        "runtimeMinutes": "164"
    },
    "2018_122": {
        "plotSummary": "Max, a macho, solitary Rottweiler police dog is ordered to go undercover as a primped show dog in a prestigious Dog Show, along with his human partner, to avert a disaster from happening.",
        "runtimeMinutes": "92"
    },
    "2018_123": {
        "plotSummary": "A police detective determined to catch the unseen boss of Asia's biggest drug cartel joins hands with a revenge-thirsty member of the gang. Read more: Synopsis",
        "runtimeMinutes": "123"
    },
    "2018_124": {
        "plotSummary": "In the mid-1990s, a loyal South Korean secret agent is caught in a political vortex plotted by the ruling classes of North and South Korea.",
        "runtimeMinutes": "137"
    },
    "2018_125": {
        "plotSummary": "The true story of Ruth Bader Ginsburg, her struggles for equal rights, and the early cases of a historic career that lead to her nomination and confirmation as U.S. Supreme Court Associate Justice. Read more: Synopsis",
        "runtimeMinutes": "120"
    },
    "2018_126": {
        "plotSummary": "The unlikely pairing of a spoiled millionaire venture capitalist scouting for extreme wedding tour locations and a grounded science photographer en route to chronicle the Aurora Australis lights face the ultimate 75 day test for survival ...See moreThe unlikely pairing of a spoiled millionaire venture capitalist scouting for extreme wedding tour locations and a grounded science photographer en route to chronicle the Aurora Australis lights face the ultimate 75 day test for survival and redemption after their twin engine craft crashes during a debilitating snowstorm over the vast desolate nether-regions of Antartica.  Written by Kenny WooSee less",
        "runtimeMinutes": "117"
    },
    "2018_127": {
        "plotSummary": "After mobiles start mysteriously flying out of the hands of people in Chennai, Dr Vaseegaran summons his trusted robot Chitti to ward off the bird-shaped supernatural powers of Pakshirajan.",
        "runtimeMinutes": "148"
    },
    "2018_128": {
        "plotSummary": "Self-financed fictional biopic of Brazilian bishop Edir Macedo, founder of the Universal Church of the Kingdom of God and owner of Record TV network.",
        "runtimeMinutes": "134"
    },
    "2018_129": {
        "plotSummary": "A young girl from London moves to Africa with her parents where she befriends a lion cub.",
        "runtimeMinutes": "98"
    },
    "2018_13": {
        "plotSummary": "PLA Navy Marine Corps launch a hostage rescue operation in the fictional Republic of Ihwea and undergo a fierce battle with rebellions and terrorism. Read more: Synopsis",
        "runtimeMinutes": "142"
    },
    "2018_130": {
        "plotSummary": "Young computer hacker Lisbeth Salander and journalist Mikael Blomkvist find themselves caught in a web of spies, cybercriminals and corrupt government officials.",
        "runtimeMinutes": "115"
    },
    "2018_131": {
        "plotSummary": "Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Now, facing pressure from all sides of the community, Starr must find her voice and stand up for what's right.",
        "runtimeMinutes": "133"
    },
    "2018_132": {
        "plotSummary": "A woman is released from prison and reunites with her sister. She soon discovers that her sister is in an online relationship with a man who may not be what he seems.",
        "runtimeMinutes": "110"
    },
    "2018_133": {
        "plotSummary": "A battle-hardened army officer squares off against drug lords and Russian henchmen to save his ex-lover's kidnapped daughter in the underbelly of Goa, India.",
        "runtimeMinutes": "137"
    },
    "2018_134": {
        "plotSummary": "Thieves attempt a massive heist against the U.S. Treasury as a Category 5 hurricane approaches one of its Mint facilities.",
        "runtimeMinutes": "103"
    },
    "2018_135": {
        "plotSummary": "Early 1970s. Four strangers check in at the El Royale Hotel. The hotel is deserted, staffed by a single desk clerk. Some of the new guests' reasons for being there are less than innocent and some are not who they appear to be.",
        "runtimeMinutes": "141"
    },
    "2018_136": {
        "plotSummary": "An untested American submarine captain teams with U.S. Navy Seals to rescue the Russian president, who has been kidnapped by a rogue general.",
        "runtimeMinutes": "121"
    },
    "2018_137": {
        "plotSummary": "When a border dispute arises between the U.S. and Canada, the Super Troopers are tasked with establishing a Highway Patrol station in the disputed area.",
        "runtimeMinutes": "100"
    },
    "2018_138": {
        "plotSummary": "A family of four staying at a secluded mobile home park for the night are stalked and then hunted by three masked psychopaths.",
        "runtimeMinutes": "85"
    },
    "2018_139": {
        "plotSummary": "Alex Honnold attempts to become the first person to ever free solo climb El Capitan.",
        "runtimeMinutes": "100"
    },
    "2018_14": {
        "plotSummary": "Tang and Qin team up to solve a murder in New York's Chinatown.",
        "runtimeMinutes": "121"
    },
    "2018_140": {
        "plotSummary": "Upon realizing the extent to which women are affected by their menses, a man sets out to create a sanitary pad machine and to provide inexpensive sanitary pads to the women of rural India.",
        "runtimeMinutes": "140"
    },
    "2018_141": {
        "plotSummary": "A young boy encounters a magical garden which enables him to travel through time and meet his relatives from different eras, with guidance by his younger sister from the future.",
        "runtimeMinutes": "98"
    },
    "2018_142": {
        "plotSummary": "A dramatization of the behind-the-scenes story of the IMF negotiations that took place during the financial crisis in 1997, through three parallel stories.",
        "runtimeMinutes": "114"
    },
    "2018_143": {
        "plotSummary": "Things go badly for a hack director and film crew shooting a low budget zombie movie in an abandoned WWII Japanese facility, when they are attacked by real zombies.",
        "runtimeMinutes": "96"
    },
    "2018_144": {
        "plotSummary": "When the puppet cast of a '90s children's TV show begin to get murdered one by one, a disgraced LAPD detective-turned-private eye puppet takes on the case.",
        "runtimeMinutes": "91"
    },
    "2018_145": {
        "plotSummary": "A 17-year-old girl suffers from a condition that prevents her from being out in the sunlight.",
        "runtimeMinutes": "91"
    },
    "2018_146": {
        "plotSummary": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby.",
        "runtimeMinutes": "86"
    },
    "2018_147": {
        "plotSummary": "Hichki presents a positive and inspiring story about a woman who turns her biggest weakness into her biggest strength.",
        "runtimeMinutes": "116"
    },
    "2018_148": {
        "plotSummary": "The story of teenager Richard Wershe Jr., who became an undercover informant for the FBI during the 1980s and was ultimately arrested for drug-trafficking and sentenced to life in prison.",
        "runtimeMinutes": "111"
    },
    "2018_149": {
        "plotSummary": "Luke travels Roma looking for apostle Paul, turned in Nero's prisoner, to tell his story before his execution.",
        "runtimeMinutes": "108"
    },
    "2018_15": {
        "plotSummary": "A group of scientists exploring the Marianas Trench encounter the largest marine predator that has ever existed - the Megalodon.",
        "runtimeMinutes": "113"
    },
    "2018_150": {
        "plotSummary": "A washed-up boxer, Jo-ha, has lived his life relying on nothing but his physical strength. His champion glory lasted only a moment, and now pride is all Jo-ha has. He runs into his mom who left him when he was little, and comes to live ...See moreA washed-up boxer, Jo-ha, has lived his life relying on nothing but his physical strength. His champion glory lasted only a moment, and now pride is all Jo-ha has. He runs into his mom who left him when he was little, and comes to live with her and Jin-tae, the younger brother who always seems awkward except for when he plays the piano. The autistic savant, Jin-tae, shows brilliance in playing the piano and video games, and cooking ramen. He is at first scared at his older brother, who insists on swinging his fists at people for what he wants. Reunited with each other, the two brothers learn what it is to be a family.See less",
        "runtimeMinutes": "120"
    },
    "2018_151": {
        "plotSummary": "Laurel and Hardy, the world's most famous comedy duo, attempt to reignite their film careers as they embark on what becomes their swan song - a grueling theatre tour of post-war Britain.",
        "runtimeMinutes": "98"
    },
    "2018_152": {
        "plotSummary": "A homicide detective and his partner recruit the help of an online private eye to solve a murder case.",
        "runtimeMinutes": "116"
    },
    "2018_153": {
        "plotSummary": "Ash meets five residents who come together to save the day when a series of threats endanger the annual Wind Festival and the entire population of their home, Fula City",
        "runtimeMinutes": "100"
    },
    "2018_154": {
        "plotSummary": "Set in medieval Rajasthan, Queen Padmavati is married to a noble king and they live in a prosperous fortress with their subjects until an ambitious Sultan hears of Padmavati's beauty and forms an obsessive love for the Queen of Mewar.",
        "runtimeMinutes": "164"
    },
    "2018_155": {
        "plotSummary": "An exploration of the life, lessons, and legacy of iconic children's television host, Fred Rogers.",
        "runtimeMinutes": "95"
    },
    "2018_156": {
        "plotSummary": "Following in the footsteps of blockbuster MOJIN: THE LOST LEGEND and based on the bestselling novel series, MOJIN: THE WORM VALLEY once again finds legendary tomb explorer Hu Bayi on a dangerous mission as he seeks out the Tomb of Emperor ...See moreFollowing in the footsteps of blockbuster MOJIN: THE LOST LEGEND and based on the bestselling novel series, MOJIN: THE WORM VALLEY once again finds legendary tomb explorer Hu Bayi on a dangerous mission as he seeks out the Tomb of Emperor Xian, located on an island of monstrous creatures in this mystical action-adventure.  Written by Well Go USASee less",
        "runtimeMinutes": "110"
    },
    "2018_157": {
        "plotSummary": "A soldier-turned-high school teacher uses unusual methods to reach to a class of poor students, while dealing with a greedy entrepreneur and his gang of fighters as well as the government.",
        "runtimeMinutes": "101"
    },
    "2018_158": {
        "plotSummary": "While keeping a low profile after his defeat by Ip Man, Cheung Tin Chi gets into trouble after getting in a fight with a powerful foreigner.",
        "runtimeMinutes": "107"
    },
    "2018_159": {
        "plotSummary": "Mary (Taraji P. Henson) is a hit woman working for an organized crime family in Boston, whose life is completely turned around when she meets a young boy whose path she crosses when a professional hit goes bad.",
        "runtimeMinutes": "89"
    },
    "2018_16": {
        "plotSummary": "Six years after the events of \"Wreck-It Ralph,\" Ralph and Vanellope, now friends, discover a wi-fi router in their arcade, leading them into a new adventure.",
        "runtimeMinutes": "112"
    },
    "2018_160": {
        "plotSummary": "A mother concerned about her young son's disturbing behavior thinks something supernatural may be affecting him.",
        "runtimeMinutes": "92"
    },
    "2018_161": {
        "plotSummary": "The crew of a horror web series travels to an abandoned asylum for a live broadcast. It soon encounters much more than expected as it moves deeper inside the nightmarish old building.",
        "runtimeMinutes": "95"
    },
    "2018_162": {
        "plotSummary": "All Might and Deku accept an invitation to visit I Island where they battle against a villain who takes the island hostage.",
        "runtimeMinutes": "96"
    },
    "2018_163": {
        "plotSummary": "With retirement on his mind, a successful Atlanta-based drug dealer sets up one last big job while dealing with trigger-happy colleagues and the police.",
        "runtimeMinutes": "116"
    },
    "2018_164": {
        "plotSummary": "A young woman embraces her pregnancy while she and her family set out to prove her childhood friend and lover innocent of a crime he didn't commit.",
        "runtimeMinutes": "119"
    },
    "2018_165": {
        "plotSummary": "A documentary about World War I with never-before-seen footage to commemorate the centennial of the end of the war.",
        "runtimeMinutes": "99"
    },
    "2018_166": {
        "plotSummary": "A documentary following the worldwide famous music group BTS, as they tour the world and share their experience along with their beloved band friends and fans.",
        "runtimeMinutes": "84"
    },
    "2018_167": {
        "plotSummary": "In the 1950s, a music director falls in love with a singer and tries to persuade her to flee communist Poland for France.",
        "runtimeMinutes": "89"
    },
    "2018_168": {
        "plotSummary": "A wife questions her life choices as she travels to Stockholm to see her husband receive the Nobel Prize for Literature.",
        "runtimeMinutes": "99"
    },
    "2018_169": {
        "plotSummary": "Laura, a Spanish woman living in Buenos Aires, returns to her hometown outside Madrid with her two children to attend her sister's wedding. However, the trip is upset by unexpected events that bring secrets into the open.",
        "runtimeMinutes": "133"
    },
    "2018_17": {
        "plotSummary": "Count Dracula and company participate in a cruise for sea-loving monsters, unaware that their boat is being commandeered by the monster-hating Van Helsing family.",
        "runtimeMinutes": "97"
    },
    "2018_170": {
        "plotSummary": "Kung Fu apprentices at the Oolong Courtyard school are suspicious when two outsiders try to join the prestigious academy despite their strange behavior.",
        "runtimeMinutes": "103"
    },
    "2018_171": {
        "plotSummary": "When a series of unusual murders occurs, Detective K (KIM Myung-min) and his partner (OH Dal-soo) are once again called into action as they discover a trail of bodies with mysterious bite marks.",
        "runtimeMinutes": "120"
    },
    "2018_172": {
        "plotSummary": "Ma Le is a psychologist who makes money on suicide prevention. His happiness always stems from others' misfortune. The God of Longevity comes to earth to save the world but his power is absorbed by Ma Le, so he has to ask Ma Le to help him...See moreMa Le is a psychologist who makes money on suicide prevention. His happiness always stems from others' misfortune. The God of Longevity comes to earth to save the world but his power is absorbed by Ma Le, so he has to ask Ma Le to help him with the huge plan. They find four Gods: Thunder, Lightning, Wind and Rain living on the earth and start the adventure of saving the world.See less",
        "runtimeMinutes": "105"
    },
    "2018_173": {
        "plotSummary": "The story revolves around Bauua Singh (Shah Rukh Khan), a vertically challenged man, who is full of charm and wit, with a pinch of arrogance. Born to a wealthy family and raised in an environment of affluence, he is challenged to broaden ...See moreThe story revolves around Bauua Singh (Shah Rukh Khan), a vertically challenged man, who is full of charm and wit, with a pinch of arrogance. Born to a wealthy family and raised in an environment of affluence, he is challenged to broaden his horizon and find purpose in life.See less",
        "runtimeMinutes": "164"
    },
    "2018_174": {
        "plotSummary": "Depicting Ted Kennedy's involvement in the fatal 1969 car accident that claims the life of a young campaign strategist, Mary Jo Kopechne.",
        "runtimeMinutes": "106"
    },
    "2018_175": {
        "plotSummary": "In an alternate present-day version of Oakland, telemarketer Cassius Green discovers a magical key to professional success, propelling him into a universe of greed.",
        "runtimeMinutes": "112"
    },
    "2018_176": {
        "plotSummary": "A masked serial killer turns a horror-themed amusement park into his own personal playground, terrorizing a group of friends while the rest of the patrons believe that it is all part of the show.",
        "runtimeMinutes": "89"
    },
    "2018_177": {
        "plotSummary": "Based on the true story of Forrest Tucker and his audacious escape from San Quentin at the age of 70 to an unprecedented string of heists that confounded authorities and enchanted the public.",
        "runtimeMinutes": "93"
    },
    "2018_178": {
        "plotSummary": "As her marriage crumbles, a judge must decide a case involving a teenage boy who is refusing a blood transfusion on religious principle.",
        "runtimeMinutes": "105"
    },
    "2018_179": {
        "plotSummary": "A team of secret agents set out to track down the Nazi officer who masterminded the Holocaust.",
        "runtimeMinutes": "122"
    },
    "2018_18": {
        "plotSummary": "A grumpy Grinch (Benedict Cumberbatch) plots to ruin Christmas for the village of Whoville.",
        "runtimeMinutes": "85"
    },
    "2018_180": {
        "plotSummary": "A journalist strikes up a romantic relationship with notorious drug lord Pablo Escobar.",
        "runtimeMinutes": "123"
    },
    "2018_181": {
        "plotSummary": "102 Not Out is a 2018 comedy-drama film, with legendary actor Amitabh Bachchan playing a 102-year-old wanting to break the oldest-man-alive record. Another Bollywood legend Rishi Kapoor plays his sad and grumpy 75-year-old son.",
        "runtimeMinutes": "102"
    },
    "2018_182": {
        "plotSummary": "Based on the best-selling pair of memoirs from father and son David and Nic Sheff, Beautiful Boy chronicles the heartbreaking and inspiring experience of survival, relapse and recovery in a family coping with addiction over many years. Read more: Synopsis",
        "runtimeMinutes": "120"
    },
    "2018_183": {
        "plotSummary": "Set in the near-future, technology controls nearly all aspects of life. But when the world of Grey, a self-labeled technophobe, is turned upside down, his only hope for revenge is an experimental computer chip implant.",
        "runtimeMinutes": "100"
    },
    "2018_184": {
        "plotSummary": "After being gone for a decade a country star returns home to the love he left behind.",
        "runtimeMinutes": "108"
    },
    "2018_185": {
        "plotSummary": "A teen comes into possession of a new laptop and soon discovers that the previous owner is not only watching him, but will also do anything to get it back.",
        "runtimeMinutes": "92"
    },
    "2018_186": {
        "plotSummary": "On the eve of retirement a middle class, judgmental snob discovers her husband has been having an affair with her best friend and is forced into exile with her bohemian sister who lives on an impoverished inner-city council estate.",
        "runtimeMinutes": "111"
    },
    "2018_187": {
        "plotSummary": "Set in Joseon, the story depicts a battle to gain the propitious site for a grave.",
        "runtimeMinutes": "133"
    },
    "2018_188": {
        "plotSummary": "A struggling mother of three forms an unexpected bond with the night nanny hired to help with her newborn baby.",
        "runtimeMinutes": "95"
    },
    "2018_189": {
        "plotSummary": "An ace crisis negotiator faces off against a cold-blooded hostage taker. Over the course of 21 hours, she attempts to crack his unusually calm demeanor and force him to reveal his motivations.",
        "runtimeMinutes": "114"
    },
    "2018_19": {
        "plotSummary": "On the run in the year 1987, Bumblebee finds refuge in a junkyard in a small California beach town. On the cusp of turning 18 and trying to find her place in the world, Charlie Watson discovers Bumblebee, battle-scarred and broken.",
        "runtimeMinutes": "114"
    },
    "2018_190": {
        "plotSummary": "An unemployed small-town man defies all odds and naysayers and starts his own garment business.",
        "runtimeMinutes": "122"
    },
    "2018_191": {
        "plotSummary": "The exceptional life and career of U.S. Supreme Court Justice Ruth Bader Ginsburg, who has developed a breathtaking legal legacy while becoming an unexpected pop culture icon.",
        "runtimeMinutes": "98"
    },
    "2018_192": {
        "plotSummary": "An introverted teenage girl tries to survive the last week of her disastrous eighth grade year before leaving to start high school.",
        "runtimeMinutes": "93"
    },
    "2018_193": {
        "plotSummary": "A young woman is involuntarily committed to a mental institution, where she is confronted by her greatest fear - but is it real or a product of her delusion?",
        "runtimeMinutes": "98"
    },
    "2018_194": {
        "plotSummary": "Colette is pushed by her husband to write novels under his name. Upon their success, she fights to make her talents known, challenging gender norms.",
        "runtimeMinutes": "111"
    },
    "2018_195": {
        "plotSummary": "Separated couple Rodrigo and Alejandra are required to see each other occasionally because they have joint custody of their son Santi. When they discover that Santi needs surgery to save his eyesight, Santi makes a pre-operation wishlist ...See moreSeparated couple Rodrigo and Alejandra are required to see each other occasionally because they have joint custody of their son Santi. When they discover that Santi needs surgery to save his eyesight, Santi makes a pre-operation wishlist and determines to fulfill it with united parents by his side.See less",
        "runtimeMinutes": "85"
    },
    "2018_196": {
        "plotSummary": "A Hindu-Muslim love story, Kedarnath portrays how a Muslim pithoo saves a Hindu tourist from the Uttrakhand floods at the pilgrimage, and the love that eventually develops between them.",
        "runtimeMinutes": "116"
    },
    "2018_197": {
        "plotSummary": "In 1904 an earthquake of magnitude 5.4 on the Richter scale shook Oslo, with an epicenter in the \"Oslo Graben\" which runs under the Norwegian capital. There are now signs that indicate that we can expect a major future earthquake in Oslo. Read more: Synopsis",
        "runtimeMinutes": "106"
    },
    "2018_198": {
        "plotSummary": "In 1980 New York, three young men who were all adopted meet each other and find out they're triplets who were separated at birth. But their quest to find out why turns into a bizarre and sinister mystery.",
        "runtimeMinutes": "96"
    },
    "2018_199": {
        "plotSummary": "Set in riot-torn, near-future Los Angeles, 'Hotel Artemis' follows the Nurse, who runs a secret, members-only emergency room for criminals.",
        "runtimeMinutes": "94"
    },
    "2018_2": {
        "plotSummary": "T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past.",
        "runtimeMinutes": "134"
    },
    "2018_20": {
        "plotSummary": "A musician helps a young singer find fame as age and alcoholism send his own career into a downward spiral.",
        "runtimeMinutes": "136"
    },
    "2018_200": {
        "plotSummary": "In 1850s Oregon, the infamous duo of assassins, Eli Sisters (John C. Reilly) and Charlie Sisters (Joaquin Phoenix), chase a gold prospector and his unexpected ally.",
        "runtimeMinutes": "122"
    },
    "2018_201": {
        "plotSummary": "A victim of a brutal attack finds a unique and beautiful therapeutic outlet to help him through his recovery process.",
        "runtimeMinutes": "116"
    },
    "2018_202": {
        "plotSummary": "A captain and his team of 12 soldiers infiltrate a secret underground bunker to take out a target in the Korean demilitarized zone.",
        "runtimeMinutes": "119"
    },
    "2018_203": {
        "plotSummary": "An 11-year-old boy befriends three aliens after they crash their spaceship into his house.",
        "runtimeMinutes": "86"
    },
    "2018_204": {
        "plotSummary": "When Lee Israel falls out of step with current tastes, she turns her art form to deception.",
        "runtimeMinutes": "106"
    },
    "2018_205": {
        "plotSummary": "Lee Chung is a Prince of Joseon, but he has been taken hostage to the Qing Dynasty.",
        "runtimeMinutes": "121"
    },
    "2018_206": {
        "plotSummary": "A modern retelling of Louisa May Alcott's classic novel, we follow the lives of four sisters - Meg, Jo, Beth, and Amy March - detailing their passage from childhood to womanhood. Despite harsh times, they cling to optimism, and as they ...See moreA modern retelling of Louisa May Alcott's classic novel, we follow the lives of four sisters - Meg, Jo, Beth, and Amy March - detailing their passage from childhood to womanhood. Despite harsh times, they cling to optimism, and as they mature, they face blossoming ambitions and relationships, as well as tragedy, while maintaining their unbreakable bond as sisters.  Written by AnonymousSee less",
        "runtimeMinutes": "112"
    },
    "2018_207": {
        "plotSummary": "East Germany, 1979. After initially failing to flee from the East to the West in a self-built hot-air balloon, two families struggle to make a second attempt, while the East German State Police are chasing them.",
        "runtimeMinutes": "125"
    },
    "2018_208": {
        "plotSummary": "The son of a Baptist preacher unwillingly participates in a church-supported gay conversion program after being forcibly outed to his parents. Read more: Synopsis",
        "runtimeMinutes": "115"
    },
    "2018_209": {
        "plotSummary": "Dong-Chul (Don Lee) and Ji-Soo (Song Ji-Hyo) are a happily married couple. One day, Dong-Chul comes home to find his house in disarray and his wife is missing.",
        "runtimeMinutes": "116"
    },
    "2018_21": {
        "plotSummary": "When three different animals become infected with a dangerous pathogen, a primatologist and a geneticist team up to stop them from destroying Chicago.",
        "runtimeMinutes": "107"
    },
    "2018_210": {
        "plotSummary": "Attending the reunion in lieu of her late elder sister, Zhihua accidentally runs into Yin Chuan, on whom she had a crush in her youth. As old memories are evoked Zhihua slowly uncovers the intricate story of the trio.",
        "runtimeMinutes": "114"
    },
    "2018_211": {
        "plotSummary": "A story of violent love within a time frame spanning from 2001 to 2017.",
        "runtimeMinutes": "136"
    },
    "2018_212": {
        "plotSummary": "A true crime movie about a crew of retired crooks who pull off a major heist in London's jewelry district. What starts off as their last criminal hurrah, quickly turns into a brutal nightmare due to greed. Based on infamous true events.",
        "runtimeMinutes": "108"
    },
    "2018_213": {
        "plotSummary": "A look at the life of painter Vincent van Gogh during the time he lived in Arles and Auvers-sur-Oise, France.",
        "runtimeMinutes": "111"
    },
    "2018_214": {
        "plotSummary": "Valentina has the perfect life in America. Her universe trembles when Jason, her boyfriend, proposes marriage and she must confront her family, the Hidalgo, the most chaotic and surreal political dynasty in the history of Mexico.",
        "runtimeMinutes": "107"
    },
    "2018_215": {
        "plotSummary": "GRINGO, a dark comedy mixed with white-knuckle action and dramatic intrigue, explores the battle of survival for businessman Harold Soyinka (David Oyelowo) when he finds himself crossing the line from law-abiding citizen to wanted criminal.",
        "runtimeMinutes": "111"
    },
    "2018_216": {
        "plotSummary": "A deliveryman has to run for his life when he is he falsely accused of killing a presidential candidate in a car explosion.",
        "runtimeMinutes": "108"
    },
    "2018_217": {
        "plotSummary": "The story of Joan Stanley, who was exposed as the K.G.B.'s longest-serving British spy.",
        "runtimeMinutes": "101"
    },
    "2018_218": {
        "plotSummary": "A shy teenager falls for a spirit who wakes up in the body of a different person every morning.",
        "runtimeMinutes": "97"
    },
    "2018_219": {
        "plotSummary": "The story of Ro Gi Soo, a tap dancing North Korean soldier who was held captive in the Geoje prison camp during the Korean War.",
        "runtimeMinutes": "133"
    },
    "2018_22": {
        "plotSummary": "Five years after the events of Mamma Mia!, Sophie prepares for the grand reopening of the Hotel Bella Donna as she learns more about her mother's past.",
        "runtimeMinutes": "114"
    },
    "2018_220": {
        "plotSummary": "Four police officers open up a lobster restaurant as a cover in order to catch a notorious drug dealer, only to find their secret recipe is more popular than they expect. When they get caught up in their new business venture, they find a ...See moreFour police officers open up a lobster restaurant as a cover in order to catch a notorious drug dealer, only to find their secret recipe is more popular than they expect. When they get caught up in their new business venture, they find a bigger conspiracy at work.  Written by China Lion Film DistributionSee less",
        "runtimeMinutes": "94"
    },
    "2018_221": {
        "plotSummary": "Chased by a vengeful criminal, the feds and a gang of otherworldly soldiers, an ex-con and his adopted teenage brother go on the run with a weapon of mysterious origin as their only protection.",
        "runtimeMinutes": "102"
    },
    "2018_222": {
        "plotSummary": "A wild bachelorette weekend in a foreign city spins hilariously out of control in this over-the-top sequel to the box office smash GIRLS. After a drinking contest with some questionable local spirits, three friends wake naked on a beach to...See moreA wild bachelorette weekend in a foreign city spins hilariously out of control in this over-the-top sequel to the box office smash GIRLS. After a drinking contest with some questionable local spirits, three friends wake naked on a beach to discover two are handcuffed to a locked suitcase, one has a strange new tattoo, and none of them have any clue what happened the night before. When they soon find themselves pursued by local gangsters, their only shot at making it home - and to the altar - is to piece together the previous night's events while on the run.See less",
        "runtimeMinutes": "120"
    },
    "2018_223": {
        "plotSummary": "After the tragic death of star volleyball player Caroline \"Line\" Found, a team of dispirited high school girls must band together under the guidance of their tough-love coach in hopes of winning the state championship.",
        "runtimeMinutes": "101"
    },
    "2018_224": {
        "plotSummary": "A drug addicted teenage boy shows up unexpectedly at his family's home on Christmas Eve.",
        "runtimeMinutes": "103"
    },
    "2018_225": {
        "plotSummary": "Wrongfully convicted for murder, Henri Charriere forms an unlikely relationship with fellow inmate and quirky convicted counterfeiter Louis Dega, in an attempt to escape from the notorious penal colony on Devil's Island.",
        "runtimeMinutes": "133"
    },
    "2018_226": {
        "plotSummary": "Princess Songhwa refuses her fate of marrying someone who matches her marital harmony. There are 4 men on her future husband list with different fate signs. Refusing her fate, she decides to leave the palace and find her husband by herself...See morePrincess Songhwa refuses her fate of marrying someone who matches her marital harmony. There are 4 men on her future husband list with different fate signs. Refusing her fate, she decides to leave the palace and find her husband by herself. Seo Do Yoon is a person who interprets marital harmony signs. He is very skilled at his craft and, consequently, selected as the one to read the marital harmony signs between Princess Songhwa and the 4 men on her husband list.  Written by https://mydramalist.com/15094-marital-harmonySee less",
        "runtimeMinutes": "110"
    },
    "2018_227": {
        "plotSummary": "A couple off for a romantic weekend in the mountains are accosted by a biker gang. Alone in the mountains, Brea and John must defend themselves against the gang, who will stop at nothing to protect their secrets. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "2018_228": {
        "plotSummary": "A scientist becomes obsessed with bringing back his family members who died in a traffic accident.",
        "runtimeMinutes": "107"
    },
    "2018_229": {
        "plotSummary": "Follows Stevie, a thirteen-year-old in 1990s-era Los Angeles who spends his summer navigating between his troubled home life and a group of new friends that he meets at a Motor Avenue skate shop.",
        "runtimeMinutes": "85"
    },
    "2018_23": {
        "plotSummary": "During an adventure into the criminal underworld, Han Solo meets his future co-pilot Chewbacca and encounters Lando Calrissian years before joining the Rebellion.",
        "runtimeMinutes": "135"
    },
    "2018_230": {
        "plotSummary": "A Korean American arm wrestler goes to South Korea for a competition, and finds a sister that he didn't know about.",
        "runtimeMinutes": "108"
    },
    "2018_231": {
        "plotSummary": "Inspired by the true events of the 1976 hijacking of an Air France flight en route from Tel Aviv to Paris, and the most daring rescue mission ever attempted.",
        "runtimeMinutes": "107"
    },
    "2018_232": {
        "plotSummary": "Pope Francis travels the world speaking to those in need and delivering a message of hope.",
        "runtimeMinutes": "96"
    },
    "2018_233": {
        "plotSummary": "A.X.L. is a top-secret, robotic dog who develops a special friendship with Miles and will go to any length to protect his new companion.",
        "runtimeMinutes": "100"
    },
    "2018_234": {
        "plotSummary": "A woman returns to her Orthodox Jewish community that shunned her for her attraction to a female childhood friend. Once back, their passions reignite as they explore the boundaries of faith and sexuality.",
        "runtimeMinutes": "114"
    },
    "2018_235": {
        "plotSummary": "As a young New York City couple goes from college romance to marriage and the birth of their first child, the unexpected twists of their journey create reverberations that echo over continents and through lifetimes.",
        "runtimeMinutes": "117"
    },
    "2018_236": {
        "plotSummary": "A darkness swirls at the center of a world-renowned dance company, one that will engulf the artistic director, an ambitious young dancer, and a grieving psychotherapist. Some will succumb to the nightmare. Others will finally wake up.",
        "runtimeMinutes": "152"
    },
    "2018_237": {
        "plotSummary": "A love story between a couple with the same last name but very different social statuses.",
        "runtimeMinutes": "93"
    },
    "2018_238": {
        "plotSummary": "A documentary presenting Aretha Franklin with choir at the New Bethel Baptist Church in Watts, Los Angeles in January 1972.",
        "runtimeMinutes": "89"
    },
    "2018_239": {
        "plotSummary": "A father and his thirteen-year-old daughter are living an ideal existence in a vast urban park in Portland, Oregon when a small mistake derails their lives forever.",
        "runtimeMinutes": "109"
    },
    "2018_24": {
        "plotSummary": "Teen Miles Morales becomes the Spider-Man of his universe, and must join with five spider-powered individuals from other dimensions to stop a threat for all realities.",
        "runtimeMinutes": "117"
    },
    "2018_240": {
        "plotSummary": "In the mountains of Sichuan, China, a researcher forms a bond with Qian Qian, a panda who is about to experience nature for the first time.",
        "runtimeMinutes": "42"
    },
    "2018_241": {
        "plotSummary": "Jong-su bumps into a girl who used to live in the same neighborhood, who asks him to look after her cat while she's on a trip to Africa. When back, she introduces Ben, a mysterious guy she met there, who confesses his secret hobby. Read more: Synopsis",
        "runtimeMinutes": "148"
    },
    "2018_242": {
        "plotSummary": "Caught in the crossfires of civil war, CIA operatives must send a former U.S. diplomat to negotiate for the life of a friend he left behind.",
        "runtimeMinutes": "110"
    },
    "2018_243": {
        "plotSummary": "Pastor Dave responds to the unimaginable tragedy of having his church, located on the grounds of the local university, burned down.",
        "runtimeMinutes": "105"
    },
    "2018_244": {
        "plotSummary": "1809, France. Captain Neuville is called to the front, leaving his future bride heartbroken. Her sister decides to write letters on his behalf to cheer her up. But it all goes south when Neuville reappears.",
        "runtimeMinutes": "90"
    },
    "2018_245": {
        "plotSummary": "Theo was born an unwanted child. The social services set out to find the perfect home for his adoption.",
        "runtimeMinutes": "110"
    },
    "2018_246": {
        "plotSummary": "A group of interconnected people in Los Angeles are brought together by their lovely canine counterparts.",
        "runtimeMinutes": "113"
    },
    "2018_247": {
        "plotSummary": "Relationships and loyalties of a criminal family planning its next big heist are tested when some shocking revelations strike them.",
        "runtimeMinutes": "160"
    },
    "2018_248": {
        "plotSummary": "Filmmaker Michael Moore examines the current state of American politics, particularly the Donald Trump presidency and gun violence, while highlighting the power of grassroots democratic movements.",
        "runtimeMinutes": "128"
    },
    "2018_249": {
        "plotSummary": "Soorma is the story of the triumph of the human spirit, about a player, who made headlines for his miraculous comeback after facing a near death experience through sheer determination, hard work and unrelenting passion for the sport.",
        "runtimeMinutes": "131"
    },
    "2018_25": {
        "plotSummary": "Anastasia and Christian get married, but Jack Hyde continues to threaten their relationship.",
        "runtimeMinutes": "105"
    },
    "2018_250": {
        "plotSummary": "The story of crime boss John Gotti and his son.",
        "runtimeMinutes": "112"
    },
    "2018_251": {
        "plotSummary": "The next amazing chapter of Olympian and World War II hero Louis Zamperini's powerful true story of forgiveness, redemption, and amazing grace.",
        "runtimeMinutes": "98"
    },
    "2018_252": {
        "plotSummary": "German artist Kurt Barnert has escaped East Germany and now lives in West Germany, but is tormented by his childhood under the Nazis and the GDR-regime.",
        "runtimeMinutes": "189"
    },
    "2018_253": {
        "plotSummary": "A plover chick has not learned to fly when his family migrates in the fall. He must survive the arctic winter, vicious enemies and himself in order to be reunited with his beloved one next spring.",
        "runtimeMinutes": "83"
    },
    "2018_254": {
        "plotSummary": "One year has passed since the events of Mobile Suit Gundam Unicorn and the Laplace's Box was opened. Following the conflict called the \"Laplace Incident\", the Neo Zeon remnant force known as the Sleeves is destroyed. Both the Banshee and ...See moreOne year has passed since the events of Mobile Suit Gundam Unicorn and the Laplace's Box was opened. Following the conflict called the \"Laplace Incident\", the Neo Zeon remnant force known as the Sleeves is destroyed. Both the Banshee and Unicorn Gundam are sealed away from public consciousness, locked in secrecy and meant to be forgotten by history. However, sightings of another Gundam are suddenly being reported. The Unicorn Gundam 03 Phenex, thought to be lost since two years ago, has reappeared.See less",
        "runtimeMinutes": "88"
    },
    "2018_255": {
        "plotSummary": "This docudrama draws parallels between the dramatic fracturing of the nation over Abraham Lincoln's presidency and the presidency of Donald Trump. Read more: Synopsis",
        "runtimeMinutes": "108"
    },
    "2018_256": {
        "plotSummary": "A mother of two who inherits a house is confronted with murderous intruders on the first night in their new home and fights for her daughters' lives. Sixteen years later when the daughters reunite at the house, things get really strange.",
        "runtimeMinutes": "91"
    },
    "2018_257": {
        "plotSummary": "The angelic face of Carlos, a 17-year-old teenager, hides a dark facet of robberies, lies and murders.",
        "runtimeMinutes": "118"
    },
    "2018_258": {
        "plotSummary": "A police detective reconnects with people from an undercover assignment in her distant past in order to make peace.",
        "runtimeMinutes": "121"
    },
    "2018_259": {
        "plotSummary": "Balloon kingdoms, dopey police dragons and happy wizards are exactly how Terry remembered his Grandmother's wacky fairy tales. Except they are real and it's definitely not as 'cheerful.'",
        "runtimeMinutes": "97"
    },
    "2018_26": {
        "plotSummary": "A priest with a haunted past and a novice on the threshold of her final vows are sent by the Vatican to investigate the death of a young nun in Romania and confront a malevolent force in the form of a demonic nun.",
        "runtimeMinutes": "96"
    },
    "2018_260": {
        "plotSummary": "A daredevil designs and operates his own theme park with his friends.",
        "runtimeMinutes": "85"
    },
    "2018_261": {
        "plotSummary": "A timid dog groomer living in a poor suburb sells cocaine on the side and stays out of trouble, while trying to deal with his unstable, violent acquaintance who is a menace to the whole neighborhood.",
        "runtimeMinutes": "103"
    },
    "2018_262": {
        "plotSummary": "While on probation, a man begins to re-evaluate his relationship with his volatile best friend.",
        "runtimeMinutes": "95"
    },
    "2018_263": {
        "plotSummary": "The true story of a stray dog who joins his new master on the battlefields of the First World War. For his valorous actions, Sgt. Stubby is still recognized as the most decorated dog in American history.",
        "runtimeMinutes": "84"
    },
    "2018_264": {
        "plotSummary": "After losing the love of his life to a cruel Philistine Prince, a young Hebrew with supernatural strength defends his people, sacrificing everything to avenge his love, his people, and God.",
        "runtimeMinutes": "110"
    },
    "2018_265": {
        "plotSummary": "Hamlet, Prince of Denmark, finds out that his Uncle Claudius killed his father to obtain the throne, and plans his revenge.",
        "runtimeMinutes": "217"
    },
    "2018_266": {
        "plotSummary": "A pair of burglars stumble upon a woman being held captive in a home they intended to rob.",
        "runtimeMinutes": "110"
    },
    "2018_267": {
        "plotSummary": "An in-depth look at the life and music of Whitney Houston.",
        "runtimeMinutes": "120"
    },
    "2018_268": {
        "plotSummary": "A police officer assigned alarm dispatch duty enters a race against time when he answers an emergency call from a kidnapped woman.",
        "runtimeMinutes": "85"
    },
    "2018_269": {
        "plotSummary": "Juliet, Naked is the story of Annie (the long-suffering girlfriend of Duncan) and her unlikely transatlantic romance with once revered, now faded, singer-songwriter, Tucker Crowe, who also happens to be the subject of Duncan's musical obsession.",
        "runtimeMinutes": "97"
    },
    "2018_27": {
        "plotSummary": "The story continues with Wuba after he parts way with his human parents Tian and Lan for his own journey. Peace has not been restored in the monster world after the death of the evil monster king.",
        "runtimeMinutes": "110"
    },
    "2018_270": {
        "plotSummary": "Halla becomes a determined environmental activist, but this threatens a long-held hope of hers.",
        "runtimeMinutes": "101"
    },
    "2018_271": {
        "plotSummary": "When Michael Kingley, a successful retired businessman starts to see images from his past that he can't explain, he's forced to remember his childhood and how, as a boy, he rescued and raised an extraordinary orphaned pelican, Mr Percival.",
        "runtimeMinutes": "99"
    },
    "2018_272": {
        "plotSummary": "On the rocky path to sobriety after a life-changing accident, John Callahan discovers the healing power of art, willing his injured hands into drawing hilarious, often controversial cartoons, which bring him a new lease on life.",
        "runtimeMinutes": "114"
    },
    "2018_273": {
        "plotSummary": "Skeptical professor Phillip Goodman embarks on a trip to the terrifying after being given a file with details of three unexplained cases of apparitions. Read more: Synopsis",
        "runtimeMinutes": "98"
    },
    "2018_274": {
        "plotSummary": "A shy and insecure delivery truck driver accidentally arrives on the scene of a major crime and picks up two bags of cash and hides them. Only the help of a prostitute and a former biker released from jail might get him out of trouble.",
        "runtimeMinutes": "127"
    },
    "2018_275": {
        "plotSummary": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000.",
        "runtimeMinutes": "149"
    },
    "2018_276": {
        "plotSummary": "Four young men mistake their lives for a movie and attempt one of the most audacious heists in U.S. history.",
        "runtimeMinutes": "116"
    },
    "2018_277": {
        "plotSummary": "A fourth-grader, Aoyama-kun, investigates the mysterious reason behind the sudden appearance of penguins in his village, which is somehow related to a power from a young woman working at a dental clinic.",
        "runtimeMinutes": "117"
    },
    "2018_278": {
        "plotSummary": "One of the most celebrated war correspondents of our time, Marie Colvin is an utterly fearless and rebellious spirit, driven to the frontline of conflicts across the globe to give voice to the voiceless.",
        "runtimeMinutes": "110"
    },
    "2018_279": {
        "plotSummary": "A minister of a small congregation in upstate New York grapples with mounting despair brought on by tragedy, worldly concerns and a tormented past.",
        "runtimeMinutes": "113"
    },
    "2018_28": {
        "plotSummary": "Feature adaptation of Beatrix Potter's classic tale of a rebellious rabbit trying to sneak into a farmer's vegetable garden.",
        "runtimeMinutes": "95"
    },
    "2018_280": {
        "plotSummary": "A broken marriage leads to a bitter custody battle with an embattled son at the centre.",
        "runtimeMinutes": "93"
    },
    "2018_281": {
        "plotSummary": "A man dumps a girl's body in a lake after accidentally killing her with his car on a dark and foggy night. Her enraged father soon hatches an elaborate plan to find the perpetrator and take revenge.",
        "runtimeMinutes": "123"
    },
    "2018_282": {
        "plotSummary": "A movie about the crimes and trial of Kermit Gosnell, an American doctor and abortion provider who was convicted of killing three fetuses and the involuntary manslaughter of a woman who died during a procedure.",
        "runtimeMinutes": "93"
    },
    "2018_283": {
        "plotSummary": "Set in the Parisian publishing world, an editor and an author find themselves in over their heads, as they cope with a middle-age crisis, the changing industry and their wives.",
        "runtimeMinutes": "108"
    },
    "2018_284": {
        "plotSummary": "The extraordinary true story of Army Chaplain Darren Turner and his wife Heather. When war etches battle scars on their hearts, they face one more battle: the fight to save their marriage. One marriage, one family, under God.",
        "runtimeMinutes": "119"
    },
    "2018_285": {
        "plotSummary": "A journalist is sent by the Vatican to investigate a young girl claiming to be visited by the Virgin Mary.",
        "runtimeMinutes": "144"
    },
    "2018_286": {
        "plotSummary": "Collective screening of the Academy Award nominated short films from the Live Action category for 2018.",
        "runtimeMinutes": "96"
    },
    "2018_287": {
        "plotSummary": "A spectacular sled race through the village. Frankie-Four-Eyes and his team, including Sophie as the driver, take on the newcomers: the mysterious and conceited Zac and his athletic cousin Charly. The fantastic sled designed by Frankie ...See moreA spectacular sled race through the village. Frankie-Four-Eyes and his team, including Sophie as the driver, take on the newcomers: the mysterious and conceited Zac and his athletic cousin Charly. The fantastic sled designed by Frankie disintegrates right before crossing the finish line. It is a bitter loss for Frankie who refuses to accept that he might have made some building mistakes. Together with his friends, he manages to prove that Zac cheated during the race. Frankie demands a rematch; which Zac accepts on condition that Frankie build an entirely new race track. Frankie and his friends build a spectacular race track. Zac realizes he is up against a worthy opponent so he raises the stakes even more by cornering Frankie into betting the barn. As the two teams prepare for race day, Zac has no scruples about cheating even more to weight the outcome of the race in his favor. But Frankie and his team have a few surprises of their own in store for him.See less",
        "runtimeMinutes": "89"
    },
    "2018_288": {
        "plotSummary": "Singer tries to save her artist-boyfriend from the consequences of his politics, with tragic results.",
        "runtimeMinutes": "150"
    },
    "2018_289": {
        "plotSummary": "After suffering a near fatal head injury, a young cowboy undertakes a search for new identity and what it means to be a man in the heartland of America.",
        "runtimeMinutes": "104"
    },
    "2018_29": {
        "plotSummary": "A few decades after her original visit, Mary Poppins, the magical nanny, returns to help the Banks siblings and Michael's children through a difficult time in their lives.",
        "runtimeMinutes": "130"
    },
    "2018_290": {
        "plotSummary": "Sarah is a young woman whose life is in a bit of a mess. The last thing she needs is someone else to look after. Yet, like it or not, her Grandmother has bequeathed her a very spoiled pug - Patrick. Surely she must have had her reasons?.",
        "runtimeMinutes": "94"
    },
    "2018_291": {
        "plotSummary": "Based on Ian McEwan's novel. In 1962 England, a young couple find their idyllic romance colliding with issues of sexual freedom and societal pressure, leading to an awkward and fateful wedding night.",
        "runtimeMinutes": "110"
    },
    "2018_292": {
        "plotSummary": "After developing an interest in surfing, a teenage boy and his friend forge an unlikely friendship with an older surfer.",
        "runtimeMinutes": "115"
    },
    "2018_293": {
        "plotSummary": "A teenage boy must deal with his mother's complicated response after his father temporarily abandons them to take a menial and dangerous job.",
        "runtimeMinutes": "105"
    },
    "2018_294": {
        "plotSummary": "Bharat, an young graduate, becomes the C.M of Andhra Pradesh (pre-div) after his father demise without any political knowledge, faces challenges in the process of reform the society.",
        "runtimeMinutes": "173"
    },
    "2018_295": {
        "plotSummary": "In 1987, U.S. Senator Gary Hart's presidential campaign is derailed when he's caught in a scandalous love affair.",
        "runtimeMinutes": "113"
    },
    "2018_296": {
        "plotSummary": "Two upper-class teenage girls in suburban Connecticut rekindle their unlikely friendship after years of growing apart. Together, they hatch a plan to solve both of their problems-no matter what the cost.",
        "runtimeMinutes": "92"
    },
    "2018_297": {
        "plotSummary": "Dames Judi Dench, Eileen Atkins, Joan Plowright, and Maggie Smith get together for tea to reminisce and discuss their acting careers.",
        "runtimeMinutes": "84"
    },
    "2018_298": {
        "plotSummary": "This is more than a documentary. It's a film packed with tools to help you discover the best version of yourself. Mama of four, CCO/founder of The Hollis Company and The Chic Site, Rachel Hollis has been called \"Tina Fey meets Tony Robbins...See moreThis is more than a documentary. It's a film packed with tools to help you discover the best version of yourself. Mama of four, CCO/founder of The Hollis Company and The Chic Site, Rachel Hollis has been called \"Tina Fey meets Tony Robbins for women\" and is taking audiences on an inside look at chasing the biggest of dreams.See less",
        "runtimeMinutes": "120"
    },
    "2018_299": {
        "plotSummary": "Marguerite must navigate through the hardships of the Liberation after losing her husband and starting a relationship with the enemy during the War.",
        "runtimeMinutes": "127"
    },
    "2018_3": {
        "plotSummary": "When the island's dormant volcano begins roaring to life, Owen and Claire mount a campaign to rescue the remaining dinosaurs from this extinction-level event.",
        "runtimeMinutes": "128"
    },
    "2018_30": {
        "plotSummary": "In a post-apocalyptic world, a family is forced to live in silence while hiding from monsters with ultra-sensitive hearing.",
        "runtimeMinutes": "90"
    },
    "2018_301": {
        "plotSummary": "While grieving the loss of her husband, a financially struggling widow meets a race car driver.",
        "runtimeMinutes": "111"
    },
    "2018_302": {
        "plotSummary": "A family fight to survive as the streets of Paris fill with a deadly gas.",
        "runtimeMinutes": "89"
    },
    "2018_303": {
        "plotSummary": "The life and career of fashion designer Lee Alexander McQueen: from his start as a tailor, to launching and overseeing his eponymous line and his untimely death.",
        "runtimeMinutes": "111"
    },
    "2018_304": {
        "plotSummary": "83 year old Edie believes that it is never too late - packing an old camping bag, leaving her life behind and embarking on an adventure she never got to have - climbing the imposing Mount Suilven in Scotland.",
        "runtimeMinutes": "102"
    },
    "2018_305": {
        "plotSummary": "A group of wealthy boys in Los Angeles during the early 1980s establish a 'get-rich-quick' scam that turns deadly.",
        "runtimeMinutes": "108"
    },
    "2018_306": {
        "plotSummary": "The untold story of the last days in the tragic times of Oscar Wilde, a person who observes his own failure with ironic distance and regards the difficulties that beset his life with detachment and humor.",
        "runtimeMinutes": "105"
    },
    "2018_307": {
        "plotSummary": "A young reporter and his niece discover a beautiful and enchanting creature they believe to be the real little mermaid.",
        "runtimeMinutes": "85"
    },
    "2018_308": {
        "plotSummary": "A young Leonardo Da Vinci helps his friend Lisa to recover her house after it was destroyed by a fire looking for a fabulous treasure.",
        "runtimeMinutes": "85"
    },
    "2018_309": {
        "plotSummary": "After a malicious data hack exposes the secrets of the perpetually American town of Salem, chaos descends and four girls must fight to survive, while coping with the hack themselves. Read more: Synopsis",
        "runtimeMinutes": "108"
    },
    "2018_31": {
        "plotSummary": "A working-class Italian-American bouncer becomes the driver of an African-American classical pianist on a tour of venues through the 1960s American South.",
        "runtimeMinutes": "130"
    },
    "2018_311": {
        "plotSummary": "During the marijuana bonanza, a violent decade that saw the origins of drug trafficking in Colombia, Rapayet and his indigenous family get involved in a war to control the business that ends up destroying their lives and their culture.",
        "runtimeMinutes": "125"
    },
    "2018_312": {
        "plotSummary": "The intertwining fates of the historical figures, the men and the women of the 1789 French revolution, as they meet at the newly established Assemblee Nationale.",
        "runtimeMinutes": "121"
    },
    "2018_313": {
        "plotSummary": "A teenager gets a summer job working for a horse trainer and befriends the fading racehorse, Lean on Pete.",
        "runtimeMinutes": "121"
    },
    "2018_314": {
        "plotSummary": "In 2001, Afghanistan is under the control of the Taliban. When her father is captured, a determined young girl disguises herself as a boy in order to provide for her family.",
        "runtimeMinutes": "94"
    },
    "2018_315": {
        "plotSummary": "A father and daughter form an unlikely songwriting duo in the summer before she leaves for college.",
        "runtimeMinutes": "97"
    },
    "2018_316": {
        "plotSummary": "Toby, a disillusioned film director, is pulled into a world of time-jumping fantasy when a Spanish cobbler believes himself to be Sancho Panza. He gradually becomes unable to tell dreams from reality.",
        "runtimeMinutes": "132"
    },
    "2018_317": {
        "plotSummary": "Ricardo recounts the adventures of his 21 year old self, when he went to Italy following love.",
        "runtimeMinutes": "141"
    },
    "2018_318": {
        "plotSummary": "Agnes, taken for granted as a suburban mother, discovers a passion for solving jigsaw puzzles which unexpectedly draws her into a new world - where her life unfolds in ways she could never have imagined.",
        "runtimeMinutes": "103"
    },
    "2018_319": {
        "plotSummary": "An up-and-coming journalist finds his world and faith increasingly challenged when he's granted the interview of a lifetime - with someone who claims to be God.",
        "runtimeMinutes": "97"
    },
    "2018_32": {
        "plotSummary": "A security expert must infiltrate a burning skyscraper, 225 stories above ground, when his family is trapped inside by criminals.",
        "runtimeMinutes": "102"
    },
    "2018_320": {
        "plotSummary": "After promising 1100 employees that they would protect their jobs, the managers of a factory decide to suddenly close up shop. Laurent takes the lead in a fight against this decision.",
        "runtimeMinutes": "113"
    },
    "2018_321": {
        "plotSummary": "When Blitzen announces his retirement on December 21st, a miniature horse has 3 days to fulfill his lifelong dream of earning a spot on Santa's team at the North Pole try-outs.",
        "runtimeMinutes": "89"
    },
    "2018_322": {
        "plotSummary": "Three actresses at different stages of their career. One from before the 1979 Islamic Revolution, one popular star of today known throughout the country and a young girl longing to attend a drama conservatory.",
        "runtimeMinutes": "100"
    },
    "2018_323": {
        "plotSummary": "A customs officer who can smell fear develops an unusual attraction to a strange traveler while aiding a police investigation which will call into question her entire existence.",
        "runtimeMinutes": "110"
    },
    "2018_324": {
        "plotSummary": "Four girls on their way to find true love discover that friendship this strong has its consequences.",
        "runtimeMinutes": "135"
    },
    "2018_325": {
        "plotSummary": "A father and his daughter struggle to survive in deep space where they live in isolation.",
        "runtimeMinutes": "113"
    },
    "2018_326": {
        "plotSummary": "Follows the life of Native Canadian Saul Indian Horse as he survives residential school and life amongst the racism of the 1970s. A talented hockey player, Saul must find his own path as he battles stereotypes and alcoholism.",
        "runtimeMinutes": "101"
    },
    "2018_327": {
        "plotSummary": "Life and facts of Mary Wollstonecraft Godwin, who at 16 met 21 year old poet Percy Shelley, resulting in the writing of Frankenstein.",
        "runtimeMinutes": "120"
    },
    "2018_328": {
        "plotSummary": "Set in Ireland during the Great Famine, the drama follows an Irish Ranger who has been fighting for the British Army abroad, as he abandons his post to reunite with his family.",
        "runtimeMinutes": "100"
    },
    "2018_329": {
        "plotSummary": "Sam, a disenchanted young man, finds a mysterious woman swimming in his apartment's pool one night. The next morning, she disappears. Sam sets off across LA to find her, and along the way he uncovers a conspiracy far more bizarre.",
        "runtimeMinutes": "139"
    },
    "2018_33": {
        "plotSummary": "Debbie Ocean gathers an all-female crew to attempt an impossible heist at New York City's yearly Met Gala.",
        "runtimeMinutes": "110"
    },
    "2018_330": {
        "plotSummary": "A fearless income tax officer raids the mansion of the most powerful man in Lucknow after someone mysteriously draws his attention towards the evidence.",
        "runtimeMinutes": "122"
    },
    "2018_331": {
        "plotSummary": "French dancers gather in a remote, empty school building to rehearse on a wintry night. The all-night celebration morphs into a hallucinatory nightmare when they learn their sangria is laced with LSD.",
        "runtimeMinutes": "97"
    },
    "2018_332": {
        "plotSummary": "The story of the 1819 Peterloo Massacre where British forces attacked a peaceful pro-democracy rally in Manchester.",
        "runtimeMinutes": "154"
    },
    "2018_333": {
        "plotSummary": "",
        "runtimeMinutes": "205"
    },
    "2018_334": {
        "plotSummary": "Escaping war, a young girl finds a lone surviving infant and decides to raise him as her son.",
        "runtimeMinutes": "115"
    },
    "2018_335": {
        "plotSummary": "When Monica finds out her daughter is about to die she takes extreme measures to save her.",
        "runtimeMinutes": "106"
    },
    "2018_336": {
        "plotSummary": "Australian western set on the Northern Territory frontier in the 1920s, where justice itself is put on trial when an aged Aboriginal farmhand shoots a white man in self-defense and goes on the run as a posse gathers to hunt him down. Read more: Synopsis",
        "runtimeMinutes": "113"
    },
    "2018_337": {
        "plotSummary": "Good girl Sandy Olsson and greaser Danny Zuko fell in love over the summer. When they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance?",
        "runtimeMinutes": "110"
    },
    "2018_338": {
        "plotSummary": "After a doctor is called to visit a crumbling manor, strange things begin to occur.",
        "runtimeMinutes": "111"
    },
    "2018_339": {
        "plotSummary": "In the early twentieth century, an aging actress and her lover visit the estate of her elderly brother.",
        "runtimeMinutes": "98"
    },
    "2018_34": {
        "plotSummary": "Jake Pentecost, son of Stacker Pentecost, reunites with Mako Mori to lead a new generation of Jaeger pilots, including rival Lambert and 15-year-old hacker Amara, against a new Kaiju threat.",
        "runtimeMinutes": "111"
    },
    "2018_340": {
        "plotSummary": "He's an unlikely hero, exiled and insecure - until God calls him to free the Israelites. Experience the epic story of MOSES in jaw-dropping scale, brought to life on stage with massive sets, spectacular special effects and live animals.",
        "runtimeMinutes": "130"
    },
    "2018_341": {
        "plotSummary": "",
        "runtimeMinutes": "187"
    },
    "2018_342": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_343": {
        "plotSummary": "A troubled woman living in an isolated community finds herself pulled between the control of her oppressive family and the allure of a secretive outsider suspected of a series of brutal murders.",
        "runtimeMinutes": "107"
    },
    "2018_344": {
        "plotSummary": "A couple's relationship becomes complicated when she leaves him for his best friend, and returns after he dies.",
        "runtimeMinutes": "75"
    },
    "2018_345": {
        "plotSummary": "An unpublished writer returns to his hometown after graduating, where he seeks sponsors to publish his book while dealing with his father's deteriorating indulgence into gambling.",
        "runtimeMinutes": "188"
    },
    "2018_346": {
        "plotSummary": "An Indian couple go to great lengths to move to London, England.",
        "runtimeMinutes": "141"
    },
    "2018_347": {
        "plotSummary": "Jacques is an older writer from Paris. Arthur is a young student in Rennes. They instantly fall in love. But they'll have to face rejection and sickness to keep it that way.",
        "runtimeMinutes": "132"
    },
    "2018_348": {
        "plotSummary": "Set ten years after an apocalyptic event that killed millions and left the world inhabited by ghosts.",
        "runtimeMinutes": "98"
    },
    "2018_349": {
        "plotSummary": "",
        "runtimeMinutes": "225"
    },
    "2018_35": {
        "plotSummary": "Young hero Thomas embarks on a mission to find a cure for a deadly disease known as \"The Flare\".",
        "runtimeMinutes": "143"
    },
    "2018_350": {
        "plotSummary": "British crime drama film directed by Idris Elba based on the novel of the same name by Jamaican-born writer Victor Headley.",
        "runtimeMinutes": "101"
    },
    "2018_351": {
        "plotSummary": "Three stories are connected by a Memphis hotel and the spirit of Elvis Presley.",
        "runtimeMinutes": "110"
    },
    "2018_352": {
        "plotSummary": "The enchanted lives of a couple in a secluded forest are brutally shattered by a nightmarish hippie cult and their demon-biker henchmen, propelling a man into a spiraling, surreal rampage of vengeance.",
        "runtimeMinutes": "121"
    },
    "2018_353": {
        "plotSummary": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
        "runtimeMinutes": "134"
    },
    "2018_354": {
        "plotSummary": "In 1993, a teenage girl is forced into a gay conversion therapy center by her conservative guardians. Read more: Synopsis",
        "runtimeMinutes": "91"
    },
    "2018_355": {
        "plotSummary": "In an unbelievable story of perseverance, free climber Tommy Caldwell and climbing partner Kevin Jorgeson attempt to scale the impossible 3000ft Dawn Wall of El Capitan.",
        "runtimeMinutes": "100"
    },
    "2018_356": {
        "plotSummary": "An unusual set of circumstances brings unexpected success to a pop star.",
        "runtimeMinutes": "114"
    },
    "2018_357": {
        "plotSummary": "The royal saga of deceit, conspiracy, greed and lust continues in the third installment of the series, as the Saheb and Biwi are pitted against an enemy and everyone involved is scheming ruthlessly for their own personal gain.",
        "runtimeMinutes": "140"
    },
    "2018_358": {
        "plotSummary": "A detective fantasy / family drama where a love of words helps a father reconnect with a missing son.",
        "runtimeMinutes": "91"
    },
    "2018_359": {
        "plotSummary": "A man who is suffering a mid-life crisis finds new meaning in his life as part of an all-male, middle-aged, amateur synchronised swimming team.",
        "runtimeMinutes": "96"
    },
    "2018_36": {
        "plotSummary": "Lara Croft (Alicia Vikander), the fiercely independent daughter of a missing adventurer, must push herself beyond her limits when she discovers the island where her father, Lord Richard Croft (Dominic West) disappeared.",
        "runtimeMinutes": "119"
    },
    "2018_360": {
        "plotSummary": "A young couple must navigate a blossoming romance, amidst a war between their families' competing pizza restaurants.",
        "runtimeMinutes": "102"
    },
    "2018_361": {
        "plotSummary": "A troubled family must face the facts when something goes terribly wrong at their son's desolate military post.",
        "runtimeMinutes": "113"
    },
    "2018_362": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_363": {
        "plotSummary": "Two men enter a bet with intriguer Alfonso that their women will stay true, but disguise themselves, switch partners, and regretfully seduce their targets.",
        "runtimeMinutes": null
    },
    "2018_364": {
        "plotSummary": "A German pastry maker travels to Jerusalem in search of the wife and son of his dead lover.",
        "runtimeMinutes": "113"
    },
    "2018_365": {
        "plotSummary": "In the middle of dealing with multiple crisis, washed-out film director Tin Lik-hang must take care of his dementia-ridden father. Suddenly, his father starts to age backwards rapidly and is eventually the same age as his son.",
        "runtimeMinutes": "100"
    },
    "2018_366": {
        "plotSummary": "The Beatles agree to accompany Captain Fred in his yellow submarine and go to Pepperland to free it from the music-hating Blue Meanies.",
        "runtimeMinutes": "90"
    },
    "2018_367": {
        "plotSummary": "As three fathers fight to save their families, their lives become intertwined in an unlikely journey across the globe, where they learn the healing power of forgiveness and reconciliation.",
        "runtimeMinutes": "108"
    },
    "2018_368": {
        "plotSummary": "Gauthier, a young journalist, learns through his mother that he's the illegitimate son of Guy Jamet, an aging French pop singer who was famous from the '60s to the '90s. As the old-time crooner embarks on a tour to promote his newly ...See moreGauthier, a young journalist, learns through his mother that he's the illegitimate son of Guy Jamet, an aging French pop singer who was famous from the '60s to the '90s. As the old-time crooner embarks on a tour to promote his newly released cover album, Gauthier decides to follow him behind the scenes, on stage, and on the road, under the pretext of filming a documentary about his career.See less",
        "runtimeMinutes": "101"
    },
    "2018_369": {
        "plotSummary": "In the last moments of World War II, a young German soldier fighting for survival finds a Nazi captain's uniform. Impersonating an officer, the man quickly takes on the monstrous identity of the perpetrators he's escaping from.",
        "runtimeMinutes": "118"
    },
    "2018_37": {
        "plotSummary": "Laurie Strode confronts her long-time foe Michael Myers, the masked figure who has haunted her since she narrowly escaped his killing spree on Halloween night four decades ago.",
        "runtimeMinutes": "106"
    },
    "2018_370": {
        "plotSummary": "",
        "runtimeMinutes": "200"
    },
    "2018_371": {
        "plotSummary": "A young woman and her beloved have other marital obligations arranged by their fathers.",
        "runtimeMinutes": null
    },
    "2018_372": {
        "plotSummary": "Two aging fathers - one a King, one his courtier - reject the children who truly love them. Their blindness unleashes a tornado of pitiless ambition and treachery, and their worlds crumble.",
        "runtimeMinutes": "227"
    },
    "2018_373": {
        "plotSummary": "A year in the life of a middle-class family's maid in Mexico City in the early 1970s.",
        "runtimeMinutes": "135"
    },
    "2018_374": {
        "plotSummary": "Maria, an alienated high-school student, has her life turned upside down when she switches places with her sinister mirror image.",
        "runtimeMinutes": "103"
    },
    "2018_375": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_376": {
        "plotSummary": "A young girl grows up to become a strong and fearless woman in Budapest before World War I.",
        "runtimeMinutes": "142"
    },
    "2018_377": {
        "plotSummary": "On another planet in the distant past, a Gelfling embarks on a quest to find the missing shard of a magical crystal, and so restore order to his world.",
        "runtimeMinutes": "93"
    },
    "2018_378": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_379": {
        "plotSummary": "A love triangle between a spirited young woman, her outgoing boyfriend and a fiance who's husband material.",
        "runtimeMinutes": "156"
    },
    "2018_38": {
        "plotSummary": "This contemporary romantic comedy, based on a global bestseller, follows native New Yorker Rachel Chu to Singapore to meet her boyfriend's family.",
        "runtimeMinutes": "120"
    },
    "2018_380": {
        "plotSummary": "A man attempting to escape occupied France falls in love with the wife of a dead author whose identity he has assumed.",
        "runtimeMinutes": "101"
    },
    "2018_381": {
        "plotSummary": "After making movies for many years, Elvis Presley makes a comeback tour in 1968.",
        "runtimeMinutes": "60"
    },
    "2018_382": {
        "plotSummary": "Caesar and his assassins are dead. General Mark Antony now rules alongside his fellow defenders of Rome. But at the fringes of a war-torn empire the Egyptian Queen Cleopatra and Mark Antony have fallen fiercely in love.",
        "runtimeMinutes": "220"
    },
    "2018_383": {
        "plotSummary": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "runtimeMinutes": "195"
    },
    "2018_384": {
        "plotSummary": "Set in a dugout in Aisne in 1918, it is the story of a group of British officers, led by the mentally disintegrating young officer Stanhope, as they await their fate.",
        "runtimeMinutes": "107"
    },
    "2018_385": {
        "plotSummary": "A portrait of genius music composer Ryuichi Sakamoto.",
        "runtimeMinutes": "100"
    },
    "2018_386": {
        "plotSummary": "The true story of an English boxer incarcerated in one of Thailand's most notorious prisons as he fights in Muay Thai tournaments to earn his freedom.",
        "runtimeMinutes": "116"
    },
    "2018_387": {
        "plotSummary": "As kids, they escaped a UFO death cult. Now, two adult brothers seek answers after an old videotape surfaces and brings them back to where they began.",
        "runtimeMinutes": "111"
    },
    "2018_388": {
        "plotSummary": "A former major league baseball player, Moe Berg, goes undercover in World War II Europe for the Office of Strategic Services.",
        "runtimeMinutes": "98"
    },
    "2018_389": {
        "plotSummary": "Biopic of Swedish writer Astrid Lindgren, the author of numerous children's books and creator of Pippi Longstocking.",
        "runtimeMinutes": "123"
    },
    "2018_39": {
        "plotSummary": "Under the tutelage of Rocky Balboa, newly crowned heavyweight champion Adonis Creed faces off against Viktor Drago, the son of Ivan Drago.",
        "runtimeMinutes": "130"
    },
    "2018_390": {
        "plotSummary": "Never take your mistress on an annual guys' getaway, especially one devoted to hunting - a violent lesson for three wealthy married men.",
        "runtimeMinutes": "108"
    },
    "2018_391": {
        "plotSummary": "A successful song-and-dance team become romantically involved with a sister act and team up to save the failing Vermont inn of their former commanding general.",
        "runtimeMinutes": "120"
    },
    "2018_392": {
        "plotSummary": "When conflict, rebellion and resentment overwhelm their family, Charlie and Alice are forced to change their parenting strategy, and are surprised to find effective, life-long solutions were closer than they imagined.",
        "runtimeMinutes": "100"
    },
    "2018_393": {
        "plotSummary": "In a social media-centered world, the smart phone has become a cultural rite of passage for kids. But is that rite all wrong? How can this generation of parents blaze a new trail to equip their kids to thrive in an ever-changing digital ...See moreIn a social media-centered world, the smart phone has become a cultural rite of passage for kids. But is that rite all wrong? How can this generation of parents blaze a new trail to equip their kids to thrive in an ever-changing digital environment while steering clear of the dangers that lurk nearby?See less",
        "runtimeMinutes": "70"
    },
    "2018_394": {
        "plotSummary": "A family curse confines orphaned twins Rachel and Edwards to their home, in punishment for their ancestors' sins. Bound to the rules of a haunting childhood lullaby, the twins must never let any outsiders inside the house.",
        "runtimeMinutes": "92"
    },
    "2018_395": {
        "plotSummary": "The life of a foster family in South Central Los Angeles, a few weeks before the city erupts in violence following the verdict of the Rodney King trial.",
        "runtimeMinutes": "86"
    },
    "2018_396": {
        "plotSummary": "Serial office-safe thief is finally caught by her latest boss, who then blackmails her into marriage. The psychological underpinnings for her thievery and her rejection of men are revealed.",
        "runtimeMinutes": "150"
    },
    "2018_397": {
        "plotSummary": "A psychological thriller based on the infamous 1892 murders of Lizzie Andrew Borden's family.",
        "runtimeMinutes": "105"
    },
    "2018_398": {
        "plotSummary": "1945: The boys are back. With American soldiers returning home, singer-songwriter Private First Class Donny Novitski dreams of rebuilding his life, forgetting his demons, and for everything to be just like it was before. When the NBC ...See more1945: The boys are back. With American soldiers returning home, singer-songwriter Private First Class Donny Novitski dreams of rebuilding his life, forgetting his demons, and for everything to be just like it was before. When the NBC announces a national competition, a 'Tribute To The Troops', Donny joins forces with a motley group of musicians, and together they form a band unlike any the nation has ever seen; a band of veterans. On their journey, they fight to have their voices heard, struggle to trust each other, and together have to make a sacrifice that could end it all. After everything they have been through, can they truly be welcomed home?  Written by chelseamaySee less",
        "runtimeMinutes": "130"
    },
    "2018_399": {
        "plotSummary": "Chela and Chiquita are both descended from wealthy families in Asunción and have been together for over 30 years. But recently, their financial situation has worsened and they begin selling off their inherited possessions. But when their ...See moreChela and Chiquita are both descended from wealthy families in Asunción and have been together for over 30 years. But recently, their financial situation has worsened and they begin selling off their inherited possessions. But when their debts lead to Chiquita being imprisoned on fraud charges, Chela is forced to face a new reality. Driving for the first time in years, she begins to provide a local taxi service to a group of elderly wealthy ladies. As Chela settles into her new life, she encounters the much younger Angy, forging a fresh and invigorating new connection. Chela finally begins to break out of her shell and engage with the world, embarking on her own personal, intimate revolution.See less",
        "runtimeMinutes": "98"
    },
    "2018_4": {
        "plotSummary": "The Incredibles family takes on a new mission which involves a change in family roles: Bob Parr (Mr. Incredible) must manage the house while his wife Helen (Elastigirl) goes out to save the world.",
        "runtimeMinutes": "118"
    },
    "2018_40": {
        "plotSummary": "A Yeti is convinced that the elusive creatures known as \"humans\" really do exist.",
        "runtimeMinutes": "96"
    },
    "2018_400": {
        "plotSummary": "Mrs. Gequil is a teacher despised by her colleagues and students. On a stormy night, she is struck by lightning and faints. When she wakes up, she feels different. Will she be able to keep the powerful and dangerous Mrs. Hyde contained?",
        "runtimeMinutes": "95"
    },
    "2018_401": {
        "plotSummary": "While Joseph Goebbels infamously declared Berlin \"free of Jews\" in 1943, 1,700 managed to survive in the Nazi capital through the end of WWII. The Invisibles traces the stories of four young people who learned to hide in plain sight.",
        "runtimeMinutes": "110"
    },
    "2018_402": {
        "plotSummary": "Pick of the Litter follows a litter of puppies from the moment they're born and begin their quest to become Guide Dogs for the Blind, the ultimate canine career. Cameras follow these pups through a two-year odyssey as they train to become ...See morePick of the Litter follows a litter of puppies from the moment they're born and begin their quest to become Guide Dogs for the Blind, the ultimate canine career. Cameras follow these pups through a two-year odyssey as they train to become dogs whose ultimate responsibility is to protect their blind partners from harm. Along the way, the dogs meet a community of dedicated individuals who train them to do amazing, life-changing things in the service of their human. The stakes are high and not every dog can make the cut. Only the best of the best. The pick of the litter.See less",
        "runtimeMinutes": "80"
    },
    "2018_403": {
        "plotSummary": "In 1985, a group of criminals mock the security of the National Museum of Anthropology in Mexico City to extract 140 pre-Hispanic pieces from their showcases.",
        "runtimeMinutes": "128"
    },
    "2018_404": {
        "plotSummary": "Laura and her son Henry are forced to drive her estranged, pot-dealing, carefree father Jack cross country after being kicked out of a nursing home.",
        "runtimeMinutes": "104"
    },
    "2018_405": {
        "plotSummary": "A young man who is curious about his deceased parents' past takes a food journey to Singapore where he uncovers more than just delicious meals.",
        "runtimeMinutes": "89"
    },
    "2018_406": {
        "plotSummary": "On Christmas Eve, a young boy embarks on a magical adventure to the North Pole on the Polar Express, while learning about friendship, bravery, and the spirit of Christmas.",
        "runtimeMinutes": "100"
    },
    "2018_407": {
        "plotSummary": "An illustrious British boarding school becomes a bloody battleground when a mysterious sinkhole appears at a nearby fracking site unleashing unspeakable horror.",
        "runtimeMinutes": "104"
    },
    "2018_408": {
        "plotSummary": "Mizore Yoroizuka and Nozomi Kasaki are a pair of best friends in their final year of high school. They're both obsessed with the school's brass band club. With Mizore on the oboe and Nozomi on the flute, they spend their days in happiness,...See moreMizore Yoroizuka and Nozomi Kasaki are a pair of best friends in their final year of high school. They're both obsessed with the school's brass band club. With Mizore on the oboe and Nozomi on the flute, they spend their days in happiness, until the club begins to practice songs inspired by the fairy tale Liz und ein Blauer Vogel - \"Liz and the Blue Bird\". Immersed in this story, Mizore and Nozomi begin to realize that there may be no such thing as being together forever.  Written by animenewsnetworkSee less",
        "runtimeMinutes": "90"
    },
    "2018_409": {
        "plotSummary": "Artist Yayoi Kusama and experts discuss her life and work, from her modest beginnings in Japan to becoming an internationally renowned artist.",
        "runtimeMinutes": "76"
    },
    "2018_41": {
        "plotSummary": "A cataclysmic event causes a man, who dreams of winning the lottery, to become stranded on an island with his co-workers.",
        "runtimeMinutes": "134"
    },
    "2018_410": {
        "plotSummary": "After their first fight ended in a controversial split decision draw, Canelo Alvarez and Gennady Golovkin meet for a second time with the WBA Super Middleweight and WBC and IBO Middleweight Titles on the line.",
        "runtimeMinutes": null
    },
    "2018_411": {
        "plotSummary": "A look at the life, work and religious heritage of violinist Itzhak Perlman.",
        "runtimeMinutes": "82"
    },
    "2018_412": {
        "plotSummary": "A reimagining of the life and times of Blaze Foley, the unsung songwriting legend of the Texas Outlaw Music movement.",
        "runtimeMinutes": "129"
    },
    "2018_413": {
        "plotSummary": "It's time for the Festival of the Bells, but the holiday has lost its meaning for Gobo.",
        "runtimeMinutes": "25"
    },
    "2018_414": {
        "plotSummary": "Christian begins to work as a shelf stacker at a supermarket and finds himself in a new, unknown world: the long aisles, the bustle at the checkouts, the forklifts.",
        "runtimeMinutes": "125"
    },
    "2018_415": {
        "plotSummary": "When Mary Colbert hears Mark's message she feels called to start a national prayer movement across the nation for the leadership of America and a return to the godly principles they were founded upon.",
        "runtimeMinutes": "120"
    },
    "2018_416": {
        "plotSummary": "A zombie apocalypse threatens the sleepy town of Little Haven - at Christmas - forcing Anna and her friends to fight, slash and sing their way to survival, facing the undead in a desperate race to reach their loved ones. But they soon ...See moreA zombie apocalypse threatens the sleepy town of Little Haven - at Christmas - forcing Anna and her friends to fight, slash and sing their way to survival, facing the undead in a desperate race to reach their loved ones. But they soon discover that no one is safe in this new world, and with civilization falling apart around them, the only people they can truly rely on are each other.See less",
        "runtimeMinutes": "93"
    },
    "2018_417": {
        "plotSummary": "Vegeta is lured to the planet New Vegeta by a group of Saiyan survivors in hopes that he will be the king of their new planet. But when he finds that they have ulterior motives of universal domination, he and the Z Warriors must fight ...See moreVegeta is lured to the planet New Vegeta by a group of Saiyan survivors in hopes that he will be the king of their new planet. But when he finds that they have ulterior motives of universal domination, he and the Z Warriors must fight Broly, the legendary Super Saiyan.  Written by page8701See less",
        "runtimeMinutes": "72"
    },
    "2018_418": {
        "plotSummary": "A five-year-old boy develops a relationship with Ponyo, a young goldfish princess who longs to become a human after falling in love with him.",
        "runtimeMinutes": "101"
    },
    "2018_419": {
        "plotSummary": "The life of three friends takes a tragic turn due to an inflated electricity bill, which leads to a courtroom drama and social awakening.",
        "runtimeMinutes": "161"
    },
    "2018_42": {
        "plotSummary": "A working-class family man, Christopher Robin, encounters his childhood friend Winnie-the-Pooh, who helps him to rediscover the joys of life.",
        "runtimeMinutes": "104"
    },
    "2018_420": {
        "plotSummary": "In her own words, comedienne Gilda Radner looks back and reflects on her life and career. Weaving together recently discovered audiotapes, interviews with her friends, rare home movies and diaries read by modern day comediennes (including ...See moreIn her own words, comedienne Gilda Radner looks back and reflects on her life and career. Weaving together recently discovered audiotapes, interviews with her friends, rare home movies and diaries read by modern day comediennes (including Amy Poehler), LOVE Gilda offers a unique window into the honest and whimsical world of a beloved performer whose greatest role was sharing her story.  Written by Director Lisa DapolitoSee less",
        "runtimeMinutes": "88"
    },
    "2018_421": {
        "plotSummary": "A woman leaves an Austrian convent to become a governess to the children of a Naval officer widower.",
        "runtimeMinutes": "172"
    },
    "2018_422": {
        "plotSummary": "An NYPD officer tries to save his wife and several others taken hostage by German terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles.",
        "runtimeMinutes": "132"
    },
    "2018_423": {
        "plotSummary": "Two opposing factions of transforming alien robots engage in a battle that has the fate of Earth in the balance.",
        "runtimeMinutes": "30"
    },
    "2018_424": {
        "plotSummary": "The affaire of a married Palestinian man and a married Israeli woman in Jerusalem takes a dangerous political dimension when they are spotted in the wrong place at the wrong time, leaving them to deal with more than their broken marriages.",
        "runtimeMinutes": "127"
    },
    "2018_425": {
        "plotSummary": "The communities join forces in the last stand against the Saviors as all-out war unfolds.",
        "runtimeMinutes": "48"
    },
    "2018_426": {
        "plotSummary": "",
        "runtimeMinutes": "325"
    },
    "2018_427": {
        "plotSummary": "The 8th Annual Grateful Dead Meet-Up At The Movies featuring a screening of the Grateful Dead's July 7, 1989 performance at John F. Kennedy Stadium in Philadelphia.",
        "runtimeMinutes": "180"
    },
    "2018_428": {
        "plotSummary": "A lonely woman living in Tokyo decides to take an English class where she discovers her alter ego, Lucy.",
        "runtimeMinutes": "95"
    },
    "2018_429": {
        "plotSummary": "Jeff \"The Dude\" Lebowski, mistaken for a millionaire of the same name, seeks restitution for his ruined rug and enlists his bowling buddies to help get it.",
        "runtimeMinutes": "117"
    },
    "2018_43": {
        "plotSummary": "Robert McCall serves an unflinching justice for the exploited and oppressed, but how far will he go when that is someone he loves?",
        "runtimeMinutes": "121"
    },
    "2018_430": {
        "plotSummary": "A thousand years ago, one boy with a dream of becoming a great warrior is abducted with his sister and taken to a land far away from home. Thrown into a world where greed and injustice rule all, Bilal finds the courage to raise his voice ...See moreA thousand years ago, one boy with a dream of becoming a great warrior is abducted with his sister and taken to a land far away from home. Thrown into a world where greed and injustice rule all, Bilal finds the courage to raise his voice and make a change. Inspired by true events, this is a story of a real hero who earned his remembrance in time and history.See less",
        "runtimeMinutes": "105"
    },
    "2018_431": {
        "plotSummary": "After helping a cat, a seventeen-year-old girl finds herself involuntarily engaged to a cat Prince in a magical world where her only hope of freedom lies with a dapper cat statuette come to life.",
        "runtimeMinutes": "75"
    },
    "2018_432": {
        "plotSummary": "The spirits of a deceased couple are harassed by an unbearable family that has moved into their home, and hire a malicious spirit to drive them out.",
        "runtimeMinutes": "92"
    },
    "2018_433": {
        "plotSummary": "A young boy and a girl with a magic crystal must race against pirates and foreign agents in a search for a legendary floating castle.",
        "runtimeMinutes": "125"
    },
    "2018_434": {
        "plotSummary": "In Argentina pre-coup d'etat, a successful lawyer starts to feel against the ropes when a secret of the past threatens his present.",
        "runtimeMinutes": "109"
    },
    "2018_435": {
        "plotSummary": "Set in Rajasthan, this love story explores how the protagonists deal with issues like differences between castes and honor killings.",
        "runtimeMinutes": "138"
    },
    "2018_436": {
        "plotSummary": "The cultural revolution that occurred in the 1960s England is explored in this documentary.",
        "runtimeMinutes": "85"
    },
    "2018_437": {
        "plotSummary": "On vacation at a remote lake house, a mother and her two young daughters must fight for survival after falling into a terrifying and bizarre nightmare conceived by a psychopath.",
        "runtimeMinutes": "89"
    },
    "2018_438": {
        "plotSummary": "The tale of Bardock, the father of Goku, and his rebellion against his master the mighty Frieza.",
        "runtimeMinutes": "48"
    },
    "2018_439": {
        "plotSummary": "Two friends and a chirpy teenager take a road trip from Bangalore to Kochi.",
        "runtimeMinutes": "114"
    },
    "2018_44": {
        "plotSummary": "A ninety-year-old horticulturist and Korean War veteran turns drug mule for a Mexican cartel.",
        "runtimeMinutes": "116"
    },
    "2018_440": {
        "plotSummary": "Bridget returns home at her brother's urging to deal with her ailing mother and her father's reluctance to let go of their life together.",
        "runtimeMinutes": "101"
    },
    "2018_441": {
        "plotSummary": "A young boy and his little sister struggle to survive in Japan during World War II.",
        "runtimeMinutes": "89"
    },
    "2018_442": {
        "plotSummary": "In the summer of 1962, a new kid in town is taken under the wing of a young baseball prodigy and his rowdy team, resulting in many adventures.",
        "runtimeMinutes": "101"
    },
    "2018_443": {
        "plotSummary": "An all guts, no glory San Francisco cop becomes determined to find the underworld kingpin that killed the witness in his protection.",
        "runtimeMinutes": "114"
    },
    "2018_444": {
        "plotSummary": "The aftermath of a police killing of a black man, told through the eyes of the bystander who filmed the act, an African-American police officer and a high-school baseball phenom inspired to take a stand.",
        "runtimeMinutes": "96"
    },
    "2018_445": {
        "plotSummary": "A city in southern China and a bag containing a million yuan draw several people from diverse backgrounds with different personal motives into a bloody conflict.",
        "runtimeMinutes": "77"
    },
    "2018_446": {
        "plotSummary": "Clairvoyant femme fatale Nicola Six has been living with a dark premonition of her impending death by murder. She begins a tangled love affair with three uniquely different men: one of whom she knows will be her murderer.",
        "runtimeMinutes": "118"
    },
    "2018_447": {
        "plotSummary": "Drawn from a never-before-seen cache of personal footage spanning decades, this is an intimate portrait of the Sri Lankan artist and musician who continues to shatter conventions.",
        "runtimeMinutes": "96"
    },
    "2018_448": {
        "plotSummary": "A genius teenage boy is in love with a girl who breaks up after a year. He invents a time-machine and tries to fix the break-up repeatedly. He finally goes a year back with his friend/advisor to fix the bad days.",
        "runtimeMinutes": "104"
    },
    "2018_449": {
        "plotSummary": "For seven years a certain boy wizard went to a certain Wizard School and conquered evil. This, however, is not his story. This is the story of the Puffs. . . who just happened to be there too. A tale for anyone who has never been destined ...See moreFor seven years a certain boy wizard went to a certain Wizard School and conquered evil. This, however, is not his story. This is the story of the Puffs. . . who just happened to be there too. A tale for anyone who has never been destined to save the world.  Written by Tilted Windmills TheatricalsSee less",
        "runtimeMinutes": "118"
    },
    "2018_45": {
        "plotSummary": "A young girl is transported into a magical world of gingerbread soldiers and an army of mice.",
        "runtimeMinutes": "99"
    },
    "2018_450": {
        "plotSummary": "In Dark Meat City, a young man develops supernatural powers after an otherwise uneventful scooter accident.",
        "runtimeMinutes": "94"
    },
    "2018_451": {
        "plotSummary": "A portrait of unsung Hollywood legend Scotty Bowers, whose bestselling memoir chronicled his decades spent as sexual procurer to the stars.",
        "runtimeMinutes": "98"
    },
    "2018_452": {
        "plotSummary": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
        "runtimeMinutes": "152"
    },
    "2018_453": {
        "plotSummary": "On a South Pacific island during World War II, love blooms between a young nurse and a secretive Frenchman who's being courted for a dangerous military mission.",
        "runtimeMinutes": "157"
    },
    "2018_454": {
        "plotSummary": "From the segregated American South to the fashion capitals of the world, operatic fashion editor Andre Leon Talley's life and career are on full display, in a poignant portrait that includes appearances by Anna Wintour, Marc Jacobs, Tom ...See moreFrom the segregated American South to the fashion capitals of the world, operatic fashion editor Andre Leon Talley's life and career are on full display, in a poignant portrait that includes appearances by Anna Wintour, Marc Jacobs, Tom Ford, Bethann Hardison, Valentino, and Manolo Blahnik.See less",
        "runtimeMinutes": "93"
    },
    "2018_455": {
        "plotSummary": "Leaning into the Wind follows artist Andy Goldsworthy on his exploration of the world and himself through ephemeral and permanent workings on the landscape, cities and with his own body.",
        "runtimeMinutes": "97"
    },
    "2018_456": {
        "plotSummary": "In 1930s Italy, a veteran World War I pilot is cursed to look like an anthropomorphic pig.",
        "runtimeMinutes": "94"
    },
    "2018_457": {
        "plotSummary": "After discovering he is a human, a man raised as an elf at the North Pole decides to travel to New York City to locate his real father.",
        "runtimeMinutes": "97"
    },
    "2018_458": {
        "plotSummary": "Manny, Joel, and Jonah tear their way through childhood and push against the volatile love of their parents. As Manny and Joel grow into versions of their father and Ma dreams of escape, Jonah embraces an imagined world all on his own.",
        "runtimeMinutes": "94"
    },
    "2018_459": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_46": {
        "plotSummary": "Parapsychologist Dr. Elise Rainier faces her most fearsome and personal haunting yet, as she is drawn back to her ghostly childhood home, where the terror began.",
        "runtimeMinutes": "103"
    },
    "2018_460": {
        "plotSummary": "Violette is old enough to get married when her village in the Lower Alps is cruelly deprived of all its men by the repression that followed the republican uprising of December 1851. For the next two years, the village is completely cut off...See moreViolette is old enough to get married when her village in the Lower Alps is cruelly deprived of all its men by the repression that followed the republican uprising of December 1851. For the next two years, the village is completely cut off. The women swear an oath that if a man should come, he will become their shared husband, so that life may continue to flourish in each of their wombs.  Written by epagkaSee less",
        "runtimeMinutes": "98"
    },
    "2018_461": {
        "plotSummary": "Bipolar disorder and addiction as seen through the life of three-time world champion surfer Andy Irons. The untold story of Andy's life serves to tear down the myths associated with these two ferocious diseases.",
        "runtimeMinutes": "100"
    },
    "2018_462": {
        "plotSummary": "A former police detective juggles wrestling with his personal demons and becoming obsessed with a hauntingly beautiful woman.",
        "runtimeMinutes": "128"
    },
    "2018_463": {
        "plotSummary": "In the 1800s, a scientist invents a contraption that transports him into a steampunk world where the laws of physics are bent and distorted.",
        "runtimeMinutes": "105"
    },
    "2018_464": {
        "plotSummary": "Created by Victor Frankenstein, the one known only as 'The Creature' sets out to discover the world and the meaning of his life.",
        "runtimeMinutes": "130"
    },
    "2018_465": {
        "plotSummary": "When Professor Harpreet Kaur lands in Shanghai, the last thing she would have on her mind is getting kidnapped. A crazy comedy of errors unrolls as the 'Happy' gang - Bagga, Guddu, Happy and Usmaan Miyaan - navigate through China while ...See moreWhen Professor Harpreet Kaur lands in Shanghai, the last thing she would have on her mind is getting kidnapped. A crazy comedy of errors unrolls as the 'Happy' gang - Bagga, Guddu, Happy and Usmaan Miyaan - navigate through China while Harpreet, aka Happy is caught in the crosshairs.See less",
        "runtimeMinutes": "136"
    },
    "2018_466": {
        "plotSummary": "After teenager Kyle Moore is uprooted by his parents' separation, he's unable to fit into his new hometown. Then he stumbles upon a magical app that causes his social media updates to come true, which changes his entire life.",
        "runtimeMinutes": "106"
    },
    "2018_467": {
        "plotSummary": "A young autistic woman runs away from her caregiver in an attempt to submit her 500-page manuscript to a \"Star Trek\" writing competition at Paramount Pictures.",
        "runtimeMinutes": "93"
    },
    "2018_468": {
        "plotSummary": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
        "runtimeMinutes": "112"
    },
    "2018_469": {
        "plotSummary": "In a politically divided America, a man struggles to make it through the Thanksgiving holiday without destroying his family.",
        "runtimeMinutes": "93"
    },
    "2018_47": {
        "plotSummary": "When a young boy accidentally triggers the universe's most lethal hunters' return to Earth, only a ragtag crew of ex-soldiers and a disgruntled scientist can prevent the end of the human race.",
        "runtimeMinutes": "107"
    },
    "2018_470": {
        "plotSummary": "Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy.",
        "runtimeMinutes": "153"
    },
    "2018_471": {
        "plotSummary": "A pilot is the only hope to stop the mutiny of a spacecraft by its security crew, who plot to sell the crew of the ship into slavery.",
        "runtimeMinutes": "91"
    },
    "2018_472": {
        "plotSummary": "A prince and a fellowship of companions set out to rescue his bride from a fortress of alien invaders who have arrived on their home planet.",
        "runtimeMinutes": "116"
    },
    "2018_473": {
        "plotSummary": "An ordinary woman makes an extraordinary decision which will change her life forever.",
        "runtimeMinutes": "101"
    },
    "2018_474": {
        "plotSummary": "The first film to encompass the remarkable story of one of the true icons of our time, as she fights to maintain her brand's integrity, her principles - and her legacy.",
        "runtimeMinutes": "83"
    },
    "2018_475": {
        "plotSummary": "An alien touring the galaxy breaks away from her group and meets two young inhabitants of the most dangerous place in the universe: the London suburb of Croydon.",
        "runtimeMinutes": "102"
    },
    "2018_476": {
        "plotSummary": "A sexually curious teen forms an unorthodox kinship with her mentally unstable stepbrother.",
        "runtimeMinutes": "90"
    },
    "2018_477": {
        "plotSummary": "In 1844, after travelling hundreds of miles on foot, a black woman finds friendship with the wife of the founder of the Mormon Church.",
        "runtimeMinutes": "90"
    },
    "2018_478": {
        "plotSummary": "A daughter torn between two mothers, one who raised her with love and her biological mother, who instinctively claims her back.",
        "runtimeMinutes": "97"
    },
    "2018_479": {
        "plotSummary": "After barely surviving Eren's recovery, a rising threat from the shadows puts everyone's lives in danger again.",
        "runtimeMinutes": "24"
    },
    "2018_48": {
        "plotSummary": "After a cyber-attack reveals the identity of all of the active undercover agents in Britain, Johnny English is forced to come out of retirement to find the mastermind hacker.",
        "runtimeMinutes": "89"
    },
    "2018_480": {
        "plotSummary": "A pragmatic paleontologist visiting an almost complete theme park is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose.",
        "runtimeMinutes": "127"
    },
    "2018_481": {
        "plotSummary": "A community of magical shape-shifting raccoon dogs struggle to prevent their forest home from being destroyed by urban development.",
        "runtimeMinutes": "119"
    },
    "2018_482": {
        "plotSummary": "Four expert thieves attempt to steal every famous artwork that is haunting their mutual psychotherapist. A detective attempts to find out who the \"Collector\" is.",
        "runtimeMinutes": "96"
    },
    "2018_483": {
        "plotSummary": "A world-renowned opera singer becomes trapped in a hostage situation when she's invited to perform for a wealthy industrialist in South America.",
        "runtimeMinutes": "100"
    },
    "2018_484": {
        "plotSummary": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
        "runtimeMinutes": "102"
    },
    "2018_485": {
        "plotSummary": "Survivor and mental wellness advocate Kevin Hines explores the lasting effects of suicide focusing on breaking stigma, advocacy, and mental wellness.",
        "runtimeMinutes": "93"
    },
    "2018_486": {
        "plotSummary": "",
        "runtimeMinutes": "160"
    },
    "2018_487": {
        "plotSummary": "This striking and moving documentary from BAFTA nominated directors Jacqui and David Morris traces the extraordinary life of Rudolf Nureyev. From his birth in the 5th class carriage of a trans-Siberian train, to his dramatic leap to ...See moreThis striking and moving documentary from BAFTA nominated directors Jacqui and David Morris traces the extraordinary life of Rudolf Nureyev. From his birth in the 5th class carriage of a trans-Siberian train, to his dramatic leap to freedom in the West at the height of the Cold War, and unprecedented adulation as the most famous dancer in the world. The film highlights Nureyev's unlikely yet legendary partnership with Margot Fonteyn and charts his meteoric rise to the status of global cultural phenomenon. Nureyev's life plays out like the sweeping plot of a classic Russian novel. His story is Russia's story. Blending never-before-seen footage, with an original score by award-winning composer Alex Baranowski and spellbinding newly choreographed dance tableaux directed by Royal Ballet alumnus, Russell Maliphant, Nureyev is a theatrical and cinematic experience like no other. This is a portrayal as unique as the man himself. There will never be another Nureyev.See less",
        "runtimeMinutes": "109"
    },
    "2018_488": {
        "plotSummary": "Paris, summer 1979. Anne is a producer of cheap gay porn. When Lois, her editor and companion, leaves her, she attempts to get her back by making a more ambitious film with the flamboyant Archibald.",
        "runtimeMinutes": "102"
    },
    "2018_489": {
        "plotSummary": "A young boxer and a call girl get caught up in a drug-smuggling scheme over the course of one night in Tokyo.",
        "runtimeMinutes": "108"
    },
    "2018_49": {
        "plotSummary": "Ballerina Dominika Egorova is recruited to 'Sparrow School,' a Russian intelligence service where she is forced to use her body as a weapon. Her first mission, targeting a C.I.A. agent, threatens to unravel the security of both nations.",
        "runtimeMinutes": "140"
    },
    "2018_490": {
        "plotSummary": "In order to save her son's life, Ana embarks on a quest to find a powerful stone from the Zone of Silence, located in Mexico. Someone finds out the power the stone possesses and believes it is a power worth killing for.",
        "runtimeMinutes": "98"
    },
    "2018_491": {
        "plotSummary": "Fiore, an old friend from Mamoru's lonely childhood who couldn't survive on Earth, returns with flowers he promised Mamoru. But, the evil flower Kisenian overpowered Fiore's weak mind and manipulated him into spreading Kisenian's seeds ...See moreFiore, an old friend from Mamoru's lonely childhood who couldn't survive on Earth, returns with flowers he promised Mamoru. But, the evil flower Kisenian overpowered Fiore's weak mind and manipulated him into spreading Kisenian's seeds over Earth in an effort to drain energy from everyone on Earth. Kisenian manages to do this because he's deceived Fiore using Fiore's long-lost friendship with Mamoru. It is up to Sailor Moon and the Sailor Senshi to stop Kisenian.  Written by Ondre Lombard See less",
        "runtimeMinutes": "61"
    },
    "2018_492": {
        "plotSummary": "\"Russ Taff: I Still Believe,\" a gripping documentary chronicling the beloved vocalist's unparalleled musical journey and behind-the-scenes battle with alcoholism.",
        "runtimeMinutes": "104"
    },
    "2018_493": {
        "plotSummary": "The origin story of Bhavesh Joshi, an Indian superhero, who sets out to fulfill his slain friend's wish to clean and reform the country, by training himself to fight and wearing a mask.",
        "runtimeMinutes": "154"
    },
    "2018_494": {
        "plotSummary": "Two Puerto Rican brothers from New York's Spanish Harlem and the street's best Salsa dancers, are separated after a tragedy only to reunite years later on opposing sides of gentrification.",
        "runtimeMinutes": "95"
    },
    "2018_495": {
        "plotSummary": "Fathom Events and The Metropolitan Opera present a special two-day event, The Opera House, a new film by award-winning documentary filmmaker Susan Froemke, on January 13 and 17 only. The Opera House surveys a remarkable period of the ...See moreFathom Events and The Metropolitan Opera present a special two-day event, The Opera House, a new film by award-winning documentary filmmaker Susan Froemke, on January 13 and 17 only. The Opera House surveys a remarkable period of the Metropolitan Opera's rich history and a time of great change for New York. Featuring rarely seen archival footage, stills, recent interviews, and a soundtrack of extraordinary Met performances, the film chronicles the creation of the Met's storied home of the last 50 years, against the backdrop of the artists, architects, and politicians who shaped the cultural life of New York City in the '50s and '60s.See less",
        "runtimeMinutes": "111"
    },
    "2018_496": {
        "plotSummary": "Teefa goes to Poland to get Anya to Pakistan to marry Butt gangster's son but lands up in trouble with Anya's gangster father and the Polish police.",
        "runtimeMinutes": "155"
    },
    "2018_497": {
        "plotSummary": "",
        "runtimeMinutes": "140"
    },
    "2018_498": {
        "plotSummary": "A disease that turns people into zombies has been cured. The once-infected zombies are discriminated against by society and their own families, which causes social issues to arise. This leads to militant government interference. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2018_499": {
        "plotSummary": "It's the Wild West, circa 1870. Samuel Alabaster, an affluent pioneer, ventures across the American frontier to marry the love of his life, Penelope. As his group traverses the west, the once-simple journey grows treacherous, blurring the ...See moreIt's the Wild West, circa 1870. Samuel Alabaster, an affluent pioneer, ventures across the American frontier to marry the love of his life, Penelope. As his group traverses the west, the once-simple journey grows treacherous, blurring the lines between hero, villain and damsel.See less",
        "runtimeMinutes": "113"
    },
    "2018_5": {
        "plotSummary": "Arthur Curry, the human-born heir to the underwater kingdom of Atlantis, goes on a quest to prevent a war between the worlds of ocean and land.",
        "runtimeMinutes": "143"
    },
    "2018_50": {
        "plotSummary": "A terminally ill man sets up his best friend, whom he has loved since high school, so that she will not be lonely after he passes away.",
        "runtimeMinutes": "105"
    },
    "2018_500": {
        "plotSummary": "After losing her parents in a car accident, Okko starts living in the countryside with her grandmother who runs a traditional Japanese inn. While she prepares to be the next owner of the inn, Okko can somehow see friendly ghosts.",
        "runtimeMinutes": "94"
    },
    "2018_501": {
        "plotSummary": "Leo is 22 and sells his body on the street for a bit of cash. The men come and go, and he stays right here - longing for love. He doesn't know what the future will bring. He hits the road. His heart is pounding.",
        "runtimeMinutes": "99"
    },
    "2018_502": {
        "plotSummary": "Follow the journey of Dr. Gordon Wilson as he traverses the globe studying God's remarkable land animals.",
        "runtimeMinutes": "83"
    },
    "2018_503": {
        "plotSummary": "",
        "runtimeMinutes": "150"
    },
    "2018_504": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_505": {
        "plotSummary": "The incredible story of amateur sailor Donald Crowhurst and his solo attempt to circumnavigate the globe. The struggles he confronted on the journey while his family awaited his return is one of the most enduring mysteries of recent times.",
        "runtimeMinutes": "112"
    },
    "2018_506": {
        "plotSummary": "In a massive heavyweight bout, Deontay Wilder takes on Tyson Fury.",
        "runtimeMinutes": null
    },
    "2018_507": {
        "plotSummary": "",
        "runtimeMinutes": "140"
    },
    "2018_508": {
        "plotSummary": "A screenwriter develops a dangerous relationship with a faded film star determined to make a triumphant return.",
        "runtimeMinutes": "110"
    },
    "2018_509": {
        "plotSummary": "An orphaned boy enrolls in a school of wizardry, where he learns the truth about himself, his family and the terrible evil that haunts the magical world.",
        "runtimeMinutes": "152"
    },
    "2018_51": {
        "plotSummary": "America's third political party, the New Founding Fathers of America, comes to power and conducts an experiment: no laws for 12 hours on Staten Island. No one has to stay on the island, but $5,000 is given to anyone who does.",
        "runtimeMinutes": "97"
    },
    "2018_510": {
        "plotSummary": "",
        "runtimeMinutes": "114"
    },
    "2018_511": {
        "plotSummary": "When a drifter befriends a quirky mortician, an unlikely business partnership is formed. Paranoia soon develops, however, and both men are forced to come to terms with the fragility of friendship and loyalty.",
        "runtimeMinutes": "108"
    },
    "2018_512": {
        "plotSummary": "The Silence of Others reveals the epic struggle of victims of Spain's 40-year dictatorship under General Franco, who continue to seek justice to this day. Filmed over six years, the film follows the survivors as they organize the ...See moreThe Silence of Others reveals the epic struggle of victims of Spain's 40-year dictatorship under General Franco, who continue to seek justice to this day. Filmed over six years, the film follows the survivors as they organize the groundbreaking 'Argentine Lawsuit' and fight a state-imposed amnesia of crimes against humanity, and explores a country still divided four decades into democracy. Seven years in the making, The Silence of Others is the second documentary feature by Emmy-winning filmmakers Almudena Carracedo and Robert Bahar (Made in L.A.). It is being Executive Produced by Pedro Almodóvar, Agustín Almodóvar, and Esther García.See less",
        "runtimeMinutes": "96"
    },
    "2018_513": {
        "plotSummary": "A documentary that investigates the pathologies that have created the richest society the world has ever seen.",
        "runtimeMinutes": "105"
    },
    "2018_514": {
        "plotSummary": "A teenaged skateboarder makes friends with a bunch of other skateboarding girls in New York City.",
        "runtimeMinutes": "106"
    },
    "2018_515": {
        "plotSummary": "A demon wreaks havoc on a Atlanta. Lilith, Adam's first wife according to Jewish mysticism, is expelled from the Garden of Eden because of her refusal to obey Adam, the man. She returns with vengeance against Man, and his offspring.",
        "runtimeMinutes": "109"
    },
    "2018_516": {
        "plotSummary": "Filmed live on stage at the Pantages Theatre in Hollywood, CA, this is a not-to-be-missed high energy show starring Original Broadway cast members.",
        "runtimeMinutes": "149"
    },
    "2018_517": {
        "plotSummary": "Armed with cutting-edge 3D technology, French ocean explorer Jean-Michel Cousteau and his adult children explore the ocean and learn about what puts it at risk.",
        "runtimeMinutes": "82"
    },
    "2018_518": {
        "plotSummary": "Nine high school students from disparate corners of the globe navigate rivalries, setbacks, and hormones on their quest to win the international science fair. Only one can be named \"Best in Fair.\"",
        "runtimeMinutes": "90"
    },
    "2018_519": {
        "plotSummary": "Forty years after the death of Elvis Presley, a musical road trip across America in his 1963 Rolls Royce explores how a country boy lost his authenticity and became a king while his country lost her democracy and became an empire.",
        "runtimeMinutes": "107"
    },
    "2018_52": {
        "plotSummary": "A woman from 2018 and a man from 1999 wake up in the same bed. They discover they can time travel using the bedroom door, and make changes to their eras, but that their destinies may not be in their own hands.",
        "runtimeMinutes": "101"
    },
    "2018_520": {
        "plotSummary": "For over six years, and for reasons he can't explain, Matt Green, 37, has been walking every block of every street in New York City - a journey of more than 8,000 miles. THE WORLD BEFORE YOUR FEET tells the story of one man's unusual ...See moreFor over six years, and for reasons he can't explain, Matt Green, 37, has been walking every block of every street in New York City - a journey of more than 8,000 miles. THE WORLD BEFORE YOUR FEET tells the story of one man's unusual personal quest and the unexpected journey of discovery, humanity, and wonder that ensues.See less",
        "runtimeMinutes": "95"
    },
    "2018_521": {
        "plotSummary": "The adventures in time and space of the Doctor, a Time Lord who changes appearance and personality by regenerating when near death, and is joined by companions in battles against aliens and other megalomaniacs.",
        "runtimeMinutes": "45"
    },
    "2018_522": {
        "plotSummary": "A stage-play producer devises a plan to make money by producing a sure-fire flop.",
        "runtimeMinutes": "88"
    },
    "2018_523": {
        "plotSummary": "A chronicle of the Barack Obama administration's foreign policy team and the events of Obama's final year in office.",
        "runtimeMinutes": "89"
    },
    "2018_524": {
        "plotSummary": "How and why what we eat is the cause of the chronic diseases that are killing us, and changing what we eat can save our lives one bite at a time.",
        "runtimeMinutes": "108"
    },
    "2018_525": {
        "plotSummary": "The music of The Beatles and the Vietnam War form the backdrop for the romance between an upper-class American girl and a poor Liverpudlian artist.",
        "runtimeMinutes": "133"
    },
    "2018_526": {
        "plotSummary": "After wishing to be made big, a teenage boy wakes the next morning to find himself mysteriously in the body of an adult.",
        "runtimeMinutes": "104"
    },
    "2018_527": {
        "plotSummary": "Eela is an aspiring playback singer and single mother. She has given up all her dreams to raise her only son. But now her baby son 'Vivan' is all grown up and being a typical young millennial, doesn't want his mother's life to revolve ...See moreEela is an aspiring playback singer and single mother. She has given up all her dreams to raise her only son. But now her baby son 'Vivan' is all grown up and being a typical young millennial, doesn't want his mother's life to revolve around him. But being an over protective mother, Eela has other ideas and joins her son's college to spend more time with him. Unfortunately her plans backfire and she suffers a backlash from Vivan for invading his privacy. Will Helicopter Eela manage to salvage her relationship with Vivan and find her calling again?See less",
        "runtimeMinutes": "135"
    },
    "2018_528": {
        "plotSummary": "In the summer of 1991, a sheltered teenage boy comes of age during a wild summer he spends on Cape Cod getting rich from selling pot to gangsters, falling in love for the first time, partying and eventually realizing that he is in over his head.",
        "runtimeMinutes": "107"
    },
    "2018_529": {
        "plotSummary": "An ancient prophecy seems to be coming true when a mysterious presence begins stalking the corridors of a school of magic and leaving its victims paralyzed.",
        "runtimeMinutes": "161"
    },
    "2018_53": {
        "plotSummary": "After the disappearance of her scientist father, three peculiar beings send Meg, her brother, and her friend to space in order to find him.",
        "runtimeMinutes": "109"
    },
    "2018_530": {
        "plotSummary": "A frustrated teenager frees herself from her mother's influence and her narrow life in a small industrial town to find out who she really is.",
        "runtimeMinutes": "96"
    },
    "2018_531": {
        "plotSummary": "Following the death of her father, Alice (Ruth Wilson) returns to her home village for the first time in 15 years, to claim the tenancy to the family farm she believes is rightfully hers.",
        "runtimeMinutes": "90"
    },
    "2018_532": {
        "plotSummary": "Ruby Rose and her friends have been burdened with transporting the Relic of Knowledge safely to Atlas. There are countless miles of Grimm-covered countryside between the city of Mistral and the northern coastline of Anima. Fortunately, the...See moreRuby Rose and her friends have been burdened with transporting the Relic of Knowledge safely to Atlas. There are countless miles of Grimm-covered countryside between the city of Mistral and the northern coastline of Anima. Fortunately, the Argus Limited can easily make the journey - so long as nothing goes wrong.  Written by Rooster TeethSee less",
        "runtimeMinutes": "22"
    },
    "2018_533": {
        "plotSummary": "A look into the possibility that aliens are actually demonic spirits merely pretending to be extraterrestrials.",
        "runtimeMinutes": "130"
    },
    "2018_534": {
        "plotSummary": "A fallen soccer superstar vows to adopt a refugee child, while becoming the naive unwitting centerpiece in in a bizarre plot to Make Portugal Great Again.",
        "runtimeMinutes": "96"
    },
    "2018_535": {
        "plotSummary": "An alien orphan is sent from his dying planet to Earth, where he grows up to become his adoptive home's first and greatest superhero.",
        "runtimeMinutes": "143"
    },
    "2018_536": {
        "plotSummary": "The Sailor Moon SuperS Special was a special 45-minute episode of the anime featuring three mini-episodes. It premiered on April 8, 1995, shortly after the beginning of Sailor Moon SuperS, and took place in the storyline directly after ...See moreThe Sailor Moon SuperS Special was a special 45-minute episode of the anime featuring three mini-episodes. It premiered on April 8, 1995, shortly after the beginning of Sailor Moon SuperS, and took place in the storyline directly after Usagi and Chibiusa received their new transformation brooches from Pegasus. The special included a compilation episode focusing on Usagi, an original story featuring the first appearances of Sailor Uranus and Sailor Neptune in the season (they would be seen again in the Sailor Moon SuperS movie), and a story adapted from the manga series \"Chibiusa's Picture Diary.\"See less",
        "runtimeMinutes": "60"
    },
    "2018_537": {
        "plotSummary": "In the final chapter of the trilogy, Sebastien will try anything to protect Belle from her previous owner.",
        "runtimeMinutes": "91"
    },
    "2018_538": {
        "plotSummary": "The story of the notorious 1970s New York City nightclub.",
        "runtimeMinutes": "98"
    },
    "2018_539": {
        "plotSummary": "An anti-drug enforcement agency stages a massive drug bust in the slums of Manila.",
        "runtimeMinutes": "127"
    },
    "2018_54": {
        "plotSummary": "A young orphan named Lewis Barnavelt aids his magical uncle in locating a clock with the power to bring about the end of the world.",
        "runtimeMinutes": "105"
    },
    "2018_540": {
        "plotSummary": "A small-town nurse named Susette Kelo emerges as the reluctant leader of her working-class neighbors in their struggle to save their homes from political and corporate interests bent on seizing the land and handing it over to Pfizer ...See moreA small-town nurse named Susette Kelo emerges as the reluctant leader of her working-class neighbors in their struggle to save their homes from political and corporate interests bent on seizing the land and handing it over to Pfizer Corporation. Susette's battle goes all the way to the US Supreme Court and the controversial 5-4 decision in Kelo vs. City of New London gave government officials the power to bulldoze a neighborhood for the benefit of a multibillion-dollar corporation. The decision outraged Americans across the political spectrum, and that passion fueled reforms that helped curb eminent domain abuse.  Written by Courtney BalakerSee less",
        "runtimeMinutes": "98"
    },
    "2018_541": {
        "plotSummary": "Dr. Craig Evans travels the globe to track down the most ancient New Testament manuscripts. Along the way, he highlights groundbreaking new evidence, demonstrating the reliability of the New Testament manuscripts.",
        "runtimeMinutes": "75"
    },
    "2018_542": {
        "plotSummary": "Harry Potter, Ron and Hermione return to Hogwarts School of Witchcraft and Wizardry for their third year of study, where they delve into the mystery surrounding an escaped prisoner who poses a dangerous threat to the young wizard.",
        "runtimeMinutes": "142"
    },
    "2018_543": {
        "plotSummary": "DARK MONEY, a political thriller, examines one of the greatest present threats to American democracy: the influence of untraceable corporate money on our elections and elected officials. The film takes viewers to Montana--a front line in ...See moreDARK MONEY, a political thriller, examines one of the greatest present threats to American democracy: the influence of untraceable corporate money on our elections and elected officials. The film takes viewers to Montana--a front line in the fight to preserve fair elections nationwide--to follow an intrepid local journalist working to expose the real-life impact of the US Supreme Court's Citizens United decision. Through this gripping story, DARK MONEY uncovers the shocking and vital truth of how American elections are bought and sold. This Sundance award-winning documentary is directed/produced by Kimberly Reed (PRODIGAL SONS) and produced by Katy Chevigny (E-TEAM).See less",
        "runtimeMinutes": "99"
    },
    "2018_544": {
        "plotSummary": "Grace, a teenage girl dying of cancer, crashes a funeral home to find out what will happen to her after she dies, but ends up teaching awkward funeral director Bill how to celebrate life.",
        "runtimeMinutes": "112"
    },
    "2018_545": {
        "plotSummary": "Two Americans searching for work in Mexico convince an old prospector to help them mine for gold in the Sierra Madre Mountains.",
        "runtimeMinutes": "126"
    },
    "2018_546": {
        "plotSummary": "A disgraced agent is forced to come back for one last undercover assignment.",
        "runtimeMinutes": "101"
    },
    "2018_547": {
        "plotSummary": "Five single people try to figure out dating in the age of social media, texting, hanging out and hooking up.",
        "runtimeMinutes": "71"
    },
    "2018_548": {
        "plotSummary": "A team of nice Jewish baseball players takes on the world.",
        "runtimeMinutes": "87"
    },
    "2018_549": {
        "plotSummary": "A New York City romantic comedy, Keep the Change is the unlikely love story of two people who meet in a support group.",
        "runtimeMinutes": "94"
    },
    "2018_55": {
        "plotSummary": "A couple find themselves in over their heads when they foster three children.",
        "runtimeMinutes": "118"
    },
    "2018_550": {
        "plotSummary": "",
        "runtimeMinutes": "165"
    },
    "2018_551": {
        "plotSummary": "A heinous crime tests the complex relationship between a tenacious personal assistant and her Hollywood starlet boss. As the assistant unravels the mystery, she must confront her own understanding of friendship, truth and celebrity.",
        "runtimeMinutes": "93"
    },
    "2018_552": {
        "plotSummary": "A rebellious young man with a troubled past comes to a new town, finding friends and enemies.",
        "runtimeMinutes": "111"
    },
    "2018_553": {
        "plotSummary": "A theatre director's latest project takes on a life of its own when her young star takes her performance too seriously.",
        "runtimeMinutes": "93"
    },
    "2018_554": {
        "plotSummary": "",
        "runtimeMinutes": "90"
    },
    "2018_555": {
        "plotSummary": "Exploring the pre-fame years of the celebrated American artist Jean-Michel Basquiat, and how New York City, its people, and its tectonically shifting arts culture of the late 1970s and '80s shaped his vision.",
        "runtimeMinutes": "78"
    },
    "2018_556": {
        "plotSummary": "The story of female friendship as Frenchwoman Claire helps the subject of her photograph, Min-Hee, discover why she was fired without apparent cause.",
        "runtimeMinutes": "69"
    },
    "2018_557": {
        "plotSummary": "Harry, Ron, and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.",
        "runtimeMinutes": "130"
    },
    "2018_558": {
        "plotSummary": "Harry Potter finds himself competing in a hazardous tournament between rival schools of magic, but he is distracted by recurring nightmares.",
        "runtimeMinutes": "157"
    },
    "2018_559": {
        "plotSummary": "",
        "runtimeMinutes": "175"
    },
    "2018_56": {
        "plotSummary": "While two criminals hide out at a woman's apartment after a botched robbery, an ex-cop tries to find a missing gun.",
        "runtimeMinutes": "109"
    },
    "2018_560": {
        "plotSummary": "A look at famous Japanese animator Hayao Miyazaki following his retirement in 2013.",
        "runtimeMinutes": "70"
    },
    "2018_561": {
        "plotSummary": "The girl group Twice's big-screen film is the movie version of their world tour 'Twiceland Zone 2: Fantasy Park'.",
        "runtimeMinutes": null
    },
    "2018_562": {
        "plotSummary": "A martial arts master agrees to teach karate to a bullied teenager.",
        "runtimeMinutes": "126"
    },
    "2018_563": {
        "plotSummary": "A group of journalists covering former President George W. Bush's planned invasion of Iraq in 2003 are skeptical of the President's claim that Saddam Hussein has \"weapons of mass destruction.\"",
        "runtimeMinutes": "90"
    },
    "2018_564": {
        "plotSummary": "",
        "runtimeMinutes": "135"
    },
    "2018_565": {
        "plotSummary": "The iconic Carlyle hotel has been an international destination for a particular jet-set as well as a favorite haunt of the most discernible New Yorkers.",
        "runtimeMinutes": "92"
    },
    "2018_566": {
        "plotSummary": "",
        "runtimeMinutes": "120"
    },
    "2018_567": {
        "plotSummary": "The story follows Jack, a highly intelligent serial killer, over the course of twelve years, and depicts the murders that really develop his inner madman.",
        "runtimeMinutes": "152"
    },
    "2018_568": {
        "plotSummary": "A Kurdish female battalion prepares to take back their town from extremists.",
        "runtimeMinutes": "115"
    },
    "2018_569": {
        "plotSummary": "A picture-perfect family is shattered when the work of a serial killer hits too close to home.",
        "runtimeMinutes": "109"
    },
    "2018_57": {
        "plotSummary": "A group of friends who meet regularly for game nights find themselves entangled in a real-life mystery when the shady brother of one of them is seemingly kidnapped by dangerous gangsters.",
        "runtimeMinutes": "100"
    },
    "2018_570": {
        "plotSummary": "",
        "runtimeMinutes": "185"
    },
    "2018_571": {
        "plotSummary": "Explore the world to see how it intersects with the stories related in Genesis. Del Tackett of \"The Truth Project\" hikes through canyons, climbs mountains, and dives below the sea to examine two competing views - one compelling truth.",
        "runtimeMinutes": "100"
    },
    "2018_572": {
        "plotSummary": "Based on the NY Times bestselling book by Andrew Solomon, Far from the Tree examines the experiences of families in which parents and children are profoundly different from one another in a variety of ways.",
        "runtimeMinutes": "93"
    },
    "2018_573": {
        "plotSummary": "Seven interconnecting stories set in and around a lost and found office of an Irish train station.",
        "runtimeMinutes": "96"
    },
    "2018_574": {
        "plotSummary": "Eli, an outcast teen, connects with his isolated grandfather Samuel for the first time, and uncovers his surprising past, when he makes his grandpa the subject of an animated art project for school.",
        "runtimeMinutes": "92"
    },
    "2018_575": {
        "plotSummary": "The story centers on Kai, a gloomy middle school student whose life changes after meeting Lu, a mermaid.",
        "runtimeMinutes": "112"
    },
    "2018_576": {
        "plotSummary": "Christopher has an extraordinary brain - exceptional at maths while ill-equipped to interpret everyday life. When his neighbour's dog is murdered, he ventures on a frightening journey that upturns his world.",
        "runtimeMinutes": "160"
    },
    "2018_577": {
        "plotSummary": "An uncannily revealing portrait of American photographers Andy Sweet and Gary Monroe and the vibrant community of Jewish retirees they obsessively focused their camera's lens on in the sunburned paradise of 1970s Miami Beach.",
        "runtimeMinutes": "70"
    },
    "2018_578": {
        "plotSummary": "German construction workers building a dam near a Bulgarian village interact with the locals, and soon the troubles arise both with the locals and among themselves.",
        "runtimeMinutes": "121"
    },
    "2018_579": {
        "plotSummary": "Documentary about rock star Joan Jett.",
        "runtimeMinutes": "93"
    },
    "2018_58": {
        "plotSummary": "Goku and Vegeta encounter Broly, a Saiyan warrior unlike any fighter they've faced before.",
        "runtimeMinutes": "100"
    },
    "2018_580": {
        "plotSummary": "An examination of our dietary choices and the food we put in our bodies. Based on Jonathan Safran Foer's memoir.",
        "runtimeMinutes": "94"
    },
    "2018_581": {
        "plotSummary": "The devil fish which manipulated by Juon-like ghost ''a little girl in red dress'' targets tiger-man's mother. Then, tiger-man tries excising his mother from the devil fish and a little girl in red dress.",
        "runtimeMinutes": "114"
    },
    "2018_582": {
        "plotSummary": "Follow the heartwarming journey of two orphan girls whose only wish is to find a home for Christmas. With a little help from their guardian angels (Dick Van Dyke and Dame Angela Lansbury), they discover miracles can happen when you believe.",
        "runtimeMinutes": "115"
    },
    "2018_583": {
        "plotSummary": "A ragtag group of Pennsylvanians barricade themselves in an old farmhouse to remain safe from a bloodthirsty, flesh-eating breed of monsters who are ravaging the East Coast of the United States.",
        "runtimeMinutes": "96"
    },
    "2018_584": {
        "plotSummary": "Intimate portrait of a woman drifting between reality and denial when she is left alone to grapple with the consequences of her husband's imprisonment.",
        "runtimeMinutes": "93"
    },
    "2018_585": {
        "plotSummary": "A naive man is appointed to fill a vacancy in the United States Senate. His plans promptly collide with political corruption, but he doesn't back down.",
        "runtimeMinutes": "129"
    },
    "2018_586": {
        "plotSummary": "With unprecedented access to pivotal artists and the white-hot market surrounding them, this film dives deep into the contemporary art world, holding a fun-house mirror up to our values and times.",
        "runtimeMinutes": "98"
    },
    "2018_587": {
        "plotSummary": "After finding out about an illegal arms deal, a military intelligence officer goes rogue with highly sensitive data related to his organization, causing his mentor: a colonel, to hunt him down.",
        "runtimeMinutes": "157"
    },
    "2018_588": {
        "plotSummary": "Leaving the mortician adrift, the drifter finds himself on an expedition across the Southwest encountering wild and crazy characters through a series of twisted and dark foibles.",
        "runtimeMinutes": "93"
    },
    "2018_589": {
        "plotSummary": "The general manager at a highway-side ''sports bar with curves\" has her incurable optimism and faith, in her girls, her customers, and herself, tested over the course of a long, strange day.",
        "runtimeMinutes": "93"
    },
    "2018_59": {
        "plotSummary": "A travelling monk and his followers find themselves trapped in a land inhabited by only women.",
        "runtimeMinutes": "114"
    },
    "2018_590": {
        "plotSummary": "A man suffering from Alzheimer's embarks on a final road trip with his granddaughter.",
        "runtimeMinutes": "127"
    },
    "2018_591": {
        "plotSummary": "A boxer struggles to make his mark in the boxing world.",
        "runtimeMinutes": "154"
    },
    "2018_592": {
        "plotSummary": "A feature-length documentary, exploring the new music and social phenomenon of chanting, that focuses on the everyday people who are finding healing and a sense of inner peace by singing mantras together with others just like them; it also...See moreA feature-length documentary, exploring the new music and social phenomenon of chanting, that focuses on the everyday people who are finding healing and a sense of inner peace by singing mantras together with others just like them; it also features the artists who are the focus of this new music-based movement. It's a film about spirituality, not religion, it's about people reconnecting with their true selves and with others.See less",
        "runtimeMinutes": "85"
    },
    "2018_593": {
        "plotSummary": "A gripping story of a three-month-long journey that renowned Polish reporter Ryszard Kapuscinski took across Angola, ravaged by a war in which the front lines shifted like a kaleidoscope, from one day to the next.",
        "runtimeMinutes": "85"
    },
    "2018_594": {
        "plotSummary": "Rudy has always been told that he was too small to play college football. But he is determined to overcome the odds and fulfill his dream of playing for Notre Dame.",
        "runtimeMinutes": "114"
    },
    "2018_595": {
        "plotSummary": "Nothing but silence. Nothing but a revolutionary song. A story in five chapters like the five fingers of a hand.",
        "runtimeMinutes": "84"
    },
    "2018_596": {
        "plotSummary": "Director Thomas Piper filmed the garden designer Piet Oudolf over five seasons as he designed gardens from New York's High Line and Hauser and Wirth's prairie garden in Somerset, England to his own private garden at Hummelo in Holland.",
        "runtimeMinutes": "75"
    },
    "2018_597": {
        "plotSummary": "As Harry Potter (Daniel Radcliffe) begins his sixth year at Hogwarts, he discovers an old book marked as \"the property of the Half-Blood Prince\" and begins to learn more about Lord Voldemort's (Ralph Fiennes') dark past.",
        "runtimeMinutes": "153"
    },
    "2018_598": {
        "plotSummary": "US Navy Lieutenant B. F. Pinkerton buys a house in Japan along with a bride, Cio-Cio San, a.k.a. Butterfly, to tide him over until he marries a \"real\" American wife. When he leaves for America, Cio-Cio San waits patiently and jumps for joy...See moreUS Navy Lieutenant B. F. Pinkerton buys a house in Japan along with a bride, Cio-Cio San, a.k.a. Butterfly, to tide him over until he marries a \"real\" American wife. When he leaves for America, Cio-Cio San waits patiently and jumps for joy when his ship enters the harbor after three years. Unfortunately, his return ends in tragedy.  Written by C. DuriniSee less",
        "runtimeMinutes": null
    },
    "2018_599": {
        "plotSummary": "Onegin's friend Lensky introduces him to Tanya, his fiancee's sister but Onegin flirts with his fiancee. Lensky challenges him to a duel; nobody stops them. Later, Onegin tries to seduce Tanya, but she's married. Onegin just doesn't get it.See moreOnegin's friend Lensky introduces him to Tanya, his fiancee's sister but Onegin flirts with his fiancee. Lensky challenges him to a duel; nobody stops them. Later, Onegin tries to seduce Tanya, but she's married. Onegin just doesn't get it.  Written by dnitzerSee less",
        "runtimeMinutes": null
    },
    "2018_6": {
        "plotSummary": "The story of the legendary British rock band Queen and lead singer Freddie Mercury, leading up to their famous performance at Live Aid.",
        "runtimeMinutes": "134"
    },
    "2018_60": {
        "plotSummary": "A look at the life of the astronaut, Neil Armstrong, and the legendary space mission that led him to become the first man to walk on the Moon on July 20, 1969.",
        "runtimeMinutes": "141"
    },
    "2018_600": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_601": {
        "plotSummary": "Following the death of their father, two sons deal with the trials of their own lives while watching their mother explore new beginnings of her own.",
        "runtimeMinutes": "91"
    },
    "2018_602": {
        "plotSummary": "A rites of passage story of a bi-racial teen struggling for survival in Nazi Germany.",
        "runtimeMinutes": "122"
    },
    "2018_603": {
        "plotSummary": "A recently widowed man's son calls a radio talk-show in an attempt to find his father a partner.",
        "runtimeMinutes": "105"
    },
    "2018_604": {
        "plotSummary": "Documentary on the life and works of comic genius Buster Keaton, directed by Peter Bogdanovich.",
        "runtimeMinutes": "102"
    },
    "2018_605": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_606": {
        "plotSummary": "1985 Chicago Bears. This movie will reveal the full story behind the 1985 Super Bowl Shuffle Chicago Bears.",
        "runtimeMinutes": "90"
    },
    "2018_607": {
        "plotSummary": "An angel tires of overseeing human activity and wishes to become human when he falls in love with a mortal.",
        "runtimeMinutes": "128"
    },
    "2018_608": {
        "plotSummary": "Fans flock to a festival celebrating the most iconic horror movies, only to discover that the charismatic showman behind the event has a diabolical agenda.",
        "runtimeMinutes": "92"
    },
    "2018_609": {
        "plotSummary": "Underneath the sands of Egypt, Anubis, an ancient evil spirit, has awakened. It's up to Yugi, who defeated Anubis centuries ago, to use his skill and determination to rid the world of evil once again.",
        "runtimeMinutes": "100"
    },
    "2018_61": {
        "plotSummary": "Four lifelong friends have their lives forever changed after reading 50 Shades of Grey in their monthly book club.",
        "runtimeMinutes": "104"
    },
    "2018_610": {
        "plotSummary": "\"Styx\" depicts the transformation of a strong woman torn from her contented world during a sailing trip.",
        "runtimeMinutes": "94"
    },
    "2018_611": {
        "plotSummary": "An old mining town on the Arizona-Mexico border finally reckons with its darkest day: the deportation of 1200 immigrant miners exactly 100 years ago. Locals collaborate to stage recreations of their controversial past.",
        "runtimeMinutes": "112"
    },
    "2018_612": {
        "plotSummary": "Allegiance illuminates one of American history's lesser known chapters as it tells the story of Sam Kimura, transported back nearly six decades to when his younger self and his sister Kei fought to stay connected to their heritage, their ...See moreAllegiance illuminates one of American history's lesser known chapters as it tells the story of Sam Kimura, transported back nearly six decades to when his younger self and his sister Kei fought to stay connected to their heritage, their family and themselves after Japanese Americans were wrongfully imprisoned during World War II. An important story told with great resonance and intimacy, Allegiance explores the ties that bind us, the struggle to persevere and the overwhelming power of forgiveness and, most especially, loveSee less",
        "runtimeMinutes": "130"
    },
    "2018_613": {
        "plotSummary": "A mosaic of stories about love and loss, exploring our relationship to the objects, artifacts, and memories that shape our lives. Read more: Synopsis",
        "runtimeMinutes": "114"
    },
    "2018_614": {
        "plotSummary": "A documentary set at the final of the 1984 French Open between John McEnroe and Ivan Lendl at a time when McEnroe was the world's top-ranked player.",
        "runtimeMinutes": "95"
    },
    "2018_615": {
        "plotSummary": "A progressive graduate student finds success and sparks outrage when his interest in battle rap as a thesis subject becomes a competitive obsession.",
        "runtimeMinutes": "120"
    },
    "2018_616": {
        "plotSummary": "A documentary about how English actor Leon Vitali came to work as an assistant to American filmmaker Stanley Kubrick for over 30 years.",
        "runtimeMinutes": "94"
    },
    "2018_617": {
        "plotSummary": "On the night of the 2016 Presidential election, Cass, an L.A. club promoter, takes a thrilling and emotional journey with Frida, a Midwestern visitor. She challenges him to revisit his broken dreams - while he pushes her to discover hers.",
        "runtimeMinutes": "89"
    },
    "2018_618": {
        "plotSummary": "A kaleidoscopic and humanistic view of the Black community in Hale County, Alabama.",
        "runtimeMinutes": "76"
    },
    "2018_62": {
        "plotSummary": "A group of high school dropouts are forced to attend night school in hope that they'll pass the GED exam to finish high school.",
        "runtimeMinutes": "111"
    },
    "2018_620": {
        "plotSummary": "Based on the award-winning book, A Chance in the World is the inspirational true story of a gifted boy who must escape his abusive foster parents to fulfill his incredible destiny.",
        "runtimeMinutes": "75"
    },
    "2018_621": {
        "plotSummary": "Etienne comes to Paris from Lyon to study cinema, meets many new friends and falls under the thrall of the mysterious Mathias.",
        "runtimeMinutes": "137"
    },
    "2018_622": {
        "plotSummary": "When a leprous winery owner in 1930s China dies a few days after his arranged marriage, his young widow is forced to run the winery to make a living while contending with bandits, her drunkard lover, and the invading Japanese army.",
        "runtimeMinutes": "91"
    },
    "2018_623": {
        "plotSummary": "When Dr. Kaveh Nariman, a forensic pathologist, comes to work he encounters a corpse that looks familiar.",
        "runtimeMinutes": "99"
    },
    "2018_624": {
        "plotSummary": "Caesar returns in triumph to Rome and the people pour out of their homes to celebrate. Alarmed by the autocrat's popularity, the educated elite conspire to bring him down. After his assassination, civil war erupts on the streets of Rome.",
        "runtimeMinutes": "135"
    },
    "2018_625": {
        "plotSummary": "\"The Charmer\" is an intense psychological drama about Esmail, a young Iranian man who is desperately looking to meet women who can secure his stay in Denmark. As time is running out he falls in love and his past catches up with him.",
        "runtimeMinutes": "100"
    },
    "2018_626": {
        "plotSummary": "Aaron Davis is accused of murder and incarcerated for a crime he swears that he did not commit. His son Jalen is forced to grow up on the streets of Los Angeles without the guidance of a father and primarily raised by his mother Shala and ...See moreAaron Davis is accused of murder and incarcerated for a crime he swears that he did not commit. His son Jalen is forced to grow up on the streets of Los Angeles without the guidance of a father and primarily raised by his mother Shala and Grandmother Camilla. Jalen finds himself in hot water with his life at risk after his friend Diggy decides to partner with one of the biggest drug dealers in the city leaving a large debt to be recouped. Everything seems to turn around when Aaron is reminded to put his faith in God first and use the power of prayer to help solve his problems. Will Aaron find a way to prove his innocence and save his son's life before it is too late?See less",
        "runtimeMinutes": "89"
    },
    "2018_627": {
        "plotSummary": "The life, times and afflictions of the fifteenth-century Russian iconographer St. Andrei Rublev.",
        "runtimeMinutes": "205"
    },
    "2018_628": {
        "plotSummary": "Right after winning a fight in Las Vegas, Kurt Sloane is sedated and taken to a prison in Bangkok, where he's forced to fight a 6'10\" giant for freedom and $1M - but this will require some intense training.",
        "runtimeMinutes": "110"
    },
    "2018_629": {
        "plotSummary": "Nina is a stand-up comedian who sees her life turned upside down when she meets Rafe.",
        "runtimeMinutes": "97"
    },
    "2018_63": {
        "plotSummary": "In the prehistoric past, a young man struggles to return home after being separated from his tribe during a buffalo hunt. He finds a similarly lost wolf companion and starts a friendship that would change humanity.",
        "runtimeMinutes": "96"
    },
    "2018_630": {
        "plotSummary": "A group of artists in Santa Fe, NM become a DIY collective called Meow Wolf. Their immersive, large-scale exhibitions crack open a profitable niche in the arts industry, even as their social mission is challenged by the demands of rapid ...See moreA group of artists in Santa Fe, NM become a DIY collective called Meow Wolf. Their immersive, large-scale exhibitions crack open a profitable niche in the arts industry, even as their social mission is challenged by the demands of rapid success. The group's members navigate fracture and loss for years in pursuit of their idealistic vision. When they spark the interest of George R. R. Martin and receive his support to take over an old bowling alley, Meow Wolf builds a massive exhibition with over 140 artists working at a breakneck pace. With the wild success of the House of Eternal Return, Meow Wolf now faces its own internal turmoil as it begins to change the lives of creatives everywhere.See less",
        "runtimeMinutes": "88"
    },
    "2018_631": {
        "plotSummary": "73 BC pre-Columbian New World. A humble soldier rises unexpectedly as the protector of a young republic. Now Chief Captain of a war-weary nation, Moroni defends his country with revolutionary prowess, but his greatest struggle will be ...See more73 BC pre-Columbian New World. A humble soldier rises unexpectedly as the protector of a young republic. Now Chief Captain of a war-weary nation, Moroni defends his country with revolutionary prowess, but his greatest struggle will be uniting a beleaguered people.See less",
        "runtimeMinutes": "14"
    },
    "2018_632": {
        "plotSummary": "The ruined aftermath of a bloody civil war. Ruthlessly fighting to survive, the Macbeths are propelled towards the crown by forces of elemental darkness.",
        "runtimeMinutes": "210"
    },
    "2018_633": {
        "plotSummary": "A humble sportscaster/plane crash survivor joins forces with ultra-competitive CEO in the world's most grueling bicycle endurance race. Driven by their shared convictions, they cycle 3,000+ miles nonstop, battling opponents, extreme ...See moreA humble sportscaster/plane crash survivor joins forces with ultra-competitive CEO in the world's most grueling bicycle endurance race. Driven by their shared convictions, they cycle 3,000+ miles nonstop, battling opponents, extreme terrain/weather, inner demons and occasionally each other.See less",
        "runtimeMinutes": "113"
    },
    "2018_634": {
        "plotSummary": "The morning after a party, a young man wakes up to find Paris invaded by zombies.",
        "runtimeMinutes": "93"
    },
    "2018_635": {
        "plotSummary": "A grizzled thug and his gang head to an island retreat with a haul of 250 kilograms of gold bullion to lay low; however, a bohemian writer, his muse, and a pair of gendarmes further complicate things, as allegiances are put to the test.",
        "runtimeMinutes": "92"
    },
    "2018_636": {
        "plotSummary": "Nancy becomes increasingly convinced she was kidnapped as a child. When she meets a couple whose daughter went missing thirty years ago, reasonable doubts give way to willful belief.",
        "runtimeMinutes": "85"
    },
    "2018_638": {
        "plotSummary": "Japanese figure skater Yuri Katsuki faces a crushing defeat during the Grand Prix finals and heads home, unsure of whether or not he wishes to continue his skating career. After a video of Yuri mimicking Russian figure skater Victor ...See moreJapanese figure skater Yuri Katsuki faces a crushing defeat during the Grand Prix finals and heads home, unsure of whether or not he wishes to continue his skating career. After a video of Yuri mimicking Russian figure skater Victor Nikiforov's routine goes viral, Victor decided to become Yuri's coach, much to the dismay of his coach, his fans, and his fellow Russian skater Yuri Plisetsky.See less",
        "runtimeMinutes": "20"
    },
    "2018_639": {
        "plotSummary": "Three young men bond together to escape volatile families in their Rust-Belt hometown. As they face adult responsibilities, unexpected revelations threaten their decade-long friendship. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2018_64": {
        "plotSummary": "In the afterlife, one guardian helps a man through his trials, while his two colleagues help a former guardian on earth.",
        "runtimeMinutes": "142"
    },
    "2018_640": {
        "plotSummary": "A timeless tale that takes place against the backdrop of the segregated coffee fields in 1920s Hawaii - a coming-of-age journey about a young man who transcends the boundaries of race and class in pursuit of a forbidden love.",
        "runtimeMinutes": "110"
    },
    "2018_641": {
        "plotSummary": "Live theatrical production of Tennessee Williams' 'Cat on a Hot Tin Roof'.",
        "runtimeMinutes": "185"
    },
    "2018_642": {
        "plotSummary": "Indigenous detective Jay Swan arrives in the town of Goldstone to search for a missing person, and his simple duty becomes complicated when he uncovers a web of crime and corruption.",
        "runtimeMinutes": "110"
    },
    "2018_643": {
        "plotSummary": "A documentary about the 20th century German sculptor and performance artist Joseph Beuys.",
        "runtimeMinutes": "107"
    },
    "2018_644": {
        "plotSummary": "The last year of singer Nico's life, as she tours and grapples with addiction and personal demons.",
        "runtimeMinutes": "93"
    },
    "2018_645": {
        "plotSummary": "In a South Yorkshire city, Ryan Sinclair, Yasmin Khan and Graham O'Brien are about to have their lives changed forever, as a mysterious woman, unable to remember her own name, falls from the night sky.",
        "runtimeMinutes": "60"
    },
    "2018_646": {
        "plotSummary": "A Coptic leper and his orphaned apprentice leave the confines of the leper colony for the first time and embark on a journey across Egypt to search for what is left of their families.",
        "runtimeMinutes": "97"
    },
    "2018_647": {
        "plotSummary": "Catherine Weldon, a portrait painter from 1890s Brooklyn, travels to Dakota to paint a portrait of Sitting Bull and becomes embroiled in the Lakota peoples' struggle over the rights to their land.",
        "runtimeMinutes": "101"
    },
    "2018_648": {
        "plotSummary": "A group of undocumented Mexican immigrants work long hours six days a week, and then savor their day of rest on Sundays on the soccer fields of Brooklyn.",
        "runtimeMinutes": "92"
    },
    "2018_649": {
        "plotSummary": "The continuing adventures of Henry, Jessie, Violet, and Benny as they spend the summer on their grandfather's private island.",
        "runtimeMinutes": "81"
    },
    "2018_65": {
        "plotSummary": "Stephanie is a single mother with a parenting vlog who befriends Emily, a secretive upper-class woman who has a child at the same elementary school. When Emily goes missing, Stephanie takes it upon herself to investigate.",
        "runtimeMinutes": "117"
    },
    "2018_650": {
        "plotSummary": "A Russian Literature professor at the University of Havana is ordered to work as a translator for child victims of the Chernobyl nuclear disaster when they are sent to Cuba for medical treatment.",
        "runtimeMinutes": "107"
    },
    "2018_651": {
        "plotSummary": "A group of friends find themselves in trouble when one receives a chit from the gangster that he owes money to.",
        "runtimeMinutes": "137"
    },
    "2018_652": {
        "plotSummary": "Set in the Hasidic enclave of Borough Park, Brooklyn, \"93Queen\" follows a group of tenacious Hasidic women who are smashing the patriarchy in their community by creating the first all-female volunteer ambulance corps in New York City. With...See moreSet in the Hasidic enclave of Borough Park, Brooklyn, \"93Queen\" follows a group of tenacious Hasidic women who are smashing the patriarchy in their community by creating the first all-female volunteer ambulance corps in New York City. With unprecedented-and insider-access, \"93Queen\" offers up a unique portrayal of a group of religious women who are taking matters into their own hands to change their own community from within.  Written by Heidi ReinbergSee less",
        "runtimeMinutes": "90"
    },
    "2018_653": {
        "plotSummary": "Together, a filmmaker and her characters venture into a personal research project about intimacy. On the fluid border between reality and fiction, Touch Me Not follows the emotional journeys of Laura, Tómas and Christian, offering a deeply...See moreTogether, a filmmaker and her characters venture into a personal research project about intimacy. On the fluid border between reality and fiction, Touch Me Not follows the emotional journeys of Laura, Tómas and Christian, offering a deeply empathic insight into their lives.See less",
        "runtimeMinutes": "123"
    },
    "2018_654": {
        "plotSummary": "This period film from Director Devon Parks weaves an intersecting web of characters, all having witnessed a murder from three different vantage points. The dark past of this turn of the century town begins to uncover itself as an elaborate...See moreThis period film from Director Devon Parks weaves an intersecting web of characters, all having witnessed a murder from three different vantage points. The dark past of this turn of the century town begins to uncover itself as an elaborate plot for revenge is constructed around the origins of a real life ghost story.See less",
        "runtimeMinutes": "101"
    },
    "2018_655": {
        "plotSummary": "In Brooklyn, New York, Kyra (Michelle Pfeiffer) loses her job and struggles to survive on her ailing mother's income. As the weeks and months go on, her problems worsen. This leads her on a risky and enigmatic path that threatens her life.",
        "runtimeMinutes": "98"
    },
    "2018_656": {
        "plotSummary": "Discovery shines a spotlight on the institution taking us to the moon and to the outer edge of our solar system. Above and Beyond celebrates NASA's many accomplishments and catapults viewers to where its headed in the future. Directed, ...See moreDiscovery shines a spotlight on the institution taking us to the moon and to the outer edge of our solar system. Above and Beyond celebrates NASA's many accomplishments and catapults viewers to where its headed in the future. Directed, produced, and narrated by Emmy®-winning Rory Kennedy, the film examines the ways NASA has changed our vision of the universe, our planet, and ourselves.See less",
        "runtimeMinutes": "90"
    },
    "2018_657": {
        "plotSummary": "A young woman is forced to reflect on her first relationship when she inadvertently moves into her ex-boyfriend's apartment building.",
        "runtimeMinutes": "91"
    },
    "2018_658": {
        "plotSummary": "\"You're free. Go home\" Most Holocaust films end with these words, the very words that survivors heard at liberation. After Auschwitz begins with these words, inviting audiences to experience what happened next. For survivors, liberation ...See more\"You're free. Go home\" Most Holocaust films end with these words, the very words that survivors heard at liberation. After Auschwitz begins with these words, inviting audiences to experience what happened next. For survivors, liberation from the camps was the beginning of a life long struggle. They wanted to go home, but there was no home left in Europe. They came to America and wanted to tell people about their pasts but were silenced for over three decades. \"You're in America now, put it behind you\". After Auschwitz is a \"Post-Holocaust\" documentary that captures what it means to survive and try to life a normal life after unspeakable tragedy. Six extraordinary women who all survived Auschwitz take us on a journey that American audiences have never seen before. These women all moved to Los Angeles, married, raised children and became \"Americans\" but they never truly found a place to call home. What makes the story so much more fascinating is how these women saw, interpreted and interacted with the changing face of America in the second half of the 20th century. They serve as our guides on an unbelievable journey, sometimes celebratory, sometimes heart breaking but always inspiring. It is also the only \"Holocaust\" film that includes Ricardo Montalban, George W. Bush and an appearance at The Kennedy Center Honors. After Auschwitz gives us the story that we have always wanted to see and one that in many ways is as important as the stories of the camps themselves.See less",
        "runtimeMinutes": "83"
    },
    "2018_659": {
        "plotSummary": "A newly reunited young couple's drive through the Pacific Northwest turns into a nightmare as they are forced to face nature, unsavory locals, and a monstrous creature, known to the Native Americans as Oh-Mah.",
        "runtimeMinutes": "106"
    },
    "2018_66": {
        "plotSummary": "In early 18th century England, a frail Queen Anne occupies the throne and her close friend, Lady Sarah, governs the country in her stead. When a new servant, Abigail, arrives, her charm endears her to Sarah.",
        "runtimeMinutes": "119"
    },
    "2018_660": {
        "plotSummary": "Sex Fashion and Disco is a documentary film concerning Antonio Lopez (1943-1987), the most influential fashion illustrator of 1970s Paris and New York, and his colorful and sometimes outrageous milieu. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2018_661": {
        "plotSummary": "An unearthly fog rolls into a small coastal town exactly 100 years after a ship mysteriously sank in its waters.",
        "runtimeMinutes": "89"
    },
    "2018_662": {
        "plotSummary": "Nothing Can Save Humanity From Itself",
        "runtimeMinutes": "90"
    },
    "2018_663": {
        "plotSummary": "Ten-year-old Flynn transforms his living room into a supper club using his classmates as line cooks. With sudden fame, Flynn outgrows his bedroom kitchen, and sets out to challenge the hierarchy of the culinary world.",
        "runtimeMinutes": "82"
    },
    "2018_664": {
        "plotSummary": "An ex-con struggling to readjust to life in his small town forms an intense bond with his former high school teacher.",
        "runtimeMinutes": "109"
    },
    "2018_665": {
        "plotSummary": "Mark Cousins dives deep into the visual world of legendary director and actor Orson Welles to reveal a portrait of the artist as he's never been seen before.",
        "runtimeMinutes": "115"
    },
    "2018_666": {
        "plotSummary": "A man abducts a flower shop owner and holds her captive in a small, soundproof room in an effort to extract a dark secret from her past.",
        "runtimeMinutes": "88"
    },
    "2018_667": {
        "plotSummary": "The behind the scene look at the casting calls; selection of cast members, story board ideas producers, and directoral commentary. Plus never before scene footage of this iconic cult classic with additional commentary from selected cast ...See moreThe behind the scene look at the casting calls; selection of cast members, story board ideas producers, and directoral commentary. Plus never before scene footage of this iconic cult classic with additional commentary from selected cast members and other leading consultants involved in the making of this memorable film.See less",
        "runtimeMinutes": "85"
    },
    "2018_668": {
        "plotSummary": "The story of Dr. Vasant Lad's mission to bring the ancient health care system of wellness called Ayurveda from India to the West in the late 1970s. From the director of One Track Heart: The Story of Krishna Das.",
        "runtimeMinutes": "89"
    },
    "2018_669": {
        "plotSummary": "What if running could lead to enlightenment? 3100: Run and Become follows an unassuming Finnish paperboy in the Self-Transcendence 3100 Miler - the world's longest race. His story takes the viewer around the world to the Kalahari Desert, ...See moreWhat if running could lead to enlightenment? 3100: Run and Become follows an unassuming Finnish paperboy in the Self-Transcendence 3100 Miler - the world's longest race. His story takes the viewer around the world to the Kalahari Desert, the mountain temples of Japan and the Navajo Reservation.See less",
        "runtimeMinutes": "80"
    },
    "2018_67": {
        "plotSummary": "A harmless game of Truth or Dare among friends turns deadly when someone - or something - begins to punish those who tell a lie or refuse the dare.",
        "runtimeMinutes": "100"
    },
    "2018_670": {
        "plotSummary": "Internationally renowned director Margarethe von Trotta takes a closer look at Bergman's life and work and explores his film legacy with Bergman's closest collaborators, both in front and behind the camera, as well as a new generation of ...See moreInternationally renowned director Margarethe von Trotta takes a closer look at Bergman's life and work and explores his film legacy with Bergman's closest collaborators, both in front and behind the camera, as well as a new generation of filmmakers. The documentary presents key scenes, recurring themes in his films and his life, and journeys to the places at the center of Bergman's creative achievement and the focal points of his life such as the Royal Dramatic Theatre in Stockholm, locations and landscapes from his masterpieces, and the stations from his career in Sweden, France and Germany. Explore the many layers of Bergman's work and life with INGMAR BERGMAN - LEGACY OF A DEFINING GENIUS.  Written by AnonymousSee less",
        "runtimeMinutes": "99"
    },
    "2018_671": {
        "plotSummary": "Following the 2016 presidential election, Frederick Wiseman's documentary dissects small-town America to understand how its values impact and influence the political landscape of the nation.",
        "runtimeMinutes": "143"
    },
    "2018_672": {
        "plotSummary": "The Gardener is a documentary directed by Sebastien Chabot about Frank Cabot's Les Quatre Vents, aka Cabot Garden, a magnificent private garden in the Charlevoix region near Quebec City.",
        "runtimeMinutes": "88"
    },
    "2018_673": {
        "plotSummary": "A wayward nine-year-old girl is sent to the countryside to work and mature, but finds herself instead deeply entangled in a drama she can hardly grasp.",
        "runtimeMinutes": "91"
    },
    "2018_674": {
        "plotSummary": "When the son of an African American judge is murdered in a routine pull-over gone wrong, Judge Charles Coleman takes the law into his own hands to ensure justice is had when the two cops walk free.",
        "runtimeMinutes": "94"
    },
    "2018_675": {
        "plotSummary": "A singer in New York City gets a grim diagnosis that puts her life and dreams into perspective.",
        "runtimeMinutes": "91"
    },
    "2018_676": {
        "plotSummary": "Jessie and Angela, high school dropouts, are taking a week off to chill at the beach. Too bad their house got robbed, rent's due, they're about to get fired, and they're broke.",
        "runtimeMinutes": "85"
    },
    "2018_677": {
        "plotSummary": "Loving parents of a four-year-old must come to terms with their child being transgender.",
        "runtimeMinutes": "92"
    },
    "2018_678": {
        "plotSummary": "A war correspondent gets taken hostage while on assignment, prompting his mother, impatient with the government's lack of concern, to take matters into her own hands.",
        "runtimeMinutes": "109"
    },
    "2018_679": {
        "plotSummary": "Bomb City is a crime-thriller, about the cultural aversion of a group of punk rockers in a conservative Texas town. Their ongoing battle with a rival, more-affluent clique leads to a controversial hate crime that questions the morality of ...See moreBomb City is a crime-thriller, about the cultural aversion of a group of punk rockers in a conservative Texas town. Their ongoing battle with a rival, more-affluent clique leads to a controversial hate crime that questions the morality of American justice. Based on the true-life story of Brian Deneke.See less",
        "runtimeMinutes": "98"
    },
    "2018_68": {
        "plotSummary": "A woman struggling with insecurity wakes from a fall believing she is the most beautiful and capable woman on the planet. Her new confidence empowers her to live fearlessly, but what happens when she realizes her appearance never changed?",
        "runtimeMinutes": "110"
    },
    "2018_680": {
        "plotSummary": "Upon arriving at the Digital World after the \"reboot\", the digidestined are hunted by a new villain. Meanwhile, Sora is troubled by her partner digimon's indifference towards her.",
        "runtimeMinutes": "82"
    },
    "2018_681": {
        "plotSummary": "Life and career of legendary blues musician Paul Butterfield.",
        "runtimeMinutes": "95"
    },
    "2018_682": {
        "plotSummary": "Cynthia is a horror film about the 'perfect' couple and their desperate obsession to have a child which descends into a terrifying dark comedy.",
        "runtimeMinutes": "89"
    },
    "2018_683": {
        "plotSummary": "Through the eyes of the greatest athletes of all time, IN SEARCH OF GREATNESS is a cinematic journey into the secrets of genius.",
        "runtimeMinutes": "77"
    },
    "2018_684": {
        "plotSummary": "In 'Ramen Heads,' Osamu Tomita, Japan's reigning king of ramen, takes us deep into his world, revealing every single step of his obsessive approach to creating the perfect soup and noodles, and his relentless search for the highest-quality...See moreIn 'Ramen Heads,' Osamu Tomita, Japan's reigning king of ramen, takes us deep into his world, revealing every single step of his obsessive approach to creating the perfect soup and noodles, and his relentless search for the highest-quality ingredients. In addition to Tomita's story, the film also profiles five other notable ramen shops, each with its own philosophy and flavour, which exemplify various different aspects the ramen world. Mixing in a brief rundown of ramen's historical roots, the film gives viewers an in-depth look at the culture surrounding this unique and beguiling dish. This is a documentary record of 15 months in the lives of Japan's top ramen masters and their legions of devoted fans.See less",
        "runtimeMinutes": "93"
    },
    "2018_685": {
        "plotSummary": "The story of a bride-to-be trying to find her real father told using hit songs by the popular 1970s group ABBA.",
        "runtimeMinutes": "108"
    },
    "2018_686": {
        "plotSummary": "The comeback of Detroit is poised to be the greatest turnaround story of American history. American Dream: Detroit illustrates why the history and the future of Detroit matters in the global landscape. Grammy winning singer Michael Bolton ...See moreThe comeback of Detroit is poised to be the greatest turnaround story of American history. American Dream: Detroit illustrates why the history and the future of Detroit matters in the global landscape. Grammy winning singer Michael Bolton celebrates the golden age of Detroit - featuring its native entertainment legends like Francis Ford Coppola, Jerry Bruckheimer, Aretha Franklin, Smokey Robinson, Alice Cooper, John Varvatos and many more - and reveals the landscape of the new Detroit being built by young visionaries as well as entrepreneurial moguls. Told through the eyes of Bolton's own discovery, this important story has remained until now largely obscured by mainstream media's preference to portray only the devastation of the city's downfall. This is the story of the American Dream.  Written by Christina KlineSee less",
        "runtimeMinutes": null
    },
    "2018_687": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_688": {
        "plotSummary": "The DigiDestined must stand together to prevent the digital world from swallowing the real world.",
        "runtimeMinutes": "98"
    },
    "2018_689": {
        "plotSummary": "A rookie detective, son of a dead disgraced cop, works to solve his first major case while under the watchful eye of a ghost-like assassin.",
        "runtimeMinutes": "95"
    },
    "2018_69": {
        "plotSummary": "Three parents try to stop their daughters from losing their virginity on prom night.",
        "runtimeMinutes": "102"
    },
    "2018_690": {
        "plotSummary": "It is Hallowaiian on the Big Island of Hawaii, so excitement and mischief are in the air. Three young friends, Kai, Eddie and Leilani uncover a mysterious idol in a secret cave whilst catching some waves at sunset. They quickly uncover ...See moreIt is Hallowaiian on the Big Island of Hawaii, so excitement and mischief are in the air. Three young friends, Kai, Eddie and Leilani uncover a mysterious idol in a secret cave whilst catching some waves at sunset. They quickly uncover that they've unleashed an ancient evil upon the island in the form of a giant pineapple-headed monster. The kids find help in some mystical friends and discover that in order to vanquish the evil, Kai must uncover his heritage, and believe the ancient stories of his ancestors.See less",
        "runtimeMinutes": "82"
    },
    "2018_691": {
        "plotSummary": "In a small Cafe, Min-hee Kim plays a guest who prefers to observe but not interact with the other guests herself.",
        "runtimeMinutes": "66"
    },
    "2018_692": {
        "plotSummary": "A mute gunfighter defends a young widow and a group of outlaws against a gang of bounty killers in the winter of 1898, and a grim, tense struggle unfolds.",
        "runtimeMinutes": "105"
    },
    "2018_693": {
        "plotSummary": "A team of Ultra-marathon runners journey to Bhutan to set a speed record on the world's hardest trek. But Bhutan's Himalayan landscape isn't welcoming to athletes not used to the conditions, and it's inhabitants must be persuaded to let ...See moreA team of Ultra-marathon runners journey to Bhutan to set a speed record on the world's hardest trek. But Bhutan's Himalayan landscape isn't welcoming to athletes not used to the conditions, and it's inhabitants must be persuaded to let the runners pursue their dream. The result is a shared accomplishment and an adventure that constantly teeters on the edge of total failure.See less",
        "runtimeMinutes": "105"
    },
    "2018_694": {
        "plotSummary": "Wanda, a lonely housewife, drifts through mining country until she meets a petty thief who takes her in.",
        "runtimeMinutes": "102"
    },
    "2018_695": {
        "plotSummary": "Live coverage of Prince Harry and Meghan Markle getting married at St George's Chapel in Windsor.",
        "runtimeMinutes": null
    },
    "2018_696": {
        "plotSummary": "The inspirational tale of the grandfathers of fitness as we now know it, Joe and Ben Weider. Facing anti-Semitism and extreme poverty, the brothers beat all odds to build an empire and inspire future generations.",
        "runtimeMinutes": "107"
    },
    "2018_697": {
        "plotSummary": "When two kids find and play a magical board game, they release a man trapped in it for decades - and a host of dangers that can only be stopped by finishing the game.",
        "runtimeMinutes": "104"
    },
    "2018_698": {
        "plotSummary": "Hal Ashby's obsessive genius led to an unprecedented string of Oscar®-winning classics, including Harold and Maude, Shampoo and Being There. But as contemporaries Francis Ford Coppola, Scorsese and Spielberg rose to blockbuster stardom in ...See moreHal Ashby's obsessive genius led to an unprecedented string of Oscar®-winning classics, including Harold and Maude, Shampoo and Being There. But as contemporaries Francis Ford Coppola, Scorsese and Spielberg rose to blockbuster stardom in the 1980s, Ashby's uncompromising nature played out as a cautionary tale of art versus commerce.  Written by Lisa JanssenSee less",
        "runtimeMinutes": "90"
    },
    "2018_699": {
        "plotSummary": "An unsettling and eye-opening Wall Street horror story about Chinese companies, the American stock market, and the opportunistic greed behind the biggest heist you've never heard of.",
        "runtimeMinutes": "82"
    },
    "2018_7": {
        "plotSummary": "A failed reporter is bonded to an alien entity, one of many symbiotes who have invaded Earth. But the being takes a liking to Earth and decides to protect it.",
        "runtimeMinutes": "112"
    },
    "2018_70": {
        "plotSummary": "Ron Stallworth, an African American police officer from Colorado Springs, CO, successfully manages to infiltrate the local Ku Klux Klan branch with the help of a Jewish surrogate who eventually becomes its leader. Based on actual events.",
        "runtimeMinutes": "135"
    },
    "2018_700": {
        "plotSummary": "350 Days peels back the curtain on the severe toll pro wrestlers endured on the road 350 days a year, a toll on their bodies, families, and psyches.",
        "runtimeMinutes": "108"
    },
    "2018_701": {
        "plotSummary": "When five friends gather for a high school reunion, they find themselves around a man deform with mercury poisoning. Read more: Synopsis",
        "runtimeMinutes": "106"
    },
    "2018_702": {
        "plotSummary": "Montauk, East Hampton, New York, 2016. Peter Beard discusses his work as a photographer, artist and diarist before reminiscing about his attempt to make a documentary in the summer of 1972 with his friend Lee Radziwill (younger sister of ...See moreMontauk, East Hampton, New York, 2016. Peter Beard discusses his work as a photographer, artist and diarist before reminiscing about his attempt to make a documentary in the summer of 1972 with his friend Lee Radziwill (younger sister of Jacqueline Kennedy Onassis), focusing on their childhood and the 20th- century history of East Hampton.  Written by Paul ElliottSee less",
        "runtimeMinutes": "80"
    },
    "2018_703": {
        "plotSummary": "A cynical college professor takes a keen interest in a talented young writing student.",
        "runtimeMinutes": "106"
    },
    "2018_704": {
        "plotSummary": "Five children in Swaziland dive into their imaginations to create an original African tale about a girl on a dangerous quest.",
        "runtimeMinutes": "77"
    },
    "2018_705": {
        "plotSummary": "A documentary about an important American still photographer who captured New York City in the 1960s (his work there is said to have influenced the TV show Mad Men) and later the West in Texas and Los Angeles.",
        "runtimeMinutes": "90"
    },
    "2018_706": {
        "plotSummary": "Rüdiger Suchsland examines German cinema from 1933, when the Nazis came into power, until 1945 when the Third Reich collapsed.",
        "runtimeMinutes": "105"
    },
    "2018_707": {
        "plotSummary": "Serving a life sentence in one of Israel's toughest prisons, Mikki Levy never thought he'd ever see the light of day. But when's he's released early on a technicality, Mikki moves to New York hoping for a fresh start. Living with his uncle...See moreServing a life sentence in one of Israel's toughest prisons, Mikki Levy never thought he'd ever see the light of day. But when's he's released early on a technicality, Mikki moves to New York hoping for a fresh start. Living with his uncle in Brooklyn, the harsh reality of life as an ex-con sets in and he gets dragged into a brutal turf war with the Russian mob, forcing him to revisit his dark past, and the survival skills he learned in prison. Mikki aggressively ascends the ranks of the underworld, but his tenacious drive may be the cause of his demise.See less",
        "runtimeMinutes": "91"
    },
    "2018_708": {
        "plotSummary": "An intersectional narrative of two families in Brooklyn and the unraveling of unspoken unhappiness that occurs when a young foreign girl spending time abroad upsets the balance on both sides.",
        "runtimeMinutes": "94"
    },
    "2018_709": {
        "plotSummary": "Jonathan leaves the office every day at noon. When he gets home, he goes to sleep. Every morning he wakes up and there is a breakfast prepared for him along with a video telling him about the second part of his day.",
        "runtimeMinutes": "95"
    },
    "2018_71": {
        "plotSummary": "Two young friends find a magic book that brings a ventriloquist's dummy to life.",
        "runtimeMinutes": "90"
    },
    "2018_710": {
        "plotSummary": "Ex-jailbirds Eddie and Paul are on parole and working in a New York diner. Their lives are a dead end. That is, until English lawyer Katherine Rookwood walks into the diner with an offer they can't refuse.",
        "runtimeMinutes": "100"
    },
    "2018_711": {
        "plotSummary": "Nadia Murad, a 23-year-old Yazidi, survived genocide and sexual slavery committed by ISIS. Repeating her story to the world, this ordinary girl finds herself thrust onto the international stage as the voice of her people. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2018_712": {
        "plotSummary": "With an interminable case of writer's block and a personal family crisis, playwright Nate is forced to move into his father's retirement community.",
        "runtimeMinutes": "93"
    },
    "2018_713": {
        "plotSummary": "Four people in a Chinese city live through a complicated day as their lives intersect.",
        "runtimeMinutes": "230"
    },
    "2018_714": {
        "plotSummary": "\"I do not care if we go down in history as barbarians.\" These words, spoken in the Council of Ministers of the summer of 1941, started the ethnic cleansing on the Eastern Front. The film attempts to comment on this statement.",
        "runtimeMinutes": "140"
    },
    "2018_715": {
        "plotSummary": "A documentary that explores the rise and fall of the late Roger Ailes, from his early media influence on the Nixon presidency to his controversial leadership at Fox News.",
        "runtimeMinutes": "107"
    },
    "2018_716": {
        "plotSummary": "Andre is a young boy that lives in an industrial neighborhood in Ouro Preto, Brazil, near an old aluminum factory. One day he finds a notebook from one of the factory workers.",
        "runtimeMinutes": "97"
    },
    "2018_717": {
        "plotSummary": "A personal essay which analyses and compares images of the political upheavals of the 1960s. From the military coup in Brazil to China's Cultural Revolution, from the student uprisings in Paris to the end of the Prague Spring.",
        "runtimeMinutes": "127"
    },
    "2018_718": {
        "plotSummary": "Since the 1940s, alien beings known as \"GRAYS\" have been sighted around the globe with the thought that they visit our planet to study our species and civilization before they eventually invade...but what if we're wrong? What if they are ...See moreSince the 1940s, alien beings known as \"GRAYS\" have been sighted around the globe with the thought that they visit our planet to study our species and civilization before they eventually invade...but what if we're wrong? What if they are only here to protect us? After a meteorite crashes to earth awakening the extraterrestrial creature within, a young woman is abducted by an alien \"GRAY\" to aid in hunting down and destroying the creature, before it can reach a second meteorite that fell to earth decades earlier, unleashing its deadly infestation of earth.See less",
        "runtimeMinutes": "85"
    },
    "2018_719": {
        "plotSummary": "In the war-torn Nuba Mountains of Sudan, American doctor Tom Catena selflessly and courageously serves the needs of a forgotten people, while the region is bombed relentlessly by an indicted war criminal, Omar Al-Bashir. Two things remain ...See moreIn the war-torn Nuba Mountains of Sudan, American doctor Tom Catena selflessly and courageously serves the needs of a forgotten people, while the region is bombed relentlessly by an indicted war criminal, Omar Al-Bashir. Two things remain constant: Dr. Tom's faith and his enduring love for the Nuba people.See less",
        "runtimeMinutes": "85"
    },
    "2018_72": {
        "plotSummary": "Life and intrigue in an ancient Chinese court.",
        "runtimeMinutes": "116"
    },
    "2018_720": {
        "plotSummary": "A young man living a sheltered life develops a crush on an ex-stripper and joins her Alcoholics Anonymous group just so he can be in the same room with her.",
        "runtimeMinutes": "90"
    },
    "2018_721": {
        "plotSummary": "Documentary filmmaker R. Scott Cooper, on a mission to expose the dark side of Christian culture, infiltrates a small group.",
        "runtimeMinutes": "121"
    },
    "2018_722": {
        "plotSummary": "24 Frames is an experimental project made by filmmaker Abbas Kiarostami in the last three years of his life. It is a collection of 24 short four-and-a-half minute films inspired by still images, including paintings and photographs.",
        "runtimeMinutes": "114"
    },
    "2018_723": {
        "plotSummary": "After a deadly encounter with two yakuza, a loser with a crush on his childhood girlfriend goes to heaven and back, embarking on a psychedelic self-discovery experience with her and his friends.",
        "runtimeMinutes": "103"
    },
    "2018_724": {
        "plotSummary": "All his life, Yves dedicated himself to poetry, carrying his suitcase to any couch that would welcome him. When he storms into Dyane's life, a graphic designer who falls for his charms, her son Marc immediately disapproves of this ...See moreAll his life, Yves dedicated himself to poetry, carrying his suitcase to any couch that would welcome him. When he storms into Dyane's life, a graphic designer who falls for his charms, her son Marc immediately disapproves of this eccentric stranger in his mother's bed. But the studious teenager soon finds Yves' rebel ways contagious and begins to explore his own artistic side. Meanwhile, the poet feels increasingly trapped in his new life and decides to sabotage everything in a great outburst. Now alone at the end of the world, he realizes his words no longer mean anything. Freely inspired by the life and work of Quebec poet Yves Boisvert (1950-2012), For Those Who Don't Read Me tells the story of a man's quest for the absolute, fighting not to end up forgotten between two cookbooks.  Written by AnonymousSee less",
        "runtimeMinutes": "107"
    },
    "2018_725": {
        "plotSummary": "A French village doctor becomes the target of poison-pen letters sent to village leaders, accusing him of affairs and practicing abortion.",
        "runtimeMinutes": "92"
    },
    "2018_726": {
        "plotSummary": "The film tells futurist, architect, and inventor R. Buckminster Fuller's incredible story through two teens hoping to get laid, become punk gods, and survive high school.",
        "runtimeMinutes": "85"
    },
    "2018_727": {
        "plotSummary": "A documentary comprised entirely of footage from dashboard cameras from Russian cars.",
        "runtimeMinutes": "67"
    },
    "2018_728": {
        "plotSummary": "Clara, a lonely nurse from the outskirts of São Paulo, is hired by mysterious and wealthy Ana as the nanny for her unborn child. The two women develop a strong bond, but a fateful night changes their plans.",
        "runtimeMinutes": "135"
    },
    "2018_729": {
        "plotSummary": "The film documents Bill Bennett's journey to find the source of a mysterious voice which saved his life. It features some of the world's leading experts on intuition spanning the fields of science, religion, and spirituality.",
        "runtimeMinutes": "83"
    },
    "2018_73": {
        "plotSummary": "After a spoiled, wealthy yacht owner is thrown overboard and loses his memory, a mistreated employee convinces him that he is her working-class husband.",
        "runtimeMinutes": "112"
    },
    "2018_730": {
        "plotSummary": "Holy Hell is the over-the-top, outrageous, sexually-deviant, blood-drenched story of Father Augustus Bane: a priest pushed too far who begins praying to a revolver and hunting down the gangsters who killed his parishioners. In the vein of ...See moreHoly Hell is the over-the-top, outrageous, sexually-deviant, blood-drenched story of Father Augustus Bane: a priest pushed too far who begins praying to a revolver and hunting down the gangsters who killed his parishioners. In the vein of recent alternative horror/comedies like \"Machete\" and \"Hobo with a Shotgun\", HOLY HELL is a modern take on 60's and 70's B-Movie and Exploitation film tropes. The goal of this feature length movie is to break through every limit set by film, taste and reasonable societal behavior: all with anarchic glee.  Written by Ryan LaPlanteSee less",
        "runtimeMinutes": "89"
    },
    "2018_731": {
        "plotSummary": "A disabled Vietnam vet rediscovers the Hawaiian warrior within to protect his family, defend their land, and clear his father's name.",
        "runtimeMinutes": "95"
    },
    "2018_732": {
        "plotSummary": "The lives of an English working-class family are told out of order in a free-associative manner. The first part, \"Distant Voices\", focuses on the father's role in the family. The second part, \"Still Lives\", focuses on his children.",
        "runtimeMinutes": "84"
    },
    "2018_733": {
        "plotSummary": "When the world is threatened by an evil supervillain, a teenager and his mentor team up to stop him.",
        "runtimeMinutes": "89"
    },
    "2018_734": {
        "plotSummary": "Suzanne is forced against her will to take vows as a nun and three mothers superior treat her in radically different ways. Suzanne's virtue brings disaster to everyone in this faithful adaptation of a bitter attack on religious abuses.",
        "runtimeMinutes": "140"
    },
    "2018_735": {
        "plotSummary": "Keith, a twenty-four-year-old newly released from prison and living with his dad under house arrest in Baltimore, is struggling to reestablish himself, within a community scarred by unemployment, neglect, and deeply entrenched segregation.",
        "runtimeMinutes": "101"
    },
    "2018_736": {
        "plotSummary": "When the body of a drifter is discovered the same day a photographer arrives in a small farming community, the local sheriff is left to piece together a string of events that don't quite add up.",
        "runtimeMinutes": "84"
    },
    "2018_737": {
        "plotSummary": "A biographical portrait of Daniel Patrick Moynihan, twentieth century colossus: public intellectual, policy specialist, ambassador and U.S. Senator from New York. The film captures the spirit of Moynihan's remarkable ideas as they evolved ...See moreA biographical portrait of Daniel Patrick Moynihan, twentieth century colossus: public intellectual, policy specialist, ambassador and U.S. Senator from New York. The film captures the spirit of Moynihan's remarkable ideas as they evolved over the course of his tumultuous life in postwar America, featuring both the triumphs and the controversies. A poor boy who grew up on the streets of Depression-era NY to become a Harvard professor, Moynihan devoted his decades-long career -- serving both Democratic and Republican administrations -- to battling poverty. Possessed of a natural wit that appealed to both elite and street, Moynihan remains one of the most widely quoted people of his generation. Moynihan's legacy continues to be claimed by both the left and right, even as he defies easy categorization. The film is an exploration into the heady and boisterous world of ideas that helped shape his complex worldview, and the policy prescriptions that have stood the test of time. At a moment of degraded political discourse, MOYNIHAN re-elevates the debate.See less",
        "runtimeMinutes": "102"
    },
    "2018_738": {
        "plotSummary": "Two misfit brothers hustle cash and chase dreams in the desert. When a mysterious woman threatens to repo their beloved houseboat the brothers cook up an epic con to finally leave their dusty town and sail off on a beam of sunshine to California.",
        "runtimeMinutes": "104"
    },
    "2018_739": {
        "plotSummary": "Turo (25) is trying to overcome his fears by leading the most unknown heavy metal band in Finland, Impaled Rektum, to the hottest metal festival of Norway. The journey includes heavy metal, grave robbing, Viking heaven and an armed ...See moreTuro (25) is trying to overcome his fears by leading the most unknown heavy metal band in Finland, Impaled Rektum, to the hottest metal festival of Norway. The journey includes heavy metal, grave robbing, Viking heaven and an armed conflict between Finland and Norway.See less",
        "runtimeMinutes": "92"
    },
    "2018_74": {
        "plotSummary": "Garden gnomes, Gnomeo (James McAvoy) and Juliet (Emily Blunt), recruit renowned detective Sherlock Gnomes (Johnny Depp) to investigate the mysterious disappearance of other garden ornaments.",
        "runtimeMinutes": "86"
    },
    "2018_740": {
        "plotSummary": "When the girl of a rebelious teenage couple finds out she is being sent away, they both believe escaping the rigid order suffocating them is the only way to be free. But is it?",
        "runtimeMinutes": "95"
    },
    "2018_741": {
        "plotSummary": "A Cuban man cycles through his opinions and memories as the threat of foreign invasion intensifies and the rest of his family moves to Miami.",
        "runtimeMinutes": "97"
    },
    "2018_742": {
        "plotSummary": "During three years of unparalleled violence in Baltimore, CHARM CITY delivers an unexpectedly candid, observational portrait of those left on the frontlines. With grit, fury, and compassion, a group of police, citizens, and government ...See moreDuring three years of unparalleled violence in Baltimore, CHARM CITY delivers an unexpectedly candid, observational portrait of those left on the frontlines. With grit, fury, and compassion, a group of police, citizens, and government officials grapple with the consequences of violence and try to reclaim their future.See less",
        "runtimeMinutes": "108"
    },
    "2018_743": {
        "plotSummary": "In these divided times, religious institutions are losing young members and even closing their doors at an alarming rate. Director Aaron Wolf's personal journey of rediscovery comes alive in Restoring Tomorrow, a universal story of hope as...See moreIn these divided times, religious institutions are losing young members and even closing their doors at an alarming rate. Director Aaron Wolf's personal journey of rediscovery comes alive in Restoring Tomorrow, a universal story of hope as a treasured local temple near demise, is lifted up by a community's determination to achieve the impossible. Wolf's journey explores how when any community puts their mind to it, the impossible becomes possible. Wilshire Boulevard Temple, a Los Angeles treasure built by the original Hollywood moguls, needs to raise millions to restore its majesty and vibrancy, thus also restoring the future of the Jewish community, the greater Los Angeles community-and on a personal level, Wolf himself.  Written by hwpSee less",
        "runtimeMinutes": "82"
    },
    "2018_744": {
        "plotSummary": "Jenny Lamour wants to succeed in music hall. Her husband and accompanist is Maurice Martineau, a nice but jealous man. When he knew Jenny is making eyes at Brignon, an old businessman, in order to get some engagements, he looses his temper...See moreJenny Lamour wants to succeed in music hall. Her husband and accompanist is Maurice Martineau, a nice but jealous man. When he knew Jenny is making eyes at Brignon, an old businessman, in order to get some engagements, he looses his temper and threatens Brignon with death. But Jenny went anyway to a rendez-vous at the old man's, who is murdered the same evening. The criminal investigations are lead by Inspector Antoine...  Written by YepokSee less",
        "runtimeMinutes": "106"
    },
    "2018_745": {
        "plotSummary": "The Amendment is the true and inspiring story of finding triumph over tragedy, injustice and loss. In 1979, Brooks Douglass and his sister Leslie survived a devastating crime that rocked their community and took their parents' lives. ...See moreThe Amendment is the true and inspiring story of finding triumph over tragedy, injustice and loss. In 1979, Brooks Douglass and his sister Leslie survived a devastating crime that rocked their community and took their parents' lives. Initially sent into an emotional tailspin Brooks regained his footing, became Oklahoma's youngest state senator and championed important victim's rights legislation. It is not until his question for ultimate justice brings him face-to-face with his parents' killer that he must reconcile military training with the lessons of his father to discover the path to finally finding peace.See less",
        "runtimeMinutes": "90"
    },
    "2018_746": {
        "plotSummary": "An Italian Countess is allied with Nationalists during the Italian-Austrian war of unification. However, she risks betraying their cause when she falls in love with an Austrian Lieutenant.",
        "runtimeMinutes": "123"
    },
    "2018_747": {
        "plotSummary": "A philosophical investigation into the nature of humanity, art, creativity, being, and purpose. As much a visual poem as a documentary, the film oscillates from present to past and weaving intimate glimpses of the world renowned jazz ...See moreA philosophical investigation into the nature of humanity, art, creativity, being, and purpose. As much a visual poem as a documentary, the film oscillates from present to past and weaving intimate glimpses of the world renowned jazz percussionist's fascinating cosmology with blistering performances from around the globe.  Written by cheller1029See less",
        "runtimeMinutes": "91"
    },
    "2018_748": {
        "plotSummary": "Alex is floating unconscious in a lake when light from a UFO of light saves her by enhancing her abilities such as telekinesis and healing power. Her friend Sean helps her. The authorities want her - not just for stealing a police car.",
        "runtimeMinutes": "90"
    },
    "2018_749": {
        "plotSummary": "Marlina lives quietly in Sumba until one day a man named Markus and his gang try to rob her house and she kills him. Eventually, she is haunted by Markus, and her life turns in 180 degrees. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2018_75": {
        "plotSummary": "Detective Dee is forced to defend himself against the accusations of Empress Wu while investigating a crime spree.",
        "runtimeMinutes": "132"
    },
    "2018_750": {
        "plotSummary": "The Misandrists begins with Volker, a young man with an injured leg, stumbling through the forest, pursued by the police and their tracking dogs. When he emerges from the woods, he sees two young women, Isolde and Hilde, frolicking in a ...See moreThe Misandrists begins with Volker, a young man with an injured leg, stumbling through the forest, pursued by the police and their tracking dogs. When he emerges from the woods, he sees two young women, Isolde and Hilde, frolicking in a field not far from a large old country house. When the beautiful young Isolde realizes that the handsome young man is in trouble with the law, she convinces Hilde to help her hide him in the basement of the house, which happens to be a school for wayward girls. Isolde forces Hilde to agree to keep the young man's presence in the basement hidden from the rest of the household, especially from Big Mother, who runs the school, which is composed of twelve other females: four teachers and eight young women rescued from the streets. It is a lesbian separatist stronghold. Isolde secretly nurses Volker back to health, but does not let him know that the school for girls is also a front for a quasi-terrorist organization called the FLA - the Female Liberation Army - that is willing to go to any lengths to challenge the patriarchy. Meanwhile, we are introduced to all the other girls and women of the house, discovering their backgrounds and their relationships with one another, their beliefs and womanifestos. Several of the members of this radical female tribe are harbouring secrets of their own, which are eventually revealed as the film moves towards its climax: the revelation of a new style of lesbian porn that is to be used as both propaganda tool and calling card for their new brand of female revolution. Blessed be the Goddess of all worlds that has not made me a man.See less",
        "runtimeMinutes": "91"
    },
    "2018_751": {
        "plotSummary": "When a 12 year old girl goes missing, detective Rachel Willow discovers that human trafficking can happen anywhere, even in her small town.",
        "runtimeMinutes": "81"
    },
    "2018_752": {
        "plotSummary": "Lee and Sol are hiding out on a beach in Southern India living a slacker life of sex, drugs and parties. Trouble comes to paradise when Vix, a beautiful girl from Lee's past, turns up. Things get worse when Lee accidentally kills a holy ...See moreLee and Sol are hiding out on a beach in Southern India living a slacker life of sex, drugs and parties. Trouble comes to paradise when Vix, a beautiful girl from Lee's past, turns up. Things get worse when Lee accidentally kills a holy cow and the gang find themselves up against crooked cops, local hoodlums, gangsters.... and mysticism. How far do you have to go to get away?  Written by AnonymousSee less",
        "runtimeMinutes": "85"
    },
    "2018_753": {
        "plotSummary": "From red light districts to lush rain-forests, 'Black Mother' is a loving and lyrical ode to Jamaica and its people, a visual poem that is at once deeply felt love letter and ecstatic street-corner prayer.",
        "runtimeMinutes": "77"
    },
    "2018_754": {
        "plotSummary": "Brazil 1821. A rich cattle herder finds out that his wife dies in labor. Forced to live in the property with numerous African slaves, he marries his wife's niece. But he returns to droving, leaving his wife behind alone with the slaves.",
        "runtimeMinutes": "116"
    },
    "2018_755": {
        "plotSummary": "A lost orphan boy and a giant elephant team up to take down an elephant poaching syndicate. Read more: Synopsis",
        "runtimeMinutes": "87"
    },
    "2018_756": {
        "plotSummary": "During the summer of 1990 in Chile, people begin to feel a growing sense of freedom and three teenagers face their first loves and fears.",
        "runtimeMinutes": "110"
    },
    "2018_757": {
        "plotSummary": "In 2012, Sunday Times war correspondent, Marie Colvin and photographer, Paul Conroy arrived in Syria to tell the story of civilians trapped in Homs, a city under siege and relentless military attack from the Syrian army.",
        "runtimeMinutes": "95"
    },
    "2018_758": {
        "plotSummary": "Two guards fighting through a power breakdown inside the secret 'Death House' prison must fight to survive ruthless inmates and even supernatural horrors.",
        "runtimeMinutes": "95"
    },
    "2018_759": {
        "plotSummary": "Lulu Danger's unsatisfying marriage takes a turn for the worse when a mysterious man from her past comes to town to perform an event called \"An Evening With Beverly Luff Linn; For One Magical Night Only.\"",
        "runtimeMinutes": "108"
    },
    "2018_76": {
        "plotSummary": "A war-hardened Crusader and his Moorish commander mount an audacious revolt against the corrupt English crown.",
        "runtimeMinutes": "116"
    },
    "2018_760": {
        "plotSummary": "When a desperate SOS letter penned by a political prisoner turns up in Halloween decorations sold in Oregon, it sparks a nail-biting chain of events that exposes appalling human rights violations and leads to sweeping labor reform in China.See moreWhen a desperate SOS letter penned by a political prisoner turns up in Halloween decorations sold in Oregon, it sparks a nail-biting chain of events that exposes appalling human rights violations and leads to sweeping labor reform in China.  Written by Hot DocsSee less",
        "runtimeMinutes": "75"
    },
    "2018_761": {
        "plotSummary": "A verite legal drama about Judge Kholoud Al-Faqih, the first woman appointed to a Shari'a court in the Middle East, whose career provides rare insights into both Islamic law and gendered justice.",
        "runtimeMinutes": "76"
    },
    "2018_762": {
        "plotSummary": "Aaron wants to become a family with his girlfriend and her 8-year-old son, but high up in the Italian Dolomites, his attempts to win the boy's acceptance turn into a dangerous power game.",
        "runtimeMinutes": "94"
    },
    "2018_763": {
        "plotSummary": "This is a story about the infinite possibility of love.",
        "runtimeMinutes": "94"
    },
    "2018_764": {
        "plotSummary": "Disturbing collection of 1940s and 1950s United States government-issued propaganda films designed to reassure Americans that the atomic bomb was not a threat to their safety.",
        "runtimeMinutes": "86"
    },
    "2018_765": {
        "plotSummary": "While backpacking around America, two Aussie girls find themselves deep in turtle racing debt. They devise crafty schemes to earn money any way they can while unwittingly becoming tangled in a dark mystery surrounding their family's past.",
        "runtimeMinutes": "93"
    },
    "2018_766": {
        "plotSummary": "What makes a woman swipe right for Mr. Wrong? Sofía Vergara and Whitney Cummings star in this fresh, witty look at the science behind our romantic missteps.",
        "runtimeMinutes": "98"
    },
    "2018_767": {
        "plotSummary": "A documentary about discriminatory hiring practices concerning women directors in Hollywood, and an inspiring conversation with those who have succeeded against all odds.",
        "runtimeMinutes": "94"
    },
    "2018_768": {
        "plotSummary": "Paranoia & Superstition in 15th Century Europe.",
        "runtimeMinutes": "102"
    },
    "2018_769": {
        "plotSummary": "Tyler, a sole black man, attends an otherwise all-white weekend of drunken bro debauchery on a birthday trip to a cabin in the Catskills.",
        "runtimeMinutes": "86"
    },
    "2018_77": {
        "plotSummary": "The inspiring and unknown true story behind MercyMe's beloved, chart topping song that brings ultimate hope to so many is a gripping reminder of the power of true forgiveness.",
        "runtimeMinutes": "110"
    },
    "2018_770": {
        "plotSummary": "After being stabbed with an ancient, germ-infested knife, a doctor's assistant finds himself with an insatiable desire for blood.",
        "runtimeMinutes": "110"
    },
    "2018_771": {
        "plotSummary": "Twenty-one year old Tracy walks in on her boyfriend Mark having sex with a man and decides to leave him. After assessing her limited options, she returns to Mark with a deal-if he agrees to marry her, she'll forget the incident ever ...See moreTwenty-one year old Tracy walks in on her boyfriend Mark having sex with a man and decides to leave him. After assessing her limited options, she returns to Mark with a deal-if he agrees to marry her, she'll forget the incident ever happened. Mark accepts her terms, but neither fully understands the sacrifices they have to make. As their relationship deteriorates, Tracy's world opens up when she befriends the quirky residents in her Los Feliz neighborhood: Sebastian, a troubled recluse who closed the door to society after being bitten by a poisonous spider; Luann, a former child star and true free spirit; Krista, Mark's hard-charging talent manager; Jonathan, a gay magazine reporter; and Ricky, a hot Mexican with a failing food truck. As Tracy discovers her sense of self and true passion for cooking, she is a catalyst that forces them all to grow and connect in unforeseen ways.See less",
        "runtimeMinutes": "87"
    },
    "2018_772": {
        "plotSummary": "The life of a high school girl in Iran becomes more complicated after her mother catches her in an act of rebellion.",
        "runtimeMinutes": "102"
    },
    "2018_773": {
        "plotSummary": "A documentary murder mystery about the filmmaker's family, set in lower Alabama.",
        "runtimeMinutes": "90"
    },
    "2018_774": {
        "plotSummary": "Follows the story of teenager Billy Bloom who, despite attending an ultra conservative high school, makes the decision to run for homecoming queen.",
        "runtimeMinutes": "91"
    },
    "2018_775": {
        "plotSummary": "A young girl and an old man are the only ones in a village who believe the old stories about dragons, and then a dragon arrives.",
        "runtimeMinutes": "70"
    },
    "2018_776": {
        "plotSummary": "Father Gabriele Amorth performs his ninth exorcism on an Italian woman.",
        "runtimeMinutes": "68"
    },
    "2018_777": {
        "plotSummary": "A woman at rock bottom must find her way across Los Angeles in order to crash her ex-boyfriend's engagement party.",
        "runtimeMinutes": "86"
    },
    "2018_778": {
        "plotSummary": "Set in a parallel universe entering a black hole, a woman reading the book of Revelation has visions of regeneration during Anthropocene.",
        "runtimeMinutes": "90"
    },
    "2018_779": {
        "plotSummary": "The young toolmaker Jochen fights with his colleagues to a performance bonus. He gets to know the girl Marion. For both, it is love at first sight.",
        "runtimeMinutes": "476"
    },
    "2018_78": {
        "plotSummary": "In a post-apocalyptic world where cities ride on wheels and consume each other to survive, two people meet in London and try to stop a conspiracy.",
        "runtimeMinutes": "128"
    },
    "2018_780": {
        "plotSummary": "The lives of Pomme, an aspiring singer, and Suzanne, a struggling mother, as they search for their own identity in 1970s France.",
        "runtimeMinutes": "120"
    },
    "2018_781": {
        "plotSummary": "Russian president Vladimir Putin attacks the 2016 American presidential election in collaboration with the Trump campaign. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2018_782": {
        "plotSummary": "A spy navigates the precarious terrain of love and survival during an undercover mission in Syria.",
        "runtimeMinutes": "93"
    },
    "2018_783": {
        "plotSummary": "An ex-con tries to get back custody of her son with the help of an idealistic young public defender and at the same time falls into a romantic fling with a traumatized former US soldier.",
        "runtimeMinutes": "95"
    },
    "2018_784": {
        "plotSummary": "In a poor Estonian village, a group of peasants use magic and folk remedies to survive the winter, and a young woman tries to get a young man to love her.",
        "runtimeMinutes": "115"
    },
    "2018_785": {
        "plotSummary": "Before he was chairman of the board. He was just a man, desperate for a woman, clinging to a dream. The story of Sinatra as never told before and Ava Gardner, the woman who saved him, by breaking him. Based on true stories.",
        "runtimeMinutes": "110"
    },
    "2018_786": {
        "plotSummary": "A group of brave NYPD officers risk it all to expose the truth about illegal quota practices in police departments.",
        "runtimeMinutes": "112"
    },
    "2018_787": {
        "plotSummary": "On his deathbed, the reigning king bestows power to an unexpected heir who must find strength within himself to unite his people against the violent crusades which threaten their freedom.",
        "runtimeMinutes": "114"
    },
    "2018_788": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2018_789": {
        "plotSummary": "After being whisked away to Los Angeles by a handsome Hollywood star, Katie is left alone in his apartment, where strange and scary things begin to happen.",
        "runtimeMinutes": "90"
    },
    "2018_79": {
        "plotSummary": "An elite unit of the LA County Sheriff's Dept. and the state's most successful bank robbery crew clash as the outlaws plan a seemingly impossible heist on the Federal Reserve Bank.",
        "runtimeMinutes": "140"
    },
    "2018_790": {
        "plotSummary": "When two siblings undertake an archaeological excavation of their late grandmother's house, they embark on a magical-realist journey in search of what life remains in the objects we leave behind.",
        "runtimeMinutes": "94"
    },
    "2018_791": {
        "plotSummary": "During World War I, a British private, sent ahead to a French town to scout for enemy presence, is mistaken for a King by the colorful patients of an insane asylum.",
        "runtimeMinutes": "102"
    },
    "2018_792": {
        "plotSummary": "Batman is wrongly implicated in a series of murders of mob bosses actually done by a new vigilante assassin.",
        "runtimeMinutes": "76"
    },
    "2018_793": {
        "plotSummary": "The life and music of Johann Sebastian Bach as presented by his wife, Anna.",
        "runtimeMinutes": "94"
    },
    "2018_794": {
        "plotSummary": "After 40 years of running their community arts space, The Bread Factory, Dorothea and Greta are suddenly fighting for survival when a celebrity couple--performance artists from China--come to Checkford and build an enormous complex down ...See moreAfter 40 years of running their community arts space, The Bread Factory, Dorothea and Greta are suddenly fighting for survival when a celebrity couple--performance artists from China--come to Checkford and build an enormous complex down the street catapulting big changes in their small town.See less",
        "runtimeMinutes": "122"
    },
    "2018_795": {
        "plotSummary": "REVIVAL is hybrid of every film idiom: Broadway musical, Hollywood musical, animation, green screen technology, and sound stage. Revival is the hippest experience of The Gospel the world has yet seen.",
        "runtimeMinutes": "105"
    },
    "2018_796": {
        "plotSummary": "Adapted from Waki Yamato's popular manga, Haikara-San is a heartfelt, and sometimes comical, tale of love surviving through the perils of war and separation.",
        "runtimeMinutes": "97"
    },
    "2018_797": {
        "plotSummary": "Chance events trap hitch-hiker Al Roberts in a tightening net of film noir trouble.",
        "runtimeMinutes": "68"
    },
    "2018_798": {
        "plotSummary": "The Dekkoo-original series 'OUT On Stage' is a hilarious, one-of-a-kind comedy series hosted by Zach Noe Towers - OUT Magazine's \"One of the 10 comedians to watch in 2018\". Experience the party when Zach and 16 other top-rated Gay and ...See moreThe Dekkoo-original series 'OUT On Stage' is a hilarious, one-of-a-kind comedy series hosted by Zach Noe Towers - OUT Magazine's \"One of the 10 comedians to watch in 2018\". Experience the party when Zach and 16 other top-rated Gay and Lesbian stand-up comedians discuss taboo subjects as only they can.See less",
        "runtimeMinutes": null
    },
    "2018_799": {
        "plotSummary": "After losing big, an aging gambler decides to assemble a team to rob a casino.",
        "runtimeMinutes": "98"
    },
    "2018_8": {
        "plotSummary": "Ethan Hunt and his IMF team, along with some familiar allies, race against time after a mission gone wrong.",
        "runtimeMinutes": "147"
    },
    "2018_80": {
        "plotSummary": "A grieving family is haunted by tragic and disturbing occurrences.",
        "runtimeMinutes": "127"
    },
    "2018_800": {
        "plotSummary": "Therese is a nun-in-training who returns to \"civilian\" life to care for her young sister Denise.",
        "runtimeMinutes": "104"
    },
    "2018_801": {
        "plotSummary": "A stylish, sexy film about a young man's journey into an unusual form of escort work, set in an imaginary vision of London's Soho.",
        "runtimeMinutes": "90"
    },
    "2018_802": {
        "plotSummary": "Award-winning filmmaker Dome Karukoski brings to screen the life and work of artist Touko Valio Laaksonen (aka Tom of Finland), one of the most influential and celebrated figures of twentieth century gay culture.",
        "runtimeMinutes": "117"
    },
    "2018_803": {
        "plotSummary": "Against the backdrop of her provocative and inventive performance, Narcissister reflects on the personal impact of her mother's illness and death.",
        "runtimeMinutes": "91"
    },
    "2018_804": {
        "plotSummary": "As an entire generation has come of age on social media, virtual relationships are slowly replacing real-life human connections. And China has taken it to an extreme. Here, live streaming has become the most popular online entertainment ...See moreAs an entire generation has come of age on social media, virtual relationships are slowly replacing real-life human connections. And China has taken it to an extreme. Here, live streaming has become the most popular online entertainment for hundreds of millions. People's Republic of Desire provides a verite journey into this digital universe, where young performers earn as much as US$150,000 a month singing, dancing or doing talk shows to live, interactive audiences of tens of thousands. Their fans include China's super rich, who each night lavish virtual gifts on their favorite performers (40% of the money paid for these gifts go to the performers), and the dirt poor, many of them migrant workers in urban areas searching for a cheap way to be entertained, to feel connected. The film follows three young characters - a singer, a comedian, and a migrant worker - as they search for fame, fortune and human connection in live streaming. We also meet their families, those managing the online talents, and those with money who control the fate of these talents, behind the scenes much like the Wizard of Oz. The story culminates in the bizarre annual online idol competition, in which the rich can buy unlimited amount of votes for their favorite performers. There our characters realize that money alone pulls the strings in this virtual universe, and human connection and personal happiness remain as illusive online as-perhaps even more so than- in our real and broken world.See less",
        "runtimeMinutes": "95"
    },
    "2018_805": {
        "plotSummary": "TRUST MACHINE is the first blockchain-funded, blockchain-distributed, and blockchain-focused documentary, from entertainment tech company SingularDTV and Futurism Studios. The feature documentary explores the evolution of cryptocurrency, ...See moreTRUST MACHINE is the first blockchain-funded, blockchain-distributed, and blockchain-focused documentary, from entertainment tech company SingularDTV and Futurism Studios. The feature documentary explores the evolution of cryptocurrency, blockchain and decentralization, including the technology's role in addressing important real-world problems, such as world hunger and income inequality.  Written by anonymousSee less",
        "runtimeMinutes": "84"
    },
    "2018_806": {
        "plotSummary": "Hillary Clinton, Roberto Saviano, Jonathan Franzen and others weigh-in on the Elena Ferrante \"craze\" and what makes her work - and her mysterious persona - so uniquely captivating.",
        "runtimeMinutes": "74"
    },
    "2018_807": {
        "plotSummary": "The story of PiL, the groundbreaking band form by John Lydon after the collapse of The Sex Pistols in 1978.",
        "runtimeMinutes": "105"
    },
    "2018_808": {
        "plotSummary": "An aging former movie star is forced to face the reality that his glory days are behind him. On its surface, the film is a tale about faded fame. At its core, it's a universal story about growing old.",
        "runtimeMinutes": "94"
    },
    "2018_809": {
        "plotSummary": "Two rival record collectors attempt to con an old lady out of a rare, but cursed, 1930s Blues record. When a series of unfortunate circumstances lands them in jail, the feud festers for over twenty years until they are released from prison...See moreTwo rival record collectors attempt to con an old lady out of a rare, but cursed, 1930s Blues record. When a series of unfortunate circumstances lands them in jail, the feud festers for over twenty years until they are released from prison and get a second chance at snagging the vinyl, this time from a more formidable foe.See less",
        "runtimeMinutes": "77"
    },
    "2018_81": {
        "plotSummary": "A small group of former classmates organize an elaborate, annual game of tag that requires some to travel all over the country.",
        "runtimeMinutes": "100"
    },
    "2018_810": {
        "plotSummary": "Patients suffering from cancer, and their families, struggle against mean-spirited legislation, and the proclaimed goal of Attorney General Jeff Sessions to roll back marijuana reforms in states such as California.",
        "runtimeMinutes": "97"
    },
    "2018_811": {
        "plotSummary": "A swindler's activity indirectly caused a political crisis in France in the last years before World War II.",
        "runtimeMinutes": "120"
    },
    "2018_812": {
        "plotSummary": "Filmmaker Emily Railsback and award-winning sommelier Jeremy Quinn provide intimate access to rural family life in the Republic of Georgia as they explore the rebirth of 8,000-year-old winemaking traditions almost lost during the period of...See moreFilmmaker Emily Railsback and award-winning sommelier Jeremy Quinn provide intimate access to rural family life in the Republic of Georgia as they explore the rebirth of 8,000-year-old winemaking traditions almost lost during the period of Soviet rule. By using unobtrusive iPhone technology, Railsback brings the voices and ancestral legacies of modern Georgians directly to the viewer, revealing an intricate and resilient society that has survived regular foreign invasion and repeated attempts to erase Georgian culture. The revival of traditional winemaking is the central force driving this powerful, independent and autonomous nation to find its 21st century identity.  Written by Morgan Station FIlmsSee less",
        "runtimeMinutes": "78"
    },
    "2018_813": {
        "plotSummary": "A young woman sets out on a crime spree that she broadcasts on social media.",
        "runtimeMinutes": "80"
    },
    "2018_814": {
        "plotSummary": "A film that reveals the unsettling truth about Australia's love-hate relationship with its beloved icon.",
        "runtimeMinutes": "103"
    },
    "2018_815": {
        "plotSummary": "Bernie Sanders inspired a generation - but who inspired him? This is the passionate, thoughtful biography of the founder of the American Socialist Party, five-time presidential candidate and the only presidential candidate in US history to...See moreBernie Sanders inspired a generation - but who inspired him? This is the passionate, thoughtful biography of the founder of the American Socialist Party, five-time presidential candidate and the only presidential candidate in US history to be imprisoned for his campaign platform. The values with which lived his life and fought for social and economic justice remain in short supply today.See less",
        "runtimeMinutes": "97"
    },
    "2018_816": {
        "plotSummary": "Talal Derki returns to his homeland where he gains the trust of a radical Islamist family, sharing their daily life for over two years.",
        "runtimeMinutes": "99"
    },
    "2018_817": {
        "plotSummary": "A 65-year-old single artist living in New York City has a good life: a stable teaching job, successful friends, and a loyal, aging dog named Bing. As her dream of a respectable place in the art world becomes more elusive, her frustration ...See moreA 65-year-old single artist living in New York City has a good life: a stable teaching job, successful friends, and a loyal, aging dog named Bing. As her dream of a respectable place in the art world becomes more elusive, her frustration with her lack of recognition feels alarmingly urgent.See less",
        "runtimeMinutes": "86"
    },
    "2018_818": {
        "plotSummary": "A man searches for answers to Donald Trump's widespread support before the 2016 presidential election.",
        "runtimeMinutes": "90"
    },
    "2018_819": {
        "plotSummary": "A 13-part documentary mini-series (directed by Chris Marker) on the significance of ancient Greek culture in the creation of the modern Western Civilization.",
        "runtimeMinutes": "340"
    },
    "2018_82": {
        "plotSummary": "Sanju is a biopic of the controversial life of actor Sanjay Dutt: his film career, jail sentence and personal life.",
        "runtimeMinutes": "155"
    },
    "2018_820": {
        "plotSummary": "The Most Unknown is an epic documentary film that sends nine scientists to extraordinary parts of the world to uncover unexpected answers to some of humanity's biggest questions. How did life begin? What is time? What is consciousness? How...See moreThe Most Unknown is an epic documentary film that sends nine scientists to extraordinary parts of the world to uncover unexpected answers to some of humanity's biggest questions. How did life begin? What is time? What is consciousness? How much do we really know? By introducing researchers from diverse backgrounds for the first time, then dropping them into new, immersive field work they previously hadn't tackled, the film reveals the true potential of interdisciplinary collaboration, pushing the boundaries of how science storytelling is approached. What emerges is a deeply human trip to the foundations of discovery and a powerful reminder that the unanswered questions are the most crucial ones to pose. Directed by Emmy-nominated and Peabody Award-winning filmmaker Ian Cheney (The Search for General Tso, The City Dark) and advised by world-renowned filmmaker Werner Herzog (Fitzcarraldo, Aguirre, The Wrath of God, Grizzly Man), The Most Unknown is an ambitious look at a side of science never before shown on screen. The film was made possible by a grant from Science Sandbox, a Simons Foundation initiative dedicated to engaging everyone with the process of science.See less",
        "runtimeMinutes": "92"
    },
    "2018_821": {
        "plotSummary": "A sumptuous Sundance doc depicting the Long Island birthplace of stock car racing where only one track remains. Located on prime real estate, the real tors are circling. The property is worth millions and only the love and integrity of the...See moreA sumptuous Sundance doc depicting the Long Island birthplace of stock car racing where only one track remains. Located on prime real estate, the real tors are circling. The property is worth millions and only the love and integrity of the track's community and elderly owners keep the bulldozers at bay. Stunning cinematography immerses us in the intimate world of grassroots racing, at a time when its future is in the balance. Can this great blue collar American pastime survive?See less",
        "runtimeMinutes": "75"
    },
    "2018_822": {
        "plotSummary": "When Michel, who's 22, tells his parents he is in love, his mother Yvonne is distraught, believing she will lose his love (which is the center of her life), and his father Georges is distressed because it is Georges' mistress, Madeleine, ...See moreWhen Michel, who's 22, tells his parents he is in love, his mother Yvonne is distraught, believing she will lose his love (which is the center of her life), and his father Georges is distressed because it is Georges' mistress, Madeleine, who his son loves. Yvonne and Georges financially and emotionally depend on Michel's maiden aunt, Leo, who was once engaged to Georges but gave him up to her sister. Leo resolves to help them separate Michel and Madeleine, choreographs an elaborate meeting at Madeleine's flat where Georges concocts a lie that Madeleine feels she must embrace, and the lovers part. Aunt Leo then has a change of heart and tries to put everything right.  Written by See less",
        "runtimeMinutes": "105"
    },
    "2018_823": {
        "plotSummary": "A 16-year-old girl and her extended family are left reeling after her calculating grandmother unveils an array of secrets on her deathbed.",
        "runtimeMinutes": "95"
    },
    "2018_824": {
        "plotSummary": "The film explores life in India - both British and Indian - in the 50 years leading up to Independence in 1947.",
        "runtimeMinutes": "72"
    },
    "2018_825": {
        "plotSummary": "Hopes and love and ambitions and friendship in a group of young jazz-loving Parisians.",
        "runtimeMinutes": "112"
    },
    "2018_826": {
        "plotSummary": "An action/thriller set in 1977 about four friends who reunite for a bachelor party to hunt for buried Prohibition money on Kentucky's Bluegrass Bourbon Trail, only to become ripped apart by greed, corruption, and murder.",
        "runtimeMinutes": "98"
    },
    "2018_827": {
        "plotSummary": "A group of friends stumble upon a mirror that serves as a portal to a \"multiverse\", but soon discover that importing knowledge from the other side in order to better their lives brings increasingly dangerous consequences.",
        "runtimeMinutes": "104"
    },
    "2018_828": {
        "plotSummary": "A picaresque chronicle of Laura, a peasant maid, and Sebastian, the young orphan in her charge, against a backdrop of overflowing passion and revolutionary intrigue in Europe at the twilight of the 18th century.",
        "runtimeMinutes": "113"
    },
    "2018_829": {
        "plotSummary": "In this Derek Jarman version of Christopher Marlowe's Elizabethan drama, in modern costumes and settings, Plantagenet king Edward II hands the power-craving nobility the perfect excuse by taking as lover besides his diplomatic wife, the ...See moreIn this Derek Jarman version of Christopher Marlowe's Elizabethan drama, in modern costumes and settings, Plantagenet king Edward II hands the power-craving nobility the perfect excuse by taking as lover besides his diplomatic wife, the French princess Isabel, not an acceptable lady at court but the ambitious Piers Gaveston, who uses his favor in bed even to wield political influence - the stage is set for a palace revolt which sends the gay pair from the throne to a terminal torture dungeon.  Written by KGF VissersSee less",
        "runtimeMinutes": "87"
    },
    "2018_83": {
        "plotSummary": "The story of Dick Cheney, an unassuming bureaucratic Washington insider, who quietly wielded immense power as Vice President to George W. Bush, reshaping the country and the globe in ways that we still feel today.",
        "runtimeMinutes": "132"
    },
    "2018_830": {
        "plotSummary": "Two high school outsiders join forces in an attempt to overtake the local school board. Guided by their families, they enter the perilous word of politics and, in the process, learn a thing or two about love.",
        "runtimeMinutes": "108"
    },
    "2018_831": {
        "plotSummary": "Documentary about Miriam Makeba.",
        "runtimeMinutes": "90"
    },
    "2018_832": {
        "plotSummary": "THE ADVOCATES is a sweeping look at the history and causes of Los Angeles' current homeless crisis, and an intimate view of the tireless work of advocates who strive to create better lives for their homeless clients.",
        "runtimeMinutes": "87"
    },
    "2018_833": {
        "plotSummary": "With 18 Michelin stars, Alain Ducasse creates restaurants for our times, builds schools and pushes the boundaries of his profession. This public, yet secretive man agreed to be followed for 2 years, thereby revealing his evolving universe.",
        "runtimeMinutes": "84"
    },
    "2018_834": {
        "plotSummary": "Perhaps Europe's most popular pilgrimage, the Camino de Santiago attracts wayfarers of all stripes to walk its ancient paths in search of meaning. One such pilgrim is Dane Johansen, an American cellist who in 2014 ventured to walk the ...See morePerhaps Europe's most popular pilgrimage, the Camino de Santiago attracts wayfarers of all stripes to walk its ancient paths in search of meaning. One such pilgrim is Dane Johansen, an American cellist who in 2014 ventured to walk the Camino with his instrument on his back, performing music for his fellow pilgrims along the way. As Dane soon discovers, the paths we travel through life are often uncomfortably magnified by the reality of life on the Camino. Accompanied by the vast landscapes of Northern Spain, the haunting music of J.S. Bach for solo cello (performed by Johansen), and the very personal struggles and joys of the many pilgrims encountered along the way, Strangers on the Earth examines the physical, mental and spiritual aspects of the concept of 'journey' and the vital role it can play as part of the human experience.See less",
        "runtimeMinutes": "96"
    },
    "2018_835": {
        "plotSummary": "An immersive experience of the Sonoran Desert on the U.S.-Mexico border.",
        "runtimeMinutes": "94"
    },
    "2018_836": {
        "plotSummary": "Based on the Step Up franchise, the series tells the story of the students and teachers at High Water Performing Arts School in Atlanta.",
        "runtimeMinutes": "50"
    },
    "2018_837": {
        "plotSummary": "Nuke is a regular city elephant with a boring desk job yearning for great space adventures. When Nuke joins forces with rogue warrior Squeeze Whistle, a fearless space squirrel, they set off on a fur-raising adventure to rescue a princess ...See moreNuke is a regular city elephant with a boring desk job yearning for great space adventures. When Nuke joins forces with rogue warrior Squeeze Whistle, a fearless space squirrel, they set off on a fur-raising adventure to rescue a princess and stop an evil mouse intent on taking over the galaxy.See less",
        "runtimeMinutes": "70"
    },
    "2018_838": {
        "plotSummary": "Today, you're more likely to go to prison in the United States than anywhere else in the world. So in the unfortunate case it should happen to you - this is the Survivors Guide to Prison.",
        "runtimeMinutes": "102"
    },
    "2018_839": {
        "plotSummary": "When Ryder's dream girl Siobhan returns to school he tries to win her heart until his efforts fail and he hits rock bottom, it's then that he realizes his true love has been there all along.",
        "runtimeMinutes": "98"
    },
    "2018_84": {
        "plotSummary": "Four women with nothing in common except a debt left behind by their dead husbands' criminal activities take fate into their own hands and conspire to forge a future on their own terms.",
        "runtimeMinutes": "129"
    },
    "2018_840": {
        "plotSummary": "Based on real life events, Summer of '67 brings to life the turbulent times of the sixties and the struggles faced by the men and women impacted by the Vietnam War. Young wife and mother Milly (Rachel Schrey) is forced to live with her ...See moreBased on real life events, Summer of '67 brings to life the turbulent times of the sixties and the struggles faced by the men and women impacted by the Vietnam War. Young wife and mother Milly (Rachel Schrey) is forced to live with her mother-in-law while her husband Gerald (Cameron Gilliam) is away on the USS Forrestal. Kate (Bethany Davenport) must choose between Peter (Christopher Dalton) her high school sweetheart and Van (Sam Brooks) her new hippie boyfriend. Ruby Mae (Sharonne Lanier) finally finds true love with Reggie (Jerrold Edwards) only to have him whisked away by the draft. Each woman faces the question of whether or not their man will return, and even if he does, will life as they know it ever be the same?See less",
        "runtimeMinutes": "83"
    },
    "2018_841": {
        "plotSummary": "An unfiltered look in to the lives of 3 characters surviving amongst the most recent cycle of conflict in the Democratic Republic of Congo, otherwise known as the M23 rebellion.See moreAn unfiltered look in to the lives of 3 characters surviving amongst the most recent cycle of conflict in the Democratic Republic of Congo, otherwise known as the M23 rebellion.  Written by AnonymousSee less",
        "runtimeMinutes": "93"
    },
    "2018_842": {
        "plotSummary": "After having moved to France, Fuad works night shifts at a museum for Egyptian culture. During long nights, he is repeatedly drawn to a statue representing the seductive ancient goddess Ishtar and becomes allured by her visions.",
        "runtimeMinutes": "90"
    },
    "2018_843": {
        "plotSummary": "When an inmate is granted one weekend out of prison to see her dying mother, a rookie correction officer struggles to keep her under control.",
        "runtimeMinutes": "83"
    },
    "2018_844": {
        "plotSummary": "A look at the rise of anti-Semitism and assaults against Jews in present-day France.",
        "runtimeMinutes": "79"
    },
    "2018_845": {
        "plotSummary": "A scholar, tasked to copy a sutra, meets with a mysterious old lady and her daughter in the mountains.",
        "runtimeMinutes": "192"
    },
    "2018_846": {
        "plotSummary": "Four interviews done in the 1970s with women who survived the Holocaust.",
        "runtimeMinutes": "273"
    },
    "2018_847": {
        "plotSummary": "The development of the American skyscraper, starting in the late 19th century, in Chicago and then New York, centers on the conflict between architects Daniel Burnham and Louis Sullivan.",
        "runtimeMinutes": "79"
    },
    "2018_848": {
        "plotSummary": "Henry Long desperately seeks a cure for the condition that leaves him unable to feel physical pain.",
        "runtimeMinutes": "81"
    },
    "2018_849": {
        "plotSummary": "The lives of a street punk, a millennial couple, and a Salvadoran teenager being recruited by a local gang collide, forming an interlocking story of class and identity in Echo Park, Los Angeles.",
        "runtimeMinutes": "82"
    },
    "2018_85": {
        "plotSummary": "The drug war on the U.S.-Mexico border has escalated as the cartels have begun trafficking terrorists across the US border. To fight the war, federal agent Matt Graver re-teams with the mercurial Alejandro.",
        "runtimeMinutes": "122"
    },
    "2018_850": {
        "plotSummary": "Directed by Hava Beller an 85-year-old, female, Oscar-nominated filmmaker, whose two prior films took her each over a decade to make. This one took even longer. She has a very distinct eye and style. The film explores the ongoing ...See moreDirected by Hava Beller an 85-year-old, female, Oscar-nominated filmmaker, whose two prior films took her each over a decade to make. This one took even longer. She has a very distinct eye and style. The film explores the ongoing Palestinian/Jewish conflict in the Middle East, it does not take the rose tinted view that \"if they can build a bridge/perform a play/ work side by side in a hospital - that peace should not be impossible.\" This longitudinal study is a far more immersive, tough, authentic and keenly observed work than the scores we have all see before by exploring the lives of young people born into a life that is lived right on the conflict zone.  Written by Film Sales Corp.See less",
        "runtimeMinutes": "120"
    },
    "2018_851": {
        "plotSummary": "Two women, who are dissatisfied with the dishonesty they see in dating and relationships, decide to make a pact to spend 24 hours together hoping to find a new way to create intimacy.",
        "runtimeMinutes": "93"
    },
    "2018_852": {
        "plotSummary": "A 1950's Howard Hughes employee-confidante, George Van Tassel, uses alien guidance and Nikola Tesla's ideas to build a time machine -- The Integratron. Is he deluded, or could it actually work? As waves of devotees join him in the ...See moreA 1950's Howard Hughes employee-confidante, George Van Tassel, uses alien guidance and Nikola Tesla's ideas to build a time machine -- The Integratron. Is he deluded, or could it actually work? As waves of devotees join him in the California desert, the FBI gets involved fearing insurrection and possibly more. Nearing completion, Van Tassel's tale and the Integratron meet an unexpected end: the \"workings\" of the dome finally emerge. The unusual story is told by historians, astronomers and current residents of Joshua Tree, including the stewards of the Integratron, the Karl Sisters, and a galaxy of believers and skeptics alike.See less",
        "runtimeMinutes": "74"
    },
    "2018_853": {
        "plotSummary": "The camera delves into the lives of local whalers, global activists and an American journalist in the \"whale and dolphin killing town\" of Taiji, Japan, revealing not everything is as black and white as it seems.",
        "runtimeMinutes": "97"
    },
    "2018_854": {
        "plotSummary": "The Ötztal Alps, more than 5300 years ago. A Neolithic clan has settled near a creek. It is their leader Kelab's responsibility to be the keeper of the group's holy shrine Tineka. While Kelab is hunting, the settlement is attacked.",
        "runtimeMinutes": "96"
    },
    "2018_855": {
        "plotSummary": "Dylan Derringer, a lonely dentist in Florida, is confronted by a figure from the past bringing news that sends him on an eventful and ultimately life-altering journey of discovery.",
        "runtimeMinutes": "91"
    },
    "2018_856": {
        "plotSummary": "This documentary explores the life of Dr. Martin Luther King Jr. and his impact on civil rights through present day.",
        "runtimeMinutes": "95"
    },
    "2018_857": {
        "plotSummary": "After suffering a heart attack, a world famous, hard-drinking actor is forced to drive cross country with his estranged son (who testified against him in his parents' divorce) on one last madcap adventure.",
        "runtimeMinutes": "97"
    },
    "2018_858": {
        "plotSummary": "Two strangers spark romance through their unusual habit.",
        "runtimeMinutes": "77"
    },
    "2018_859": {
        "plotSummary": "Cuban Food Stories is a documentary that follows the various culinary delights made in Cuba, often showing how they're made.",
        "runtimeMinutes": "82"
    },
    "2018_86": {
        "plotSummary": "After his 16-year-old daughter goes missing, a desperate father breaks into her laptop to look for clues to find her.",
        "runtimeMinutes": "102"
    },
    "2018_860": {
        "plotSummary": "When Jon returns on his first trip home from college, he inadvertently triggers events that inspire him to embark on an auspicious journey through the night to return a lost locket.",
        "runtimeMinutes": "90"
    },
    "2018_861": {
        "plotSummary": "A guilt-ridden man who blames himself for the accidental death of his only child meets a mysterious beautiful woman in the same remote town where the fateful car crash occurred. There is a spark between them. But she carries a dark past.",
        "runtimeMinutes": "83"
    },
    "2018_862": {
        "plotSummary": "A young man disappears amid talk of violence and demagoguery, leaving behind an obscure cache of letters, postcards, and notebooks.",
        "runtimeMinutes": "60"
    },
    "2018_863": {
        "plotSummary": "Pop surrealism meets satirical melodrama, The Texture of Falling is unlike any film that you've ever seen. It transcends genre and defies classification. It follows Louisa (Julie Webb) as a filmmaker reeling from a recent professional ...See morePop surrealism meets satirical melodrama, The Texture of Falling is unlike any film that you've ever seen. It transcends genre and defies classification. It follows Louisa (Julie Webb) as a filmmaker reeling from a recent professional dejection, who meets Luke (Patrick Green), a pianist experiencing his own artistic crisis. Despite a long-term relationship with Ati, (Donny Persons), Louisa is intrigued by Luke. As Louisa falls for him, her skepticism of romantic love begins to unravel as she surrenders to her passions. But as Louisa and Luke's romance blooms, a simultaneous story arises as Michael (Benjamin Farmer), a wayward architect estranged from his wife, meets Sylvia, an enigmatic painter. But are these parallels merely a coincidence? Soon Michael and Sylvia embark on a verboten journey of pleasure and pain. But who is Sylvia? As Michael's lust crescendos, he realizes that he has chosen the elusive. In The Texture of Falling, nothing is what it seems. From its opening shot to its startling climax, the film inverts all expectations. Marking the audacious, unforgettable debut of its writer-director-actor, Maria Allred, it is a visual tour-de-force. It asks what is real and what is artifice. Where do our fantasies end and our passions begin?  Written by William BoydSee less",
        "runtimeMinutes": "75"
    },
    "2018_864": {
        "plotSummary": "A childless, single, broke, stoner attempts to salvage her failing business and love life while falling in love for the first time with a married man.",
        "runtimeMinutes": "90"
    },
    "2018_865": {
        "plotSummary": "\"An L.A. Minute\" is a satirical look at fame, success, the star-making machinery and the karma that attaches to all those who worship at the altar of Celebrity. Best-selling author Ted Gold faces a moral dilemma when Velocity, an ...See more\"An L.A. Minute\" is a satirical look at fame, success, the star-making machinery and the karma that attaches to all those who worship at the altar of Celebrity. Best-selling author Ted Gold faces a moral dilemma when Velocity, an avant-garde performance artist and the living embodiment of integrity, rocks his 1% world.See less",
        "runtimeMinutes": "86"
    },
    "2018_866": {
        "plotSummary": "For Serbian filmmaker Mila Turajlic, a locked door in her mother's apartment in Belgrade provides the gateway to both her remarkable family history and her country's tumultuous political inheritance.",
        "runtimeMinutes": "100"
    },
    "2018_867": {
        "plotSummary": "Two guys serendipitously meet at a time when they both find themselves at personal crossroads and decide to embark on an unplanned road trip across the American Southwest.",
        "runtimeMinutes": "90"
    },
    "2018_868": {
        "plotSummary": "Joel (Alessandro Nivola) lives a solitary existence, rarely straying from his narrow routines of working in a landfill and going through the motions of getting through the day. He faces emotional and psychological upheaval with the arrival...See moreJoel (Alessandro Nivola) lives a solitary existence, rarely straying from his narrow routines of working in a landfill and going through the motions of getting through the day. He faces emotional and psychological upheaval with the arrival of Will, his ten-year-old son whom he has never met. The boy, who has been abandoned by his mother, weighs 250 pounds, is diabetic, and needs serious care -- attention Joel may not be capable of giving. Their collective pain, in the face of an indifferent world, could be crushing. Together, they embark on a journey of survival.See less",
        "runtimeMinutes": "93"
    },
    "2018_869": {
        "plotSummary": "",
        "runtimeMinutes": "90"
    },
    "2018_87": {
        "plotSummary": "Audrey and Morgan are best friends who unwittingly become entangled in an international conspiracy when one of the women discovers the boyfriend who dumped her was actually a spy.",
        "runtimeMinutes": "117"
    },
    "2018_870": {
        "plotSummary": "When her best friend takes his own life, Liusaidh has to deal with stresses of such a situation.",
        "runtimeMinutes": "91"
    },
    "2018_871": {
        "plotSummary": "An Evangelical Christian man attends the funeral services of his father in his hometown, where he has to participate in religious rites that clash with his beliefs and finds himself pressured to take revenge on the murderer.",
        "runtimeMinutes": "106"
    },
    "2018_872": {
        "plotSummary": "STELLA'S LAST WEEKEND is the story of two brothers whose relationship is challenged when they find they are in love with the same girl, but it is also about the unshakable bond between them.",
        "runtimeMinutes": "102"
    },
    "2018_873": {
        "plotSummary": "A former U.S. Marshal struggling to put his life together after a case gone wrong. A former colleague reappears in his life and explains all of the survivors of the man's unit are suffering the same symptoms and that there may be a larger ...See moreA former U.S. Marshal struggling to put his life together after a case gone wrong. A former colleague reappears in his life and explains all of the survivors of the man's unit are suffering the same symptoms and that there may be a larger conspiracy at hand.  Written by IvanWongSee less",
        "runtimeMinutes": "118"
    },
    "2018_874": {
        "plotSummary": "When a recent widower consumed with regret seeks absolution in riding his motorcycle cross-country to confront the mistakes of his past, he unexpectedly discovers that life is about moving forward, one mile at a time.",
        "runtimeMinutes": "97"
    },
    "2018_875": {
        "plotSummary": "In this heart-warming story full of hope, dreams and second chances, two seniors meet and discover that it's never too late to fall in love again.",
        "runtimeMinutes": "107"
    },
    "2018_876": {
        "plotSummary": "Inspired by the life and works of Nelly Arcan, a sex worker turned international literary star, lost between irreconcilable identities, whose life ended tragically.",
        "runtimeMinutes": "100"
    },
    "2018_877": {
        "plotSummary": "Andres and his 12 year old son Pedro live in a violent neighborhood in Caracas, but they hardly see each other. One day, Andres comes home and finds out that Pedro has gotten himself in serious trouble after hurting a boy in a fight.",
        "runtimeMinutes": "82"
    },
    "2018_878": {
        "plotSummary": "A story of friendship, love, marriage, secrets, and lies that unfolds between two couples in one apartment during a Sunday brunch that will affect their lives forever.",
        "runtimeMinutes": "77"
    },
    "2018_879": {
        "plotSummary": "Wilson, a black man in his late fifties, has been living as a refugee in Hungary for years. He works as a security guard in Budapest and his main desire is to acquire Hungarian citizenship, but he keeps failing the exams that are required ...See moreWilson, a black man in his late fifties, has been living as a refugee in Hungary for years. He works as a security guard in Budapest and his main desire is to acquire Hungarian citizenship, but he keeps failing the exams that are required for his application. In preparing for the next exam, he is helped by Mari, a Hungarian woman of roughly the same age who is a history teacher. Unexpectedly the teacher and her pupil start to develop deep affection towards each other.  Written by trixie650203See less",
        "runtimeMinutes": "109"
    },
    "2018_88": {
        "plotSummary": "A big box store worker reinvents her life and her life-story and shows Madison Avenue what street smarts can do. Read more: Synopsis",
        "runtimeMinutes": "103"
    },
    "2018_880": {
        "plotSummary": "A blue-collar family man breaks the promise he'd made to never fight again. Now forty years old, with a wife and four children who need him, Joe Carman risks everything to go back into the fighting cage and come to terms with his past.",
        "runtimeMinutes": "81"
    },
    "2018_881": {
        "plotSummary": "A social media couple's camping trip is ruined by filmmakers making a documentary on how easy it is to track someone down off social media and kill them.",
        "runtimeMinutes": "82"
    },
    "2018_882": {
        "plotSummary": "An intimate portrait of the world's most outstanding rhythmic gymnast Margarita Mamun who needs to overcome mental fragility to take part in the Olympic Games.",
        "runtimeMinutes": "74"
    },
    "2018_883": {
        "plotSummary": "Exploring the enduring appeal of TV game shows. An insightful look at the phenomenon of TV game shows, memorable contestant moments and the hosts we played along with throughout the years.",
        "runtimeMinutes": "96"
    },
    "2018_884": {
        "plotSummary": "Inside the fascinating but little-known world of same-sex competitive ballroom dance, HOT TO TROT follows a small international cast of four magnetic men and women, on and off the dance floor, over a four-year period. An immersive ...See moreInside the fascinating but little-known world of same-sex competitive ballroom dance, HOT TO TROT follows a small international cast of four magnetic men and women, on and off the dance floor, over a four-year period. An immersive character study - and an idiosyncratic attack on bigotry - this rousing, powerful story unfurls with the rhythms and energy of dramatic cinema.See less",
        "runtimeMinutes": "88"
    },
    "2018_885": {
        "plotSummary": "The filmmaker retraces her grandmother's Auschwitz survival story and investigates how her life-long fight against intolerance can be passed on to new generations in the 21st century.",
        "runtimeMinutes": "100"
    },
    "2018_886": {
        "plotSummary": "A portrait of hard rocking band Deer Tick, known for their substance-fueled live performances, on their evolutionary journey to become one of the greatest cult rock bands of our time.",
        "runtimeMinutes": "110"
    },
    "2018_887": {
        "plotSummary": "A hidden-camera video involving a fake prostitute threatens to destroy ACORN, America's largest grassroots anti-poverty organization. World Premiere Tribeca Film Festival.",
        "runtimeMinutes": "84"
    },
    "2018_888": {
        "plotSummary": "Amos Gitai returns to the West Bank to better understand the efforts of the citizens, both Israelis and Palestinians, to try to overcome the consequences of the 50-year occupation. Interspersing footage of his interviews with Yitzhak Rabin...See moreAmos Gitai returns to the West Bank to better understand the efforts of the citizens, both Israelis and Palestinians, to try to overcome the consequences of the 50-year occupation. Interspersing footage of his interviews with Yitzhak Rabin from the 1990s with the contemporary interviews of everyday citizens.  Written by TVSee less",
        "runtimeMinutes": "84"
    },
    "2018_889": {
        "plotSummary": "Finding Happiness is a film that captures a joyful reality. With a unique story directly from the heart and soul of each person who has lived it. Told through the eyes of a New York investigative journalist, Finding Happiness takes us on a...See moreFinding Happiness is a film that captures a joyful reality. With a unique story directly from the heart and soul of each person who has lived it. Told through the eyes of a New York investigative journalist, Finding Happiness takes us on a journey to see how people can live in harmony, collaboration, compassion, cooperation, peace and love together in a conscious community called Ananda - which means \"joy\".  Written by Dea ShanderaSee less",
        "runtimeMinutes": "96"
    },
    "2018_89": {
        "plotSummary": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
        "runtimeMinutes": "125"
    },
    "2018_890": {
        "plotSummary": "In Greenwich Village there is Debt Slavery and prostitution at NYU due to high tuition and fees for students. NYU and other Land Lords are changing the character of the Bohemian Village due to outrageous rents and pass along real estate taxes.",
        "runtimeMinutes": "89"
    },
    "2018_891": {
        "plotSummary": "One woman and her family trek the broken mental health system in an effort to save her brother as he descends into madness. Beginning as a testimony of his sanity, his iPhone video diary ultimately becomes an unfiltered look at the mind of...See moreOne woman and her family trek the broken mental health system in an effort to save her brother as he descends into madness. Beginning as a testimony of his sanity, his iPhone video diary ultimately becomes an unfiltered look at the mind of a man with untreated schizophrenia.See less",
        "runtimeMinutes": "101"
    },
    "2018_892": {
        "plotSummary": "A narcissistic plastic surgeon prefers women of a certain high quality, but meets an every day woman who questions his morals, his methods and his meaning to life.",
        "runtimeMinutes": "95"
    },
    "2018_893": {
        "plotSummary": "A drug that alters perceptions during trauma and stress, is being advertised as a cure for socio-political tensions. Several couples volunteer for human trials but end up with more than they bargained for.",
        "runtimeMinutes": "79"
    },
    "2018_894": {
        "plotSummary": "Comedy drama based on the true story of two British Army dentists who in 1942, eager to see action, go A.W.O.L. and invade occupied France on their own.",
        "runtimeMinutes": "109"
    },
    "2018_895": {
        "plotSummary": "A young, modern, Sikh family travels the globe meeting with diverse communities of Sikhs to explore their roots and identity in Sikhism, the world's fifth largest religion.",
        "runtimeMinutes": "89"
    },
    "2018_896": {
        "plotSummary": "Two estranged American brothers meet in Saas-Fee, Switzerland to get to know one another. Cut off from distractions, their differences come to a head, \"interfering\" in their relationships, revealing the reality behind their personas.",
        "runtimeMinutes": "97"
    },
    "2018_897": {
        "plotSummary": "Invisible Hands is the first feature documentary that exposes child labor and child trafficking within the supply chains of the world's biggest corporations.",
        "runtimeMinutes": "80"
    },
    "2018_898": {
        "plotSummary": "Featuring Bill Murray, Hunter S. Thompson, Steven Spielberg, Lynn Swann, Goldie Hawn, Abbie Hoffman, Lily Tomlin and more, \"TVTV: Video Revolutionaries\" is a new documentary about Top Value Television (TVTV), a band of merry video makers ...See moreFeaturing Bill Murray, Hunter S. Thompson, Steven Spielberg, Lynn Swann, Goldie Hawn, Abbie Hoffman, Lily Tomlin and more, \"TVTV: Video Revolutionaries\" is a new documentary about Top Value Television (TVTV), a band of merry video makers who, from 1972 to 1977, took the then brand-new portable video camera and journeyed out to document the world. In those days, there were only three TV networks, using giant studio cameras, and no one had ever seen a portable camera stuck in their face. Because the technology was so new, there were no rules about how to use it or what to make. So the new video journalists used it to make format-bending satirical shows about whatever interested them -- from the 1972 Republican Convention to an expose of a 15-year-old guru called \"Lord of the Universe\" to capturing the Steelers and Cowboys partying hard the night before Super Bowl X. Directed by TVTV alum Paul Goldsmith, the film is like opening a treasure chest into the 1970s, filled with cultural and political events hosted by now-famous characters who were then just beginning their climb to iconic.  Written by Paul GoldsmithSee less",
        "runtimeMinutes": "82"
    },
    "2018_899": {
        "plotSummary": "When the Universe decides what it wants, it's pointless to resist. With his family's life at stake, Joseph Steadman finds himself the unwilling test subject of a maniacal scientist in a battle that could save the world, or destroy it.",
        "runtimeMinutes": "93"
    },
    "2018_9": {
        "plotSummary": "Foul-mouthed mutant mercenary Wade Wilson (a.k.a. Deadpool), brings together a team of fellow mutant rogues to protect a young boy with supernatural abilities from the brutal, time-traveling cyborg Cable.",
        "runtimeMinutes": "119"
    },
    "2018_90": {
        "plotSummary": "A family of small-time crooks take in a child they find outside in the cold.",
        "runtimeMinutes": "121"
    },
    "2018_91": {
        "plotSummary": "12 Strong tells the story of the first Special Forces team deployed to Afghanistan after 9/11; under the leadership of a new captain, the team must work with an Afghan warlord to take down the Taliban.",
        "runtimeMinutes": "130"
    },
    "2018_92": {
        "plotSummary": "Simon Spier keeps a huge secret from his family, his friends and all of his classmates: he's gay. When that secret is threatened, Simon must face everyone and come to terms with his identity.",
        "runtimeMinutes": "110"
    },
    "2018_93": {
        "plotSummary": "A small team of elite American intelligence officers, part of a top-secret tactical command unit, try to smuggle a mysterious police officer with sensitive information out of Indonesia.",
        "runtimeMinutes": "94"
    },
    "2018_94": {
        "plotSummary": "After her husband abruptly asks for a divorce, a middle-aged mother returns to college in order to complete her degree.",
        "runtimeMinutes": "105"
    },
    "2018_95": {
        "plotSummary": "While serving a five-year sentence for a violent crime, a 12-year-old boy sues his parents for neglect.",
        "runtimeMinutes": "126"
    },
    "2018_96": {
        "plotSummary": "Set in Japan, Isle of Dogs follows a boy's odyssey in search of his lost dog.",
        "runtimeMinutes": "101"
    },
    "2018_97": {
        "plotSummary": "A series of mysterious events change the life of a blind pianist, who must now report a crime that he should technically know nothing of.",
        "runtimeMinutes": "139"
    },
    "2018_98": {
        "plotSummary": "A true story of survival, as a young couple's chance encounter leads them first to love, and then on the adventure of a lifetime as they face one of the most catastrophic hurricanes in recorded history.",
        "runtimeMinutes": "96"
    },
    "2018_99": {
        "plotSummary": "An attempted terrorist attack on a Paris bound train is prevented by three courageous young Americans. Their friendship was their greatest weapon that saved the lives of those on board.",
        "runtimeMinutes": "94"
    }
}