{
    "2019_1": {
        "plotSummary": "After the devastating events of Avengers: Infinity War, the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe.",
        "runtimeMinutes": "181"
    },
    "2019_10": {
        "plotSummary": "In Jumanji: The Next Level, the gang is back but the game has changed. As they return to rescue one of their own, the players will have to brave parts unknown from arid deserts to snowy mountains, to escape the world's most dangerous game.",
        "runtimeMinutes": "123"
    },
    "2019_100": {
        "plotSummary": "World-renowned civil rights defense attorney Bryan Stevenson works to free a wrongly condemned death row prisoner.",
        "runtimeMinutes": "137"
    },
    "2019_101": {
        "plotSummary": "With his debts mounting and angry collectors closing in, a fast-talking New York City jeweler risks everything in hope of staying afloat and alive.",
        "runtimeMinutes": "135"
    },
    "2019_102": {
        "plotSummary": "An embattled NYPD detective is thrust into a citywide manhunt for a pair of cop killers after uncovering a massive and unexpected conspiracy.",
        "runtimeMinutes": "99"
    },
    "2019_103": {
        "plotSummary": "A house is cursed by a vengeful ghost that dooms those who enter it with a violent death.",
        "runtimeMinutes": "94"
    },
    "2019_104": {
        "plotSummary": "A woman is transformed into her younger self at a point in her life when the pressures of adulthood become too much to bear. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2019_105": {
        "plotSummary": "A young woman disenchanted with love mysteriously finds herself trapped inside a romantic comedy. Read more: Synopsis",
        "runtimeMinutes": "89"
    },
    "2019_106": {
        "plotSummary": "When a nurse downloads an app that claims to predict the moment a person will die, it tells her she only has three days to live. With the clock ticking and a figure haunting her, she must find a way to save her life before time runs out.",
        "runtimeMinutes": "90"
    },
    "2019_107": {
        "plotSummary": "A couple travels to Sweden to visit a rural hometown's fabled mid-summer festival. What begins as an idyllic retreat quickly devolves into an increasingly violent and bizarre competition at the hands of a pagan cult.",
        "runtimeMinutes": "148"
    },
    "2019_108": {
        "plotSummary": "A couple's first date takes an unexpected turn when a police officer pulls them over.",
        "runtimeMinutes": "132"
    },
    "2019_109": {
        "plotSummary": "Two sisters diving in a ruined underwater city quickly learn they've entered the territory of the deadliest shark species in the claustrophobic labyrinth of submerged caves.",
        "runtimeMinutes": "90"
    },
    "2019_11": {
        "plotSummary": "Lawman Luke Hobbs (Dwayne \"The Rock\" Johnson) and outcast Deckard Shaw (Jason Statham) form an unlikely alliance when a cyber-genetically enhanced villain threatens the future of humanity. Read more: Synopsis",
        "runtimeMinutes": "137"
    },
    "2019_110": {
        "plotSummary": "Serial billionaire kidnapper Logan has been savaging Hong Kong. Now, his gang is aiming the dart beyond Hong Kong, at an affluent Macau regal.",
        "runtimeMinutes": "101"
    },
    "2019_111": {
        "plotSummary": "A mother gives her 13-year-old son a toy doll for his birthday, unaware of its more sinister nature.",
        "runtimeMinutes": "90"
    },
    "2019_112": {
        "plotSummary": "After foiling a bomb attack at the 1996 Atlanta Olympics security guard Richard Jewell is an instant hero, however when the FBI leaks to the media that he is a suspect in the bombing his life becomes a nightmare.",
        "runtimeMinutes": "131"
    },
    "2019_113": {
        "plotSummary": "Legendary performer Judy Garland arrives in London in the winter of 1968 to perform a series of sold-out concerts.",
        "runtimeMinutes": "118"
    },
    "2019_114": {
        "plotSummary": "The extraordinary tale of Harriet Tubman's escape from slavery and transformation into one of America's greatest heroes, whose courage, ingenuity, and tenacity freed hundreds of slaves and changed the course of history.",
        "runtimeMinutes": "125"
    },
    "2019_115": {
        "plotSummary": "A former wrestler and his family make a living performing at small venues around the country while his kids dream of joining World Wrestling Entertainment.",
        "runtimeMinutes": "108"
    },
    "2019_116": {
        "plotSummary": "Indian army special forces execute a covert operation, avenging the killing of fellow army men at their base by a terrorist group.",
        "runtimeMinutes": "138"
    },
    "2019_117": {
        "plotSummary": "A high-school basketball coach volunteers to coach a troubled teen in long-distance running.",
        "runtimeMinutes": "119"
    },
    "2019_118": {
        "plotSummary": "An aging film director suffering from chronic illness and writer's block reflects on his life.",
        "runtimeMinutes": "113"
    },
    "2019_119": {
        "plotSummary": "A young married couple buys a beautiful house on several acres of land, only to find out that the man they bought it from refuses to let go of the property.",
        "runtimeMinutes": "102"
    },
    "2019_12": {
        "plotSummary": "Born with unique powers, a boy is recruited to fight demons and save the community that fears him.",
        "runtimeMinutes": "110"
    },
    "2019_120": {
        "plotSummary": "A bus transporting the inmates is flipped resulting in the felons escaping. In order to round up and once again incarcerate the criminals the cops form a special task force that needs to work in haste. The chief detective forms a crack ...See moreA bus transporting the inmates is flipped resulting in the felons escaping. In order to round up and once again incarcerate the criminals the cops form a special task force that needs to work in haste. The chief detective forms a crack team and is rearing to go because time is of the essence. Moreover, the criminals are dangerous on the loose. The matter is complicated when a criminal gang is soon involved and interferes.  Written by metallian.comSee less",
        "runtimeMinutes": "114"
    },
    "2019_121": {
        "plotSummary": "Consummate con man Roy Courtnay has set his sights on his latest mark: the recently widowed Betty McLeish, worth millions. But this time, what should have been a simple swindle escalates into a cat-and-mouse game with the ultimate stakes.",
        "runtimeMinutes": "109"
    },
    "2019_122": {
        "plotSummary": "Through his bond with his owner, aspiring Formula One race car driver Denny, golden retriever Enzo learns that the techniques needed on the racetrack can also be used to successfully navigate the journey of life.",
        "runtimeMinutes": "109"
    },
    "2019_123": {
        "plotSummary": "At the cusp of India's birth as an Independent nation, a family makes an arduous journey to freedom at a cost. A young boy Bharat, makes a promise to his Father that he will keep his family together no matter what.",
        "runtimeMinutes": "150"
    },
    "2019_124": {
        "plotSummary": "What if a child from another world crash-landed on Earth, but instead of becoming a hero to mankind, he proved to be something far more sinister?",
        "runtimeMinutes": "90"
    },
    "2019_125": {
        "plotSummary": "An animated adventure in which the free-spirited UglyDolls confront what it means to be different, struggle with a desire to be loved, and ultimately discover who you truly are is what matters most.",
        "runtimeMinutes": "87"
    },
    "2019_126": {
        "plotSummary": "A detective recruits his Uber driver into an unexpected night of adventure.",
        "runtimeMinutes": "93"
    },
    "2019_127": {
        "plotSummary": "A band of kids embark on an epic quest to thwart a medieval menace.",
        "runtimeMinutes": "120"
    },
    "2019_128": {
        "plotSummary": "Beneath Anna Poliatova's striking beauty lies a secret that will unleash her indelible strength and skill to become one of the world's most feared government assassins.",
        "runtimeMinutes": "118"
    },
    "2019_129": {
        "plotSummary": "A struggling father agrees to run a scam in which he convinces a camgirl to marry him.",
        "runtimeMinutes": "116"
    },
    "2019_13": {
        "plotSummary": "As the sun is dying out, people all around the world build giant planet thrusters to move Earth out of its orbit and sail Earth to a new star system. Yet the 2500-year journey comes with unexpected dangers, and in order to save humanity, a...See moreAs the sun is dying out, people all around the world build giant planet thrusters to move Earth out of its orbit and sail Earth to a new star system. Yet the 2500-year journey comes with unexpected dangers, and in order to save humanity, a group of young people in this age of a wandering Earth fight hard for the survival of humankind.See less",
        "runtimeMinutes": "125"
    },
    "2019_130": {
        "plotSummary": "A gangster on the run sacrifices everything for his family and a woman he meets while on the lam.",
        "runtimeMinutes": "113"
    },
    "2019_131": {
        "plotSummary": "A group of youths aspiring to become professional superheroes, fight in a world full of people with abilities, also known as quirks. Deku and his fellow classmates from Hero Academy face Nine, the strongest villain yet.",
        "runtimeMinutes": "104"
    },
    "2019_132": {
        "plotSummary": "A coming-of-age story based on the lives of street rappers in Mumbai.",
        "runtimeMinutes": "153"
    },
    "2019_133": {
        "plotSummary": "A group of people learn about a hidden treasure and then they race to find it and claim it.",
        "runtimeMinutes": "130"
    },
    "2019_134": {
        "plotSummary": "Mr. Link recruits explorer Sir Lionel Frost to help find his long-lost relatives in the fabled valley of Shangri-La. Along with adventurer Adelina Fortnight, this trio of explorers travel the world to help their new friend.",
        "runtimeMinutes": "93"
    },
    "2019_135": {
        "plotSummary": "Zequi tries to regain Lucy's love by bringing the school's team to victory.",
        "runtimeMinutes": "102"
    },
    "2019_136": {
        "plotSummary": "A crime boss teams up with a cop to track down a serial killer.",
        "runtimeMinutes": "109"
    },
    "2019_137": {
        "plotSummary": "On the eve of their high school graduation, two academic superstars and best friends realize they should have worked less and played more. Determined not to fall short of their peers, the girls try to cram four years of fun into one night. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2019_138": {
        "plotSummary": "Based on the life of Patna-based mathematician Anand Kumar who runs the famed Super 30 program for IIT aspirants in Patna.",
        "runtimeMinutes": "154"
    },
    "2019_139": {
        "plotSummary": "Zak runs away from his care home to make his dream of becoming a wrestler come true.",
        "runtimeMinutes": "97"
    },
    "2019_14": {
        "plotSummary": "When Hiccup discovers Toothless isn't the only Night Fury, he must seek \"The Hidden World\", a secret Dragon Utopia before a hired tyrant named Grimmel finds it first.",
        "runtimeMinutes": "104"
    },
    "2019_140": {
        "plotSummary": "The film revolves around a Chinese man who returns to New Zealand following the death of his wife and begins to discover that she harbored a number of secrets.",
        "runtimeMinutes": "132"
    },
    "2019_141": {
        "plotSummary": "A corporate defense attorney takes on an environmental lawsuit against a chemical company that exposes a lengthy history of pollution. Read more: Synopsis",
        "runtimeMinutes": "126"
    },
    "2019_142": {
        "plotSummary": "A Chinese family discovers their grandmother has only a short while left to live and decide to keep her in the dark, scheduling a wedding to gather before she dies.",
        "runtimeMinutes": "100"
    },
    "2019_143": {
        "plotSummary": "A rookie New Orleans police officer is forced to balance her identity as a black woman after she witnesses two corrupt cops committing murder.",
        "runtimeMinutes": "108"
    },
    "2019_144": {
        "plotSummary": "A late night talk show host suspects that she may soon lose her long-running show.",
        "runtimeMinutes": "102"
    },
    "2019_145": {
        "plotSummary": "A small but brave donkey and his animal friends become the unsung heroes of the first Christmas.",
        "runtimeMinutes": "86"
    },
    "2019_146": {
        "plotSummary": "JJ Shaft, a cyber security expert with a degree from MIT, enlists his family's help to uncover the truth behind his best friend's untimely death.",
        "runtimeMinutes": "111"
    },
    "2019_147": {
        "plotSummary": "The true story of the Taj Hotel terrorist attack in Mumbai. Hotel staff risk their lives to keep everyone safe as people make unthinkable sacrifices to protect themselves and their families.",
        "runtimeMinutes": "123"
    },
    "2019_148": {
        "plotSummary": "All Abby Johnson ever wanted to do was help women. As one of the youngest Planned Parenthood clinic directors in the nation, she believed in a woman's right to choose. Until the day she saw something that changed everything.",
        "runtimeMinutes": "109"
    },
    "2019_149": {
        "plotSummary": "Live-action adaptation of the classic story of a wooden puppet named Pinocchio who comes to life.",
        "runtimeMinutes": "125"
    },
    "2019_15": {
        "plotSummary": "Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies and dark new forces at play.",
        "runtimeMinutes": "119"
    },
    "2019_150": {
        "plotSummary": "Xinyi believes she's finally found a good man; going all in on this new and potentially life changing relationship. But when her teenage crush re-enters her life, she has to decide who to pick - and who will pick her.",
        "runtimeMinutes": "98"
    },
    "2019_151": {
        "plotSummary": "A young woman befriends a lonely widow who's harboring a dark and deadly agenda toward her.",
        "runtimeMinutes": "98"
    },
    "2019_152": {
        "plotSummary": "Tang Yuan, Jiao Zi and their family enjoy Chinese New Year together, learning about traditions, and sharing Peppa Pig stories.",
        "runtimeMinutes": "81"
    },
    "2019_153": {
        "plotSummary": "A group of female students is stalked by a stranger during their Christmas break. That is until the young sorority pledges discover that the killer is part of an underground college conspiracy.",
        "runtimeMinutes": "92"
    },
    "2019_154": {
        "plotSummary": "In 1950s New York, a lonely private detective afflicted with Tourette's Syndrome ventures to solve the murder of his mentor and only friend.",
        "runtimeMinutes": "144"
    },
    "2019_155": {
        "plotSummary": "Two lighthouse keepers try to maintain their sanity whilst living on a remote and mysterious New England island in the 1890s.",
        "runtimeMinutes": "109"
    },
    "2019_156": {
        "plotSummary": "In England in 1987, a teenager from an Asian family learns to live his life, understand his family and find his own voice through the music of American rock star Bruce Springsteen.",
        "runtimeMinutes": "118"
    },
    "2019_157": {
        "plotSummary": "The lives of six enigmatic characters become entangled whilst in search of love, but separated by the dichotomy between the two worlds of Husnabad, a town in North India.",
        "runtimeMinutes": "166"
    },
    "2019_158": {
        "plotSummary": "The story focuses on the Holy Grail War and explores the relationship between Shirou Emiya and Sakura Matou, two teenagers participating in this conflict. The story continues immediately from Fate/stay night: Heaven's Feel I. presage ...See moreThe story focuses on the Holy Grail War and explores the relationship between Shirou Emiya and Sakura Matou, two teenagers participating in this conflict. The story continues immediately from Fate/stay night: Heaven's Feel I. presage flower, following Shirou as he continues to participate in the Holy Grail War even after being eliminated as a master.See less",
        "runtimeMinutes": "117"
    },
    "2019_159": {
        "plotSummary": "Part 2 of Edir Macedo's self-financed biopic. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "2019_16": {
        "plotSummary": "Twenty-seven years after their first encounter with the terrifying Pennywise, the Losers Club have grown up and moved away, until a devastating phone call brings them back.",
        "runtimeMinutes": "169"
    },
    "2019_160": {
        "plotSummary": "Do Il-Chool (Park Jung-Min) has a talent for playing poker and he is the son of Jjakgwi. His father was a gambler and had one ear cut off after he was caught cheating. Il-Chool meets mysterious gambler Aekku (Ryoo Seung-Bum) and gets ...See moreDo Il-Chool (Park Jung-Min) has a talent for playing poker and he is the son of Jjakgwi. His father was a gambler and had one ear cut off after he was caught cheating. Il-Chool meets mysterious gambler Aekku (Ryoo Seung-Bum) and gets involved in the master gambling world.See less",
        "runtimeMinutes": "139"
    },
    "2019_161": {
        "plotSummary": "POMS is a comedy about a group of women who form a cheer leading squad at their retirement community, proving that you're never too old to 'bring it!'",
        "runtimeMinutes": "90"
    },
    "2019_162": {
        "plotSummary": "Adapted from the Japanese novel Goodbye, Khoru, following a guide dog and his conflicted master.",
        "runtimeMinutes": "107"
    },
    "2019_163": {
        "plotSummary": "Animated feature film inspired by the Playmobil brand toys.",
        "runtimeMinutes": "99"
    },
    "2019_164": {
        "plotSummary": "The wives of New York gangsters in Hell's Kitchen in the 1970s continue to operate their husbands' rackets after they're locked up in prison. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2019_165": {
        "plotSummary": "In the 1990s, when Go gambling fever swept Korea, Gui-su loses everything because his father gambled obsessively until there was nothing left. Left all alone in the world, Gui-su meets a mentor and Go teacher, Il-do, and goes through ...See moreIn the 1990s, when Go gambling fever swept Korea, Gui-su loses everything because his father gambled obsessively until there was nothing left. Left all alone in the world, Gui-su meets a mentor and Go teacher, Il-do, and goes through vicious training to become the grandmaster of Go. He sets out for revenge on the world that destroyed his life, but soon finds himself chased by an unknown loner pursuing his own vendetta.  Written by CJ EntertainmentSee less",
        "runtimeMinutes": "106"
    },
    "2019_166": {
        "plotSummary": "Gloria finds a power she never knew she had when she is drawn into a dangerous world of cross-border crime. Surviving will require all of her cunning, inventiveness, and strength. Based on the Spanish-language film. Read more: Synopsis",
        "runtimeMinutes": "104"
    },
    "2019_167": {
        "plotSummary": "A look at the Apollo 11 mission to land on the moon led by commander Neil Armstrong and pilots Buzz Aldrin and Michael Collins.",
        "runtimeMinutes": "93"
    },
    "2019_168": {
        "plotSummary": "The peaceful town of Centerville finds itself battling a zombie horde as the dead start rising from their graves.",
        "runtimeMinutes": "104"
    },
    "2019_169": {
        "plotSummary": "Chulbul Pandey encounters an enemy from his past, and his origin story as the fearless cop unfolds.",
        "runtimeMinutes": "160"
    },
    "2019_17": {
        "plotSummary": "In a world where people collect Pokemon to do battle, a boy comes across an intelligent talking Pikachu who seeks to be a detective.",
        "runtimeMinutes": "104"
    },
    "2019_170": {
        "plotSummary": "A fishing boat captain juggles facing his mysterious past and finding himself ensnared in a reality where nothing is what it seems.",
        "runtimeMinutes": "106"
    },
    "2019_171": {
        "plotSummary": "A couple in crisis. He, disillusioned, sees his life upset the day an entrepreneur offers him to plunge back into the time of his choice.",
        "runtimeMinutes": "115"
    },
    "2019_172": {
        "plotSummary": "The dramatic story of the cutthroat race between electricity titans Thomas Edison and George Westinghouse to determine whose electrical system would power the modern world.",
        "runtimeMinutes": "108"
    },
    "2019_173": {
        "plotSummary": "Mi-Young, who used to be considered the Major Crimes Unit's top cop, is stationed behind a desk after having a baby. She leads uneventful yet peaceful days at handling civil complaints and looking after her son and unemployed husband at ...See moreMi-Young, who used to be considered the Major Crimes Unit's top cop, is stationed behind a desk after having a baby. She leads uneventful yet peaceful days at handling civil complaints and looking after her son and unemployed husband at home. One day, an overly enthusiastic detective Ji-Hye, is consigned to Mi-Young's team, and they bicker over every little thing from the moment they meet. In fact, they are sisters-in-law, and neither are happy about sitting next to each other all day in the same office. But differences are pushed aside when a woman who came to file a report gets run over in front of Mi-Young and Ji-Hye. They discover that the woman is the victim of 'spy cam porn' and was threatened it would go up on a community site in three days. The two cops take the case, but due to workload, no one can handle it in time. Ji-Hye's burning passion for justice rekindles Mi-Young's sense of duty, and the two decide to take matters into their own hands.  Written by CJ Entertainment AmericaSee less",
        "runtimeMinutes": "107"
    },
    "2019_174": {
        "plotSummary": "An MMA fighter helps an exorcist fight evil.",
        "runtimeMinutes": "129"
    },
    "2019_175": {
        "plotSummary": "Korean pop group BTS set out on a world tour.",
        "runtimeMinutes": "103"
    },
    "2019_176": {
        "plotSummary": "A free-spirited woman in her 50s seeks out love at L.A. dance clubs. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2019_177": {
        "plotSummary": "A loving mom becomes compelled to reconnect with her creative passions after years of sacrificing herself for her family. Her leap of faith takes her on an epic adventure that jump-starts her life and leads to her triumphant rediscovery.",
        "runtimeMinutes": "109"
    },
    "2019_178": {
        "plotSummary": "Civil rights activist Ann Atwater faces off against C.P. Ellis, Exalted Cyclops of the Ku Klux Klan, in 1971 Durham, North Carolina over the issue of school integration.",
        "runtimeMinutes": "133"
    },
    "2019_179": {
        "plotSummary": "A concert film by South Korean group BTS. The movie takes place during the August 25 and 26, 2018 shows of their Love Yourself Tour at Seoul Olympic Stadium.",
        "runtimeMinutes": "112"
    },
    "2019_18": {
        "plotSummary": "Continuing the story of Max and his pet friends, following their secret lives after their owners leave them for work or school each day.",
        "runtimeMinutes": "86"
    },
    "2019_180": {
        "plotSummary": "A boy in New York is taken in by a wealthy Upper East Side family after his mother is killed in a bombing at the Metropolitan Museum of Art.",
        "runtimeMinutes": "149"
    },
    "2019_181": {
        "plotSummary": "On an isolated island in Brittany at the end of the eighteenth century, a female painter is obliged to paint a wedding portrait of a young woman.",
        "runtimeMinutes": "122"
    },
    "2019_182": {
        "plotSummary": "An Arctic fox works in the mailroom of a package delivery service, but wants to be doing the deliveries.",
        "runtimeMinutes": "92"
    },
    "2019_183": {
        "plotSummary": "Adán (Omar Chaparro) is a charming seducer who believes he knows how to make any woman swoon. He prepares to teach his friends the art of conquering women, using his array of bullet-proof rules of seduction. Mia (Martha Higareda) is an ...See moreAdán (Omar Chaparro) is a charming seducer who believes he knows how to make any woman swoon. He prepares to teach his friends the art of conquering women, using his array of bullet-proof rules of seduction. Mia (Martha Higareda) is an ambitious producer that dreams of having her own TV show on women empowerment called \"Todos Caen,\" a strategic guide to dating that teaches you just how to hook a man- and have him eating from the palm of your hand in no time. Mia and Adán cross paths at a bar one fateful night, and from there the game is on in an all-out battle of the sexes. But as they test their finely honed seduction strategies on one another, both find that sometimes the more you play hard to get, the harder you may end up falling.  Written by Pantelion FilmsSee less",
        "runtimeMinutes": "120"
    },
    "2019_184": {
        "plotSummary": "The true story of a British whistleblower who leaked information to the press about an illegal NSA spy operation designed to push the UN Security Council into sanctioning the 2003 invasion of Iraq.",
        "runtimeMinutes": "112"
    },
    "2019_185": {
        "plotSummary": "A futuristic firefighting mecha service is created to protect the world.",
        "runtimeMinutes": "111"
    },
    "2019_186": {
        "plotSummary": "Phil makes top 10 pop lists at work. His only \"friend\" is cellphone Siri. His new phone includes AI helper Jexi, who improves/controls his social life.",
        "runtimeMinutes": "84"
    },
    "2019_187": {
        "plotSummary": "Daniel experiences a spiritual transformation in a detention center. Although his criminal record prevents him from applying to the seminary, he has no intention of giving up his dream and decides to minister a small-town parish.",
        "runtimeMinutes": "115"
    },
    "2019_188": {
        "plotSummary": "Post World War II, a British colonel and his wife are assigned to live in Hamburg during the post-war reconstruction, but tensions arise with the German who previously owned the house.",
        "runtimeMinutes": "108"
    },
    "2019_189": {
        "plotSummary": "The formative years of the orphaned author J.R.R. Tolkien as he finds friendship, love and artistic inspiration among a group of fellow outcasts at school.",
        "runtimeMinutes": "112"
    },
    "2019_19": {
        "plotSummary": "When the windshield of his commercial airplane shatters at 30,000 feet in the air, a pilot and his flight crew work to ensure the safety of the passengers and land the plane.",
        "runtimeMinutes": "111"
    },
    "2019_190": {
        "plotSummary": "The real life of Tommaso Buscetta, the so-called \"boss of the two worlds,\" the first mafia informant in Sicily in the 1980s.",
        "runtimeMinutes": "153"
    },
    "2019_191": {
        "plotSummary": "Set in a Chicago neighborhood nearly a decade after an occupation by an extraterrestrial force, 'Captive State' explores the lives on both sides of the conflict - the collaborators and dissidents.",
        "runtimeMinutes": "109"
    },
    "2019_192": {
        "plotSummary": "Hoping that self-employment through gig economy can solve their financial woes, a hard-up UK delivery driver and his wife struggling to raise a family end up trapped in the vicious circle of this modern-day form of labour exploitation.",
        "runtimeMinutes": "101"
    },
    "2019_193": {
        "plotSummary": "The story takes place several years after Lelouch's \"Zero Requiem\" plan.",
        "runtimeMinutes": "112"
    },
    "2019_194": {
        "plotSummary": "A 21-year old boy Sunny has a penchant for sexually assaulting and killing girls. He's locked horns with top cop Shivani Shivaji Roy. Will she nab him?",
        "runtimeMinutes": "103"
    },
    "2019_195": {
        "plotSummary": "Life, works and achievements of opera legend Luciano Pavarotti.",
        "runtimeMinutes": "114"
    },
    "2019_196": {
        "plotSummary": "A unit of student soldiers on a diversionary mission for the Battle of Incheon during the Korean War in 1950.",
        "runtimeMinutes": "104"
    },
    "2019_197": {
        "plotSummary": "Three men, abused by the same priest during their childhood, engage in a fight for justice that will expose their personal experiences and question their life with their wife, family, and colleagues.",
        "runtimeMinutes": "137"
    },
    "2019_198": {
        "plotSummary": "When Kanan and Dia disappear while visiting Mari on Italy, Chika and the rest of the Aqours have no choice but to reach the \"Belpaese\" themselves and search for them.",
        "runtimeMinutes": "100"
    },
    "2019_199": {
        "plotSummary": "A coming-of-age story about an Adelie penguin named Steve who joins millions of fellow males in the icy Antarctic spring on a quest to build a suitable nest, find a life partner and start a family.",
        "runtimeMinutes": "76"
    },
    "2019_2": {
        "plotSummary": "After the murder of his father, a young lion prince flees his kingdom only to learn the true meaning of responsibility and bravery.",
        "runtimeMinutes": "118"
    },
    "2019_20": {
        "plotSummary": "An anthology film consist of 7 short stories directed by several different directors, which are based on 7 moments since the founding of People's Republic of China.",
        "runtimeMinutes": "154"
    },
    "2019_200": {
        "plotSummary": "The story of Rudolf Nureyev's defection to the West.",
        "runtimeMinutes": "127"
    },
    "2019_201": {
        "plotSummary": "Following a fatal accident, a Chinese expatriate working for a mining company in Australia discovers that new technology developed by the company may be a health risk, and investigates a web of conspiracies in his search for the truth.",
        "runtimeMinutes": "134"
    },
    "2019_202": {
        "plotSummary": "A young woman decides to make positive changes in her life by training for the New York City Marathon.",
        "runtimeMinutes": "104"
    },
    "2019_203": {
        "plotSummary": "Mayday's \"Life Tour\" concert that started in March 2017 and ended in January 2019 is filmed and presented in this movie version.",
        "runtimeMinutes": "112"
    },
    "2019_204": {
        "plotSummary": "Lupin III goes on a grand adventure to uncover the secrets of the Bresson Diary, which is tied to the legacy of his famous grandfather.",
        "runtimeMinutes": "93"
    },
    "2019_205": {
        "plotSummary": "A troubled young Glaswegian woman dreams of becoming a Nashville country star.",
        "runtimeMinutes": "101"
    },
    "2019_206": {
        "plotSummary": "A rip-roaring look at some sort of woman living her sort of life. With family and friendships under strain and a guinea pig cafe struggling to keep afloat, Fleabag suddenly finds herself with nothing to lose.",
        "runtimeMinutes": "80"
    },
    "2019_207": {
        "plotSummary": "A hopeless romantic ambivalent about his future in medical school falls for a hard-luck young woman who doesn't believe in love.",
        "runtimeMinutes": "100"
    },
    "2019_208": {
        "plotSummary": "Chintu Tyagi is an ordinary, middle class man who finds himself torn between his wife and another woman.",
        "runtimeMinutes": "126"
    },
    "2019_209": {
        "plotSummary": "Against the backdrop of high school football and track, two brothers in a small Southern town face escalating problems with two different world views, straining - but ultimately strengthening - the bonds of brotherhood.",
        "runtimeMinutes": "101"
    },
    "2019_21": {
        "plotSummary": "A deactivated cyborg's revived, but can't remember anything of her past and goes on a quest to find out who she is.",
        "runtimeMinutes": "122"
    },
    "2019_210": {
        "plotSummary": "The story of Roman Coleman, a violent convict, who is given the chance to participate in a rehabilitation therapy program involving the training of wild mustangs.",
        "runtimeMinutes": "96"
    },
    "2019_211": {
        "plotSummary": "A man's near death experience inspires him to choose life - and change the lives of millions.",
        "runtimeMinutes": "118"
    },
    "2019_212": {
        "plotSummary": "December 1897, Paris. Edmond Rostand is not yet thirty but already two children and a lot of anxieties. He has not written anything for two years. In desperation, he offers the great Constant Coquelin a new play, a heroic comedy, in verse,...See moreDecember 1897, Paris. Edmond Rostand is not yet thirty but already two children and a lot of anxieties. He has not written anything for two years. In desperation, he offers the great Constant Coquelin a new play, a heroic comedy, in verse, for the holidays. Only concern: it is not written yet. Ignoring the whims of actresses, the demands of his Corsican producers, the jealousy of his wife, the stories of his best friend's heart and the lack of enthusiasm of all those around him, Edmond starts writing this piece which nobody believes. For now, he has only the title: \"Cyrano de Bergerac\".  Written by Gaumont DistributionSee less",
        "runtimeMinutes": "110"
    },
    "2019_213": {
        "plotSummary": "Feature adaptation of Rapman's YouTube series about two young friends who become rivals in a street war.",
        "runtimeMinutes": "91"
    },
    "2019_214": {
        "plotSummary": "Veronica Ngo stars as an ex-gangster who is lying low in the countryside after becoming a mother, but she can't escape her violent past when her daughter is kidnapped.",
        "runtimeMinutes": "98"
    },
    "2019_215": {
        "plotSummary": "An undercover cop becomes embroiled in a battle with warring criminals who want to acquire a \"black box,\" their ultimate key to a treasure.",
        "runtimeMinutes": "170"
    },
    "2019_216": {
        "plotSummary": "Based on true events of the Indian Space Research Organisation (ISRO) successfully launching the Mars Orbiter Mission (Mangalyaan), making it the least expensive mission to Mars.",
        "runtimeMinutes": "130"
    },
    "2019_217": {
        "plotSummary": "3 men, considered as losers in their lives by the people, plan to get rich along with their girlfriends by fooling 2 gangsters and robbing their money.",
        "runtimeMinutes": "149"
    },
    "2019_218": {
        "plotSummary": "After a man's family dies in what appears to be a murder, he gets a phone call from one of the dead, his niece. He's not sure if she's a ghost or if he's going mad, but as it turns out, he's not.",
        "runtimeMinutes": "103"
    },
    "2019_219": {
        "plotSummary": "Seen by over 120 million people worldwide one of the world's most popular musicals. Now cinema audiences can experience a live broadcast of the musical phenomenon which broke box office records and sold out its entire 16-week season.",
        "runtimeMinutes": "145"
    },
    "2019_22": {
        "plotSummary": "The crypto-zoological agency Monarch faces off against a battery of god-sized monsters, including the mighty Godzilla, who collides with Mothra, Rodan, and his ultimate nemesis, the three-headed King Ghidorah.",
        "runtimeMinutes": "132"
    },
    "2019_220": {
        "plotSummary": "A stormy reunion between scriptwriter Lumir with her famous mother and actress, Fabienne, against the backdrop of Fabienne's autobiographic book and her latest role in a Sci-Fi picture as a daughter of a mother who never grows old.",
        "runtimeMinutes": "106"
    },
    "2019_221": {
        "plotSummary": "Documentarian John Chester and his wife Molly work to develop a sustainable farm on 200 acres outside of Los Angeles.",
        "runtimeMinutes": "91"
    },
    "2019_222": {
        "plotSummary": "A young girl is drawn into a mystery involving sealife around the world, in which two mysterious boys are somehow involved.",
        "runtimeMinutes": "111"
    },
    "2019_223": {
        "plotSummary": "Kazuma's party is suddenly alerted by an outrageous letter delivered by Yunyun. The letter requested that they come to the Crimson Demon Clan's village, that is facing a threat that could mean it's ending.",
        "runtimeMinutes": "90"
    },
    "2019_224": {
        "plotSummary": "Professor James Murray begins work compiling words for the first edition of the Oxford English Dictionary in the mid-19th century, and receives over 10,000 entries from a patient at Broadmoor Criminal Lunatic Asylum, Dr. William Minor.",
        "runtimeMinutes": "124"
    },
    "2019_225": {
        "plotSummary": "Simon is a compulsive liar. His family and colleagues organize an intervention but it turns into a confrontation and Simon denies everything. The next day, he wakes up in a reality where all his lies are now proven facts.",
        "runtimeMinutes": "111"
    },
    "2019_226": {
        "plotSummary": "Jay and Silent Bob inadvertently sign away their names and rights to the new Bluntman and Chronic movie. Now they head to Hollywood to stop the film from being made. Along the way Jay discovers that he is a father. Read more: Synopsis",
        "runtimeMinutes": "105"
    },
    "2019_227": {
        "plotSummary": "A set of three brothers are due to marry a set of three sisters, until one of the brothers starts to realize that they are all reincarnations from 600 years earlier and the wrong couples are about to get married.",
        "runtimeMinutes": "145"
    },
    "2019_228": {
        "plotSummary": "A young man searches for home in the changing city that seems to have left him behind.",
        "runtimeMinutes": "121"
    },
    "2019_229": {
        "plotSummary": "The Austrian Franz Jägerstätter, a conscientious objector, refuses to fight for the Nazis in World War II.",
        "runtimeMinutes": "174"
    },
    "2019_23": {
        "plotSummary": "April 6th, 1917. As a regiment assembles to wage war deep in enemy territory, two soldiers are assigned to race against time and deliver a message that will stop 1,600 men from walking straight into a deadly trap.",
        "runtimeMinutes": "119"
    },
    "2019_230": {
        "plotSummary": "A rebellious stoner named Moondog lives life by his own rules.",
        "runtimeMinutes": "95"
    },
    "2019_231": {
        "plotSummary": "The little swift Manou grows up believing he's a seagull learning to fly he finds out he never will be. When he runs from home he meets birds of his own species and finds out who he really is.",
        "runtimeMinutes": "90"
    },
    "2019_232": {
        "plotSummary": "A football player's dreams to play in the NFL are halted when he is wrongly convicted and sent to prison. Years later, he fights to clear his name within an unjust system.",
        "runtimeMinutes": "99"
    },
    "2019_233": {
        "plotSummary": "With one of the most memorably stunning voices that has ever hit the airwaves, Linda Ronstadt burst onto the 1960s folk rock music scene in her early twenties.",
        "runtimeMinutes": "95"
    },
    "2019_234": {
        "plotSummary": "Buried by treacherous conditions at the top of Mt. Baekdu, a policeman must brave the extreme weather until his transfer comes through. When a group of thieves stumbles into the station, both sides must fight for survival.",
        "runtimeMinutes": "112"
    },
    "2019_235": {
        "plotSummary": "A man stranded in the Arctic after a plane crash must decide whether to remain in the relative safety of his makeshift camp or to embark on a deadly trek through the unknown.",
        "runtimeMinutes": "98"
    },
    "2019_236": {
        "plotSummary": "The story revolves around a vet, who on his homecoming to his father's elephant reserve, encounters and fights an international poachers racket.",
        "runtimeMinutes": "115"
    },
    "2019_237": {
        "plotSummary": "A surfer and firefighter meet and fall in love.",
        "runtimeMinutes": "95"
    },
    "2019_238": {
        "plotSummary": "A political Godfather, who ruled the God's Own Country, dies and a lot of thieves dressed up as politicians took over the rule. When question arises on the replacement of the 'God', just one name emerges; 'Stephen Nedumbally'.",
        "runtimeMinutes": "175"
    },
    "2019_239": {
        "plotSummary": "Live concert performance of Bruce Springsteen singing songs from his album 'Western Stars'.",
        "runtimeMinutes": "83"
    },
    "2019_24": {
        "plotSummary": "A faded television actor and his stunt double strive to achieve fame and success in the final years of Hollywood's Golden Age in 1969 Los Angeles.",
        "runtimeMinutes": "161"
    },
    "2019_240": {
        "plotSummary": "A dynamic young entrepreneur finds herself locked in a hotel room with the corpse of her dead lover. She hires a prestigious lawyer to defend her and they work together to figure out what actually happened.",
        "runtimeMinutes": "118"
    },
    "2019_241": {
        "plotSummary": "After the death of her grandmother, Teresa comes home to her matriarchal village in a near-future Brazil to find a succession of sinister events that mobilizes all of its residents.",
        "runtimeMinutes": "131"
    },
    "2019_242": {
        "plotSummary": "The 2019 Oscar nominated documentary shorts are Black Sheep, End Game, Lifeboat, A Night at the Garden, and Period. End of Sentence.",
        "runtimeMinutes": null
    },
    "2019_243": {
        "plotSummary": "The film tells the story of Sweety Chaudhary, a closeted lesbian, and her attempts to come out to her conservative and traditional family.",
        "runtimeMinutes": "120"
    },
    "2019_244": {
        "plotSummary": "Docudrama tracing the life of Saint Faustina Kowalska, whose visions of Jesus Christ inspired the Roman Catholic devotion to the Divine Mercy and earned her the title of \"Apostle of Divine Mercy\".",
        "runtimeMinutes": "107"
    },
    "2019_245": {
        "plotSummary": "The story of Tracy Edwards, a 24-year-old cook on charter boats, who became the skipper of the first ever all-female crew to enter the Whitbread Round the World Race in 1989.",
        "runtimeMinutes": "97"
    },
    "2019_246": {
        "plotSummary": "A balloon pilot and a scientist find themselves in a fight for survival while attempting to make discoveries in a gas balloon in the 1860s.",
        "runtimeMinutes": "100"
    },
    "2019_247": {
        "plotSummary": "Set in a little restaurant in an inconspicuous lane of Shanghai, which opens at midnight everyday. The owner is a man of about fifty, makes a set of special food for each guest who visits the restaurant, and listens everyone's story.",
        "runtimeMinutes": "103"
    },
    "2019_248": {
        "plotSummary": "A tribute to the sitcom \"Friends\" on its 25th anniversary.",
        "runtimeMinutes": "105"
    },
    "2019_249": {
        "plotSummary": "A young actor's stormy childhood and early adult years as he struggles to reconcile with his father and deal with his mental health.",
        "runtimeMinutes": "94"
    },
    "2019_25": {
        "plotSummary": "A newly fostered young boy in search of his mother instead finds unexpected super powers and soon gains a powerful enemy.",
        "runtimeMinutes": "132"
    },
    "2019_250": {
        "plotSummary": "A single mother living in the Irish countryside with her son begins to suspect he may not be her son at all, and fears his increasingly disturbing behavior is linked to a mysterious sinkhole in the forest behind their house.",
        "runtimeMinutes": "90"
    },
    "2019_251": {
        "plotSummary": "A look at the roots of the historic music scene in L.A.'s Laurel Canyon featuring the music of iconic groups such as The Byrds, The Beach Boys, Buffalo Springfield, and The Mamas and the Papas. Read more: Synopsis",
        "runtimeMinutes": "82"
    },
    "2019_252": {
        "plotSummary": "The film is based on the third battle of Panipat which took place on the 14 of January in 1761 between the Marathas and the King of Afghanistan, Ahmad Shah Abdali.",
        "runtimeMinutes": "171"
    },
    "2019_253": {
        "plotSummary": "A decade after the death of an American television star, a young actor reminisces about the written correspondence he shared with him, as well as the impact those letters had on both their lives.",
        "runtimeMinutes": "123"
    },
    "2019_254": {
        "plotSummary": "A tragic incident forces Anirudh, a middle-aged man, to take a trip down memory lane and reminisce his college days along with his friends, who were labelled as losers.",
        "runtimeMinutes": "143"
    },
    "2019_255": {
        "plotSummary": "An in-depth look at the relationship between the late musician Leonard Cohen and his Norwegian muse Marianne Ihlen.",
        "runtimeMinutes": "102"
    },
    "2019_256": {
        "plotSummary": "An epic journey, faithfully adapted to modern-day. Christian faces distractions, challenges, and perils at every turn of the way. But ends victorious, with helpful guides, as he stays on the narrow path to the distant Celestial City.",
        "runtimeMinutes": "108"
    },
    "2019_257": {
        "plotSummary": "A look at the final days in the life of renowned playwright William Shakespeare.",
        "runtimeMinutes": "101"
    },
    "2019_258": {
        "plotSummary": "A jaded psychotherapist returns to her first passion of becoming a writer.",
        "runtimeMinutes": "100"
    },
    "2019_259": {
        "plotSummary": "An ex-convict working undercover intentionally gets himself incarcerated again in order to infiltrate the mob at a maximum security prison.",
        "runtimeMinutes": "113"
    },
    "2019_26": {
        "plotSummary": "A young elephant, whose oversized ears enable him to fly, helps save a struggling circus, but when the circus plans a new venture, Dumbo and his friends discover dark secrets beneath its shiny veneer.",
        "runtimeMinutes": "112"
    },
    "2019_260": {
        "plotSummary": "A filmed version of the popular stage musical, in which a feisty drag queen attempts to rescue a shoe factory by designing fabulous and fetishistic footwear.",
        "runtimeMinutes": "135"
    },
    "2019_261": {
        "plotSummary": "A manager of an orphanage in Kolkata travels to New York to meet a benefactor.",
        "runtimeMinutes": "112"
    },
    "2019_262": {
        "plotSummary": "Constructed from over 500 hours of never-before-seen footage, this documentary centers on the career of celebrated football player Diego Maradona, who played for S.S.C. Napoli in the 1980s.",
        "runtimeMinutes": "130"
    },
    "2019_263": {
        "plotSummary": "A group of four old friends conformed by a film director, a film writer, an actress and her husband share a big house in the country. Their coexistence is menaced by a young couple who resourcefully and deceitfully seek to get them to sell...See moreA group of four old friends conformed by a film director, a film writer, an actress and her husband share a big house in the country. Their coexistence is menaced by a young couple who resourcefully and deceitfully seek to get them to sell the house to develop a real estate project of their own.See less",
        "runtimeMinutes": "129"
    },
    "2019_264": {
        "plotSummary": "Metallica and the San Francisco Symphony perform a live concert together at Chase Center in San Francisco.",
        "runtimeMinutes": "150"
    },
    "2019_265": {
        "plotSummary": "Traces the journey of a suburban family - led by a well-intentioned but domineering father - as they navigate love, forgiveness, and coming together in the aftermath of a loss.",
        "runtimeMinutes": "135"
    },
    "2019_266": {
        "plotSummary": "A look at Depeche Mode's final moments of their 2017 Global Spirit Tour, featuring intimate stories from select fans.",
        "runtimeMinutes": "83"
    },
    "2019_267": {
        "plotSummary": "After being attacked on the street, a young man enlists at a local dojo, led by a charismatic and mysterious sensei, in an effort to learn how to defend himself from future threats.",
        "runtimeMinutes": "104"
    },
    "2019_268": {
        "plotSummary": "The story of Oumae Kumiko and others as second-year students.",
        "runtimeMinutes": "100"
    },
    "2019_269": {
        "plotSummary": "A gang of teenage boys stalks the streets of Naples armed with hand guns and AK-47s to do their mob bosses' bidding.",
        "runtimeMinutes": "111"
    },
    "2019_27": {
        "plotSummary": "John Wick is on the run after killing a member of the international assassins' guild, and with a $14 million price tag on his head, he is the target of hit men and women everywhere.",
        "runtimeMinutes": "130"
    },
    "2019_270": {
        "plotSummary": "After barely surviving prison, the demented Firefly clan go on the run, unleashing a whole new wave of murder, madness and mayhem.",
        "runtimeMinutes": "115"
    },
    "2019_271": {
        "plotSummary": "A married couple is forced to reckon with their idealized image of their son, adopted from war-torn Eritrea, after an alarming discovery by a devoted high school teacher threatens his status as an all-star student.",
        "runtimeMinutes": "109"
    },
    "2019_272": {
        "plotSummary": "A manipulative woman and a roguish man conduct a turbulent romance during the American Civil War and Reconstruction periods.",
        "runtimeMinutes": "238"
    },
    "2019_273": {
        "plotSummary": "Dorothy Gale is swept away from a farm in Kansas to a magical land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home to Kansas and help her friends as well.",
        "runtimeMinutes": "102"
    },
    "2019_274": {
        "plotSummary": "Benjamin is a big, strong and good-natured elephant who lives in the Newtown zoo. He and his best friend Otto, a caring and courageous 9-year-old boy, love to go on adventures together. But when a shrewd woman threatens to shut down the ...See moreBenjamin is a big, strong and good-natured elephant who lives in the Newtown zoo. He and his best friend Otto, a caring and courageous 9-year-old boy, love to go on adventures together. But when a shrewd woman threatens to shut down the zoo, Benjamin and Otto must hatch a plan to save Benjamin's home.See less",
        "runtimeMinutes": "91"
    },
    "2019_275": {
        "plotSummary": "Peggy Sawyer, a talented young performer with stars in her eyes gets her big break on Broadway.",
        "runtimeMinutes": "155"
    },
    "2019_276": {
        "plotSummary": "Pretending to be married in order to cohabitate, a small-town couple lands in endless awkward situations to hide the truth from their orthodox families.",
        "runtimeMinutes": "126"
    },
    "2019_277": {
        "plotSummary": "The love story of a young English woman and a German PoW, who together overcome prejudice, public hostility and personal tragedy.",
        "runtimeMinutes": "120"
    },
    "2019_278": {
        "plotSummary": "Fantastic Fungi is a descriptive time-lapse journey about the magical, mysterious and medicinal world of fungi and their power to heal, sustain and contribute to the regeneration of life on Earth that began 3.5 billion years ago.",
        "runtimeMinutes": "81"
    },
    "2019_279": {
        "plotSummary": "A drama focusing on a group of friends in their late 20s.",
        "runtimeMinutes": "119"
    },
    "2019_28": {
        "plotSummary": "A detective investigates the death of a patriarch of an eccentric, combative family.",
        "runtimeMinutes": "130"
    },
    "2019_280": {
        "plotSummary": "Missionary John H. Groberg returns to Tonga in the 1960s with his wife and their five young daughters. When their sixth child is born with a serious illness, the Grobergs face their ultimate test of faith, only to find themselves ...See moreMissionary John H. Groberg returns to Tonga in the 1960s with his wife and their five young daughters. When their sixth child is born with a serious illness, the Grobergs face their ultimate test of faith, only to find themselves surrounded by the love and prayers of thousands of Tongans. Barriers of inter religious strife are soon broken down as all unite in hopes of a miracle that will save the baby's life, as well as the life of a Tongan minister's son.  Written by Colin ArmoSee less",
        "runtimeMinutes": "117"
    },
    "2019_281": {
        "plotSummary": "High school loner Bird Fitcher has no idea what dark secrets are tied to the Polaroid camera she finds. It doesn't take long to discover that those who have their picture taken with it, soon die.",
        "runtimeMinutes": "88"
    },
    "2019_282": {
        "plotSummary": "Kept apart by a terrible lie and a conservative society, two sisters born in Rio de Janeiro make their way through life each believing the other is living out her dreams half a world away.",
        "runtimeMinutes": "139"
    },
    "2019_283": {
        "plotSummary": "A young film student in the early '80s becomes romantically involved with a complicated and untrustworthy man. Read more: Synopsis",
        "runtimeMinutes": "120"
    },
    "2019_284": {
        "plotSummary": "Sophia, an unemployed academic, is forced to change the way she thinks and lives her life when Karim, her beloved brother, falls in love.",
        "runtimeMinutes": "117"
    },
    "2019_285": {
        "plotSummary": "A man's obsession with his designer deerskin jacket causes him to blow his life savings and turn to crime.",
        "runtimeMinutes": "77"
    },
    "2019_286": {
        "plotSummary": "A student must face off against bullies and overcome hurdles, both academic and romantic, to win his college's coveted Student of the Year trophy.",
        "runtimeMinutes": "146"
    },
    "2019_287": {
        "plotSummary": "On a remote mountaintop, eight kids with guns watch over a hostage and a conscripted milk cow.",
        "runtimeMinutes": "102"
    },
    "2019_288": {
        "plotSummary": "1945, Leningrad. WWII has devastated the city, demolishing its buildings and leaving its citizens in tatters, physically and mentally. Two young women search for meaning and hope in the struggle to rebuild their lives amongst the ruins.",
        "runtimeMinutes": "130"
    },
    "2019_289": {
        "plotSummary": "Studying in Hong Kong but living in Shenzhen (the port city of Mainland China), Peipei has spent 16 years in her life travelling between these two cities. To realize the dream of seeing snow in Japan with her bestie, Peipei joins a ...See moreStudying in Hong Kong but living in Shenzhen (the port city of Mainland China), Peipei has spent 16 years in her life travelling between these two cities. To realize the dream of seeing snow in Japan with her bestie, Peipei joins a smuggling gang and uses her student identity to smuggle iPhones from Hong Kong to Mainland. Her family life and friendships begin to fall apart. The daily life of Peipei starts to get out of control.See less",
        "runtimeMinutes": "99"
    },
    "2019_29": {
        "plotSummary": "An augmented human and Sarah Connor must stop an advanced liquid Terminator from hunting down a young girl, whose fate is critical to the human race.",
        "runtimeMinutes": "128"
    },
    "2019_290": {
        "plotSummary": "Violet is a shy teenager who dreams of escaping her small town and pursuing her passion to sing. With the help of an unlikely mentor, she enters a local singing competition that will test her integrity, talent and ambition. Driven by a ...See moreViolet is a shy teenager who dreams of escaping her small town and pursuing her passion to sing. With the help of an unlikely mentor, she enters a local singing competition that will test her integrity, talent and ambition. Driven by a pop-fueled soundtrack, Teen Spirit is a visceral and stylish spin on the Cinderella story.See less",
        "runtimeMinutes": "93"
    },
    "2019_291": {
        "plotSummary": "The story of a young boy who witnesses Billy the Kid's encounter with Sheriff Pat Garrett.",
        "runtimeMinutes": "100"
    },
    "2019_292": {
        "plotSummary": "Salam, an inexperienced young Palestinian man, becomes a writer on a popular soap opera after a chance meeting with an Israeli soldier. His creative career is on the rise - until the soldier and the show's financial backers disagree about ...See moreSalam, an inexperienced young Palestinian man, becomes a writer on a popular soap opera after a chance meeting with an Israeli soldier. His creative career is on the rise - until the soldier and the show's financial backers disagree about how the show should end, and Salam is caught in the middle.See less",
        "runtimeMinutes": "100"
    },
    "2019_293": {
        "plotSummary": "In the early 1920s, a Kansas woman finds her life forever changed when she accompanies a young dancer on her fame-seeking journey to New York City.",
        "runtimeMinutes": "103"
    },
    "2019_294": {
        "plotSummary": "A Belgian teenager hatches a plot to kill his teacher after embracing an extremist interpretation of the Quran.",
        "runtimeMinutes": "85"
    },
    "2019_295": {
        "plotSummary": "A 50-year-old single father faces disapproval from his family and his ex-wife when he falls in love with a 26-year-old woman.",
        "runtimeMinutes": "135"
    },
    "2019_296": {
        "plotSummary": "In the summer of 1989, a group of bullied kids band together to destroy a shape-shifting monster, which disguises itself as a clown and preys on the children of Derry, their small Maine town.",
        "runtimeMinutes": "135"
    },
    "2019_297": {
        "plotSummary": "A pair of twin brothers from East L.A. choose to live their lives differently and end up on opposite sides of the law.",
        "runtimeMinutes": "144"
    },
    "2019_298": {
        "plotSummary": "FOR SAMA is both an intimate and epic journey into the female experience of war.",
        "runtimeMinutes": "100"
    },
    "2019_299": {
        "plotSummary": "Parent and child journey through the outskirts of society a decade after a pandemic has wiped out half the world's population. As a father struggles to protect his child, their bond, and the character of humanity, is tested.",
        "runtimeMinutes": "119"
    },
    "2019_3": {
        "plotSummary": "Anna, Elsa, Kristoff, Olaf and Sven leave Arendelle to travel to an ancient, autumn-bound forest of an enchanted land. They set out to find the origin of Elsa's powers in order to save their kingdom.",
        "runtimeMinutes": "103"
    },
    "2019_30": {
        "plotSummary": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
        "runtimeMinutes": "132"
    },
    "2019_300": {
        "plotSummary": "The Griswold family's plans for a big family Christmas predictably turn into a big disaster.",
        "runtimeMinutes": "97"
    },
    "2019_301": {
        "plotSummary": "",
        "runtimeMinutes": "150"
    },
    "2019_302": {
        "plotSummary": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
        "runtimeMinutes": "125"
    },
    "2019_303": {
        "plotSummary": "A look at Roger Waters' 2017-2018 concert tour.",
        "runtimeMinutes": "135"
    },
    "2019_304": {
        "plotSummary": "No Safe Spaces contends that identity politics and the suppression of free speech are spreading into every part of society and threatening to divide America.",
        "runtimeMinutes": "100"
    },
    "2019_305": {
        "plotSummary": "A young woman from Hong Kong has to reunite with her sisters to settle debts after her father dies.",
        "runtimeMinutes": "118"
    },
    "2019_306": {
        "plotSummary": "After a deadly encounter, a police officer struggles to catch the fugitives and prove the police acted lawfully, while being despised by the whole nation.",
        "runtimeMinutes": "146"
    },
    "2019_307": {
        "plotSummary": "The last female bee-hunter in Europe must save the bees and return the natural balance in Honeyland, when a family of nomadic beekeepers invade her land and threaten her livelihood.",
        "runtimeMinutes": "89"
    },
    "2019_308": {
        "plotSummary": "",
        "runtimeMinutes": "210"
    },
    "2019_309": {
        "plotSummary": "Kingdom Men Rising is a documentary exploring what it means to be a real man in the midst of cultural trends where there is confusion about masculinity. Challenging men to rise above what we've become to lives of no more excuses.",
        "runtimeMinutes": "93"
    },
    "2019_31": {
        "plotSummary": "A family's serene beach vacation turns to chaos when their doppelgängers appear and begin to terrorize them.",
        "runtimeMinutes": "116"
    },
    "2019_310": {
        "plotSummary": "In order to raise funds to pay off a lawsuit, Dominicans and Puerto Ricans get together to set up a circus.",
        "runtimeMinutes": "107"
    },
    "2019_311": {
        "plotSummary": "Several years after his childhood friend, a violin prodigy, disappears on the eve of his first solo concert, an Englishman travels throughout Europe to find him.",
        "runtimeMinutes": "113"
    },
    "2019_312": {
        "plotSummary": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby.",
        "runtimeMinutes": "86"
    },
    "2019_313": {
        "plotSummary": "The Italian mob descends on the Mexican border to take on the most powerful cartel in America. Spencer, an ex-mobster in witness protection, battles the cartel who captured his son in Arizona, with his mob buddies coming to help. Read more: Synopsis",
        "runtimeMinutes": "93"
    },
    "2019_314": {
        "plotSummary": "A group of young misfits called The Goonies discover an ancient map and set out on an adventure to find a legendary pirate's long-lost treasure.",
        "runtimeMinutes": "114"
    },
    "2019_315": {
        "plotSummary": "Based on the love story of a couple spanning 25 years and told through the lens of their spunky teenage daughter Aisha Chaudhary, who was diagnosed with pulmonary fibrosis.",
        "runtimeMinutes": "143"
    },
    "2019_316": {
        "plotSummary": "A choir and Kanye West perform in the Roden Crater located in Arizona's Painted Desert.",
        "runtimeMinutes": "31"
    },
    "2019_317": {
        "plotSummary": "A documentary feature about the troubled heart and soul of Michael Hutchence, lead singer and songwriter of INXS.",
        "runtimeMinutes": "102"
    },
    "2019_318": {
        "plotSummary": "Sisters Marianne and Christin travel to the Magdalen Islands, where they will spread their father's ashes and flee their personal problems, without realizing that they carry them with them, literally and figuratively.",
        "runtimeMinutes": "99"
    },
    "2019_319": {
        "plotSummary": "Soldier Marshall Bennett returns back home after sustaining injuries from an improvised explosive device overseas. When he learns his father is behind on his mortgage payments, Marshall turns to competitive racing to save the family farm.",
        "runtimeMinutes": "94"
    },
    "2019_32": {
        "plotSummary": "The Men in Black have always protected the Earth from the scum of the universe. In this new adventure, they tackle their biggest threat to date: a mole in the Men in Black organization.",
        "runtimeMinutes": "114"
    },
    "2019_320": {
        "plotSummary": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
        "runtimeMinutes": "134"
    },
    "2019_321": {
        "plotSummary": "Travel with Noah as he fulfills God's wish, even amidst seemingly impossible odds and the scrutiny of onlookers.",
        "runtimeMinutes": "130"
    },
    "2019_322": {
        "plotSummary": "A hit-man lives isolated in a cabin at the edge of a lake. One day, an injured woman arrives in front of his house. To save her, he could well risk his own life.",
        "runtimeMinutes": "91"
    },
    "2019_323": {
        "plotSummary": "A young witch, on her mandatory year of independent life, finds fitting into a new community difficult while she supports herself by running an air courier service.",
        "runtimeMinutes": "103"
    },
    "2019_324": {
        "plotSummary": "A struggling street photographer in Mumbai, pressured to marry by his grandmother, convinces a shy stranger to pose as his fiancee. The pair develop a connection that transforms them in ways they could not expect.",
        "runtimeMinutes": "110"
    },
    "2019_325": {
        "plotSummary": "Musicians, scholars, family and friends reflect on the life of jazzer Miles Davis to reveal the man behind the legend. Full access to Davis' estate provides rare footage and photos, outtakes from recording sessions and new interviews.",
        "runtimeMinutes": "114"
    },
    "2019_326": {
        "plotSummary": "An old man recalls his time painting houses for his friend, Jimmy Hoffa, through the 1950-70s.",
        "runtimeMinutes": "209"
    },
    "2019_327": {
        "plotSummary": "The Holy Trinity of Rock returns to the big screen on Wednesday, August 21, when the first \"Annual Exercise in Fan Indulgence\" Cinema Strangiato brings Rush fans together in movie theatres worldwide. Featuring R40+, this global fan event ...See moreThe Holy Trinity of Rock returns to the big screen on Wednesday, August 21, when the first \"Annual Exercise in Fan Indulgence\" Cinema Strangiato brings Rush fans together in movie theatres worldwide. Featuring R40+, this global fan event will give audiences a special look into some of the best performances from R40 LIVE, including songs such as \"Closer to the Heart\", \"Subdivisions\", \"Tom Sawyer\" and more, as well as unreleased backstage moments and candid footage left on the cutting room floor. R40+ also includes unseen soundcheck performances of the fan-favorite \"Jacob's Ladder\", exclusive new interviews with Tom Morello, Billy Corgan, Taylor Hawkins, producer Nick Raskulinecz, violinist Jonathan Dinklage and more. As a special bonus, fans will get a glimpse into the madness and passion that went in to the making of Geddy Lee's new book, Geddy Lee's Big Beautiful Book of Bass - featuring a brand-new interview from the man himself.See less",
        "runtimeMinutes": "120"
    },
    "2019_328": {
        "plotSummary": "When Willard and Rebecca Bean are called on a mission to a town that's hostile towards them, they must choose whether to fight for their right to live there or love their hostile neighbors.",
        "runtimeMinutes": "100"
    },
    "2019_329": {
        "plotSummary": "This artful and intimate meditation on the legendary storyteller examines her life, her works and the powerful themes she has confronted throughout her literary career.",
        "runtimeMinutes": "120"
    },
    "2019_33": {
        "plotSummary": "Jean Grey begins to develop incredible powers that corrupt and turn her into a Dark Phoenix, causing the X-Men to decide if her life is worth more than all of humanity.",
        "runtimeMinutes": "113"
    },
    "2019_330": {
        "plotSummary": "A UFC fighter's world is turned upside down when he discovers an elite group of world-renowned athletes and scientists who prove that everything he had been taught about protein was a lie.",
        "runtimeMinutes": "86"
    },
    "2019_332": {
        "plotSummary": "Set in 1825, Clare, a young Irish convict woman, chases a British officer through the rugged Tasmanian wilderness, bent on revenge for a terrible act of violence he committed against her family. On the way she enlists the services of an ...See moreSet in 1825, Clare, a young Irish convict woman, chases a British officer through the rugged Tasmanian wilderness, bent on revenge for a terrible act of violence he committed against her family. On the way she enlists the services of an Aboriginal tracker named Billy, who is also marked by trauma from his own violence-filled past.See less",
        "runtimeMinutes": "136"
    },
    "2019_333": {
        "plotSummary": "A pair of high-frequency traders go up against their old boss in an effort to make millions in a fiber-optic cable deal.",
        "runtimeMinutes": "111"
    },
    "2019_334": {
        "plotSummary": "Driven by a constant need to create, Phish frontman Trey Anastasio takes on new projects, including some of his most personal music to date as well as Phish's ambitious New Year's Eve show at Madison Square Garden.",
        "runtimeMinutes": "100"
    },
    "2019_335": {
        "plotSummary": "When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle.",
        "runtimeMinutes": "119"
    },
    "2019_336": {
        "plotSummary": "A young beautician, newly arrived in a small Louisiana town, finds work at the local salon, where a small group of women share a close bond of friendship, and welcome her into the fold.",
        "runtimeMinutes": "117"
    },
    "2019_337": {
        "plotSummary": "A couple's life in NYC becomes a whirlwind when Nicole suspects Jose is cheating on her while receiving the surprise that her father is getting married to a woman half his age.",
        "runtimeMinutes": "96"
    },
    "2019_338": {
        "plotSummary": "A birthday tribute concert for Joni Mitchell performed in Los Angeles.",
        "runtimeMinutes": "128"
    },
    "2019_339": {
        "plotSummary": "Not everything is as it seems for Cristi, a policeman who plays both sides of the law. Embarking with the beautiful Gilda on a high-stakes heist, both will have to navigate the twists and turns of corruption, treachery and deception.",
        "runtimeMinutes": "97"
    },
    "2019_34": {
        "plotSummary": "Security guard David Dunn uses his supernatural abilities to track Kevin Wendell Crumb, a disturbed man who has twenty-four personalities.",
        "runtimeMinutes": "129"
    },
    "2019_340": {
        "plotSummary": "It's the fascinating true story about the love affair between socialite and popular author Vita Sackville-West and literary icon Virginia Woolf.",
        "runtimeMinutes": "110"
    },
    "2019_341": {
        "plotSummary": "Stand-up comedian Chonda Pierce presents the third in her successful series of feature documentaries.",
        "runtimeMinutes": "90"
    },
    "2019_342": {
        "plotSummary": "After discovering he is a human, a man raised as an elf at the North Pole decides to travel to New York City to locate his real father.",
        "runtimeMinutes": "97"
    },
    "2019_343": {
        "plotSummary": "An extraordinary look at the lives of a middle-aged couple in the midst of the wife's breast cancer diagnosis.",
        "runtimeMinutes": "92"
    },
    "2019_344": {
        "plotSummary": "The pastor of a landmark church is the sole hold-out in a Philadelphia neighborhood earmarked for gentrification. But soon, the spirits of congregational members past begin to make their displeasure known. Who are the righteous among them?",
        "runtimeMinutes": "81"
    },
    "2019_345": {
        "plotSummary": "YouTube superstar DanTDM is bringing his show \"DanTDM Presents The Contest\" to your local cinema. \"DanTDM Presents The Contest\" is an interactive in-cinema event that provides you with an engaging gaming experience and immersive story.",
        "runtimeMinutes": null
    },
    "2019_346": {
        "plotSummary": "A filmmaker searches for scientific evidence that Moses wrote the first books of the Bible.",
        "runtimeMinutes": "140"
    },
    "2019_347": {
        "plotSummary": "A collection of five uncut, full-length colorized episodes on Lucille Ball's 'I Love Lucy'.",
        "runtimeMinutes": "155"
    },
    "2019_348": {
        "plotSummary": "A look at the life of genre-blending artist and style icon Lil Peep.",
        "runtimeMinutes": "116"
    },
    "2019_349": {
        "plotSummary": "Meet David Crosby in this portrait of a man with everything but an easy retirement on his mind.",
        "runtimeMinutes": "95"
    },
    "2019_35": {
        "plotSummary": "Chinese firefighters struggle to contain a huge fire after an oil pipeline explodes.",
        "runtimeMinutes": "118"
    },
    "2019_350": {
        "plotSummary": "In 1925's historic great race of mercy, a group of brave mushers travel 700 miles to save the small children of Nome, Alaska from a deadly epidemic.",
        "runtimeMinutes": "87"
    },
    "2019_351": {
        "plotSummary": "Roy Cohn personified the dark arts of American politics, turning empty vessels into dangerous demagogues - from Joseph McCarthy to his final project, Donald J. Trump.",
        "runtimeMinutes": "97"
    },
    "2019_352": {
        "plotSummary": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
        "runtimeMinutes": "146"
    },
    "2019_353": {
        "plotSummary": "Three generations grappling with a life-changing experience during one day of a vacation in Sintra, Portugal, a historic town known for its dense gardens and fairy-tale villas and palaces.",
        "runtimeMinutes": "100"
    },
    "2019_354": {
        "plotSummary": "RAISE HELL: The Life and Times of Molly Ivins tells the story of media firebrand Molly Ivins, six feet of Texas trouble who took on the Good Old Boy corruption wherever she found it. Her razor sharp wit left both sides of the aisle ...See moreRAISE HELL: The Life and Times of Molly Ivins tells the story of media firebrand Molly Ivins, six feet of Texas trouble who took on the Good Old Boy corruption wherever she found it. Her razor sharp wit left both sides of the aisle laughing, and craving ink in her columns. She knew the Bill of Rights was in peril, and said \"Polarizing people is a good way to win an election and a good way to wreck a country.\" Molly's words have proved prescient. Now it's up to us to raise hell.See less",
        "runtimeMinutes": "93"
    },
    "2019_355": {
        "plotSummary": "In India, a journalist investigates whether or not an Australian missionary is performing illegal conversions on the local townspeople.",
        "runtimeMinutes": "112"
    },
    "2019_356": {
        "plotSummary": "Prior to the India-Pakistan war of 1971, an Indian banker is recruited by the Research and Analysis Wing for a covert operation deep inside Pakistan.",
        "runtimeMinutes": "141"
    },
    "2019_357": {
        "plotSummary": "After losing an arm to a shark attack at age 13, Bethany Hamilton refuses to give up her dreams of being a professional surfer.",
        "runtimeMinutes": "100"
    },
    "2019_358": {
        "plotSummary": "Based on the absurd but true 1973 bank heist and hostage crisis in Stockholm that was documented in the New Yorker as the origins of the 'Stockholm Syndrome'.",
        "runtimeMinutes": "92"
    },
    "2019_359": {
        "plotSummary": "A young Jewish boy somewhere in Eastern Europe seeks refuge during World War II where he encounters many different characters.",
        "runtimeMinutes": "169"
    },
    "2019_36": {
        "plotSummary": "While babysitting the daughter of Ed and Lorraine Warren, a teenager and her friend unknowingly awaken an evil spirit trapped in a doll.",
        "runtimeMinutes": "106"
    },
    "2019_360": {
        "plotSummary": "An act of civil disobedience turns into a standoff with police when homeless people in Cincinnati take over the public library to seek shelter from the bitter cold.",
        "runtimeMinutes": "119"
    },
    "2019_361": {
        "plotSummary": "Raghu and Zoya are enjoying their lives together until a gang leader with harmful intentions turns their world upside down.",
        "runtimeMinutes": "152"
    },
    "2019_362": {
        "plotSummary": "Water and ice are shown around the world, in all of their many powerful forms.",
        "runtimeMinutes": "90"
    },
    "2019_363": {
        "plotSummary": "An off duty police begins to suspect a local man for having had an affair with his recently dead wife. Gradually his obsession for finding out the truth accumulates and inevitably begins to endanger himself and his loved ones.",
        "runtimeMinutes": "109"
    },
    "2019_364": {
        "plotSummary": "Asako lives in Osaka. She falls in love with Baku, a free-spirit. One day, Baku suddenly disappears. Two years later, Asako now lives in Tokyo and meets Ryohei. He looks just like Baku, but has a completely different personality.",
        "runtimeMinutes": "119"
    },
    "2019_365": {
        "plotSummary": "In this freewheeling comedy, medical transport driver Vic risks his job to shuttle a group of rowdy seniors and a Russian boxer to a funeral, dragging clients like Tracy, a young woman with ALS, along for the ride.",
        "runtimeMinutes": "110"
    },
    "2019_366": {
        "plotSummary": "A bit of an outsider struggling to fit into her new surroundings, Nancy and her pals set out to solve a mystery, make new friends, and establish their place in the community.",
        "runtimeMinutes": "89"
    },
    "2019_367": {
        "plotSummary": "Spending the summer at a Catskills resort with her family, Frances \"Baby\" Houseman falls in love with the camp's dance instructor, Johnny Castle.",
        "runtimeMinutes": "100"
    },
    "2019_368": {
        "plotSummary": "Two NYC money launderers make a quick drug deal. Things go wrong, as dirty cops are involved. One of the friends gets amnesia during their escape with the drugs and money.",
        "runtimeMinutes": "112"
    },
    "2019_369": {
        "plotSummary": "Kermit and his newfound friends trek across America to find success in Hollywood, but a frog legs merchant is after Kermit.",
        "runtimeMinutes": "95"
    },
    "2019_37": {
        "plotSummary": "A bullied teenage girl forms an unlikely friendship with a mysterious young man who protects her from her assailants, all while she copes with the pressures of her final examinations.",
        "runtimeMinutes": "135"
    },
    "2019_370": {
        "plotSummary": "A life performance of Perrault's famous ballet with a beloved score by Tchaikovsky by the prestigious Bolshoi on its 2019 season.",
        "runtimeMinutes": "170"
    },
    "2019_371": {
        "plotSummary": "A passionate coming-of-age tale set amidst the conservative confines of modern Tbilisi, the film follows Merab, a competitive dancer who is thrown off balance by the arrival of Irakli, a fellow male dancer with a rebellious streak.",
        "runtimeMinutes": "113"
    },
    "2019_372": {
        "plotSummary": "A serial killer strikes fear in the hearts of residents of Hamburg during the early 1970s.",
        "runtimeMinutes": "115"
    },
    "2019_373": {
        "plotSummary": "Atticus Finch, a lawyer in the Depression-era South, defends a black man against an undeserved rape charge, and his children against prejudice.",
        "runtimeMinutes": "129"
    },
    "2019_374": {
        "plotSummary": "English rock band The Cure honor their 40 years together with a live concert at London's Hyde Park in July 2018.",
        "runtimeMinutes": "137"
    },
    "2019_375": {
        "plotSummary": "A girl without self-confidence meets a mysterious alchemist Hippocrates and his student Pipo who are on a mission to save the world. Together, they laid the groundwork for \"Wonderland\" and Akane is labeled as Wonderland's savior.",
        "runtimeMinutes": "115"
    },
    "2019_376": {
        "plotSummary": "A loyal dog and a vigilante cat embark on a space age voyage to find their way home.",
        "runtimeMinutes": "90"
    },
    "2019_377": {
        "plotSummary": "Snobbish phonetics Professor Henry Higgins agrees to a wager that he can make flower girl Eliza Doolittle presentable in high society.",
        "runtimeMinutes": "170"
    },
    "2019_378": {
        "plotSummary": "The origin story behind one of Broadway's most beloved musicals, Fiddler on The Roof, and its creative roots in early 1960s New York, when \"tradition\" was on the wane as gender roles, sexuality, race relations and religion were evolving.",
        "runtimeMinutes": "97"
    },
    "2019_379": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_38": {
        "plotSummary": "American car designer Carroll Shelby and driver Ken Miles battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966.",
        "runtimeMinutes": "152"
    },
    "2019_380": {
        "plotSummary": "An impoverished preacher who brings hope to the Miami projects is offered cash to save his family from eviction. He has no idea his sponsor works for the FBI who plan to turn him into a criminal by fueling his madcap revolutionary dreams.",
        "runtimeMinutes": "87"
    },
    "2019_381": {
        "plotSummary": "Come one, come all. On Thursday, August 1, join Dead Heads in your neighborhood - and around the world - when Trafalgar Releasing and Rhino Entertainment celebrate the 9th Annual Grateful Dead Meet-Up at the Movies. This can't-miss event -...See moreCome one, come all. On Thursday, August 1, join Dead Heads in your neighborhood - and around the world - when Trafalgar Releasing and Rhino Entertainment celebrate the 9th Annual Grateful Dead Meet-Up at the Movies. This can't-miss event - the first to go global - features the previously unreleased complete June 17, 1991 concert from Giants Stadium. Widely considered one of the greatest shows of the band's final decade of performing, 6/17/91 also sounds unlike any Dead show you've ever heard as it was one of only two recorded on 48-track. Mixed by Jeffr ey Norman in glorious surround sound with video from the multi-camera live edit, this will be the first time the Bruce Hornsby and Vince Welnick line-up has ever appeared on the big screen . Opening with a shocking \"Eyes Of The World,\" the Dead were firing on all cylinders from the opening notes of the show, mixing beloved classics like \"Truckin'\" and \"Uncle John's Band\" with rarities including \"Saint Of Circumstance,\" \"Might l MYAs bl,\" \"New Speedway Boogie,\" and \"China Doll.\" But the real standout was the recurrence of \"Dark Star,\" which wove in and out of the setlist, making no less than six distinct appearances and teases during the show. The Dead capped off the spectacularly night with a perfect song to send the crowd on its way - The Band's \"The Weight.\"  Written by Trafalgar ReleasingSee less",
        "runtimeMinutes": "120"
    },
    "2019_382": {
        "plotSummary": "A fest of the internet's favorite create: the cat video.",
        "runtimeMinutes": "70"
    },
    "2019_383": {
        "plotSummary": "",
        "runtimeMinutes": "110"
    },
    "2019_384": {
        "plotSummary": "For sixty years, Elizabeth II has met each of her twelve Prime Ministers in a weekly audience at Buckingham Palace, a meeting like no other in British public life, it is private.",
        "runtimeMinutes": "173"
    },
    "2019_385": {
        "plotSummary": "",
        "runtimeMinutes": "140"
    },
    "2019_386": {
        "plotSummary": "Telling the story of Moe Berg, an enigmatic Jewish catcher during baseball's Golden Age who joined the Office of Strategic Services (OSS) to spy for the U.S. on the Nazis' atomic bomb program.",
        "runtimeMinutes": "101"
    },
    "2019_387": {
        "plotSummary": "Dramatization of the little known side of the writer Emily Dickinson's life, in particular, her relationship with another woman.",
        "runtimeMinutes": "84"
    },
    "2019_388": {
        "plotSummary": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
        "runtimeMinutes": "169"
    },
    "2019_389": {
        "plotSummary": "A young Israeli man absconds to Paris to flee his nationality, aided by his trusty Franco-Israeli dictionary.",
        "runtimeMinutes": "123"
    },
    "2019_39": {
        "plotSummary": "Jo March reflects back and forth on her life, telling the beloved story of the March sisters - four young women, each determined to live life on her own terms.",
        "runtimeMinutes": "135"
    },
    "2019_390": {
        "plotSummary": "A love story between a girl who loves reading books, and a boy who has previously checked out all of the library books she chooses.",
        "runtimeMinutes": "111"
    },
    "2019_391": {
        "plotSummary": "Warrior and pacifist Princess Nausicaä desperately struggles to prevent two warring nations from destroying themselves and their dying planet.",
        "runtimeMinutes": "117"
    },
    "2019_392": {
        "plotSummary": "Born on the original Christmas in the stable next door to Jesus Christ, Brian of Nazareth spends his life being mistaken for a messiah.",
        "runtimeMinutes": "94"
    },
    "2019_393": {
        "plotSummary": "In the late 1980s, the Detroit Red Wings worked to finally break their decades long Stanley Cup drought by extracting players from the Soviet Union, and in the process, changed the way North American hockey is played.",
        "runtimeMinutes": "102"
    },
    "2019_394": {
        "plotSummary": "Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.",
        "runtimeMinutes": "145"
    },
    "2019_395": {
        "plotSummary": "The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.",
        "runtimeMinutes": "228"
    },
    "2019_396": {
        "plotSummary": "Rockumentary following British singer, Liam Gallagher, as he attempts to make a solo comeback.",
        "runtimeMinutes": "85"
    },
    "2019_397": {
        "plotSummary": "Focused on the life of the band and their collaborators over the 3 vital years in which they developed critically acclaimed albums, 'Humanz' and 'The Now Now', and undertook their most ambitious world tour to date.",
        "runtimeMinutes": "95"
    },
    "2019_398": {
        "plotSummary": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
        "runtimeMinutes": "142"
    },
    "2019_399": {
        "plotSummary": "A look at the quick rise and influence of the controversial religious group known as The Satanic Temple.",
        "runtimeMinutes": "95"
    },
    "2019_4": {
        "plotSummary": "Following the events of Avengers: Endgame, Spider-Man must step up to take on new threats in a world that has changed forever.",
        "runtimeMinutes": "129"
    },
    "2019_40": {
        "plotSummary": "The eccentrically macabre family moves to a bland suburb where Wednesday Addams' friendship with the daughter of a hostile and conformist local reality show host exacerbates conflict between the families.",
        "runtimeMinutes": "86"
    },
    "2019_400": {
        "plotSummary": "Based on the novel by Jason Wright, it tells the story of reporter Hope Jensen, who uncovers the secret behind \"Christmas Jars\" - jars filled with money and given anonymously to people in need. The phenomenon has changed countless lives.",
        "runtimeMinutes": "110"
    },
    "2019_401": {
        "plotSummary": "Two vicious step-siblings of an elite Manhattan prep school make a wager: to deflower the new headmaster's daughter before the start of term.",
        "runtimeMinutes": "97"
    },
    "2019_402": {
        "plotSummary": "Ira Steven Behr explores the legacy of Star Trek: Deep Space Nine.",
        "runtimeMinutes": "116"
    },
    "2019_403": {
        "plotSummary": "Three former parapsychology professors set up shop as a unique ghost removal service.",
        "runtimeMinutes": "105"
    },
    "2019_404": {
        "plotSummary": "Victor (William Levy) has a deep secret - he is a cold-blooded assassin. Smooth talking and seductive, Victor was raised to do one thing only, which is to kill for money. When he is sent to the home of a brutal drug lord to collect payment...See moreVictor (William Levy) has a deep secret - he is a cold-blooded assassin. Smooth talking and seductive, Victor was raised to do one thing only, which is to kill for money. When he is sent to the home of a brutal drug lord to collect payment for his most recent hit, he encounters the beautiful Sarai (Alicia Sanz), who has been forced to spend the last 9 years of her life with the drug lord. After Victor leaves the compound, Sarai seizes her chance at freedom by hiding out in Victor's car. But things don't go as planned and instead of being transported back to her home, she finds herself free from one dangerous man only to be caught in the clutches of another. While on the run from the vengeful drug lord and his brutal henchmen, Victor's conscience catches up with him as he risks all that he stood for to protect his captive. In the end, the power Sarai unknowingly holds over Victor and their undeniable attraction may be what places her right in the arms of a killer.  Written by PantelionSee less",
        "runtimeMinutes": "106"
    },
    "2019_405": {
        "plotSummary": "After a Jewish prince is betrayed and sent into slavery by a Roman friend, he regains his freedom and comes back for revenge.",
        "runtimeMinutes": "212"
    },
    "2019_406": {
        "plotSummary": "A tribute to one of the world's great filmmakers and the men of the 8th Air Force who flew mission after suicidal mission in the Second World War.",
        "runtimeMinutes": "101"
    },
    "2019_407": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_408": {
        "plotSummary": "Economic collapse causes widespread rioting and social unrest, leaving a lovesick 19-year-old girl struggling to care for her siblings in a stretch of woods bordered by lawless anarchy, wondering why a good God would let this happen.See moreEconomic collapse causes widespread rioting and social unrest, leaving a lovesick 19-year-old girl struggling to care for her siblings in a stretch of woods bordered by lawless anarchy, wondering why a good God would let this happen.  Written by J. P. JohnstonSee less",
        "runtimeMinutes": "140"
    },
    "2019_409": {
        "plotSummary": "In the year leading up to the 1904 St. Louis World's Fair, the four Smith daughters learn lessons of life and love, even as they prepare for a reluctant move to New York.",
        "runtimeMinutes": "113"
    },
    "2019_41": {
        "plotSummary": "A musical fantasy about the fantastical human story of Elton John's breakthrough years. Read more: Synopsis",
        "runtimeMinutes": "121"
    },
    "2019_410": {
        "plotSummary": "Matchmaker Dolly Levi travels to Yonkers to find a partner for \"half-a-millionaire\" Horace Vandergelder, convincing his niece, his niece's intended, and his two clerks to travel to New York City along the way.",
        "runtimeMinutes": "146"
    },
    "2019_411": {
        "plotSummary": "A story centered on a mysterious British Muslim man (Dev Patel) on his journey across Pakistan and India.",
        "runtimeMinutes": "96"
    },
    "2019_412": {
        "plotSummary": "The Clock family are four-inch-tall people who live anonymously in another family's residence, borrowing simple items to make their home. Life changes for the Clocks when their teenage daughter, Arrietty, is discovered.",
        "runtimeMinutes": "94"
    },
    "2019_413": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_414": {
        "plotSummary": "The iconic Merce Cunningham and the last generation of his dance company is stunningly profiled in Alla Kovgan's 3D documentary, through recreations of his landmark works and archival footage of Cunningham, John Cage, and Robert Rauschenberg.",
        "runtimeMinutes": "93"
    },
    "2019_415": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_416": {
        "plotSummary": "A teenager's quest to launch Norwegian Black Metal in Oslo in the early 1990s results in a very violent outcome.",
        "runtimeMinutes": "118"
    },
    "2019_417": {
        "plotSummary": "As she prepares to execute another inmate, Bernadine must confront the psychological and emotional demons her job creates, ultimately connecting her to the man she is sanctioned to kill.",
        "runtimeMinutes": "112"
    },
    "2019_418": {
        "plotSummary": "Based on the international bestseller by Robert Seethaler. A tender, heart-breaking story about one young man and his friendship with Sigmund Freud during the Nazi occupation of Vienna....",
        "runtimeMinutes": "117"
    },
    "2019_419": {
        "plotSummary": "A brave-hearted girl and her charming best friend make a bewitching pair as they embark on a mission to take down the oppressive schooling system of K-12.",
        "runtimeMinutes": "96"
    },
    "2019_42": {
        "plotSummary": "The continuing story of the Crawley family, wealthy owners of a large estate in the English countryside in the early twentieth century. Read more: Synopsis",
        "runtimeMinutes": "122"
    },
    "2019_420": {
        "plotSummary": "Ed Hemsler spends his life preparing for a disaster that may never come. Ronnie Meisner spends her life shopping for things she may never use. These two people will try to find love.",
        "runtimeMinutes": "94"
    },
    "2019_421": {
        "plotSummary": "When an alien spacecraft of enormous power is spotted approaching Earth, Admiral James T. Kirk resumes command of the overhauled USS Enterprise in order to intercept it.",
        "runtimeMinutes": "132"
    },
    "2019_422": {
        "plotSummary": "When a billionaire's daughter intent on bringing down a major crime syndicate is targeted by a group of professional assassins, a team of mercenaries must stop them before they kill her.",
        "runtimeMinutes": "96"
    },
    "2019_423": {
        "plotSummary": "In the city of Orario, beneath an impossibly tall tower, lies the dungeon. Only adventurers who form partnerships with the gods themselves have any hope of defeating the monsters that lie within. But the dungeon is not the only place where...See moreIn the city of Orario, beneath an impossibly tall tower, lies the dungeon. Only adventurers who form partnerships with the gods themselves have any hope of defeating the monsters that lie within. But the dungeon is not the only place where monsters exist. Far from Orario, in the ruins of an ancient city, a new threat arises. To counter this threat, the goddess Artemis has come to Orario in search of a champion-but it's not Ais Wallenstein (the legendary Sword Princess) nor Ottar (the strongest warrior to ever enter the dungeon) that she chooses. Rather it is Bell Cranel, a newbie adventurer partnered with a low-tier goddess.See less",
        "runtimeMinutes": "82"
    },
    "2019_424": {
        "plotSummary": "Diane fills her days helping others and desperately attempting to bond with her drug-addicted son. As these pieces of her existence begin to fade, she finds herself confronting memories she'd sooner forget than face.",
        "runtimeMinutes": "95"
    },
    "2019_425": {
        "plotSummary": "A bold girl discovers a bizarre, threatening, and mysterious new world beyond her front door after she escapes her father's protective and paranoid control.",
        "runtimeMinutes": "105"
    },
    "2019_426": {
        "plotSummary": "Filmmakers travel to six continents and 20 countries to document the impact humans have made on the planet.",
        "runtimeMinutes": "87"
    },
    "2019_427": {
        "plotSummary": "A young man is ostracized by his classmates after he bullies a deaf girl to the point where she moves away. Years later, he sets off on a path for redemption.",
        "runtimeMinutes": "130"
    },
    "2019_428": {
        "plotSummary": "Live coverage of Errol Spence Jr. vs. Danny Garcia at the AT&T Stadium in Arlington, Texas.",
        "runtimeMinutes": "223"
    },
    "2019_429": {
        "plotSummary": "Astronaut Lucy Cola returns to Earth after a transcendent experience during a mission to space, and begins to lose touch with reality in a world that now seems too small.",
        "runtimeMinutes": "124"
    },
    "2019_43": {
        "plotSummary": "A high-school boy who has run away to Tokyo befriends a girl who appears to be able to manipulate the weather.",
        "runtimeMinutes": "112"
    },
    "2019_430": {
        "plotSummary": "Cynthia and Mary show up to collect Cynthia's inheritance from her deceased grandfather, but the only item she receives is an antique sword that was believed by her grandfather to be proof that the South won the Civil War.",
        "runtimeMinutes": "88"
    },
    "2019_431": {
        "plotSummary": "Oscar-winning musical chronicle that brilliantly captures the three-day rock concert and celebration of peace and love that became a capstone for the Sixties.",
        "runtimeMinutes": "184"
    },
    "2019_432": {
        "plotSummary": "Two teenage boys in Scotland in 1994, best friends with no control over their lives, risk everything to attend an illegal rave, hoping for the best night of their boring lives.",
        "runtimeMinutes": "101"
    },
    "2019_433": {
        "plotSummary": "The life of Mikhail Gorbachev, the eighth and final President of the Soviet Union in chronological order.",
        "runtimeMinutes": "90"
    },
    "2019_434": {
        "plotSummary": "You Are Here - A Come From Away Story is an intimate feature documentary that goes deep into the community of Gander, Newfoundland where 38 airliners carrying over 6,500 passengers were forced to land after the terrorist attacks on 9/11. ...See moreYou Are Here - A Come From Away Story is an intimate feature documentary that goes deep into the community of Gander, Newfoundland where 38 airliners carrying over 6,500 passengers were forced to land after the terrorist attacks on 9/11. The film pulls back the emotional layers surrounding the five days during which the community housed, fed and cared for the dislocated passengers (or the \"come from aways\" in Newfoundland parlance). While their stories were the inspiration for the extraordinary Broadway hit musical, Come From Away, the documentary, You Are Here, reveals first-hand accounts of the great kindnesses and energetic resourcefulness the community showed their unexpected guests. Their emotional and sometimes humorous story of compassion and generosity, born of a long history of rescuing and welcoming shipwrecked sailors, resonates with a legacy of healing and reconciliation for the world - especially for the survivors of those murdered on 9/11, and for the first responders who lost their own lives saving others on that fateful day.  Written by MDF Productions IncSee less",
        "runtimeMinutes": "84"
    },
    "2019_435": {
        "plotSummary": "Charting the incredible life of Dr. Ruth Westheimer, a Holocaust survivor who became America's most famous sex therapist.",
        "runtimeMinutes": "100"
    },
    "2019_436": {
        "plotSummary": "Josh Groban sings at a live concert from Madison Square Garden.",
        "runtimeMinutes": null
    },
    "2019_437": {
        "plotSummary": "An operatic gala concert event captured live on Aug 4, 2019 with excerpts from 3 famous operas. Placido Domingo's 50th anniversary.",
        "runtimeMinutes": "120"
    },
    "2019_438": {
        "plotSummary": "In 19th century rural Vietnam, May is ready to become the third wife of a wealthy landowner. Little does she know that her hidden desires will force her to decide between living in safety and being free.",
        "runtimeMinutes": "96"
    },
    "2019_439": {
        "plotSummary": "An extraordinary look into the political career of Imelda Marcos, this documentary tells a cautionary tale of a powerful leader whose questionable sense of reality divided the Philippines.",
        "runtimeMinutes": "101"
    },
    "2019_44": {
        "plotSummary": "It's been five years since everything was awesome and the citizens are facing a huge new threat: Lego Duplo invaders from outer space, wrecking everything faster than they can rebuild. Read more: Synopsis",
        "runtimeMinutes": "107"
    },
    "2019_440": {
        "plotSummary": "Inspired by historical events, CLIFFS OF FREEDOM is a timeless and romantic story of bravery and faith between a Greek village girl and a Turkish Ottoman Colonel during the dawn of the Greek War for Independence.",
        "runtimeMinutes": "137"
    },
    "2019_441": {
        "plotSummary": "Shakira is a global superstar who, by the age of 18, had taken Latin America by storm. Now, she celebrates her triumphant return to the stage in 2018 with a thrilling concert film documenting her acclaimed El Dorado World Tour.",
        "runtimeMinutes": "122"
    },
    "2019_442": {
        "plotSummary": "Giant spiders from another dimension invade Wisconsin.",
        "runtimeMinutes": "84"
    },
    "2019_443": {
        "plotSummary": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
        "runtimeMinutes": "202"
    },
    "2019_444": {
        "plotSummary": "Based on Anuja Chauhan's novel, Zoya Factor is a rom-com about Zoya, an advertising agent, and her relationship with the captain of Team India, Nikhil Khoda.",
        "runtimeMinutes": "134"
    },
    "2019_445": {
        "plotSummary": "Tanya Degurechaff continues her misadventures, avoiding death and being sent to hell, while battling the forces of the Republic Army.",
        "runtimeMinutes": "115"
    },
    "2019_446": {
        "plotSummary": "Conceived and created by Khalid and Emil Nava, Free Spirit is a direct creative parallel to Khalid's new album, using the new music to tell the stories of the beauty and the pain of growing up as Khalid has always done in his work. This ...See moreConceived and created by Khalid and Emil Nava, Free Spirit is a direct creative parallel to Khalid's new album, using the new music to tell the stories of the beauty and the pain of growing up as Khalid has always done in his work. This film expands on his lyrics and artistry by sharing a visual story as a companion piece.See less",
        "runtimeMinutes": "45"
    },
    "2019_447": {
        "plotSummary": "A look at the career of 60 Minutes newsman, Mike Wallace.",
        "runtimeMinutes": "90"
    },
    "2019_448": {
        "plotSummary": "A team of researchers discovers a strange mutation of man and octopus who proceeds to terrorize them.",
        "runtimeMinutes": "79"
    },
    "2019_449": {
        "plotSummary": "",
        "runtimeMinutes": "140"
    },
    "2019_45": {
        "plotSummary": "A wealthy businessman tries to take down a drug kingpin that he used to work with, while a policeman tries to find justice without breaking the law.",
        "runtimeMinutes": "99"
    },
    "2019_450": {
        "plotSummary": "A U.S. soccer star suffers a career-threatening injury in the run-up to the World Cup, and during his recovery, embarks on an epic romance with a Russian single mom.",
        "runtimeMinutes": "107"
    },
    "2019_451": {
        "plotSummary": "A drunken, hard-nosed U.S. Marshal and a Texas Ranger help a stubborn teenager track down her father's murderer in Indian Territory.",
        "runtimeMinutes": "128"
    },
    "2019_452": {
        "plotSummary": "'Slayer: The Repentless Killogy' is a short narrative film written and directed by BJ McDonnell, that blends the music of Slayer with an uncompromising and unmissable, trilogy of music videos assembled as one chronological story-line.",
        "runtimeMinutes": "131"
    },
    "2019_453": {
        "plotSummary": "After becoming a mother, a filmmaker uncovers the untold history of China's one-child policy and the generations of parents and children forever shaped by this social experiment.",
        "runtimeMinutes": "83"
    },
    "2019_454": {
        "plotSummary": "Found inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her, but ultimately she must confront her fate, ...See moreFound inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her, but ultimately she must confront her fate, the punishment for her crime.See less",
        "runtimeMinutes": "137"
    },
    "2019_455": {
        "plotSummary": "",
        "runtimeMinutes": "95"
    },
    "2019_456": {
        "plotSummary": "Winter 1839. LIBERTY, MISSOURI. Local jailer, Samuel Tillery (Jasen Wade) is tasked with watching Missouri's most wanted men as they await their upcoming hearing. Caught between the local Missourians' increased drive to remove the ...See moreWinter 1839. LIBERTY, MISSOURI. Local jailer, Samuel Tillery (Jasen Wade) is tasked with watching Missouri's most wanted men as they await their upcoming hearing. Caught between the local Missourians' increased drive to remove the prisoners, and the prisoners' desperate efforts to survive, Tillery is pushed beyond what any lawman can endure. Based on actual recorded accounts, OUT OF LIBERTY is an intense, evocative western, with an outcome you have to see to believe.See less",
        "runtimeMinutes": "111"
    },
    "2019_457": {
        "plotSummary": "A documentary outlining the story of a town once troubled by social tensions that makes a powerful comeback and reunites community through music.",
        "runtimeMinutes": "116"
    },
    "2019_458": {
        "plotSummary": "A self-destructive punk rocker struggles with sobriety while trying to recapture the creative inspiration that led her band to success.",
        "runtimeMinutes": "136"
    },
    "2019_459": {
        "plotSummary": "Rocket ships, Rayguns, and Robots abound in this heart-pounding tale where the stellar adventurer Saber Raine is hired to guide three elite soldiers on a rescue mission to a mysterious planet on the outer rim of the galaxy.",
        "runtimeMinutes": "83"
    },
    "2019_46": {
        "plotSummary": "Three teenagers must help a Yeti return to his family while avoiding a wealthy man and a zoologist who want him for their own needs. Read more: Synopsis",
        "runtimeMinutes": "97"
    },
    "2019_460": {
        "plotSummary": "Amidst air strikes and bombings, a group of female doctors in Ghouta, Syria struggle with systemic sexism while trying to care for the injured using limited resources.",
        "runtimeMinutes": "107"
    },
    "2019_461": {
        "plotSummary": "Faced with an indifferent youth group, a new youth Pastor (Brett Varvel) tries to motivate his students to read God's Word and get serious about their faith.",
        "runtimeMinutes": "103"
    },
    "2019_462": {
        "plotSummary": "Harry and Sally have known each other for years, and are very good friends, but they fear sex would ruin the friendship.",
        "runtimeMinutes": "95"
    },
    "2019_463": {
        "plotSummary": "Best friends and old-school street hustlers Black and Blue went legit twenty years ago when they opened their family restaurant. But with the health inspector threatening to shut them down, they could lose it all. Now it's up to young scam...See moreBest friends and old-school street hustlers Black and Blue went legit twenty years ago when they opened their family restaurant. But with the health inspector threatening to shut them down, they could lose it all. Now it's up to young scam artists Fatboy and Spyda to step up and save the day. And a stolen shipment of the hottest smart phones might just be the ticket, so long as the cops and a couple of bloodthirsty gangs don't get them first. Come back and visit the old neighborhood in this hilarious all-new comedy classic even wilder than the original.See less",
        "runtimeMinutes": "107"
    },
    "2019_464": {
        "plotSummary": "After being arrested for the murder of a white classmate, a young black man's father fights in court for his son's vindication. Against all odds, they embrace their undying trust in each other and find faith in God.",
        "runtimeMinutes": "89"
    },
    "2019_466": {
        "plotSummary": "The Ood have given a warning to The Doctor. The Master is returning yet that is not the biggest threat. A darkness is coming which brings with it The End of Time.",
        "runtimeMinutes": "60"
    },
    "2019_468": {
        "plotSummary": "A woman raises her young grandson after her daughter goes missing.",
        "runtimeMinutes": "111"
    },
    "2019_469": {
        "plotSummary": "When Detective Mike Hoolihan is called to investigate the shooting of leading astrophysicist and black hole expert, Jennifer Rockwell, she is affected in ways she struggles to comprehend. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2019_47": {
        "plotSummary": "The Kung Fu master travels to the U.S. where his student has upset the local martial arts community by opening a Wing Chun school.",
        "runtimeMinutes": "107"
    },
    "2019_470": {
        "plotSummary": "A re-imagining of Hamlet, told from Ophelia's perspective.",
        "runtimeMinutes": "114"
    },
    "2019_471": {
        "plotSummary": "Join 311 and their dedicated fan base to several 311 Days, 311 cruises and festivals. Get to know the band personally and just what it means to be a fan.",
        "runtimeMinutes": "133"
    },
    "2019_472": {
        "plotSummary": "A group of intelligence officers embark on a top secret mission to track down a wanted international criminal.",
        "runtimeMinutes": "123"
    },
    "2019_473": {
        "plotSummary": "Agnès Varda, photographer, installation artist and pioneer of the Nouvelle Vague, is an institution of French cinema. Taking a seat on a theatre stage, she uses photos and film excerpts to provide an insight into her unorthodox oeuvre.",
        "runtimeMinutes": "119"
    },
    "2019_474": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_475": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_476": {
        "plotSummary": "After a happy childhood in the countryside, a teenager moves to London, where he must navigate an unfamiliar environment on his road to adulthood.",
        "runtimeMinutes": "98"
    },
    "2019_477": {
        "plotSummary": "Two miles into the earth, nine Appalachian miners struggle to survive after a methane explosion leaves them with one hour of oxygen. Read more: Synopsis",
        "runtimeMinutes": "83"
    },
    "2019_478": {
        "plotSummary": "A TV interviewer and his cameraman meet a former actress and travel through her memories and career.",
        "runtimeMinutes": "87"
    },
    "2019_479": {
        "plotSummary": "Rose, a mostly sweet and lonely Irish driving instructor, must use her supernatural talents to save the daughter of Martin (also mostly sweet and lonely) from a washed-up rock star who is using her in a Satanic pact to reignite his fame.",
        "runtimeMinutes": "94"
    },
    "2019_48": {
        "plotSummary": "An over-the-hill hitman faces off against a younger clone of himself.",
        "runtimeMinutes": "117"
    },
    "2019_480": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_481": {
        "plotSummary": "Filmmakers and stars discuss the filming and social effects of Galaxy Quest, a comedic take-off of Star Trek, with brilliant commentary not only on the Star Trek series but on the real-life actors themselves.",
        "runtimeMinutes": "95"
    },
    "2019_482": {
        "plotSummary": "A martial arts master agrees to teach karate to a bullied teenager.",
        "runtimeMinutes": "126"
    },
    "2019_483": {
        "plotSummary": "Hamlet, Prince of Denmark, finds out that his Uncle Claudius killed his father to obtain the throne, and plans his revenge.",
        "runtimeMinutes": "217"
    },
    "2019_484": {
        "plotSummary": "A dark fairy tale about a gang of five children trying to survive the horrific violence of the cartels and the ghosts created every day by the drug war.",
        "runtimeMinutes": "83"
    },
    "2019_485": {
        "plotSummary": "Recent divorcee Faith enters a dance contest to save her dance studio, where she meets Jimmy Hope and rediscovers her faith and dreams.",
        "runtimeMinutes": "106"
    },
    "2019_486": {
        "plotSummary": "Comedian Kathy Griffin performs a new set in the aftermath of the fallout she experienced due to a controversial Donald Trump-inspired photo shoot that threatened to end her career.",
        "runtimeMinutes": "106"
    },
    "2019_487": {
        "plotSummary": "The Dark Knight of Gotham City begins his war on crime with his first major enemy being Jack Napier, a criminal who becomes the clownishly homicidal Joker.",
        "runtimeMinutes": "126"
    },
    "2019_488": {
        "plotSummary": "\"The Iron Orchard\" is the story of Jim McNeely, a young man thrust into the vibrant and brutal West Texas oilfields in 1939, who works his way through the ranks to ultimately become a formidable wildcatter.",
        "runtimeMinutes": "118"
    },
    "2019_489": {
        "plotSummary": "Life at work becomes unbearable for Orna. Her boss appreciates and promotes her, while making inappropriate advances. Her husband struggles to keep his new restaurant afloat, and Orna becomes the main breadwinner for their three children. ...See moreLife at work becomes unbearable for Orna. Her boss appreciates and promotes her, while making inappropriate advances. Her husband struggles to keep his new restaurant afloat, and Orna becomes the main breadwinner for their three children. When her world is finally shattered, she must pull herself together to fight, in her own way, for her job and a sense of self-worth.  Written by Jerusalem Film FestivalSee less",
        "runtimeMinutes": "93"
    },
    "2019_49": {
        "plotSummary": "When the world's best spy is turned into a pigeon, he must rely on his nerdy tech officer to save the world.",
        "runtimeMinutes": "102"
    },
    "2019_490": {
        "plotSummary": "Amidst some of the most tumultuous times in our nation's history, Rev. Theodore Hesburgh finds himself in the eye of the storm as he works to advance the causes of peace and equal rights.",
        "runtimeMinutes": "106"
    },
    "2019_491": {
        "plotSummary": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate and other historical events unfold through the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
        "runtimeMinutes": "142"
    },
    "2019_492": {
        "plotSummary": "An inside look at 2001's Daytona 500 featuring Michael Waltrip and Dale Earnhardt Jr.",
        "runtimeMinutes": "88"
    },
    "2019_493": {
        "plotSummary": "A man is brought back from the dead to work in the hell of sugar cane plantations. 55 years later, a Haitian teenager tells her friends her family secret - not suspecting that it will push one of them to commit the irreparable.",
        "runtimeMinutes": "103"
    },
    "2019_494": {
        "plotSummary": "Alice, a single mother, is a dedicated senior plant breeder at a corporation engaged in developing new species. Against company policy, she takes one home as a gift for her teenage son and names it after him but soon starts fearing it.",
        "runtimeMinutes": "105"
    },
    "2019_495": {
        "plotSummary": "Follows the personal and professional lives of six twenty to thirty-something-year-old friends living in Manhattan.",
        "runtimeMinutes": "22"
    },
    "2019_496": {
        "plotSummary": "A tale of women's empowerment, The Warrior Queen of Jhansi tells the true story of Lakshmibai, the historic Queen of Jhansi who fiercely led her army against the British East India Company in the infamous mutiny of 1857.",
        "runtimeMinutes": "102"
    },
    "2019_497": {
        "plotSummary": "Kate Stone is career-focused, and enjoys her life that way. Her brash attitude keeps relationships at arm's length, making her an outcast in her own right.",
        "runtimeMinutes": "85"
    },
    "2019_498": {
        "plotSummary": "In Nazi-occupied Paris, the immoral art dealer, Robert Klein, leads a life of luxury, until a copy of a Jewish newspaper brings him to the attention of the police, linking him with a mysterious doppelgänger. Will Mr Klein clear his name?",
        "runtimeMinutes": "123"
    },
    "2019_499": {
        "plotSummary": "THE DIVINE PLAN: The Divine Plan: John Paul II, Ronald Reagan, and the Dramatic End of the Cold War/ A film by Robert Orlando It remains the least-known story of the twentieth century - A president and a pope; an unlikely pair who combine ...See moreTHE DIVINE PLAN: The Divine Plan: John Paul II, Ronald Reagan, and the Dramatic End of the Cold War/ A film by Robert Orlando It remains the least-known story of the twentieth century - A president and a pope; an unlikely pair who combine deep faith with political acumen and high-octane star power. A plot that involves two assassination attempts, KGB scheming, CIA intrigue and the final act to topple the Soviet Empire.See less",
        "runtimeMinutes": "105"
    },
    "2019_5": {
        "plotSummary": "Carol Danvers becomes one of the universe's most powerful heroes when Earth is caught in the middle of a galactic war between two alien races.",
        "runtimeMinutes": "123"
    },
    "2019_50": {
        "plotSummary": "Inspired by the viral New York Magazine article, Hustlers follows a crew of savvy former strip club employees who band together to turn the tables on their Wall Street clients. Read more: Synopsis",
        "runtimeMinutes": "110"
    },
    "2019_500": {
        "plotSummary": "Britt-Marie, 63 years old, has just left a 40 year old marriage and her long life as a house wife. Being told she is a nagging passive aggressive aunt, the new, only job, in small town Borg, will be quite challenging. Small town of Borg ...See moreBritt-Marie, 63 years old, has just left a 40 year old marriage and her long life as a house wife. Being told she is a nagging passive aggressive aunt, the new, only job, in small town Borg, will be quite challenging. Small town of Borg has no pride left except the young soccer team and Britt-Marie's new job is to coach them. This is the start of a journey filled with not only struggles and challenges, but also warmth and love.  Written by spelling errorsSee less",
        "runtimeMinutes": "97"
    },
    "2019_501": {
        "plotSummary": "The true story of how Luis Buñuel made his third movie.",
        "runtimeMinutes": "80"
    },
    "2019_502": {
        "plotSummary": "Shmuel, a Hasidic cantor in upstate New York, distraught by the untimely death of his wife, struggles to find religious solace, while secretly obsessing over how her body will decay.",
        "runtimeMinutes": "105"
    },
    "2019_503": {
        "plotSummary": "Five friends travel from El Paso to the Gulf of Mexico along the Rio Grande via bicycle, horseback, and canoe, exploring the relationship between the river and the proposed wall along America's border with Mexico.",
        "runtimeMinutes": "97"
    },
    "2019_504": {
        "plotSummary": "Two popular teen boys, best friends since childhood, discover their lives, families, and girlfriends dramatically upended after an unexpected incident occurs on the night of a 17th birthday party.",
        "runtimeMinutes": "93"
    },
    "2019_505": {
        "plotSummary": "This three-act ballet boasts a score by Alexander Glazunov, filled with melody, color, and grand effects. Ludmilla Semenyaka is magnificent as the youthfully charming Raymonda and her gallant knight, Jean de Brienne, is portrayed by Irek ...See moreThis three-act ballet boasts a score by Alexander Glazunov, filled with melody, color, and grand effects. Ludmilla Semenyaka is magnificent as the youthfully charming Raymonda and her gallant knight, Jean de Brienne, is portrayed by Irek Moukhamedov. This is a beautiful story of a young couple separated by Jean's commitment to aid King Andrei II on a campaign. In the midst of all of this, another would-be suitor a Saraceb knight, Abderakhman (played by Gedeminas Taranda) makes a bid for the hand of Raymonda. When she rejects him, he threatens to abduct her. Jean returns just in time to settle this problem in a proper duel. Abderakhman is handily defeated, and Raymonda and Jean are married at the court of King Andrei.  Written by G. FormanSee less",
        "runtimeMinutes": "146"
    },
    "2019_506": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_507": {
        "plotSummary": "\"Good Kenyan girls become good Kenyan wives,\" but Kena and Ziki long for something more. When love blossoms between them, the two girls will be forced to choose between happiness and safety.",
        "runtimeMinutes": "83"
    },
    "2019_508": {
        "plotSummary": "An uncensored look into the artistic process and personal relationships of Christo, an artist known for his large-scale installations. For the first time since the passing of his wife and partner, Jeanne-Claude, Christo sets out to realize...See moreAn uncensored look into the artistic process and personal relationships of Christo, an artist known for his large-scale installations. For the first time since the passing of his wife and partner, Jeanne-Claude, Christo sets out to realize, The Floating Piers, a project they conceived together many years before.See less",
        "runtimeMinutes": "105"
    },
    "2019_509": {
        "plotSummary": "The story of immigration attorney Judy Wood, and how she initiated the change in U.S. law of asylum to save women's lives.",
        "runtimeMinutes": "106"
    },
    "2019_51": {
        "plotSummary": "The four members of the China Everest Climbing Commando confront the most difficult mount. The first four failures have cost them too much physical strength until the wind and snow stop the gap.",
        "runtimeMinutes": "125"
    },
    "2019_510": {
        "plotSummary": "An anthology of three original shorts written and directed by Hiromasa Yonebayashi, Yoshiyuki Momose and Akihiko Yamashita.",
        "runtimeMinutes": "53"
    },
    "2019_511": {
        "plotSummary": "Feature documentary on the life, struggle, and teaching of world-renowned yogi BKS Iyengar.",
        "runtimeMinutes": "107"
    },
    "2019_512": {
        "plotSummary": "A group of young people, guided by an app which connects living with the dead, find themselves at an abandoned castle. A place with a horrific history tied to each of them, for reasons they'll soon discover.",
        "runtimeMinutes": "83"
    },
    "2019_513": {
        "plotSummary": "Set deep in the wilds of Appalachia, where believers handle death-dealing snakes to prove themselves before God, a pastor's daughter holds a secret that threatens to tear her community apart.",
        "runtimeMinutes": "98"
    },
    "2019_514": {
        "plotSummary": "A modern Western about two sisters who work outside the law to better their lives.",
        "runtimeMinutes": "105"
    },
    "2019_515": {
        "plotSummary": "A story of relentless grit, motivational strength and humbling triumph, PALAU is a film many will relate to. As a young man, a passion and vision to proclaim the Good News of Jesus to all the nations was planted deep in Luis Palau's heart....See moreA story of relentless grit, motivational strength and humbling triumph, PALAU is a film many will relate to. As a young man, a passion and vision to proclaim the Good News of Jesus to all the nations was planted deep in Luis Palau's heart. Amidst both seemingly insurmountable struggles and remarkable miracles, Luis never lost sight of his calling. His extraordinary story will bring hope to the masses and encourage all that God has greatness in store for them.  Written by Julia BonnerSee less",
        "runtimeMinutes": "120"
    },
    "2019_516": {
        "plotSummary": "Pamela B. Green's energetic film about pioneer filmmaker Alice Guy-Blache is both a tribute and a detective story, tracing the circumstances by which this extraordinary artist faded from memory and the path toward her reclamation.",
        "runtimeMinutes": "103"
    },
    "2019_517": {
        "plotSummary": "What happens when a group of talented kids from a performing arts school are faced with an impossible challenge - to create a showcase that teaches the world how they were created to shine? From the creative minds of award-winning Bethel ...See moreWhat happens when a group of talented kids from a performing arts school are faced with an impossible challenge - to create a showcase that teaches the world how they were created to shine? From the creative minds of award-winning Bethel Music and writer/directors, Fred Vassallo and David Noroña, comes this high energy and heartfelt story that combines incredible dance with powerful songs to reveal that even kids can change the world when they find their voice and tell their story. In the veins of High School Musical, Bright Ones is an uplifting and moving film that will inspire the whole family.  Written by Bethel MusicSee less",
        "runtimeMinutes": "82"
    },
    "2019_518": {
        "plotSummary": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000.",
        "runtimeMinutes": "149"
    },
    "2019_519": {
        "plotSummary": "A look at the working environment of a chambermaid in one of Mexico City's most luxurious hotels.",
        "runtimeMinutes": "102"
    },
    "2019_52": {
        "plotSummary": "Six strangers find themselves in a maze of deadly mystery rooms and must use their wits to survive.",
        "runtimeMinutes": "99"
    },
    "2019_520": {
        "plotSummary": "Prodigiously talented, Halston reigned over fashion in the 1970s and became a household name. But everything changed in the Wall Street era. With his empire under threat, Halston took the biggest gamble of his life.",
        "runtimeMinutes": "105"
    },
    "2019_521": {
        "plotSummary": "",
        "runtimeMinutes": "160"
    },
    "2019_522": {
        "plotSummary": "When the body of a powerful businesswoman disappears from the morgue, the inspector in charge hunts for the truth. But when he questions her husband he realizes that there is much more to the case than meets the eye.",
        "runtimeMinutes": "101"
    },
    "2019_523": {
        "plotSummary": "Get caught up in the tale of a new stock broker who dreams of becoming rich. Those dreams make him susceptible to a stock market scam that threatens to get him in trouble.",
        "runtimeMinutes": "115"
    },
    "2019_524": {
        "plotSummary": "A pair of sisters find out that the mother they thought was dead is alive and starring on a soap opera.",
        "runtimeMinutes": "98"
    },
    "2019_525": {
        "plotSummary": "Photographer Stephen Wilkes creates an intimate portrait of his mentor, Jay Maisel, as he leaves the 30,000 square foot building in the Bowery that he's inhabited and filled with his eccentric collection of beautiful random objects for the...See morePhotographer Stephen Wilkes creates an intimate portrait of his mentor, Jay Maisel, as he leaves the 30,000 square foot building in the Bowery that he's inhabited and filled with his eccentric collection of beautiful random objects for the last 40 years - known as 'The Bank.'See less",
        "runtimeMinutes": "79"
    },
    "2019_526": {
        "plotSummary": "Robert Gould Shaw leads the U.S. Civil War's first all-black volunteer company, fighting prejudices from both his own Union Army, and the Confederates.",
        "runtimeMinutes": "122"
    },
    "2019_527": {
        "plotSummary": "A man kisses his wife and baby goodbye and seemingly heads away on business, with a plan to check into a hotel, call an escort service, and kill an unsuspecting prostitute.",
        "runtimeMinutes": "81"
    },
    "2019_528": {
        "plotSummary": "The tragic and controversial story of Cameron Todd Willingham, who was executed in Texas for killing his three children after scientific evidence and expert testimony that bolstered his claims of innocence were suppressed.",
        "runtimeMinutes": "127"
    },
    "2019_529": {
        "plotSummary": "The Russian aristocracy prepares for the French invasion on the eve of 1812.",
        "runtimeMinutes": "100"
    },
    "2019_53": {
        "plotSummary": "A struggling musician realizes he's the only person on Earth who can remember The Beatles after waking up in an alternate timeline where they never existed.",
        "runtimeMinutes": "116"
    },
    "2019_530": {
        "plotSummary": "Intense thriller where politics, big business and narcotics collide.",
        "runtimeMinutes": "113"
    },
    "2019_531": {
        "plotSummary": "The strange case of Mikhail Khodorkovsky, once believed to be the wealthiest man in Russia, who rocketed to prosperity and prominence in the 1990s, served a decade in prison, and became an unlikely martyr for the anti-Putin movement.",
        "runtimeMinutes": "126"
    },
    "2019_532": {
        "plotSummary": "Who was the real John DeLorean? To some, he was a renegade visionary who revolutionized the automobile industry. To others, he was the ultimate con man.",
        "runtimeMinutes": "109"
    },
    "2019_533": {
        "plotSummary": "Preparing to overhaul his TARDIS, the Doctor goes to Earth to take fresh measurements of a police box. A figure in white observes, as the Master lies in wait with a puzzling predicament for his rival Time Lord.",
        "runtimeMinutes": "25"
    },
    "2019_534": {
        "plotSummary": "A jealous King jeopardizes his family, friendships, and succession.",
        "runtimeMinutes": "180"
    },
    "2019_535": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_536": {
        "plotSummary": "Patricio Guzmán left Chile more than 40 years ago when the military dictatorship took over the government. However, he never stopped thinking about a country, a culture and a place on the map.",
        "runtimeMinutes": "84"
    },
    "2019_537": {
        "plotSummary": "",
        "runtimeMinutes": "270"
    },
    "2019_538": {
        "plotSummary": "Who Will Write Our History tells the story of Emanuel Ringelblum and the Oyneg Shabes Archive, the secret archive he created and led in the Warsaw Ghetto. With 30,000 pages of writing, photographs, posters, and more, the Oyneg Shabes ...See moreWho Will Write Our History tells the story of Emanuel Ringelblum and the Oyneg Shabes Archive, the secret archive he created and led in the Warsaw Ghetto. With 30,000 pages of writing, photographs, posters, and more, the Oyneg Shabes Archive is the most important cache of in-the-moment, eyewitness accounts from the Holocaust. It documents not only how the Jews of the ghetto died, but how they lived. The film is based on the book of the same name by historian Samuel Kassow.  Written by Katahdin ProductionsSee less",
        "runtimeMinutes": "95"
    },
    "2019_539": {
        "plotSummary": "",
        "runtimeMinutes": "110"
    },
    "2019_54": {
        "plotSummary": "The flightless birds and scheming green pigs take their feud to the next level.",
        "runtimeMinutes": "97"
    },
    "2019_540": {
        "plotSummary": "A girl named, Riko and her robot friend, Reg, journey down into a deadly, otherworldly chasm, known as the Abyss, in search of her lost mother.",
        "runtimeMinutes": "119"
    },
    "2019_541": {
        "plotSummary": "A destitute young man, raised by racist skinheads and notorious among white supremacists, turns his back on hatred and violence to transform his life, with the help of a black activist and the woman he loves.",
        "runtimeMinutes": "118"
    },
    "2019_542": {
        "plotSummary": "Set in the Chambal valley, the film follows the story of a legion of dreaded, warring dacoits who once terrorized the Indian heartlands.",
        "runtimeMinutes": "143"
    },
    "2019_543": {
        "plotSummary": "Two rebellious young women - one fleeing the chaos of secular hedonism for the disciplined comforts of faith; the other desperate to transcend her oppressive religious cross paths unexpectedly in Jerusalem, to startling consequences.",
        "runtimeMinutes": "112"
    },
    "2019_544": {
        "plotSummary": "A plains-woman faces the harshness and isolation of the untamed land in the Western frontier of the late 1800s.",
        "runtimeMinutes": "86"
    },
    "2019_545": {
        "plotSummary": "After representing himself and beating a murder charge, a concert promoter runs for the San Bernardino District Attorney's office against the prosecutor of his case.",
        "runtimeMinutes": "89"
    },
    "2019_546": {
        "plotSummary": "A celebrated Bollywood director Rohan Khurana stands accused by a female member of his crew, Anjali Dangle of having raped her at his residence.",
        "runtimeMinutes": "124"
    },
    "2019_547": {
        "plotSummary": "A chronicle of New York's drag scene in the 1980s, focusing on balls, voguing and the ambitions and dreams of those who gave the era its warmth and vitality.",
        "runtimeMinutes": "71"
    },
    "2019_548": {
        "plotSummary": "An investigative look and analysis of gender disparity in Hollywood, featuring accounts from well-known actors, executives and artists in the Industry. Read more: Synopsis",
        "runtimeMinutes": "96"
    },
    "2019_549": {
        "plotSummary": "The story of a mother trying to protect her family after their landlord sells their rented home and they become homeless.",
        "runtimeMinutes": "86"
    },
    "2019_55": {
        "plotSummary": "Mike Banning is framed for the attempted assassination of the President and must evade his own agency and the FBI as he tries to uncover the real threat.",
        "runtimeMinutes": "121"
    },
    "2019_550": {
        "plotSummary": "Twelve men heard and spread the message of Jesus. Only one woman understood it.",
        "runtimeMinutes": "120"
    },
    "2019_551": {
        "plotSummary": "A TUBA TO CUBA follows New Orleans' famed Preservation Hall Jazz Band as they retrace their musical roots from the storied city of jazz to the shores of Cuba and in turn discover a connection that runs much deeper than could have been imagined.",
        "runtimeMinutes": "82"
    },
    "2019_552": {
        "plotSummary": "After being released from the hospital, the artist Jean Michel Basquiat wanders around Manhattan trying to sell art to make money and find a place to stay.",
        "runtimeMinutes": "72"
    },
    "2019_553": {
        "plotSummary": "Two bikers head from L.A. to New Orleans through the open country and desert lands, and along the way they meet a man who bridges a counter-culture gap of which they had been unaware.",
        "runtimeMinutes": "95"
    },
    "2019_554": {
        "plotSummary": "The coming out of an evangelical father shatters his family, his community and uncovers a profoundly repressive society.",
        "runtimeMinutes": "107"
    },
    "2019_555": {
        "plotSummary": "The Third World War is on the horizon. Despite attempts at nuclear deterrence, the threat of atomic bombings between North Korea and the United States is bringing the world's population back into a Cold War-like climate. In the small town ...See moreThe Third World War is on the horizon. Despite attempts at nuclear deterrence, the threat of atomic bombings between North Korea and the United States is bringing the world's population back into a Cold War-like climate. In the small town of Baie-St-Paul (Quebec, Canada), Pier-Luc is afraid: afraid of dying, of course, but, above all, afraid of dying before he could make love for the first time. With his buddies, Hubert and Samuel, he goes through \"the summer of last chances\" and takes drastic measures in order to lose his virginity - Before we explode.See less",
        "runtimeMinutes": "108"
    },
    "2019_556": {
        "plotSummary": "A psychic middle school boy tries to live a normal life and keep his growing powers under control, even though he constantly gets into trouble.",
        "runtimeMinutes": null
    },
    "2019_557": {
        "plotSummary": "In an urban war zone where everything that moves is a target, Paul tries to live, love and inform.",
        "runtimeMinutes": "100"
    },
    "2019_558": {
        "plotSummary": "A profile of giraffe researcher Anne Dagg who, in 1956, became one of the first people to ever observe and report on animal behaviour.",
        "runtimeMinutes": "123"
    },
    "2019_559": {
        "plotSummary": "A virtuous Hong Kong Police Officer must clear his good name when the drug lord he is after frames him for the murder of a dirty cop.",
        "runtimeMinutes": "100"
    },
    "2019_56": {
        "plotSummary": "Astronaut Roy McBride undertakes a mission across an unforgiving solar system to uncover the truth about his missing father and his doomed expedition that now, 30 years later, threatens the universe.",
        "runtimeMinutes": "123"
    },
    "2019_560": {
        "plotSummary": "The movie centres around Brindsley Forde's character Blue. He fronts a reggae sound system based in West London. The film captures the trials and tribulations of young black youths in troubled London in the early eighties.",
        "runtimeMinutes": "95"
    },
    "2019_561": {
        "plotSummary": "A fly-on-the-wall chronicle of embattled former White House chief strategist Steve Bannon's global mission to spread extreme nationalism.",
        "runtimeMinutes": "91"
    },
    "2019_562": {
        "plotSummary": "An intense, raw and deep revival of Rostand's Cyrano de Bergerac by the Jamie Lloyd Company.",
        "runtimeMinutes": "160"
    },
    "2019_563": {
        "plotSummary": "Danish director Mads Brügger and Swedish private investigator Göran Björkdahl are trying to solve the mysterious death of Dag Hammarskjöld. As their investigation closes in, they discover a crime far worse than killing the ...See moreDanish director Mads Brügger and Swedish private investigator Göran Björkdahl are trying to solve the mysterious death of Dag Hammarskjöld. As their investigation closes in, they discover a crime far worse than killing the Secretary-General of the United Nations.  Written by Piraya FilmSee less",
        "runtimeMinutes": "128"
    },
    "2019_564": {
        "plotSummary": "After a tragedy reunites Nicole with her childhood friends, they each find themselves in danger, targets of a deranged stalker. Nicole knows this can't be a coincidence. The secrets of their past are coming back to haunt them.",
        "runtimeMinutes": null
    },
    "2019_565": {
        "plotSummary": "It is the dead of winter and a poet invites his sons to join him at a hotel for a reunion. The hotel also hosts a newly single woman who has a friend keep her company and with whom she shares a room, strolls and conversations. The poet is ...See moreIt is the dead of winter and a poet invites his sons to join him at a hotel for a reunion. The hotel also hosts a newly single woman who has a friend keep her company and with whom she shares a room, strolls and conversations. The poet is drawn to the beautiful girls and cannot resist the temptation to discover more. Their lives intersect, connect and disconnect and potentially become a metaphor for modern life.  Written by aghaemiSee less",
        "runtimeMinutes": "96"
    },
    "2019_566": {
        "plotSummary": "A lyrical story of the healing power of love in the midst of national conflict, loss and trauma, Those Who Remained reveals the healing process of Holocaust survivors through the eyes of a young girl in post-World War II Hungary.",
        "runtimeMinutes": "83"
    },
    "2019_567": {
        "plotSummary": "A documentary that focuses on the first 21 years of Quentin Tarantino's career and includes interviews with his frequent collaborators.",
        "runtimeMinutes": "103"
    },
    "2019_568": {
        "plotSummary": "A lonely TV weatherman strikes up an unusual friendship with a middle-aged Latino migrant worker.",
        "runtimeMinutes": "98"
    },
    "2019_569": {
        "plotSummary": "Follow big wave surfer Nathan Fletcher through the evolution of surfing and his relationship with big waves.",
        "runtimeMinutes": "84"
    },
    "2019_57": {
        "plotSummary": "The story of the Battle of Midway, told by the leaders and the sailors who fought it.",
        "runtimeMinutes": "138"
    },
    "2019_570": {
        "plotSummary": "A young choreographer casts a contemporary dancer and an innovative pianist in New York's most anticipated new Broadway show.",
        "runtimeMinutes": "103"
    },
    "2019_571": {
        "plotSummary": "The tragic tale of an all-American girl who was transformed into a cold-blooded killer in the summer of 1969.",
        "runtimeMinutes": "110"
    },
    "2019_572": {
        "plotSummary": "A rural politician marries a widow with kids and gains a respectable position. He trusts his stepson more than his own in political matters; thus upsetting his son beyond limits.",
        "runtimeMinutes": "141"
    },
    "2019_573": {
        "plotSummary": "A washed-up musician teams up with a teacher and a kids show personality to protect young children from a sudden outbreak of zombies.",
        "runtimeMinutes": "93"
    },
    "2019_574": {
        "plotSummary": "Semi-fictionalized documentary biopic of British artist David Hockney. After a difficult break-up, Hockney is left unable to paint, much to the concern of his friends. Titled after Hockney's pop-art painting 'A Bigger Splash.'.",
        "runtimeMinutes": "106"
    },
    "2019_575": {
        "plotSummary": "Both over the age of 60, Chandro Tomar and Prakashi Tomar inspire other women in India when they demonstrate their expert sharpshooting skills.",
        "runtimeMinutes": "146"
    },
    "2019_576": {
        "plotSummary": "After the death of his father, Aaron returns home to help his grief-stricken mother and to confront his past. Going through his dad's belongings, he comes across a mysterious item that is more than it seems.",
        "runtimeMinutes": "95"
    },
    "2019_577": {
        "plotSummary": "A look at the life of photographer Robert Mapplethorpe from his rise to fame in the 1970s to his untimely death in 1989.",
        "runtimeMinutes": "102"
    },
    "2019_578": {
        "plotSummary": "Filmmaker Jason Baffa examines the personal bonds and dynamic relationships that form between golfers and caddies.",
        "runtimeMinutes": "80"
    },
    "2019_579": {
        "plotSummary": "At the turn of the century lumber was a booming industry in a savage land. Upon the unexpected death of his father, Daniel Rimsdale returns home to try to salvage the floundering family lumber business, find out who killed his father, and ...See moreAt the turn of the century lumber was a booming industry in a savage land. Upon the unexpected death of his father, Daniel Rimsdale returns home to try to salvage the floundering family lumber business, find out who killed his father, and save his family from financial ruin. However, he meets heavy resistance from others who will stop at nothing to become the new Lumber Baron.See less",
        "runtimeMinutes": "120"
    },
    "2019_58": {
        "plotSummary": "A comedic look at the relationship between a wealthy man with quadriplegia and an unemployed man with a criminal record who's hired to help him.",
        "runtimeMinutes": "126"
    },
    "2019_580": {
        "plotSummary": "Renegade Texan scientist Jim Allison devotes his life work to find a cure for cancer after the disease takes the life of his mother.",
        "runtimeMinutes": "90"
    },
    "2019_581": {
        "plotSummary": "A former assassin living a new life in the shadows with his family emerges from hiding to discover the origin of his lethal beginnings.",
        "runtimeMinutes": "123"
    },
    "2019_582": {
        "plotSummary": "Vault tells a story about a group of small time criminals in 1975 who attempt to pull off the biggest heist in American history: stealing over $30 million from the Mafia in the smallest state in the union, Rhode Island.",
        "runtimeMinutes": "99"
    },
    "2019_583": {
        "plotSummary": "A criminal court judge starts a running club on L.A.'s skid row, where he trains a motley group of homeless people to run international marathons.",
        "runtimeMinutes": "85"
    },
    "2019_584": {
        "plotSummary": "In August 1969, 500,000 people gathered at a farm in upstate New York. What happened there was far more than just a concert. Woodstock tells the story of a legendary event that defined a generation through the voices of those who were there.",
        "runtimeMinutes": "106"
    },
    "2019_585": {
        "plotSummary": "A once-iconic fashion model strives to escape the world of images and disappear for good, but her son's determination to make a final film about her sparks an unexpected collaboration and confrontation with the camera's gaze.",
        "runtimeMinutes": "94"
    },
    "2019_586": {
        "plotSummary": "The story of people whose lives intertwine during a dramatic winter in New York City.",
        "runtimeMinutes": "112"
    },
    "2019_587": {
        "plotSummary": "A young man must survive an island retreat while a sinister force hunts him, leaving bodies in its wake.",
        "runtimeMinutes": "85"
    },
    "2019_588": {
        "plotSummary": "A distant poor relative of the Duke D'Ascoyne plots to inherit the title by murdering the eight other heirs who stand ahead of him in the line of succession.",
        "runtimeMinutes": "106"
    },
    "2019_589": {
        "plotSummary": "While Batman deals with a deformed man calling himself the Penguin wreaking havoc across Gotham with the help of a cruel businessman, a female employee of the latter becomes the Catwoman with her own vendetta.",
        "runtimeMinutes": "126"
    },
    "2019_59": {
        "plotSummary": "Ignoring the eerie warning of a troubled mother suspected of child endangerment, a social worker and her own small kids are soon drawn into a frightening supernatural realm.",
        "runtimeMinutes": "93"
    },
    "2019_590": {
        "plotSummary": "A young woman who works as a karaoke hostess in Koreatown reconnects with her estranged brother in the final days of their father's life.",
        "runtimeMinutes": "87"
    },
    "2019_591": {
        "plotSummary": "Dramatic, moving and deeply human, ARMSTRONG offers the definitive life story of Neil Armstrong: from his childhood in Ohio to his first steps on the Moon, and beyond.",
        "runtimeMinutes": "100"
    },
    "2019_592": {
        "plotSummary": "Two men meet in Barcelona and after spending a day together they realize that they have already met twenty years ago.",
        "runtimeMinutes": "84"
    },
    "2019_593": {
        "plotSummary": "A doctor in Fascist Italy is exiled to a remote village for his political views.",
        "runtimeMinutes": "150"
    },
    "2019_594": {
        "plotSummary": "After years in hiding, a woman is forced to go on the run when her superhuman abilities are discovered. Years after having abandoned her family, the only place she has left to hide is home.",
        "runtimeMinutes": "100"
    },
    "2019_595": {
        "plotSummary": "Suburban soccer moms find themselves constantly competing against each other in their personal lives as their kids settle their differences on the field.",
        "runtimeMinutes": "95"
    },
    "2019_596": {
        "plotSummary": "Shimu fled her village as a child when her stepmother threatened to marry her off to a middle-aged man. Now 23 and living in the capital, she works grueling hours for paltry sums at a textile factory while her husband searches for work.",
        "runtimeMinutes": "95"
    },
    "2019_597": {
        "plotSummary": "Documentary about the staff and patients of San Francisco General Hospital's AIDS ward during the early years of the epidemic.",
        "runtimeMinutes": "94"
    },
    "2019_598": {
        "plotSummary": "A feature length documentary film following one man's search for random Americans concerned about an Islamic threat and offering them a free trip to Egypt.",
        "runtimeMinutes": "98"
    },
    "2019_599": {
        "plotSummary": "During a day in their honeymoon, a couple is separated by the city's lust and the desires it produces.",
        "runtimeMinutes": "86"
    },
    "2019_6": {
        "plotSummary": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and bloody crime. This path brings him face-to-face with his alter-ego: the Joker.",
        "runtimeMinutes": "122"
    },
    "2019_60": {
        "plotSummary": "When his space shuttle flight has an accident, an astronaut remembers the lessons his father taught him growing up.",
        "runtimeMinutes": "147"
    },
    "2019_600": {
        "plotSummary": "In a strange and isolated chateau, a man becomes acquainted with a woman and insists that they have met before.",
        "runtimeMinutes": "94"
    },
    "2019_601": {
        "plotSummary": "A desperate woman accidentally murders her unfaithful husband the morning of a big party honoring his recent Pritzker Prize, now she must survive the pain of heartbreak and a night of celebration, without being found out.",
        "runtimeMinutes": "108"
    },
    "2019_602": {
        "plotSummary": "A normal father's family life is turned upside down when his son discovers his dad has another family.",
        "runtimeMinutes": "109"
    },
    "2019_603": {
        "plotSummary": "A trio of misfits whose irreverent, sexually charged dynamic evolves into a surprising love story as their spontaneous and flippant attitude towards the past or future backfires time and again.",
        "runtimeMinutes": "85"
    },
    "2019_604": {
        "plotSummary": "An exploration of the history and emotional power of cinema sound, as revealed by legendary sound designers and visionary directors, via interviews, clips from movies, and a look at their actual process of creation and discovery.",
        "runtimeMinutes": "94"
    },
    "2019_605": {
        "plotSummary": "A portrait of the extraordinary life and career of actor Anton Yelchin.",
        "runtimeMinutes": "92"
    },
    "2019_606": {
        "plotSummary": "The story of a young man who, after losing his mother, goes to work with a doctor specializing in lobotomies and therapies.",
        "runtimeMinutes": "106"
    },
    "2019_607": {
        "plotSummary": "Celebrating 50 years since he played at Woodstock, Fathom Events, BMG and Northstar Media bring the legendary artist John Fogerty to the big screen for an exclusive one-night-only concert event.",
        "runtimeMinutes": "110"
    },
    "2019_608": {
        "plotSummary": "Faced with the responsibility to take care of her addict, veteran father, headstrong teen Mickey Peck keeps her household afloat.",
        "runtimeMinutes": "88"
    },
    "2019_609": {
        "plotSummary": "An ex-army officer, Kabir, becomes a teacher in Kashmir in a school that is in a miserable condition. Things take a turn when Kabir finds a notebook, left behind by the previous year's teacher Firdaus (Pranutan Bahl).",
        "runtimeMinutes": "115"
    },
    "2019_61": {
        "plotSummary": "Columbus, Tallahassee, Wichita, and Little Rock move to the American heartland as they face off against evolved zombies, fellow survivors, and the growing pains of the snarky makeshift family.",
        "runtimeMinutes": "99"
    },
    "2019_610": {
        "plotSummary": "A Cape Verdean woman navigates her way through Lisbon, following the scanty physical traces her deceased husband left behind and discovering his secret, illicit life.",
        "runtimeMinutes": "124"
    },
    "2019_611": {
        "plotSummary": "For over 30 years, Marion Stokes obsessively and privately recorded American television news 24 hours a day filling 70,000 VHS tapes, capturing wars, talk shows and commercials that show us how television shaped the world of today.",
        "runtimeMinutes": "87"
    },
    "2019_612": {
        "plotSummary": "A portrait of controversial political strategist and former Donald Trump advisor, Steve Bannon.",
        "runtimeMinutes": "95"
    },
    "2019_613": {
        "plotSummary": "In Mexico City's wealthiest neighborhoods, the Ochoa family runs a private ambulance, competing with other for-profit EMTs for patients in need of urgent help.",
        "runtimeMinutes": "81"
    },
    "2019_614": {
        "plotSummary": "A widowed firefighter seeks closure after his wife goes missing on an actual haunted road in rural New Jersey but must unlock the road's secret if he wants to get out alive.",
        "runtimeMinutes": "77"
    },
    "2019_615": {
        "plotSummary": "When the Taliban puts a bounty on Hassan Fazili's head, he is forced to flee with his wife and two daughters. Capturing the journey, Fazili shows the dangers facing refugees seeking asylum and the love shared between a family on the run.",
        "runtimeMinutes": "88"
    },
    "2019_617": {
        "plotSummary": "A bounty killer is hired by a Mexican landowner to rescue his daughter after she's kidnapped by a gang of outlaws on her wedding day.",
        "runtimeMinutes": "87"
    },
    "2019_618": {
        "plotSummary": "The behind the scenes of a national drag queen contest in New York City, including the rehearsals leading up to the contest, the conversations in the dressing room and the jealousies that emerge before and after the competition.",
        "runtimeMinutes": "68"
    },
    "2019_619": {
        "plotSummary": "In 1973, five men and six women drifted across the Atlantic on a raft as part of a scientific experiment studying the sociology of violence, aggression and sexual attraction in human behavior. Although the project became known in the press...See moreIn 1973, five men and six women drifted across the Atlantic on a raft as part of a scientific experiment studying the sociology of violence, aggression and sexual attraction in human behavior. Although the project became known in the press as 'The Sex Raft', nobody expected what ultimately took place on that three month journey. Through extraordinary archive material and a reunion of the surviving members of the expedition on a full scale replica of the raft, this film tells the hidden story behind what has been described as 'one of the strangest group experiments of all time.'See less",
        "runtimeMinutes": "97"
    },
    "2019_62": {
        "plotSummary": "Kate is a young woman subscribed to bad decisions. Working as an elf in a year round Christmas store is not good for the wannabe singer. However, she meets Tom there. Her life takes a new turn. For Kate, it seems too good to be true.",
        "runtimeMinutes": "103"
    },
    "2019_620": {
        "plotSummary": "To escape from his lonely existence, Nurlan embarks on the most adventurous journey of his life: to find the owner of this perky piece of blue underwear. He rents a small room in Baku and begins his quest.",
        "runtimeMinutes": "90"
    },
    "2019_621": {
        "plotSummary": "A family lives in the Mexican countryside raising fighting bulls. Esther is in charge of running the ranch, while her husband Juan, a world-renowned poet, raises and selects the beasts. Although in an open marriage, their relationship ...See moreA family lives in the Mexican countryside raising fighting bulls. Esther is in charge of running the ranch, while her husband Juan, a world-renowned poet, raises and selects the beasts. Although in an open marriage, their relationship begins to crumble when Esther falls in love with an American horse-breaker and Juan is unable control his jealousy.See less",
        "runtimeMinutes": "177"
    },
    "2019_622": {
        "plotSummary": "With a potent strain of pot sweeping the City, DTA agents attempt to infiltrate a small town farming operation that has a strong leader and interesting family members.",
        "runtimeMinutes": "85"
    },
    "2019_623": {
        "plotSummary": "An artist fights to make the archives of Mexico's most famous architect available to the public.",
        "runtimeMinutes": "86"
    },
    "2019_624": {
        "plotSummary": "A documentary on Yves Saint-Laurent and the legendary fashion designer's final show.",
        "runtimeMinutes": "74"
    },
    "2019_625": {
        "plotSummary": "This documentary examines the philosophy behind the concept of Democracy, from ancient Athens to modern Greece and the American Civil Rights movement.",
        "runtimeMinutes": "107"
    },
    "2019_626": {
        "plotSummary": "Inspired by the true events of the infamous 1983 prison breakout of 38 IRA prisoners from HMP, which was to become the biggest prison escape in Europe since World War II.",
        "runtimeMinutes": "92"
    },
    "2019_627": {
        "plotSummary": "What You Gonna Do When The World's On Fire is the story of a community of black people in the American South during the summer 2017, when a string of brutal killings of black men sent shockwaves throughout the country. A meditation on the ...See moreWhat You Gonna Do When The World's On Fire is the story of a community of black people in the American South during the summer 2017, when a string of brutal killings of black men sent shockwaves throughout the country. A meditation on the state of race in America, this film is an intimate portrait into the lives of those who struggle for justice, dignity, and survival.  Written by XSee less",
        "runtimeMinutes": "123"
    },
    "2019_628": {
        "plotSummary": "Five days in the life of fabled Greenwich Village guitar store Carmine Street Guitars.",
        "runtimeMinutes": "80"
    },
    "2019_629": {
        "plotSummary": "One tipsy evening, Charlotte, the recently heartbroken, Megan, the anti-love anarchist, and Aube, the shy romantic, stumble into the 'Toy Depot'. Charmed by the male employees, the girls fill out a job application and quickly become part ...See moreOne tipsy evening, Charlotte, the recently heartbroken, Megan, the anti-love anarchist, and Aube, the shy romantic, stumble into the 'Toy Depot'. Charmed by the male employees, the girls fill out a job application and quickly become part of the 'Toy Depot' gang. Charlotte has found the guys to be particularly helpful in getting over her heartbreak, to say the least. But has she taken it too far? The film explores teenage girls' desires, the blurred lines between sex and friendship, and the unfair double standard imposed upon girls. It is a story of desire, self-censorship, and self-assertion.  Written by Amerique FilmSee less",
        "runtimeMinutes": "89"
    },
    "2019_63": {
        "plotSummary": "A police undercover operation takes a delicious, unexpected turn.",
        "runtimeMinutes": "111"
    },
    "2019_630": {
        "plotSummary": "A woman disguises herself as her dead brother, Henry, in order to survive in the Confederate ranks during the Civil War. He marries a widow to rescue her from an arranged marriage. They keep each other's secrets and find true love.",
        "runtimeMinutes": "135"
    },
    "2019_631": {
        "plotSummary": "A woman returns to her family home and discovers it to be inhabited by monsters.",
        "runtimeMinutes": "90"
    },
    "2019_632": {
        "plotSummary": "Andrei, a detective and the world's most horrible father, brings together a terrible group of people in his apartment: his resentful actress daughter, an angry thug, and a cheated cop. Each one of them has a reason to want revenge..",
        "runtimeMinutes": "99"
    },
    "2019_633": {
        "plotSummary": "A spaceship carrying settlers to Mars is knocked off course, causing the consumption-obsessed passengers to consider their place in the universe.",
        "runtimeMinutes": "106"
    },
    "2019_634": {
        "plotSummary": "A woman uses her bureaucratic job to convince divorcing couples to stay together is utterly committed to getting pregnant by her husband in a future of dance parties, ritualistic orgies and fundamentalist Christianity.",
        "runtimeMinutes": "101"
    },
    "2019_635": {
        "plotSummary": "To win the contest of her dreams, Zoe will have to turn her sister's wedding into a horror film.",
        "runtimeMinutes": "104"
    },
    "2019_636": {
        "plotSummary": "A nerd spends his time at an allotment shed away from his wife. When the zombie apocalypse begins, he and his nerdy friend try to make it through and save the wife and her cute friend.",
        "runtimeMinutes": "82"
    },
    "2019_637": {
        "plotSummary": "Batman must battle former district attorney Harvey Dent, who is now Two-Face and Edward Nygma, The Riddler with help from an amorous psychologist and a young circus acrobat who becomes his sidekick, Robin.",
        "runtimeMinutes": "121"
    },
    "2019_638": {
        "plotSummary": "An in-depth voyage into the sci-fi film \"Alien\" with the visionary filmmakers who created it. See how one of the most terrifying movies of all time came to life 40 years ago, inspired by ancient mythology and our universal fears.",
        "runtimeMinutes": "95"
    },
    "2019_639": {
        "plotSummary": "THE QUIET ONE offers a unique, never before revealed and behind-the-scenes look at the highs and lows of the life and career of Bill Wyman, former, founding member of the Rolling Stones and renaissance man of rock and roll.",
        "runtimeMinutes": "98"
    },
    "2019_64": {
        "plotSummary": "Dora, a teenage explorer, leads her friends on an adventure to save her parents and solve the mystery behind a lost city of gold.",
        "runtimeMinutes": "102"
    },
    "2019_640": {
        "plotSummary": "Dick died last night, and Zeke and Earl don't want anybody finding out how. That's too bad though, cause news travels fast in small-town Alabama.",
        "runtimeMinutes": "100"
    },
    "2019_641": {
        "plotSummary": "During a tumultuous period in the career of Silvio Berlusconi, as his marriage to second wife Veronica Lario fractures, LORO speculates on what may or may not have taken place behind closed doors, depicting a wide variety of characters ...See moreDuring a tumultuous period in the career of Silvio Berlusconi, as his marriage to second wife Veronica Lario fractures, LORO speculates on what may or may not have taken place behind closed doors, depicting a wide variety of characters from multiple levels of society and their attempts to either ingratiate or distance themselves from him.See less",
        "runtimeMinutes": "151"
    },
    "2019_642": {
        "plotSummary": "In a yurt on the snow-covered fields of the North, Nanook and Sedna live following the traditions of their ancestors. Alone in the wilderness, they look like the last people on Earth. Nanook and Sedna's traditional way of life starts ...See moreIn a yurt on the snow-covered fields of the North, Nanook and Sedna live following the traditions of their ancestors. Alone in the wilderness, they look like the last people on Earth. Nanook and Sedna's traditional way of life starts changing - slowly, but inevitably. Hunting becomes more and more difficult, the animals around them die from inexplicable deaths and the ice has been melting earlier every year. Chena, who visits them regularly, is their only connection to the outside world - and to their daughter Ága, who has left the icy tundra a long time ago due to family feud. When Sedna's health deteriorates, Nanook decides to fulfill her wish. He embarks on a long journey in order to find Ága.See less",
        "runtimeMinutes": "96"
    },
    "2019_643": {
        "plotSummary": "Danny is your average Brooklyn party boy. This year, he and his friends couldn't be more excited about the upcoming \"Brooklyn Annual Enema Party;\" one of Brooklyn's biggest parties, the event is a place \"where you come to get douched and ...See moreDanny is your average Brooklyn party boy. This year, he and his friends couldn't be more excited about the upcoming \"Brooklyn Annual Enema Party;\" one of Brooklyn's biggest parties, the event is a place \"where you come to get douched and dance.\" While the night starts out fun, it quickly takes a turn for the worse when Danny is attacked by a stranger. In the end, his fabulous drag queen and queer friends are able to save his life, but not without deadly consequences. A year later, Danny is still going throughout the aftermath of that horrible incident and refuses to go to this year's upcoming \"Brooklyn Annual Enema Party,\" despite the pressure of his close friends Cholata, Collin and Gayson. His friends want Danny to face his fears and go back out into the world. Danny refuses, but when a new boy, PuppyPup, enters his life, Danny decides to give his social life and the Brooklyn nightlife scene a second chance. It isn't until his friends start to disappear and get killed in gruesome ways that Danny realizes that his life, and everyone else who helped him that night, are in danger. A man wearing a unicorn mask is killing off Brooklyn nightlife, one queen at a time, and he won't stop until he has his revenge.  Written by Jose D. ÁlvarezSee less",
        "runtimeMinutes": "74"
    },
    "2019_644": {
        "plotSummary": "Moonlight Sonata is a deeply personal memoir about a deaf boy growing up, his deaf grandfather growing old, and Beethoven the year he was blindsided by deafness and wrote his iconic sonata. Their lives weave a story about what we discover ...See moreMoonlight Sonata is a deeply personal memoir about a deaf boy growing up, his deaf grandfather growing old, and Beethoven the year he was blindsided by deafness and wrote his iconic sonata. Their lives weave a story about what we discover when we push beyond loss.See less",
        "runtimeMinutes": "90"
    },
    "2019_645": {
        "plotSummary": "Italian photographer Letizia Battaglia spends her career documenting the life and crimes of the Mafia.",
        "runtimeMinutes": "94"
    },
    "2019_646": {
        "plotSummary": "Unfolds as a series of hunts in the wilderness of Idaho's Sawtooth Mountains. The characters communicate a mythological narrative through dance, letting movement replace language as they pursue each other and their prey.",
        "runtimeMinutes": "134"
    },
    "2019_647": {
        "plotSummary": "Libby teaches at a university but 4 years ago she was top aide to VP Rachel and was part of a total victory action. Rachel is now US president and worried about Libby keeping quiet. Libby also has a student spying on her.",
        "runtimeMinutes": "102"
    },
    "2019_648": {
        "plotSummary": "A few years after her mother's passing, 17-year old Tennie's reputation at school takes a major hit before the prom. To further complicate the daily rigors of teenage life, her father, Robert, an advertising executive who has since rebuilt...See moreA few years after her mother's passing, 17-year old Tennie's reputation at school takes a major hit before the prom. To further complicate the daily rigors of teenage life, her father, Robert, an advertising executive who has since rebuilt his business, tries to do the same with his relationship with his daughter. Against his therapist's advice, overeager Robert tries really hard to get close to Tennie by showing his own way of caring. He tries to find out about his daughter's personal life with the help of his newly appointed, 19 year-old driver/intern, Jack. Practically being raised by her extended family, Tennie although very academically inclined and mature for her age, with compassion for others, she's got a touch of sarcasm, and a hint of rebelliousness. After she catches on to her father's plan, Tennie realizes that in order to get her father off of her back, she needs to convince him to find a lady friend. She recruits her friends to create an online dating profile in order to introduce her father to potential companions. Little did she know that her father already was seeing someone that he was not yet ready to introduce to her. Things escalate when Robert gets Tennie's friends from school to participate in a focus group for a project, and in retaliation, Tennie throws a party at the house with almost half of the school showing up. A series of hilarious interactions between father and daughter ensues that starts to close the generational gap between them. What finally brings them together is a long overdue heart to heart conversation about past transgressions. One thing becomes certain, they will always have each other.See less",
        "runtimeMinutes": "94"
    },
    "2019_649": {
        "plotSummary": "The story of a group of 1980s punk artists who started organizing and playing desert shows that later inspired Burning Man, Coachella, and Lollapalooza.",
        "runtimeMinutes": "93"
    },
    "2019_65": {
        "plotSummary": "Wonder Park tells the story of an amusement park where the imagination of a wildly creative girl named June comes alive.",
        "runtimeMinutes": "85"
    },
    "2019_650": {
        "plotSummary": "Creative essay doc inspired by Lewis Hyde's classic bestseller The Gift. Chronicling gift-based cultures around the world and challenging the logic of global capitalism, the film inspires the question: is life about getting or giving?",
        "runtimeMinutes": "90"
    },
    "2019_651": {
        "plotSummary": "Feral and abandoned cats prowl the streets of New York City in the tens of thousands. Because the City can't handle this problem, hundreds of dedicated, volunteer rescuers have come to their aid. Our film focuses on four of them in the ...See moreFeral and abandoned cats prowl the streets of New York City in the tens of thousands. Because the City can't handle this problem, hundreds of dedicated, volunteer rescuers have come to their aid. Our film focuses on four of them in the borough of Brooklyn.See less",
        "runtimeMinutes": "87"
    },
    "2019_652": {
        "plotSummary": "Fascinating, multi-talented, indispensable dogs and their loving masters.",
        "runtimeMinutes": "86"
    },
    "2019_653": {
        "plotSummary": "A kaleidoscopic look at the last day of Italian filmmaker Pier Paolo Pasolini in 1975.",
        "runtimeMinutes": "84"
    },
    "2019_654": {
        "plotSummary": "Chola and Football are a couple of street dogs that live in the Los Reyes skatepark. A microcosm is organized around them, composed of things, animals and young adolescents in conflict with an adult world that they reject but are required to enter.",
        "runtimeMinutes": "78"
    },
    "2019_655": {
        "plotSummary": "",
        "runtimeMinutes": "100"
    },
    "2019_656": {
        "plotSummary": "A female athlete at a small Christian college works hard to overcome long odds in trying to win a national title in the 800 meter run. \"The Perfect Race\" is a follow up movie to \"Remember The Goal\".",
        "runtimeMinutes": "96"
    },
    "2019_657": {
        "plotSummary": "A high-powered business consultant struggles to keep her professional and personal lives from colliding after her schizophrenic sister attempts suicide.",
        "runtimeMinutes": "108"
    },
    "2019_658": {
        "plotSummary": "Batman and Robin try to keep their relationship together even as they must stop Mr. Freeze and Poison Ivy from freezing Gotham City.",
        "runtimeMinutes": "125"
    },
    "2019_659": {
        "plotSummary": "Vlada works as a truck driver during the NATO bombing of Serbia in 1999. Tasked with transporting a mysterious load from Kosovo to Belgrade, he drives through unfamiliar territory, trying to make his way in a country scarred by the war. He...See moreVlada works as a truck driver during the NATO bombing of Serbia in 1999. Tasked with transporting a mysterious load from Kosovo to Belgrade, he drives through unfamiliar territory, trying to make his way in a country scarred by the war. He knows that once the job is over, he will need to return home and face the consequences of his actions.See less",
        "runtimeMinutes": "98"
    },
    "2019_66": {
        "plotSummary": "William Luk, goes undercover as a prisoner to investigate correctional officers who are receiving bribes.",
        "runtimeMinutes": "96"
    },
    "2019_660": {
        "plotSummary": "After their family is killed in a government massacre, brother and sister Enrique and Rosa flee Guatemala and embark on a perilous journey to \"El Norte\": the United States.",
        "runtimeMinutes": "141"
    },
    "2019_661": {
        "plotSummary": "The Bauhaus art and architecture school was founded 100 years ago. Through its history, we tackle the question of how architecture can ensure that people live better together and participate in everyday life.",
        "runtimeMinutes": "95"
    },
    "2019_662": {
        "plotSummary": "A documentary on the photographer Robert Frank.",
        "runtimeMinutes": "85"
    },
    "2019_663": {
        "plotSummary": "Hoop Dreams goes to the mat in WRESTLE, an intimate coming-of-age documentary about four members of a high-school wrestling team at Huntsville's J.O. Johnson High School, a longstanding entry on Alabama's list of failing schools. Coached ...See moreHoop Dreams goes to the mat in WRESTLE, an intimate coming-of-age documentary about four members of a high-school wrestling team at Huntsville's J.O. Johnson High School, a longstanding entry on Alabama's list of failing schools. Coached by teacher Chris Scribner, teammates Jailen, Jamario, Teague, and Jaquan each face challenges far beyond a shot at the State Championship: splintered family lives, drug use, teenage pregnancy, mental health struggles, and run-ins with the law threaten to derail their success on the mat and lock any doors that could otherwise open. Tough-love coach Scribner isn't off the hook, either; he must come to terms with his own past conflicts while unwittingly wading into the complexities of race, class and privilege in the South. Director Suzannah Herbert and Co-Director Lauren Belfer captured over 650 hours of footage during the course of the team's final season to create this closely observed, deeply affecting depiction of growing up disadvantaged in America today.See less",
        "runtimeMinutes": "96"
    },
    "2019_664": {
        "plotSummary": "Two men prepare to compete in a legendary bare-knuckle fight where the winner gets a $100,000 prize. Read more: Synopsis",
        "runtimeMinutes": "101"
    },
    "2019_665": {
        "plotSummary": "A single mom and part-time paranormal investigator is asked to look into a possible \"haunting\" at a widower's farmhouse in East Tennessee.",
        "runtimeMinutes": "82"
    },
    "2019_666": {
        "plotSummary": "A young mole must try to achieve his impossible dream of becoming a footballer in order to save his hometown gold mine from a greedy supervillain known only as 'The Boss'.",
        "runtimeMinutes": "100"
    },
    "2019_667": {
        "plotSummary": "Dramaan is the most popular man in Colobane, but when a woman from his past, now exorbitantly wealthy, returns to the town, things begin to change.",
        "runtimeMinutes": "110"
    },
    "2019_668": {
        "plotSummary": "A young writer tries to obtain romance letters a poet sent to his mistress.",
        "runtimeMinutes": "90"
    },
    "2019_669": {
        "plotSummary": "Nobody has managed to topple Einstein's theory of relativity, even though it leads to the shocking conclusion that most of the universe must be made of a mysterious form of invisible matter that nobody has observed. Now physics stands at a...See moreNobody has managed to topple Einstein's theory of relativity, even though it leads to the shocking conclusion that most of the universe must be made of a mysterious form of invisible matter that nobody has observed. Now physics stands at a crossroads. Some of the sharpest brains in physics have dedicated their lives to search for this \"dark matter\" while others are working on a new theory of gravity. Chasing Einstein follows leading scientists around the world, and to the edge of the universe.See less",
        "runtimeMinutes": "82"
    },
    "2019_67": {
        "plotSummary": "An American expat tries to sell off his highly profitable marijuana empire in London, triggering plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
        "runtimeMinutes": "113"
    },
    "2019_670": {
        "plotSummary": "Steven thinks his time defending the Earth is over, but when a new threat comes to Beach City, Steven faces his biggest challenge yet.",
        "runtimeMinutes": "82"
    },
    "2019_671": {
        "plotSummary": "The story of the nobleman-turned-outlaw hero who was crowned king of Scots in the 14th century.",
        "runtimeMinutes": "124"
    },
    "2019_672": {
        "plotSummary": "Charlie has a neurological disorder where strong emotions, especially joy, make him faint. He lives with his brother. Working as librarian gives him a quiet environment but then Francesca enters the library and his life.",
        "runtimeMinutes": "97"
    },
    "2019_673": {
        "plotSummary": "A successful \"house tuner\" in New York City, who calibrates the sound in people's homes in order to adjust their moods, meets a client with a problem he can't solve.",
        "runtimeMinutes": "85"
    },
    "2019_674": {
        "plotSummary": "After being thrown out of his home by his wife for being promiscuous, Mark finds himself back at Dumpling Farm, a place of youthful memories and parties, but things aren't quite right. His old buddy Ian, who has never left the place, is ...See moreAfter being thrown out of his home by his wife for being promiscuous, Mark finds himself back at Dumpling Farm, a place of youthful memories and parties, but things aren't quite right. His old buddy Ian, who has never left the place, is possessed by a group of demonic, flesh-eating Witches. Using Ian and his farm, these beautiful Witches honey trap Mark and his friends to consume their souls.See less",
        "runtimeMinutes": "79"
    },
    "2019_675": {
        "plotSummary": "Fifteen year-old Taylor Collins is a golf legacy. The son of a PGA veteran, the younger brother of a PGA rookie, he has all the talent in the world-but wants nothing to do with golf or the pressure of being the next in line. After Taylor ...See moreFifteen year-old Taylor Collins is a golf legacy. The son of a PGA veteran, the younger brother of a PGA rookie, he has all the talent in the world-but wants nothing to do with golf or the pressure of being the next in line. After Taylor purposely blows his tryout for the school team, his disappointed father takes a drive that ends in a texting-while-driving accident and lands him in a coma. Taylor blames himself and, with the guidance of his brother and the prayer support from his mother Jenny and newfound crush Bailey, makes it his mission to get back on the team and become the first freshman in state history to lead his team to a state championship. Faith, hope, and love bring Taylor and his family closer than ever and he learns that the greatest way to honor his father and his God is to embrace the gifts and talents he was given.  Written by Movie_WatcherSee less",
        "runtimeMinutes": "91"
    },
    "2019_676": {
        "plotSummary": "",
        "runtimeMinutes": null
    },
    "2019_677": {
        "plotSummary": "The ideas that dominate the tech industry and our day to day lives were born at a secretive Silicon Valley start-up named 'General Magic', which spun out of Apple in 1990 to create the first handheld personal communicator (or \"smartphone\").",
        "runtimeMinutes": "93"
    },
    "2019_678": {
        "plotSummary": "Love, faith, and civil rights collide in the south as evangelical Christians and drag queens step into the spotlight to explore the meaning of belief. Gospel drag shows and passion plays set the stage for one hell of a show.",
        "runtimeMinutes": "75"
    },
    "2019_679": {
        "plotSummary": "'Scandalous' is the sensational true story of The National Enquirer, the infamous tabloid with a prescient grasp of its readers' darkest curiosities.",
        "runtimeMinutes": "97"
    },
    "2019_68": {
        "plotSummary": "Dr. Louis Creed and his wife, Rachel, relocate from Boston to rural Maine with their two young children. The couple soon discover a mysterious burial ground hidden deep in the woods near their new home.",
        "runtimeMinutes": "101"
    },
    "2019_680": {
        "plotSummary": "The history of the Gay and Lesbian community before the Stonewall riots began the major gay rights movement.",
        "runtimeMinutes": "87"
    },
    "2019_681": {
        "plotSummary": "In medieval France, some villagers challenge a man's claim of identity when he (as he says) returns home from some time in the army.",
        "runtimeMinutes": "112"
    },
    "2019_682": {
        "plotSummary": "Two longtime friends battle mid-life crisis by opening a bowling alley/pizzeria in their small hometown.",
        "runtimeMinutes": "108"
    },
    "2019_683": {
        "plotSummary": "Veronica plans a rendezvous with her lover, Boris, at the bank of river, only for him to be drafted into World War II shortly thereafter.",
        "runtimeMinutes": "95"
    },
    "2019_684": {
        "plotSummary": "A beautiful actress struggles to connect with her disfigured co-star on the set of a European auteur's English-language debut.",
        "runtimeMinutes": "91"
    },
    "2019_685": {
        "plotSummary": "Joseph Pulitzer spoke of \"fake news\" over 100 years ago and fought the dangers that the suppression of news had for a democracy long before our present threats to press freedom. His heroic battles have been forgotten along with the lessons...See moreJoseph Pulitzer spoke of \"fake news\" over 100 years ago and fought the dangers that the suppression of news had for a democracy long before our present threats to press freedom. His heroic battles have been forgotten along with the lessons we might learn from the tools he deployed against his enemies.See less",
        "runtimeMinutes": "84"
    },
    "2019_686": {
        "plotSummary": "Two young women, torn apart by a childhood tragedy, unexpectedly reunite and embark on an illuminating 24-hour journey, where they unlock memories of long-forgotten innocence and what it means to truly believe.",
        "runtimeMinutes": "98"
    },
    "2019_687": {
        "plotSummary": "A unique, intimate portrayal of a girl grieving for the loss of her best friend, which just so happens to take place on the day the world ends.",
        "runtimeMinutes": "101"
    },
    "2019_688": {
        "plotSummary": "Bringing back Arata, Lilith and the rest of the Trinity Seven to face off against the greatest enemy in the history of the team; Lilith's own father, the strongest Demon Lord, who challenges Arata, now a Demon Lord candidate herself.",
        "runtimeMinutes": "63"
    },
    "2019_689": {
        "plotSummary": "With LE CONCOURS the director will delve into the daily life of the Parisian cinema school, la Femis, where a specific Republican ideal of excellence is practiced and entry into which can be summed up as follows: \"everyone's equal, but ...See moreWith LE CONCOURS the director will delve into the daily life of the Parisian cinema school, la Femis, where a specific Republican ideal of excellence is practiced and entry into which can be summed up as follows: \"everyone's equal, but only the best get in...\" Through the admission process, the hard work all year and the graduation exams, LE CONCOURS will establish a portrait of our relationship to excellence in the Art world and of one of the most prestigious art school in France. A place of culture where generations intermingle.  Written by WHSee less",
        "runtimeMinutes": "121"
    },
    "2019_69": {
        "plotSummary": "Three 6th grade boys ditch school and embark on an epic journey while carrying accidentally stolen drugs, being hunted by teenage girls, and trying to make their way home in time for a long-awaited party.",
        "runtimeMinutes": "90"
    },
    "2019_690": {
        "plotSummary": "An inside look into the world of taxidermy and the passionate artists from all over the world who work on the animals.",
        "runtimeMinutes": "84"
    },
    "2019_691": {
        "plotSummary": "Story of an underground newspaper in Boston about to be taken over by big business.",
        "runtimeMinutes": "101"
    },
    "2019_692": {
        "plotSummary": "The survival and the struggle of a young mother during the Khmer Rouge revolution, to find her 4-year-old son, torn from his family by the regime.",
        "runtimeMinutes": "84"
    },
    "2019_693": {
        "plotSummary": "In Florida, parents can hire Wrinkles the Clown to scare their misbehaving children.",
        "runtimeMinutes": "78"
    },
    "2019_694": {
        "plotSummary": "The story of how three oddball teenage bluesmen became one of the biggest, most beloved bands on the planet.",
        "runtimeMinutes": "91"
    },
    "2019_695": {
        "plotSummary": "The disappearance of his child sends a man on a dark path to find the truth.",
        "runtimeMinutes": "84"
    },
    "2019_696": {
        "plotSummary": "Created out of war footage taken by combat camera for the Marine Corps.",
        "runtimeMinutes": "70"
    },
    "2019_697": {
        "plotSummary": "Billy Corben's true-crime dramedy investigates the MLB's infamous doping scandal involving a nefarious clinician and his most famous client: the New York Yankees' Alex Rodriguez.",
        "runtimeMinutes": "105"
    },
    "2019_698": {
        "plotSummary": "Three teenagers are shaken up by their first loves in the turmoil of their youth. At a time when others are conforming, they stand their ground and assert their right to love and be free.",
        "runtimeMinutes": "129"
    },
    "2019_699": {
        "plotSummary": "This documentary explores the sexual and social identity of contemporary black America through intimate, eye opening and often hilarious accounts from women and men who find love and community in the underground world of exotic dancing.",
        "runtimeMinutes": "82"
    },
    "2019_7": {
        "plotSummary": "The surviving members of the resistance face the First Order once again, and the legendary conflict between the Jedi and the Sith reaches its peak bringing the Skywalker saga to its end.",
        "runtimeMinutes": "141"
    },
    "2019_70": {
        "plotSummary": "On Halloween 1968, Stella and her two friends meet a mysterious drifter, Ramón, and uncover a sinister notebook of stories.",
        "runtimeMinutes": "108"
    },
    "2019_700": {
        "plotSummary": "In 1966 Medical student and racing fan Stephen Olvey gets the opportunity of a lifetime when he is asked to volunteer at the Indianapolis 500 on their medical team. What started as fun insider view of a sport he loved quickly devolves ...See moreIn 1966 Medical student and racing fan Stephen Olvey gets the opportunity of a lifetime when he is asked to volunteer at the Indianapolis 500 on their medical team. What started as fun insider view of a sport he loved quickly devolves before his eyes as he sees the level of medical support given to the drivers, whom he has befriended, is terrifyingly non-existent. After feeling helpless at the scene of what turns out to be a fatal accident. Dr. Olvey sets off on a mission to build a team to apply science to transform motorsports from the most fatal form of sport to one of the safest. Over the next 30 years they succeed and the science that they develop influences modern trauma medicine and the passenger cars we drive today. This is the story of the most fatal era in Motorsports and the Indy 500 doctors who pioneered safety and helped the drivers to cheat death.  Written by Michael William MilesSee less",
        "runtimeMinutes": "99"
    },
    "2019_701": {
        "plotSummary": "About a secretary who is subjected to a power game by his new employer, an exiled former revolutionary leader and his wife.",
        "runtimeMinutes": "105"
    },
    "2019_702": {
        "plotSummary": "A young woman takes work on a Martha's Vineyard farm and befriends the ten year old farmer's daughter only to discover present day horrors that stem from a dark past.",
        "runtimeMinutes": "86"
    },
    "2019_703": {
        "plotSummary": "High school grad finds himself in turmoil within his family as he battles coping with Bipolar disorder.",
        "runtimeMinutes": "92"
    },
    "2019_704": {
        "plotSummary": "ZEN FOR NOTHING tells of the experiences of Sabine Timoteo from Switzerland, as a \"Zen novice\" in Antaiji in Autumn, Winter and Spring.",
        "runtimeMinutes": "100"
    },
    "2019_705": {
        "plotSummary": "Dylan attempts to move on from his former life as a criminal, with his true love, Maria. He soon realizes that his past will continue to haunt him, when he learns the new local prison warden has not forgiven him for an old crime.",
        "runtimeMinutes": "104"
    },
    "2019_706": {
        "plotSummary": "Marya Zelli finds herself penniless after her art dealer husband, Stephan, is convicted of theft. Marya accepts the hospitality of a strange couple, H.J. and Lois Heidler, who lets her live in their house.",
        "runtimeMinutes": "101"
    },
    "2019_707": {
        "plotSummary": "After 26 years of spinning dives and flying uppercuts in the ring, Cassandro, the star of the gender-bending cross-dressing Mexican wrestlers known as the Exoticos, is far from retiring. But with dozens of broken bones and metal pins in ...See moreAfter 26 years of spinning dives and flying uppercuts in the ring, Cassandro, the star of the gender-bending cross-dressing Mexican wrestlers known as the Exoticos, is far from retiring. But with dozens of broken bones and metal pins in his body, he must now reinvent himself.See less",
        "runtimeMinutes": "73"
    },
    "2019_708": {
        "plotSummary": "Award winning writer, celebrity Mark Travis seeks inspiration by returning to his hometown. What he finds is not what he expected. Her name is Holly. What Holly would do, is like nothing Mark has ever experienced before.",
        "runtimeMinutes": "90"
    },
    "2019_709": {
        "plotSummary": "The adventurous life of young Errol Flynn in Australia before he became a famous Hollywood actor.",
        "runtimeMinutes": "106"
    },
    "2019_71": {
        "plotSummary": "After they uncover evidence that there is corruption in the police force, three police officers in Hong Kong try to discover which of them can be trusted.",
        "runtimeMinutes": "98"
    },
    "2019_710": {
        "plotSummary": "College student Ali Hooper and her little brother are attacked by a masked maniac, and the key to them surviving the night lies in unlocking a secret from the killer's past.",
        "runtimeMinutes": "90"
    },
    "2019_711": {
        "plotSummary": "Some ground subsidence has occurred in a suburban area and a team of engineers, including Hao, is dispatched to investigate the cause. After days of wandering around in the empty suburb looking for answers and carrying his heavy gear, Hao ...See moreSome ground subsidence has occurred in a suburban area and a team of engineers, including Hao, is dispatched to investigate the cause. After days of wandering around in the empty suburb looking for answers and carrying his heavy gear, Hao walks into a primary school where he finds a diary chronicling the story of a boy and the separation of what seems to be an intimate group. As the investigation keeps going, Hao discovers that this diary might contain prophecies about his own life.See less",
        "runtimeMinutes": "118"
    },
    "2019_712": {
        "plotSummary": "Inmates in Virginia attempt to transcend the cycle of recidivism through an unlikely artistic collaboration behind bars with Grammy-winning hip hop artist Todd 'Speech' Thomas.",
        "runtimeMinutes": "94"
    },
    "2019_713": {
        "plotSummary": "If a dance is not danced, it vanishes. If the Dancer Dances follows a group of New York City's top modern dancers as they reconstruct an iconic and mysterious work by the legendary Merce Cunningham, revealing what it takes to keep a dance ...See moreIf a dance is not danced, it vanishes. If the Dancer Dances follows a group of New York City's top modern dancers as they reconstruct an iconic and mysterious work by the legendary Merce Cunningham, revealing what it takes to keep a dance alive. Timed to coincide with Cunningham's centennial, the film confronts one of the most urgent issues facing the dance world today: how do we prevent the loss of masterworks to time?See less",
        "runtimeMinutes": "90"
    },
    "2019_714": {
        "plotSummary": "An in-depth exploration of the creative paths of blind and visually impaired artists including a photographer, dancer, writer and filmmaker..",
        "runtimeMinutes": "78"
    },
    "2019_715": {
        "plotSummary": "A criminal attorney struggles with his sexuality, a cryptic new boyfriend, unemployment and the disturbing childhood secrets his parents hold.",
        "runtimeMinutes": "90"
    },
    "2019_716": {
        "plotSummary": "A farmer makes a living disposing of bodies. One day, 3 bodies are delivered - except the young woman is still alive. If set free, the gang'll come after him and his daughter.",
        "runtimeMinutes": "83"
    },
    "2019_717": {
        "plotSummary": "In the Kenyan bush, a small-time ivory dealer fights to stay on top while forces mobilize to destroy his trade. When he turns to his younger cousin, a conflicted wildlife ranger who hasn't been paid in months, they both see a possible lifeline.",
        "runtimeMinutes": "79"
    },
    "2019_718": {
        "plotSummary": "Late nineteenth century in a finishing school for young girls near in France, the principal, the fascinating Miss Julie, sows confusion in the heart of the newcomer, Olivia.",
        "runtimeMinutes": "95"
    },
    "2019_719": {
        "plotSummary": "Gritty documentary that looks at the lives of teenagers living on the streets of Seattle.",
        "runtimeMinutes": "91"
    },
    "2019_72": {
        "plotSummary": "Two con women - one low rent and the other high class - team up to take down the men who have wronged them.",
        "runtimeMinutes": "93"
    },
    "2019_720": {
        "plotSummary": "An employee of a corporation with a lucrative secret process is tempted to betray it. But there's more to it than that.",
        "runtimeMinutes": "110"
    },
    "2019_721": {
        "plotSummary": "In Eschnapur, a local Maharajah and a German architect fall in-love with the same temple dancer.",
        "runtimeMinutes": "101"
    },
    "2019_722": {
        "plotSummary": "When a young boy goes missing in a sleepy backwoods town, a local sanitation truck driver, Donald, plays detective, embarking on a precarious and obsessive investigation.",
        "runtimeMinutes": "89"
    },
    "2019_723": {
        "plotSummary": "In Cracked Up we witness the effects adverse childhood experiences can have across a lifetime through the incredible story of actor, comedian, master impressionist and Saturday Night Live veteran, Darrell Hammond. Behind the scenes Darrell...See moreIn Cracked Up we witness the effects adverse childhood experiences can have across a lifetime through the incredible story of actor, comedian, master impressionist and Saturday Night Live veteran, Darrell Hammond. Behind the scenes Darrell suffered from debilitating flashbacks, self injury, addiction and misdiagnosis, until the right doctor isolated the key to unlocking the memories his brain kept locked away for over 50 years. Cracked Up, director Michelle Esrick, creates an inspiring balance between comedy and tragedy helping us understand the impact of toxic stress and childhood trauma in a new light, breaking down barriers of stigma and replacing shame with compassion and hope.See less",
        "runtimeMinutes": "95"
    },
    "2019_724": {
        "plotSummary": "Ordinary people in New York are asked to talk about their lives and their hopes for the future in a time marked by political division and climate change.",
        "runtimeMinutes": "94"
    },
    "2019_725": {
        "plotSummary": "Explores the life and work of the psychoanalytic theorist and activist Frantz Fanon who was born in Martinique, educated in Paris and worked in Algeria. Examines Fanon's theories of identity and race, and traces his involvement in the ...See moreExplores the life and work of the psychoanalytic theorist and activist Frantz Fanon who was born in Martinique, educated in Paris and worked in Algeria. Examines Fanon's theories of identity and race, and traces his involvement in the anti-colonial struggle in Algeria and throughout the world.  Written by Brian Rawnsley See less",
        "runtimeMinutes": "70"
    },
    "2019_726": {
        "plotSummary": "Based on the book,\"The Meanest Man in Texas\" is the true story about Clyde Thompson, who in 1928 was convicted of multiple murders and sentenced to death, but was miraculously paroled. Thompson gained a reputation as the meanest man in ...See moreBased on the book,\"The Meanest Man in Texas\" is the true story about Clyde Thompson, who in 1928 was convicted of multiple murders and sentenced to death, but was miraculously paroled. Thompson gained a reputation as the meanest man in Texas while working hard labor in prison, until he meets the love of his life, Julia Perryman, and finds redemption and faith.See less",
        "runtimeMinutes": "105"
    },
    "2019_727": {
        "plotSummary": "The great composer Arvo Pärt at work, whilst the artists who perform his music and are inspired by it illustrate the different aspects of the phenomenon the man is.",
        "runtimeMinutes": "75"
    },
    "2019_728": {
        "plotSummary": "After years of prescription medications failed her a suicidal woman, Adrianne, turns to underground healers to try and overcome her depression, anxiety, and opioid addiction with illegal psychedelic medicine like magic mushrooms and iboga.",
        "runtimeMinutes": "82"
    },
    "2019_729": {
        "plotSummary": "A hospital psychiatrist's own sanity is pushed to the edge when a frightened amnesiac patient insists that he has died and brought something terrible back from the other side.",
        "runtimeMinutes": "92"
    },
    "2019_73": {
        "plotSummary": "A young woman, while attempting to save her father during a category 5 hurricane, finds herself trapped in a flooding house and must fight for her life against alligators.",
        "runtimeMinutes": "87"
    },
    "2019_730": {
        "plotSummary": "Rory MacNeil, a rugged old Scotsman, travels to San Francisco to seek medical treatment. He moves in with his estranged son Ian, as he sees his life getting transformed through a newfound bond with his baby grandson.",
        "runtimeMinutes": "107"
    },
    "2019_731": {
        "plotSummary": "A dozen years after his Oscar-nominated Iraq in Fragments, American documentarian James Longley delivers a sweeping, profoundly compassionate group portrait of Afghan students and teachers still weathering national turbulence.",
        "runtimeMinutes": "117"
    },
    "2019_732": {
        "plotSummary": "An anthology film set in colonial Africa in the late 19th century telling the stories of 5 different characters: a troubled king, a middle-aged Pygmy working in a luxury hotel, a failed businessman on an expedition, a lost porter and a ...See moreAn anthology film set in colonial Africa in the late 19th century telling the stories of 5 different characters: a troubled king, a middle-aged Pygmy working in a luxury hotel, a failed businessman on an expedition, a lost porter and a young army deserter.See less",
        "runtimeMinutes": "44"
    },
    "2019_733": {
        "plotSummary": "Ghost Fleet follows a small group of activists who risk their lives on remote Indonesian islands to find justice and freedom for the enslaved fishermen who feed the world's insatiable appetite for seafood. Bangkok-based Patima ...See moreGhost Fleet follows a small group of activists who risk their lives on remote Indonesian islands to find justice and freedom for the enslaved fishermen who feed the world's insatiable appetite for seafood. Bangkok-based Patima Tungpuchayakul, a Thai abolitionist, has committed her life to helping these \"lost\" men return home. Facing illness, death threats, corruption, and complacency, Patima's fearless determination for justice inspires her nation and the world.See less",
        "runtimeMinutes": "90"
    },
    "2019_734": {
        "plotSummary": "A young couple is shaken by a seemingly fraudulent yet unprovable act that strikes to the core of their cultural pretensions.",
        "runtimeMinutes": "76"
    },
    "2019_735": {
        "plotSummary": "Gregory is a normal teen who is infatuated with a classmate. He must work to win her affection.",
        "runtimeMinutes": "91"
    },
    "2019_736": {
        "plotSummary": "A young girl befriends a dangerous escaped mental patient after the death of her parents.",
        "runtimeMinutes": "173"
    },
    "2019_737": {
        "plotSummary": "The evolution of the movie business over the past century, from penny arcades and nickelodeons, to the grand movie palaces built by the studios, and what happened over the years as they were challenged by television and cell-phone cinema.",
        "runtimeMinutes": "84"
    },
    "2019_738": {
        "plotSummary": "A story on how a small drug store owner became the exclusive selling agent of a cheap Indian generic drug against Chronic Granulocytic Leukemia in China.",
        "runtimeMinutes": "117"
    },
    "2019_739": {
        "plotSummary": "When two outsiders arrive on an isolated intentional community, seventeen-year old Anahita begins to question her role at home, and what a future out in the world-at-large could be.",
        "runtimeMinutes": "85"
    },
    "2019_74": {
        "plotSummary": "A pair of teenagers with cystic fibrosis meet in a hospital and fall in love, though their disease means they must avoid close physical contact.",
        "runtimeMinutes": "116"
    },
    "2019_740": {
        "plotSummary": "Stuart is a having a mid-life crisis. Desperate for something more in life, he tags along on his best friend's family vacation to Paris - then proposes to his friend's 26-year-old daughter, Rosalind, while standing under the Eiffel Tower.",
        "runtimeMinutes": "87"
    },
    "2019_741": {
        "plotSummary": "A documentary film about veterans with PTSD who find that, after other treatments fall short, a service dog helps them return to an independent-feeling life.",
        "runtimeMinutes": "88"
    },
    "2019_742": {
        "plotSummary": "With the impending Y2K apocalypse fast approaching, Abbie is faced with the ultimate challenge - the unbeatable level 256 on Pac-Man - and he can't get off the couch until he conquers it. A survival story set in a living room.",
        "runtimeMinutes": "91"
    },
    "2019_743": {
        "plotSummary": "A serial killer is terrorizing Arizona with the police in hot pursuit. What the police don't know is that a mysterious group are also pursuing the same killer to stop the killer from unleashing an evil like nothing before.",
        "runtimeMinutes": "94"
    },
    "2019_744": {
        "plotSummary": "A breakthrough called CRISPR opens the door to curing diseases, reshaping the biosphere, and designing our own children. A provocative exploration of its far-reaching implications, through the eyes of the scientists who discovered it.",
        "runtimeMinutes": "95"
    },
    "2019_745": {
        "plotSummary": "A Principal was call on to rescue a critically broken school. Ten years later, she is now working on her second socially and academically failing high school with a high dropout rate, riddled with crime, drugs, sex and teenage pregnancy.",
        "runtimeMinutes": "68"
    },
    "2019_746": {
        "plotSummary": "Franck Poupart is a slightly neurotic door-to-door salesman in a sinister part of Paris' suburbs. He meets Mona, a teenager, who's been made a prostitute by her own aunt. Franck would like to change his life and also save Mona from her ...See moreFranck Poupart is a slightly neurotic door-to-door salesman in a sinister part of Paris' suburbs. He meets Mona, a teenager, who's been made a prostitute by her own aunt. Franck would like to change his life and also save Mona from her aunt. Murder is the only solution he finds to achieve his goal... A very gloomy movie, exuding dispair and uneasiness, with pathetic characters.  Written by YepokSee less",
        "runtimeMinutes": "111"
    },
    "2019_747": {
        "plotSummary": "A documentary about the passionate translators of the book The Little Prince by Antoine de Saint-Exupery, who fight for the preservation of their endangered languages.",
        "runtimeMinutes": "89"
    },
    "2019_748": {
        "plotSummary": "A woman who seeks vergence on the Russian mob for the death of her father. She battles her way up in the underground MMA fighting world to find those responsible for his death.",
        "runtimeMinutes": "98"
    },
    "2019_749": {
        "plotSummary": "An elderly couple will stop at nothing to make it to the bank.",
        "runtimeMinutes": "72"
    },
    "2019_75": {
        "plotSummary": "Rambo must confront his past and unearth his ruthless combat skills to exact revenge in a final mission.",
        "runtimeMinutes": "89"
    },
    "2019_750": {
        "plotSummary": "When ex pro wrestler Buck Severs travels to an abandoned wildlife preserve with his friends for 'Bro's Weekend,' they become the targets of a deadly manhunt and Buck must find the fighter in himself before it's too late.",
        "runtimeMinutes": "85"
    },
    "2019_751": {
        "plotSummary": "A park ranger spends the night guarding a potential crime scene on a remote mountain trail.",
        "runtimeMinutes": "87"
    },
    "2019_752": {
        "plotSummary": "\"Chulas Fronteras\" is a documentary about the music of the Mexican community on both sides of the Texas-Mexico border, particularly of migrant farmers. It includes material about the roots of the music, but devotes principal attention to ...See more\"Chulas Fronteras\" is a documentary about the music of the Mexican community on both sides of the Texas-Mexico border, particularly of migrant farmers. It includes material about the roots of the music, but devotes principal attention to the music as a form of social protest against oppression and racism.  Written by George SchneidermanSee less",
        "runtimeMinutes": "58"
    },
    "2019_753": {
        "plotSummary": "A nearly wordless visual narrative inter cuts two main stories and a couple of minor ones.",
        "runtimeMinutes": "92"
    },
    "2019_754": {
        "plotSummary": "",
        "runtimeMinutes": "95"
    },
    "2019_755": {
        "plotSummary": "Seventeen year old Elizabeth and her younger sister, Sam, are thrust into circumstances more terrifying than living with their abusive, alcoholic mother when they are forced to move into their deceased Grandfather's house.",
        "runtimeMinutes": "83"
    },
    "2019_756": {
        "plotSummary": "An innocent-looking young boy mysteriously appears in a nondescript small town as some fear he's set to unleash his reign of terror.",
        "runtimeMinutes": "89"
    },
    "2019_757": {
        "plotSummary": "After 16 years in Brooklyn, working three low-paying jobs and collecting bottles on the street in his spare time, sending the bulk of his earnings home to his family in Mexico, Felipe decides to return after almost two decades. But when he...See moreAfter 16 years in Brooklyn, working three low-paying jobs and collecting bottles on the street in his spare time, sending the bulk of his earnings home to his family in Mexico, Felipe decides to return after almost two decades. But when he informs his family of his homecoming, he discovers that they've squandered the money, are deeply in debt and don't want him to return. They need him to stay in the US.See less",
        "runtimeMinutes": "74"
    },
    "2019_758": {
        "plotSummary": "A troubled Iraq War veteran struggling to reintegrate into society sets out on a cross-country journey with the hope of reuniting with his young son.",
        "runtimeMinutes": "125"
    },
    "2019_759": {
        "plotSummary": "The film tells the story of a boy who is responsible, along with his father, for finding the cure for an illness that is contracted after the person takes a fright.",
        "runtimeMinutes": "73"
    },
    "2019_76": {
        "plotSummary": "A young boy in Hitler's army finds out his mother is hiding a Jewish girl in their home.",
        "runtimeMinutes": "108"
    },
    "2019_760": {
        "plotSummary": "Lee Khan, a high official under Mongolian Emperor Yuan of the Yuan dynasty (year 1366) procures the battle map of the Chinese rebel Chu Yuan-Chang's army. Rebel spies, aided by treachery within Khan's ranks, strive to corner him in an inn.",
        "runtimeMinutes": "105"
    },
    "2019_761": {
        "plotSummary": "A woman grapples with the consequences of her celebrity husband's double life after he commits suicide.",
        "runtimeMinutes": "104"
    },
    "2019_762": {
        "plotSummary": "Factory and construction workers, farmers, commuters, miners, students. The director captures the state of his nation, by static filming one or more people in more or less motionless poses. No narrative, just portraits.",
        "runtimeMinutes": "79"
    },
    "2019_763": {
        "plotSummary": "A film in six episodes, connected by the same four actresses, full of various subplots that play with narrative and different cinematic genres , everything structured in an unusual way.",
        "runtimeMinutes": "808"
    },
    "2019_764": {
        "plotSummary": "A man forgets Mother's Day and has one hour to sneak out of his house and, with no money, find adequate gifts for the moms in his life - or face their wrath.",
        "runtimeMinutes": "75"
    },
    "2019_765": {
        "plotSummary": "Follows one memorable night in the life of LAPD officer Ray Mandel while hunting two cop killers on the loose.",
        "runtimeMinutes": "110"
    },
    "2019_766": {
        "plotSummary": "Based on the untold story of Seattle's Capitol Hill Massacre. A man planning to commit a mass shooting is befriended by an eccentric group of ravers and finds himself conflicted about his intentions.",
        "runtimeMinutes": "84"
    },
    "2019_767": {
        "plotSummary": "The film revolves around the concept of soap opera. Its structure is based on the assumption that Chilean reality does not exist, but rather is an ensemble of soap operas.",
        "runtimeMinutes": "80"
    },
    "2019_768": {
        "plotSummary": "Peter Cotton, a scientist that works on rabbits and infertility, learns that the military wishes to use his work to create superhuman soldiers. Cotton is bitten by an experimental mutant rabbit and changes into the evil Rottentail.",
        "runtimeMinutes": "106"
    },
    "2019_769": {
        "plotSummary": "One man's art. One woman's unexpected path to healing. An American woman's emotional quest to find the art of her Polish-Jewish great-grandfather, lost during World War II.",
        "runtimeMinutes": "78"
    },
    "2019_77": {
        "plotSummary": "Pirates from around the world gather at the Pirates Expo to join the hunt for Gol D. Roger's lost treasure.",
        "runtimeMinutes": "101"
    },
    "2019_770": {
        "plotSummary": "BACK TO THE FATHERLAND is a documentary film that tells the story of young people leaving their home country to try their luck somewhere else. A common tale these days if these young women and men weren't from Israel and if they wouldn't ...See moreBACK TO THE FATHERLAND is a documentary film that tells the story of young people leaving their home country to try their luck somewhere else. A common tale these days if these young women and men weren't from Israel and if they wouldn't be moving to Germany and Austria, where their families were persecuted and killed.See less",
        "runtimeMinutes": "77"
    },
    "2019_771": {
        "plotSummary": "2039: Anonymity/living off the grid is a crime. Punishment is \"disappearance\". Following the lives of convicts becomes entertainment on TV. A group of young men called Division 19 works against the system.",
        "runtimeMinutes": "93"
    },
    "2019_772": {
        "plotSummary": "A part of Joan of Arc's life. At the beginning, Jeanne (Joan) has already left Domremy, she is trying to convince a captain to escort her to the Dauphin. It ends during Jeanne's first battle, at Orleans. Meanwhile, Jeanne is depicted more ...See moreA part of Joan of Arc's life. At the beginning, Jeanne (Joan) has already left Domremy, she is trying to convince a captain to escort her to the Dauphin. It ends during Jeanne's first battle, at Orleans. Meanwhile, Jeanne is depicted more as a warrior than a saint (all cliches are avoided), with only her faith for strength.  Written by YepokSee less",
        "runtimeMinutes": "160"
    },
    "2019_773": {
        "plotSummary": "A sequel to Streetwise, focusing on Tiny.",
        "runtimeMinutes": "87"
    },
    "2019_774": {
        "plotSummary": "Chloe has been living a successful life thanks to one trick: Albert Einstein is in her mind. But one day, he decides to move and chooses another body: Zac, a depressive beekeeper.",
        "runtimeMinutes": "100"
    },
    "2019_775": {
        "plotSummary": "",
        "runtimeMinutes": "93"
    },
    "2019_776": {
        "plotSummary": "Serendipity began as a book, published on the occasion of Prune Nourry's solo show at the Guimet National Asian Art Museum in Paris in 2017. The French-born, New York-based artist has spent the majority of her artistic career creating work...See moreSerendipity began as a book, published on the occasion of Prune Nourry's solo show at the Guimet National Asian Art Museum in Paris in 2017. The French-born, New York-based artist has spent the majority of her artistic career creating work that deals with women's bodies and female fertility. A recent breast cancer diagnosis led Nourry to create Serendipity-now in the form of a stunning first-person documentary-which captures the subsequent evolution of her body, her work, her soul, and her mind. This impassioned, beautiful film embodies the artist's belief that everything is connected, coincidence is an illusion, and \"the essentials to life really are health, love, and art.\"  Written by SIBSee less",
        "runtimeMinutes": "74"
    },
    "2019_777": {
        "plotSummary": "Filmmakers expose the radical ideologists indoctrinating thousands of jihadists.",
        "runtimeMinutes": "75"
    },
    "2019_778": {
        "plotSummary": "Documentary about Jimi Hendrix historic July 4, 1970 performance in front of over 300,000 US fans.",
        "runtimeMinutes": "89"
    },
    "2019_779": {
        "plotSummary": "A basketball-savvy teen reluctantly agrees to coach a brilliant but self-centered tech whiz who has lost everything when her startup goes bust and personal life is left in ruins. Discovering that success at her new job depends on becoming ...See moreA basketball-savvy teen reluctantly agrees to coach a brilliant but self-centered tech whiz who has lost everything when her startup goes bust and personal life is left in ruins. Discovering that success at her new job depends on becoming a team player in the office and on the company's, up till now, all-male basketball team, she enlists his help in a desperate attempt to save her job and her future-an experience that ultimately changes both of their lives forever.See less",
        "runtimeMinutes": "101"
    },
    "2019_78": {
        "plotSummary": "A female dog travels four hundred miles in search of her owner throughout a Colorado wilderness.",
        "runtimeMinutes": "96"
    },
    "2019_780": {
        "plotSummary": "During World War I, a poor black Southerner travels north to Chicago to get work in the city's slaughterhouses, where he becomes embroiled in the organized labor movement. He becomes prominent as a leader of fellow African-Americans in the...See moreDuring World War I, a poor black Southerner travels north to Chicago to get work in the city's slaughterhouses, where he becomes embroiled in the organized labor movement. He becomes prominent as a leader of fellow African-Americans in the union, though many, including his best friend, view him as a sell-out.  Written by Karl WilliamsSee less",
        "runtimeMinutes": "118"
    },
    "2019_781": {
        "plotSummary": "A fictionalized account of what may have happened when John Lennon and Brian Epstein went on holiday together to Spain in 1963.",
        "runtimeMinutes": "57"
    },
    "2019_782": {
        "plotSummary": "An unseen tormentor harasses a reclusive author as a citywide blackout triggers fires, looting and escalating violence during the Summer of Sam in New York in 1977.",
        "runtimeMinutes": "99"
    },
    "2019_783": {
        "plotSummary": "Sam (Jerry Stiller) and Molly (Anne Meara) are a classic bickering old couple, and their marriage has been forty years of sparring. Yet, when Sam refuses to move the carp he's keeping in their spare bathroom, Molly becomes fed up and ...See moreSam (Jerry Stiller) and Molly (Anne Meara) are a classic bickering old couple, and their marriage has been forty years of sparring. Yet, when Sam refuses to move the carp he's keeping in their spare bathroom, Molly becomes fed up and unexpectedly leaves. Molly moves in with their grown son and starts dating an old friend. The couple's daughter convinces Sam to try to win his wife back and rediscover his own sense of romance.See less",
        "runtimeMinutes": "96"
    },
    "2019_784": {
        "plotSummary": "Edward Forester's career and personal life have hit rock bottom-but not his spirit. At 64, the handsome bachelor moves in to a tiny apartment and must start over again.",
        "runtimeMinutes": "104"
    },
    "2019_785": {
        "plotSummary": "It follows six people (and a robot) who transform their lives using stillness and mindfulness, providing inspiration as we embark on the next phase of evolution.",
        "runtimeMinutes": "88"
    },
    "2019_79": {
        "plotSummary": "A grieving snowplow driver seeks out revenge against the drug dealers who killed his son.",
        "runtimeMinutes": "119"
    },
    "2019_8": {
        "plotSummary": "When a new toy called \"Forky\" joins Woody and the gang, a road trip alongside old and new friends reveals how big the world can be for a toy.",
        "runtimeMinutes": "100"
    },
    "2019_80": {
        "plotSummary": "A dog finds the meaning of his own existence through the lives of the humans he meets. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2019_81": {
        "plotSummary": "A joyous family reunion becomes a hilarious nightmare as Madea and the crew travel to backwoods Georgia, where they find themselves unexpectedly planning a funeral that might unveil unsavory family secrets.",
        "runtimeMinutes": "109"
    },
    "2019_82": {
        "plotSummary": "A tribe of cats called the Jellicles must decide yearly which one will ascend to the Heaviside Layer and come back to a new Jellicle life. Read more: Synopsis",
        "runtimeMinutes": "110"
    },
    "2019_83": {
        "plotSummary": "When a young systems engineer blows the whistle on a dangerous technology, Charlie's Angels are called into action, putting their lives on the line to protect us all.",
        "runtimeMinutes": "118"
    },
    "2019_84": {
        "plotSummary": "Years following the events of The Shining, a now-adult Dan Torrance must protect a young girl with similar powers from a cult known as The True Knot, who prey on children with powers to remain immortal.",
        "runtimeMinutes": "152"
    },
    "2019_85": {
        "plotSummary": "A woman is boxed out by the male sports agents in her profession, but gains an unexpected edge over them when she develops the ability to hear men's thoughts. Read more: Synopsis",
        "runtimeMinutes": "117"
    },
    "2019_86": {
        "plotSummary": "A young woman falls for a guy with a dark secret and the two embark on a rocky relationship. Based on the novel by Anna Todd.",
        "runtimeMinutes": "105"
    },
    "2019_87": {
        "plotSummary": "A rock climber tries to save the day when a mysterious white gas envelops an entire district in Seoul, South Korea.",
        "runtimeMinutes": "103"
    },
    "2019_88": {
        "plotSummary": "A crew of rugged firefighters meet their match when attempting to rescue three rambunctious kids.",
        "runtimeMinutes": "96"
    },
    "2019_89": {
        "plotSummary": "Based on the true story of a real-life friendship between Fred Rogers and journalist Lloyd Vogel.",
        "runtimeMinutes": "109"
    },
    "2019_9": {
        "plotSummary": "A kind-hearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true.",
        "runtimeMinutes": "128"
    },
    "2019_90": {
        "plotSummary": "An Indian soldier chases after his mentor who has gone rogue following an unexpected kill.",
        "runtimeMinutes": "154"
    },
    "2019_91": {
        "plotSummary": "Tree Gelbman discovers that dying over and over was surprisingly easier than the dangers that lie ahead.",
        "runtimeMinutes": "100"
    },
    "2019_92": {
        "plotSummary": "A love story between a snake spirit and a snake hunter.",
        "runtimeMinutes": "99"
    },
    "2019_93": {
        "plotSummary": "A group of women take on Fox News head Roger Ailes and the toxic atmosphere he presided over at the network.",
        "runtimeMinutes": "109"
    },
    "2019_94": {
        "plotSummary": "Stagnant since 1903, at an elevation of 2,744 m, a volcano erupts on the mythical and majestic Baekdu Mountain.",
        "runtimeMinutes": "130"
    },
    "2019_95": {
        "plotSummary": "A lonely woman befriends a group of teenagers and decides to let them party at her house. Just when the kids think their luck couldn't get any better, things start happening that make them question the intention of their host.",
        "runtimeMinutes": "99"
    },
    "2019_96": {
        "plotSummary": "A bride's wedding night takes a sinister turn when her eccentric new in-laws force her to take part in a terrifying game.",
        "runtimeMinutes": "95"
    },
    "2019_97": {
        "plotSummary": "Based on the graphic novels by Mike Mignola, Hellboy, caught between the worlds of the supernatural and human, battles an ancient sorceress bent on revenge.",
        "runtimeMinutes": "120"
    },
    "2019_98": {
        "plotSummary": "Journalist Fred Flarsky reunites with his childhood crush, Charlotte Field, now one of the most influential women in the world. As she prepares to make a run for the Presidency, Charlotte hires Fred as her speechwriter and sparks fly.",
        "runtimeMinutes": "125"
    },
    "2019_99": {
        "plotSummary": "When her 14-year-old son drowns in a lake, a faithful mother prays for him to come back from the brink of death and be healed.",
        "runtimeMinutes": "116"
    }
}