{
    "2020_1": {
        "plotSummary": "From the acclaimed filmmaker behind Mr. Six comes a riveting war epic. In 1937, eight hundred Chinese soldiers fight under siege from a warehouse in the middle of the Shanghai battlefield, completely surrounded by the Japanese army.",
        "runtimeMinutes": "149"
    },
    "2020_10": {
        "plotSummary": "A sled dog struggles for survival in the wilds of the Yukon.",
        "runtimeMinutes": "100"
    },
    "2020_100": {
        "plotSummary": "A determined young Saudi doctor's surprise run for office in the local city elections sweeps up her family and community as they struggle to accept their town's first female candidate.",
        "runtimeMinutes": "104"
    },
    "2020_101": {
        "plotSummary": "A woman's life is turned upside down when her criminal parents invite an outsider to join them on a major heist they're planning.",
        "runtimeMinutes": "104"
    },
    "2020_102": {
        "plotSummary": "A \"tax collector\" working for a local crime lord finds his family's safety compromised when the rival of his boss shows up in L.A. and upends the business.",
        "runtimeMinutes": "95"
    },
    "2020_103": {
        "plotSummary": "After her friend's death, a NYC journalist becomes the target of a criminal looking to collect on a debt.",
        "runtimeMinutes": "94"
    },
    "2020_104": {
        "plotSummary": "A couple's visit with their son takes a dramatic turn when the father tells him he plans on leaving his mother.",
        "runtimeMinutes": "100"
    },
    "2020_105": {
        "plotSummary": "Friendship and love between illegal immigrants struggling and facing challenges. Showing us that when it comes to the struggle of life, no border can divide human hearts and the love inside.",
        "runtimeMinutes": "124"
    },
    "2020_106": {
        "plotSummary": "In a monster-infested world, Joel learns his girlfriend is just 80 miles away. To make the dangerous journey, Joel discovers his inner hero to be with the girl of his dreams.",
        "runtimeMinutes": "109"
    },
    "2020_107": {
        "plotSummary": "A teenager's weekend at a lake house with her father takes a turn for the worse when a group of convicts wreaks havoc on their lives.",
        "runtimeMinutes": "93"
    },
    "2020_108": {
        "plotSummary": "Stanley's last shift at his fast food job takes an unexpected turn.",
        "runtimeMinutes": "90"
    },
    "2020_109": {
        "plotSummary": "A secluded farm is struck by a strange meteorite which has apocalyptic consequences for the family living there and possibly the world.",
        "runtimeMinutes": "111"
    },
    "2020_11": {
        "plotSummary": "A young Chinese maiden disguises herself as a male warrior in order to save her father.",
        "runtimeMinutes": "115"
    },
    "2020_110": {
        "plotSummary": "A man providing overnight watch to a deceased member of his former Orthodox Jewish community finds himself opposite a malevolent entity, in writer-director Keith Thomas' electrifying feature debut.",
        "runtimeMinutes": "89"
    },
    "2020_111": {
        "plotSummary": "A powerful and stirring reinvention of the show, celebrated the world over for its Grammy Award-winning music and the thrilling energy and passion of its Irish and international dance.",
        "runtimeMinutes": "120"
    },
    "2020_112": {
        "plotSummary": "The Gamache, tailors from father to son, have been dressing the Mafia family Paternò for three generation. Vince works on behalf of Frank the godfather with his eldest son Giaco. Vince seeks to earn his stripes by impressing the godfather.",
        "runtimeMinutes": "143"
    },
    "2020_113": {
        "plotSummary": "Life for an entrepreneur and his American family begins to take a twisted turn after moving into an English country manor.",
        "runtimeMinutes": "107"
    },
    "2020_114": {
        "plotSummary": "Milla, a seriously ill teenager, falls in love with a drug dealer, Moses, her parents worst nightmare.",
        "runtimeMinutes": "118"
    },
    "2020_115": {
        "plotSummary": "Set after Hurricane Katrina, four boyhood friends out of options reluctantly accept an offer to pull off a dangerous heist in the heart of New Orleans.",
        "runtimeMinutes": "123"
    },
    "2020_116": {
        "plotSummary": "Sol, a famous Argentine Tango performer, has lived in Buenos Aires for many years. Behind her excessive temper and her glowing smile, the Diva hides an injury from which she never really recovered: the loss of her only son, Raphaël.",
        "runtimeMinutes": "98"
    },
    "2020_117": {
        "plotSummary": "Possessor follows an agent who works for a secretive organization that uses brain-implant technology to inhabit other people's bodies - ultimately driving them to commit assassinations for high-paying clients.",
        "runtimeMinutes": "103"
    },
    "2020_118": {
        "plotSummary": "A mysterious creature terrorizes five teenage friends after their bus takes a shortcut on a desolate road in the wild.",
        "runtimeMinutes": "80"
    },
    "2020_119": {
        "plotSummary": "Two movie producers who owe money to the mob set up their aging movie star for an insurance scam to try and save themselves. But they wind up getting more than they ever imagined.",
        "runtimeMinutes": "104"
    },
    "2020_12": {
        "plotSummary": "Covert security company Vanguard is the last hope of survival for an accountant after he is targeted by the world's deadliest mercenary organization.",
        "runtimeMinutes": "107"
    },
    "2020_120": {
        "plotSummary": "When a killer shark unleashes chaos on a beach community, it's up to a local sheriff, a marine biologist, and an old seafarer to hunt the beast down.",
        "runtimeMinutes": "124"
    },
    "2020_121": {
        "plotSummary": "When carefree Nyles and reluctant maid of honor Sarah have a chance encounter at a Palm Springs wedding, things get complicated as they are unable to escape the venue, themselves, or each other.",
        "runtimeMinutes": "90"
    },
    "2020_122": {
        "plotSummary": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.",
        "runtimeMinutes": "146"
    },
    "2020_123": {
        "plotSummary": "Good girl Sandy Olsson and greaser Danny Zuko fell in love over the summer. When they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance?",
        "runtimeMinutes": "110"
    },
    "2020_124": {
        "plotSummary": "A couple's wedding plans are thrown off course when the groom is diagnosed with liver cancer.",
        "runtimeMinutes": "93"
    },
    "2020_125": {
        "plotSummary": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.",
        "runtimeMinutes": "81"
    },
    "2020_126": {
        "plotSummary": "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, 2 monsters realize things may not be what they think.",
        "runtimeMinutes": "92"
    },
    "2020_127": {
        "plotSummary": "The eccentrically macabre family moves to a bland suburb where Wednesday Addams' friendship with the daughter of a hostile and conformist local reality show host exacerbates conflict between the families.",
        "runtimeMinutes": "86"
    },
    "2020_128": {
        "plotSummary": "When a man inadvertently makes Santa fall off of his roof on Christmas Eve, he finds himself magically recruited to take his place.",
        "runtimeMinutes": "97"
    },
    "2020_129": {
        "plotSummary": "One of the greatest miracles in the Bible is Moses and the Israelites trapped at the sea by Pharaoh's army, when God miraculously parts the waters, but is there any evidence that it really happened, and if so, where?",
        "runtimeMinutes": "150"
    },
    "2020_13": {
        "plotSummary": "When the owner and operator of a luxurious island invites a collection of guests to live out their most elaborate fantasies in relative seclusion, chaos quickly descends.",
        "runtimeMinutes": "109"
    },
    "2020_130": {
        "plotSummary": "A look at the friendship between two guys that spans over many years.",
        "runtimeMinutes": "98"
    },
    "2020_131": {
        "plotSummary": "A rowdy, unorthodox Santa Claus is fighting to save his declining business. Meanwhile, Billy, a neglected and precocious 12 year old, hires a hit man to kill Santa after receiving a lump of coal in his stocking.",
        "runtimeMinutes": "100"
    },
    "2020_132": {
        "plotSummary": "Hired to steal a rare painting from one of the most enigmatic painters of all time, an ambitious art dealer becomes consumed by his own greed and insecurity as the operation spins out of control.",
        "runtimeMinutes": "99"
    },
    "2020_133": {
        "plotSummary": "A group of seniors plan to break out of their retirement home.",
        "runtimeMinutes": "95"
    },
    "2020_134": {
        "plotSummary": "Five friends exploring a remote cave system in Northern Australia find themselves threatened by a hungry crocodile.",
        "runtimeMinutes": "98"
    },
    "2020_135": {
        "plotSummary": "Two New Orleans paramedics' lives are ripped apart after they encounter a series of horrific deaths linked to a designer drug with bizarre, otherworldly effects.",
        "runtimeMinutes": "102"
    },
    "2020_136": {
        "plotSummary": "T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past.",
        "runtimeMinutes": "134"
    },
    "2020_137": {
        "plotSummary": "A recently widowed traveler is kidnapped by a cold blooded killer, only to escape into the wilderness where she is forced to battle against the elements as her pursuer closes in on her.",
        "runtimeMinutes": "98"
    },
    "2020_138": {
        "plotSummary": "A man rescues a mermaid in Paris and slowly falls in love with her.",
        "runtimeMinutes": "102"
    },
    "2020_139": {
        "plotSummary": "Three former parapsychology professors set up shop as a unique ghost removal service.",
        "runtimeMinutes": "105"
    },
    "2020_14": {
        "plotSummary": "Based on the 2014 romance novel of the same name, this follows the love life of two young adults.",
        "runtimeMinutes": "105"
    },
    "2020_140": {
        "plotSummary": "Recorded over two nights during her sold-out 24 Karat Gold Tour, follows a set-list of fan favorites and rare gems from Stevie's multi-platinum selling catalog.",
        "runtimeMinutes": "135"
    },
    "2020_141": {
        "plotSummary": "Inspired by real events in the life of French New Wave icon Jean Seberg. In the late 1960s, Hoover's FBI targeted her because of her political and romantic involvement with civil rights activist Hakim Jamal.",
        "runtimeMinutes": "102"
    },
    "2020_142": {
        "plotSummary": "A group of intergalactic criminals must pull together to stop a fanatical warrior with plans to purge the universe.",
        "runtimeMinutes": "121"
    },
    "2020_143": {
        "plotSummary": "To gain more subscribers, a controversial social media influencer stays at a cursed hotel to terrifying results.",
        "runtimeMinutes": "96"
    },
    "2020_144": {
        "plotSummary": "A selfish Prince is cursed to become a monster for the rest of his life, unless he learns to fall in love with a beautiful young woman he keeps prisoner.",
        "runtimeMinutes": "129"
    },
    "2020_145": {
        "plotSummary": "A confessional, cautionary, and occasionally humorous tale of Robbie Robertson's young life and the creation of one of the most enduring groups in the history of popular music, The Band.",
        "runtimeMinutes": "100"
    },
    "2020_146": {
        "plotSummary": "In the fall of 1987, a group of small-town friends must survive the night in the home of a sinister couple after a tragic accident brings them to the couple's door.",
        "runtimeMinutes": "95"
    },
    "2020_147": {
        "plotSummary": "An artist is suspected of selling a valuable painting to the Nazis, but there is more to the story than meets the eye.",
        "runtimeMinutes": "118"
    },
    "2020_148": {
        "plotSummary": "Anglo-American relations go bad when London mob bosses invest in a West Virginia oil deal in hopes of laundering dirty money.",
        "runtimeMinutes": "106"
    },
    "2020_149": {
        "plotSummary": "A man crash lands in rural Appalachia and awakens in the attic of a traditional Hoodoo practitioner. He desperately tries to break free from her dark magic and save his family from a sinister ritual before the rise of the blood moon.",
        "runtimeMinutes": "91"
    },
    "2020_15": {
        "plotSummary": "Five young mutants, just discovering their abilities while held in a secret facility against their will, fight to escape their past sins and save themselves.",
        "runtimeMinutes": "94"
    },
    "2020_150": {
        "plotSummary": "During World War II, an Englishwoman opens her heart to an evacuee after initially resolving to be rid of him in this moving journey of womanhood, love and friendship.",
        "runtimeMinutes": "99"
    },
    "2020_151": {
        "plotSummary": "In post-WWII America, a woman, rebuilding her life in the suburbs with her husband, kidnaps her neighbor and seeks vengeance for the heinous war crimes she believes he committed against her.",
        "runtimeMinutes": "97"
    },
    "2020_152": {
        "plotSummary": "Based on Peter Carey's novel. The story of Australian bushranger Ned Kelly and his gang as they flee from authorities during the 1870s.",
        "runtimeMinutes": "124"
    },
    "2020_153": {
        "plotSummary": "After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school.",
        "runtimeMinutes": "95"
    },
    "2020_154": {
        "plotSummary": "When a museum celebrating the Ku Klux Klan opens in a South Carolina town, the idealistic Reverend Kennedy strives to keep the peace even as he urges the group's Grand Dragon to disavow his racist past.",
        "runtimeMinutes": "117"
    },
    "2020_155": {
        "plotSummary": "A compilation reel of the latest and best cat videos culled from countless hours of unique submissions and sourced animations, music videos and classic internet powerhouses.",
        "runtimeMinutes": "75"
    },
    "2020_156": {
        "plotSummary": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
        "runtimeMinutes": "126"
    },
    "2020_157": {
        "plotSummary": "Two young lovers rob their way across the southland, posting their exploits to social media, and gaining fame and followers as a result.",
        "runtimeMinutes": "100"
    },
    "2020_158": {
        "plotSummary": "Based on historical events, three young shepherds in Fátima, Portugal, report visions of the Virgin Mary, inspiring believers and angering officials of the Church and the government, who try to force them to recant their story.",
        "runtimeMinutes": "113"
    },
    "2020_159": {
        "plotSummary": "A desperate marine biker's life is turned upside-down when he is united with the sassy 9-year-old daughter he never knew existed.",
        "runtimeMinutes": "120"
    },
    "2020_16": {
        "plotSummary": "A family struggles for survival in the face of a cataclysmic natural disaster.",
        "runtimeMinutes": "119"
    },
    "2020_160": {
        "plotSummary": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the eccentric scientist Doc Brown.",
        "runtimeMinutes": "116"
    },
    "2020_161": {
        "plotSummary": "Amy thinks she's dying tomorrow...and it's contagious.",
        "runtimeMinutes": "86"
    },
    "2020_162": {
        "plotSummary": "When their eldest brother dies, Peter and Alice seek to save their parents from despair until they are forced to choose between home and imagination, setting the stage for their iconic journeys into Wonderland and Neverland.",
        "runtimeMinutes": "94"
    },
    "2020_163": {
        "plotSummary": "A Filipina teen from a small Texas town fights to pursue her dreams as a country music performer while having to decide between staying with her family or leaving the only home she has known.",
        "runtimeMinutes": "94"
    },
    "2020_164": {
        "plotSummary": "A Democratic strategist helps a retired veteran run for mayor in a small, conservative Midwest town.",
        "runtimeMinutes": "101"
    },
    "2020_165": {
        "plotSummary": "A once-celebrated kid detective, now 32, continues to solve the same trivial mysteries between hangovers and bouts of self-pity. Until a naive client brings him his first 'adult' case, to find out who brutally murdered her boyfriend.",
        "runtimeMinutes": "97"
    },
    "2020_166": {
        "plotSummary": "A freewheeling take on visionary inventor Nikola Tesla, his interactions with Thomas Edison and J.P. Morgan's daughter Anne, and his breakthroughs in transmitting electrical power and light.",
        "runtimeMinutes": "102"
    },
    "2020_167": {
        "plotSummary": "A group of friends reunite to play The Buddy Games, a wild assortment of absurd physical and mental challenges. In the process, they'll heal old wounds, right past wrongs and figure out the true meaning of friendship...or die trying.",
        "runtimeMinutes": "90"
    },
    "2020_168": {
        "plotSummary": "The story of the legendary British rock band Queen and lead singer Freddie Mercury, leading up to their famous performance at Live Aid.",
        "runtimeMinutes": "134"
    },
    "2020_169": {
        "plotSummary": "The lone survivor of an enigmatic spaceship incident hasn't returned back home alone-hiding inside his body is a dangerous creature.",
        "runtimeMinutes": "113"
    },
    "2020_17": {
        "plotSummary": "After a confrontation with an unstable man at an intersection, a woman becomes the target of his rage.",
        "runtimeMinutes": "90"
    },
    "2020_170": {
        "plotSummary": "A young Brooklyn couple heads to an upstate cabin to unplug from their phones and reconnect with each other. Blissfully unaware of their surroundings, they are left to their own devices as the planet falls under attack.",
        "runtimeMinutes": "93"
    },
    "2020_171": {
        "plotSummary": "A pair of teenage girls in rural Pennsylvania travel to New York City to seek out medical help after an unintended pregnancy.",
        "runtimeMinutes": "101"
    },
    "2020_172": {
        "plotSummary": "A boy inadvertently breaks three important rules concerning his new pet and unleashes a horde of malevolently mischievous monsters on a small town.",
        "runtimeMinutes": "106"
    },
    "2020_173": {
        "plotSummary": "On a secluded farm in a nondescript rural town, a man is slowly dying. His family gathers to mourn, and soon a darkness grows, marked by waking nightmares and a growing sense that something evil is taking over the family.",
        "runtimeMinutes": "95"
    },
    "2020_174": {
        "plotSummary": "The story of mime Marcel Marceau as he works with a group of Jewish boy scouts and the French Resistance to save the lives of ten thousand orphans during World War II.",
        "runtimeMinutes": "120"
    },
    "2020_175": {
        "plotSummary": "A controversial figure, loved by some, reviled by others, few know much more than a few headlines and the recollections of his contentious confirmation battle with Anita Hill. A story truly and fully, without cover-ups or distortions.",
        "runtimeMinutes": "116"
    },
    "2020_176": {
        "plotSummary": "Uncle John recounts the story of Christ's birth to Connie Lou through story and song. See Connie Lou discover what the world has forgotten about Christmas, ultimately opening her heart to the joy of this special season.",
        "runtimeMinutes": "130"
    },
    "2020_177": {
        "plotSummary": "Hunter, a newly pregnant housewife, finds herself increasingly compelled to consume dangerous objects. As her husband and his family tighten their control over her life, she must confront the dark secret behind her new obsession.",
        "runtimeMinutes": "94"
    },
    "2020_178": {
        "plotSummary": "Three friends struggle to find work in Paris. Things become more complicated when two of them fall in love with the same woman.",
        "runtimeMinutes": "114"
    },
    "2020_179": {
        "plotSummary": "2038: George Almore is working on a true human-equivalent AI. His latest prototype is almost ready. This sensitive phase is also the riskiest. Especially as he has a goal that must be hidden at all costs: being reunited with his dead wife.",
        "runtimeMinutes": "109"
    },
    "2020_18": {
        "plotSummary": "A crew of oceanic researchers working for a deep sea drilling company try to get to safety after a mysterious earthquake devastates their deepwater research and drilling facility located at the bottom of the Mariana Trench.",
        "runtimeMinutes": "95"
    },
    "2020_180": {
        "plotSummary": "Actors Rob Brydon and Steve Coogan travel from Troy to Ithaca following in the footsteps of the Odysseus.",
        "runtimeMinutes": "103"
    },
    "2020_181": {
        "plotSummary": "On Christmas Eve, three homeless people living on the streets of Tokyo discover a newborn baby among the trash and set out to find its parents.",
        "runtimeMinutes": "90"
    },
    "2020_182": {
        "plotSummary": "A Christian documentary diving into the sex trafficking industry in the US exposing the darkness that fuels demand, highlighting survivors' transformations through Christ, and showing Christ as the hope for all involved.",
        "runtimeMinutes": "115"
    },
    "2020_183": {
        "plotSummary": "The further adventures in time and space of the alien adventurer known as the Doctor and their companions from planet Earth.",
        "runtimeMinutes": "45"
    },
    "2020_184": {
        "plotSummary": "A famous horror writer finds inspiration for her next book after she and her husband take in a young couple.",
        "runtimeMinutes": "107"
    },
    "2020_185": {
        "plotSummary": "The Griswold family's plans for a big family Christmas predictably turn into a big disaster.",
        "runtimeMinutes": "97"
    },
    "2020_186": {
        "plotSummary": "Documentary on the famed jazz singer, Billie Holiday.",
        "runtimeMinutes": "96"
    },
    "2020_187": {
        "plotSummary": "The story of 1970s musician and activist Helen Reddy.",
        "runtimeMinutes": "116"
    },
    "2020_188": {
        "plotSummary": "A concert documentary from a 2016 all-star performance in Los Angeles, which John Densmore and Robby Krieger, the two surviving members of The Doors, developed to celebrate what would have been band member Manzarek's 70th birthday.",
        "runtimeMinutes": "67"
    },
    "2020_189": {
        "plotSummary": "Terror grips a small mountain town as bodies are discovered after each full moon. Losing sleep, raising a teenage daughter, and caring for his ailing father, officer Marshall struggles to remind himself there's no such thing as werewolves.",
        "runtimeMinutes": "83"
    },
    "2020_19": {
        "plotSummary": "A zombie virus has in the last 4 years spread to all South Korea. 4 Koreans in HK sail thru the blockade to Incheon for USD20,000,000 on a truck.",
        "runtimeMinutes": "116"
    },
    "2020_190": {
        "plotSummary": "UK, Aug. 15, 1939: 17 days before WWII, an English teacher and his camera disappear on a coastal boarding school with 20 German teen girls. Miller gets the job 6 days later, secretly trying to find out what happened.",
        "runtimeMinutes": "99"
    },
    "2020_191": {
        "plotSummary": "Set in New York City's Chinatown, an ornery, chain-smoking Chinese grandma goes all in at the casino, landing herself on the wrong side of luck - and in the middle of a gang war.",
        "runtimeMinutes": "87"
    },
    "2020_192": {
        "plotSummary": "A behind-the-scenes look at the New York rare book world.",
        "runtimeMinutes": "99"
    },
    "2020_193": {
        "plotSummary": "Three best friends embark on a road trip to a heavy-metal show, where they bond with three aspiring musicians and head off to one of the girls' country home for an after-party.",
        "runtimeMinutes": "91"
    },
    "2020_194": {
        "plotSummary": "In the beginning of WWII, with Britain becoming desperate, Churchill orders his new spy agency - SOE - to recruit and train women as spies.",
        "runtimeMinutes": "123"
    },
    "2020_195": {
        "plotSummary": "Peter has been cruel to children, animals and servants for a long time. One night he is ambushed and wakes up in a coffin, trapped after an earthquake, in the city's Gothic cemetery.",
        "runtimeMinutes": "95"
    },
    "2020_196": {
        "plotSummary": "1840s England, acclaimed but overlooked fossil hunter Mary Anning and a young woman sent to convalesce by the sea develop an intense relationship, altering both of their lives forever.",
        "runtimeMinutes": "120"
    },
    "2020_197": {
        "plotSummary": "Fifteen years after murdering his sister on Halloween night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again.",
        "runtimeMinutes": "91"
    },
    "2020_198": {
        "plotSummary": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice to curse her home in infinite winter, her sister Anna teams up with a mountain man, his playful reindeer, and a snowman to change the weather condition.",
        "runtimeMinutes": "102"
    },
    "2020_199": {
        "plotSummary": "A boy and a girl from different backgrounds fall in love regardless of their upbringing - and then tragedy strikes.",
        "runtimeMinutes": "100"
    },
    "2020_2": {
        "plotSummary": "Miami detectives Mike Lowrey and Marcus Burnett must face off against a mother-and-son pair of drug lords who wreak vengeful havoc on their city.",
        "runtimeMinutes": "124"
    },
    "2020_20": {
        "plotSummary": "The prehistoric family the Croods are challenged by a rival family the Bettermans, who claim to be better and more evolved. Read more: Synopsis",
        "runtimeMinutes": "95"
    },
    "2020_200": {
        "plotSummary": "Lost on a mysterious island where aging and time have come unglued, Wendy must fight to save her family, her freedom, and the joyous spirit of youth from the deadly peril of growing up.",
        "runtimeMinutes": "111"
    },
    "2020_201": {
        "plotSummary": "A reformed hunter living in isolation on a wildlife sanctuary becomes involved in a deadly game of cat and mouse when he and the local Sheriff set out to track a vicious killer who may have kidnapped his daughter years ago.",
        "runtimeMinutes": "93"
    },
    "2020_202": {
        "plotSummary": "Details the year leading to the assassination of Israel's Prime Minister, Yitzhak Rabin (1922-1995), from the point of view of the assassin.",
        "runtimeMinutes": "123"
    },
    "2020_203": {
        "plotSummary": "In 1989, a Canadian journalist investigates the circumstances surrounding the suspicious arrest of a heroin addict imprisoned in a Thai jail.",
        "runtimeMinutes": "125"
    },
    "2020_204": {
        "plotSummary": "The American Dream becomes a nightmare for a group of undocumented day laborers hired by a wealthy couple. What they expect to be their biggest payday turns into a terrifying fight for survival.",
        "runtimeMinutes": "86"
    },
    "2020_205": {
        "plotSummary": "A new feature film documentary about legendary NYTimes photographer Bill Cunningham.",
        "runtimeMinutes": "74"
    },
    "2020_206": {
        "plotSummary": "After a comet releases a mysterious virus that begins to kill all the women in the world, a young couple hides out in their over-sterilized apartment trying to fight for their lives.",
        "runtimeMinutes": "98"
    },
    "2020_207": {
        "plotSummary": "Isabelle and her partner adopted Clara in Vietnam, who died several years after. In order to heal her wounds, Isabelle flies to Hanoi to discover the culture of Clara and meet her biological mother, who will later become her friend.",
        "runtimeMinutes": "99"
    },
    "2020_208": {
        "plotSummary": "A man in his thirties travels to a remote cabin to reconnect with his estranged father.",
        "runtimeMinutes": "96"
    },
    "2020_209": {
        "plotSummary": "Set between the New World (Heaven) and the Old World (Earth) the story follows the life and afterlife of Jonathan Stone and all of those lives around him from his past, present and future.",
        "runtimeMinutes": "100"
    },
    "2020_21": {
        "plotSummary": "When the Queen of the Hard Rock Trolls tries to take over all the Troll kingdoms, Queen Poppy and her friends try different ways to save all the Trolls.",
        "runtimeMinutes": "90"
    },
    "2020_210": {
        "plotSummary": "A former beauty queen and single mom prepares her rebellious teenage daughter for the \"Miss Juneteenth\" pageant.",
        "runtimeMinutes": "99"
    },
    "2020_211": {
        "plotSummary": "Sally Potter's film follows a day in the life of Leo (Javier Bardem) and his daughter, Molly (Elle Fanning), as he floats through alternate lives he could have lived, leading Molly to wrestle with her own path as she considers her future.",
        "runtimeMinutes": "85"
    },
    "2020_212": {
        "plotSummary": "A skilled cook has traveled west and joined a group of fur trappers in Oregon, though he only finds true connection with a Chinese immigrant also seeking his fortune. Soon the two collaborate on a successful business.",
        "runtimeMinutes": "122"
    },
    "2020_213": {
        "plotSummary": "A woman not married to the President runs for First Lady, but she winds up getting a better proposal than she ever expected. First Lady is a classic romantic comedy with the backdrop of Presidential Politics and Royal Charm.",
        "runtimeMinutes": "101"
    },
    "2020_214": {
        "plotSummary": "Five teens compete to win a mansion owned by an eccentric billionaire. The night takes a dark turn when they become trapped and are forced to face off against a super computer who has gone rogue.",
        "runtimeMinutes": "98"
    },
    "2020_215": {
        "plotSummary": "The true story of Ruth Bader Ginsburg, her struggles for equal rights, and the early cases of a historic career that lead to her nomination and confirmation as U.S. Supreme Court Associate Justice. Read more: Synopsis",
        "runtimeMinutes": "120"
    },
    "2020_216": {
        "plotSummary": "A journey where the viewer can see Werner Herzog's creative and personal vision which was share with iconic travel writer Bruce Chatwin, the prolific author of 'In Patagonia' and a champion of the nomadic life.",
        "runtimeMinutes": "85"
    },
    "2020_217": {
        "plotSummary": "After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II.",
        "runtimeMinutes": "142"
    },
    "2020_218": {
        "plotSummary": "Follows an Irish immigrant dreaming with becoming a millionaire but ending up championing a family message.",
        "runtimeMinutes": "71"
    },
    "2020_219": {
        "plotSummary": "A teenager living with her working-class family on a council estate in Wolverhampton, England, grows up to become a popular but conflicted music journalist.",
        "runtimeMinutes": "102"
    },
    "2020_22": {
        "plotSummary": "In the 1970s Korea is under the absolute control of the president Park who controls the KCIA the organization with the edge over any branch of government.",
        "runtimeMinutes": "114"
    },
    "2020_220": {
        "plotSummary": "Live at the Roundhouse is unlike any other concert film connected with Pink Floyd. It's the nearest thing you can get to a time machine, transporting you back to the very earliest days of the band. Nick Mason, the only band member to have ...See moreLive at the Roundhouse is unlike any other concert film connected with Pink Floyd. It's the nearest thing you can get to a time machine, transporting you back to the very earliest days of the band. Nick Mason, the only band member to have played on all of Pink Floyd's studio albums, returns to the group's earliest records, joined in the line-up by Gary Kemp, Guy Pratt, Lee Harris and Dom Beken. Nick Mason's Saucerful of Secrets took the drummer back to clubs for the first time since 1967, then to theatres, across the UK, North America and Europe, playing only music his old band had recorded before The Dark Side of the Moon. Captured from the band's celebrated shows at London's Roundhouse, where Pink Floyd played some of their most revered early shows in the 1960s, the film features a uniquely thrilling setlist including songs hailing from Syd Barrett's time with the band. Only four songs from this eclectic roster have ever previously appeared on official live releases by Pink Floyd or its members. Everything else is being experienced for the first time since their original live performances.See less",
        "runtimeMinutes": "115"
    },
    "2020_221": {
        "plotSummary": "Based on the true story of a couple killed while riding a motorcycle (based on the book \"In The Blink of an Eye\") and the forgiveness of the man responsible for their deaths.",
        "runtimeMinutes": "98"
    },
    "2020_222": {
        "plotSummary": "After an accidental pregnancy turned abortion, a deadbeat nanny finds an unlikely friendship with the six-year old she's charged with protecting.",
        "runtimeMinutes": "101"
    },
    "2020_223": {
        "plotSummary": "A young Iranian-American woman goes to great lengths to appease her parents and their need to see her settled down.",
        "runtimeMinutes": "88"
    },
    "2020_224": {
        "plotSummary": "A rare peek into the mind of a genius, chronicling the life and design of Cardin. Exclusive access to his archives and his empire, and unprecedented interviews at the sunset of a glorious career.",
        "runtimeMinutes": "95"
    },
    "2020_225": {
        "plotSummary": "After freeing a young girl from her unjust imprisonment in Jerusalem, Phryne Fisher begins to unravel a mystery concerning priceless emeralds, ancient curses and the truth behind the suspicious disappearance of Shirin's forgotten tribe.",
        "runtimeMinutes": "101"
    },
    "2020_226": {
        "plotSummary": "When the world is threatened by an evil supervillain, a teenager and his mentor team up to stop him.",
        "runtimeMinutes": "89"
    },
    "2020_227": {
        "plotSummary": "Former Chief Official White House Photographer Pete Souza's journey as a person with top secret clearance and total access to the President.",
        "runtimeMinutes": "100"
    },
    "2020_228": {
        "plotSummary": "This bizarre retro comedy, shot entirely on VHS and Beta, follows 12-year-old Ralph as he accidentally records home videos and his favorite late night shows over his parents' wedding tape.",
        "runtimeMinutes": "72"
    },
    "2020_229": {
        "plotSummary": "A cop is assigned to a case of escorting a criminal to Japan while dealing with relationship problems, and his enormous change in appearance as a result of being dumped.",
        "runtimeMinutes": "96"
    },
    "2020_23": {
        "plotSummary": "Ray Garrison, a slain soldier, is re-animated with superpowers.",
        "runtimeMinutes": "109"
    },
    "2020_230": {
        "plotSummary": "Thirsty for a following, Kurt Kunkle is a rideshare driver who has figured out a deadly plan to go viral.",
        "runtimeMinutes": "93"
    },
    "2020_231": {
        "plotSummary": "Broken teens trying to claim somethings their parents failed to provide - A Future and Purpose.",
        "runtimeMinutes": "118"
    },
    "2020_232": {
        "plotSummary": "Every six years, an ancient order of jiu-jitsu fighters joins forces to battle a vicious race of alien invaders. But when a celebrated war hero goes down in defeat, the fate of the planet and mankind hangs in the balance.",
        "runtimeMinutes": "102"
    },
    "2020_233": {
        "plotSummary": "Three Christs follows Dr. Alan Stone who is treating three paranoid schizophrenic patients at the Ypsilanti State Hospital in Michigan, each of whom believed they were Jesus Christ. What transpires is both comic and deeply moving.",
        "runtimeMinutes": "109"
    },
    "2020_234": {
        "plotSummary": "Pushed to his breaking point, a master welder in a small town at the foot of the Rocky Mountains quietly fortifies a bulldozer with 30 tons of concrete and steel and seeks to destroy those he believes have wronged him.",
        "runtimeMinutes": "89"
    },
    "2020_235": {
        "plotSummary": "During the harrows of WWII, Jo, a young shepherd along with the help of the widow Horcada, helps to smuggle Jewish children across the border from southern France into Spain. Read more: Synopsis",
        "runtimeMinutes": "109"
    },
    "2020_236": {
        "plotSummary": "The exceptional life and career of U.S. Supreme Court Justice Ruth Bader Ginsburg, who has developed a breathtaking legal legacy while becoming an unexpected pop culture icon.",
        "runtimeMinutes": "98"
    },
    "2020_237": {
        "plotSummary": "Set in 1990, a lonely bachelor named David (Brian Landis Folkins) searches for an escape from the day-to-day drudgery of caring for his aging mother (Kathleen Brady). While seeking a partner through a video dating service, he discovers a ...See moreSet in 1990, a lonely bachelor named David (Brian Landis Folkins) searches for an escape from the day-to-day drudgery of caring for his aging mother (Kathleen Brady). While seeking a partner through a video dating service, he discovers a strange VHS tape called Rent-A-Pal. Hosted by the charming and charismatic Andy (Wil Wheaton), the tape offers him much-needed company, compassion, and friendship. But, Andy's friendship comes at a cost, and David desperately struggles to afford the price of admission.  Written by Pretty People PicturesSee less",
        "runtimeMinutes": "108"
    },
    "2020_238": {
        "plotSummary": "An intimate chronicle of families as they navigate their way through the unthinkable, reckoning with unexpected loss, journeying through grief, and searching for new meaning.",
        "runtimeMinutes": "92"
    },
    "2020_239": {
        "plotSummary": "In the Olympic Athlete Village, a young cross-country skier bonds with a volunteer doctor after her competition ends.",
        "runtimeMinutes": "85"
    },
    "2020_24": {
        "plotSummary": "Two friends with very different ideals start a beauty company together. One is more practical while the other wants to earn her fortune and live a lavish lifestyle. Read more: Synopsis",
        "runtimeMinutes": "83"
    },
    "2020_240": {
        "plotSummary": "Set in the underworld of debt-collecting and follows the homegrown hustler Peg Dahl, who will do anything to escape Buffalo, NY.",
        "runtimeMinutes": "95"
    },
    "2020_241": {
        "plotSummary": "Abe is a 12-year-old boy from Brooklyn who cooks to unite his half Israeli and half Palestinian family, but everything goes wrong.",
        "runtimeMinutes": "85"
    },
    "2020_242": {
        "plotSummary": "The romance between two African Americans who come from a different class background.",
        "runtimeMinutes": "104"
    },
    "2020_243": {
        "plotSummary": "Jose lives with his mother in Guatemala. It's a tough life in one of the most violent and religious countries. When he meets Luis, he's thrust into new-found passion and pain.",
        "runtimeMinutes": "85"
    },
    "2020_244": {
        "plotSummary": "A son aspires to follow in his famous MMA father's footsteps, but along his journey must figure out how to break the abusive cycle, if possible, that his father has continued.",
        "runtimeMinutes": "117"
    },
    "2020_245": {
        "plotSummary": "Five YouTubers join an online video-call and find themselves haunted and hunted by a mysterious internet troll.",
        "runtimeMinutes": "30"
    },
    "2020_246": {
        "plotSummary": "Follows a troubled young woman returning to her hometown of Niagara Falls, where the memory of a long-ago kidnapping quickly ensnares her.",
        "runtimeMinutes": "100"
    },
    "2020_247": {
        "plotSummary": "A conservative church choir director inherits her late son's San Francisco drag club.",
        "runtimeMinutes": "93"
    },
    "2020_248": {
        "plotSummary": "The story of 7 people on trial stemming from various charges surrounding the uprising at the 1968 Democratic National Convention in Chicago, Illinois.",
        "runtimeMinutes": "129"
    },
    "2020_249": {
        "plotSummary": "A Congolese man runs from a terrible accident and finds himself at a revolutionary camp, where he is told that he has a great destiny. Now, he must face his fears and his shame, but also his magnificent possibilities.",
        "runtimeMinutes": "90"
    },
    "2020_25": {
        "plotSummary": "Wanting to lead an honest life, a notorious bank robber turns himself in, only to be double-crossed by two ruthless FBI agents.",
        "runtimeMinutes": "99"
    },
    "2020_250": {
        "plotSummary": "Two longtime friends battle mid-life crisis by opening a bowling alley/pizzeria in their small hometown.",
        "runtimeMinutes": "108"
    },
    "2020_251": {
        "plotSummary": "Seventeen year-old Ayanna meets handsome and mysterious Isaiah in her path toward self-discovery. Her entire world is turned upside down as she travails on the rigorous terrain of young love in the summer before she leaves for college.",
        "runtimeMinutes": "90"
    },
    "2020_252": {
        "plotSummary": "Tullio Hermil is a chauvinist aristocrat who flaunts his mistress to his wife, but when he believes she has been unfaithful he becomes enamored of her again.",
        "runtimeMinutes": "129"
    },
    "2020_253": {
        "plotSummary": "A mysterious creature rises from the depths of the La Brea Tar Pits in Los Angeles to wreak the city.",
        "runtimeMinutes": "96"
    },
    "2020_254": {
        "plotSummary": "After a train robbery goes bad, two brothers leading a gang of cowboys must survive the night in a ghost town inhabited by a coven of witches.",
        "runtimeMinutes": "96"
    },
    "2020_255": {
        "plotSummary": "A woman searches for her missing son in a remote wilderness with the help of her estranged husband and a Native American friend. When an evil creature starts to hunt them, their journey becomes a fight for survival.",
        "runtimeMinutes": "109"
    },
    "2020_256": {
        "plotSummary": "Explore the lives of nine women from around the world who share a passion for the ocean.",
        "runtimeMinutes": "101"
    },
    "2020_257": {
        "plotSummary": "Michael is a high-powered lawyer and Jamal is an angry young man who has been imprisoned after years of abuse in the foster care system. Together they have to overcome their differences to find justice and expose the foster care system.",
        "runtimeMinutes": "109"
    },
    "2020_258": {
        "plotSummary": "The enchanted lives of a couple in a secluded forest are brutally shattered by a nightmarish hippie cult and their demon-biker henchmen, propelling a man into a spiraling, surreal rampage of vengeance.",
        "runtimeMinutes": "121"
    },
    "2020_259": {
        "plotSummary": "A teenager's adventures as a bounty hunter take an unexpected twist.",
        "runtimeMinutes": "98"
    },
    "2020_26": {
        "plotSummary": "After 12 years, the Chinese women's volleyball team again reached the Olympic final. The ups and downs of the Chinese women's volleyball team for more than three decades have slowly spread away.",
        "runtimeMinutes": "135"
    },
    "2020_260": {
        "plotSummary": "A homesick college freshman goes to a party at Shithouse and ends up spending the night with his sophomore RA who's had a shitty day and wants someone to hang out with.",
        "runtimeMinutes": "100"
    },
    "2020_261": {
        "plotSummary": "Autumn Moon (Sam Lee), a low-rent triad living in Hong Kong, struggles to find meaning in his hopelessly violent existence.",
        "runtimeMinutes": "109"
    },
    "2020_262": {
        "plotSummary": "A seductive woman falls in love with a mysterious ship's captain.",
        "runtimeMinutes": "122"
    },
    "2020_263": {
        "plotSummary": "A look at the life and work of Jewish-Israeli lawyer Lea Tsemel who has represented political prisoners for nearly 50 years.",
        "runtimeMinutes": "114"
    },
    "2020_264": {
        "plotSummary": "A married couple find themselves trapped in their frozen vehicle after a blizzard and struggle to survive amid plunging temperatures and unforeseen obstacles.",
        "runtimeMinutes": "98"
    },
    "2020_265": {
        "plotSummary": "Todd and Rory are intellectual soul mates. He might be gay. She might not care. A romantic-comedy drama with a twist; a love story without the thrill of copulation.",
        "runtimeMinutes": "95"
    },
    "2020_266": {
        "plotSummary": "Will believes his wife Rosalind is innocent of their son's suspected murder, only to discover the devastating truth behind her past links her to another unsolved crime.",
        "runtimeMinutes": "93"
    },
    "2020_267": {
        "plotSummary": "Anthony Mendoza, an inner-city drug dealer on the run, joins the Army, only to clash with Chris Wright, a hard-headed Christian determined to share his faith despite persecution.",
        "runtimeMinutes": "98"
    },
    "2020_268": {
        "plotSummary": "For the first time, American people see the possibility that elected governments have to follow rules set by Washington D.C.'s bureaucratic institutions. From 1963 JFK's assassination to 2016 Russia Collusion Conspiracy.",
        "runtimeMinutes": "139"
    },
    "2020_269": {
        "plotSummary": "An in-depth look into the life and work of musician Frank Zappa.",
        "runtimeMinutes": "129"
    },
    "2020_27": {
        "plotSummary": "Upset that he has to share the room he loves with his grandfather, Peter decides to declare war in an attempt to get it back.",
        "runtimeMinutes": "94"
    },
    "2020_270": {
        "plotSummary": "After a 13-year-old student disappears without a trace for a week and suddenly reappears, his mother and teachers are confronted with existential questions that change their whole view of life.",
        "runtimeMinutes": "105"
    },
    "2020_271": {
        "plotSummary": "On a snowy Christmas Eve, former mild-mannered college student Casey Smallwood is released from prison after serving 10 years for underage drinking. Eager to get out of town, he hops on the express train to Washington, D.C., but after the ...See moreOn a snowy Christmas Eve, former mild-mannered college student Casey Smallwood is released from prison after serving 10 years for underage drinking. Eager to get out of town, he hops on the express train to Washington, D.C., but after the holiday express takes off, it's hijacked by an angry gang of domestic terrorists and highly-Intelligent, government trained raccoons. Not one to back down from a raccoon fight, Casey joins forces with a porter on the train to fight the terrorists.See less",
        "runtimeMinutes": "96"
    },
    "2020_272": {
        "plotSummary": "In a small Arctic town struggling with the highest suicide rate in North America, a group of Inuit students' lives are transformed when they are introduced to the sport of lacrosse.",
        "runtimeMinutes": "102"
    },
    "2020_273": {
        "plotSummary": "Powerbomb is the story of an independent wrestler on the verge of breaking into the big time, but he's contemplating leaving it all behind to spend more time with his family. When our wrestler's biggest fan hears the news, he decides to ...See morePowerbomb is the story of an independent wrestler on the verge of breaking into the big time, but he's contemplating leaving it all behind to spend more time with his family. When our wrestler's biggest fan hears the news, he decides to take matters into his own hands to ensure that his champion gets to the top by any means necessary.  Written by BJ ColangeloSee less",
        "runtimeMinutes": "79"
    },
    "2020_274": {
        "plotSummary": "The story of a young woman, in 1930s British India, seeking an identity of her own against an arranged marriage and the manipulations of a powerful guru. Bringing to life the struggles of 3 generations of women in a male dominated society.",
        "runtimeMinutes": "110"
    },
    "2020_275": {
        "plotSummary": "Following director Rotimi Rainwater, a former homeless youth, as he travels the country to shine a light on the epidemic of youth homelessness in America.",
        "runtimeMinutes": "105"
    },
    "2020_276": {
        "plotSummary": "Following a mysterious car accident in the desert, Dafne suffers from post-traumatic amnesia. Jake, the first person she sees when she regains consciousness, tells her he's her husband.",
        "runtimeMinutes": "116"
    },
    "2020_277": {
        "plotSummary": "An exploration of the fallout of MIT Media Lab researcher Joy Buolamwini's startling discovery of racial bias in facial recognition algorithms.",
        "runtimeMinutes": "90"
    },
    "2020_278": {
        "plotSummary": "The story of a young man coming face to face with his hero (Jeff Daniels) and exploring the tangled relationship between the dreams of youth and the wisdom of age.",
        "runtimeMinutes": "74"
    },
    "2020_279": {
        "plotSummary": "Through an ensemble cast, FOOSBALLERS not only uncovers a forgotten piece of sports history, it follows 6 of the best table soccer players in the world as they prepare for The Tornado World Championships.",
        "runtimeMinutes": "96"
    },
    "2020_28": {
        "plotSummary": "In 1800s England, a well meaning but selfish young woman meddles in the love lives of her friends.",
        "runtimeMinutes": "124"
    },
    "2020_280": {
        "plotSummary": "\"Til death do us part\" wasn't nearly long enough for Max and Abby as his ghost returns to help her get over him. But with a second chance to be together, neither will ever want to say goodbye again.",
        "runtimeMinutes": "100"
    },
    "2020_281": {
        "plotSummary": "Plagued by mysterious hallucinations, a pregnant woman suspects that the family of her deceased boyfriend has intentions for her unborn child.",
        "runtimeMinutes": "101"
    },
    "2020_282": {
        "plotSummary": "A fatal ill man tries to secure the future of his family in a world where the toxicity of the sun forces people to stay inside during the daytime.",
        "runtimeMinutes": "103"
    },
    "2020_283": {
        "plotSummary": "Facing expulsion from college over a misunderstanding, a bipolar student indulges his misery at a strip club where he befriends a gorgeous, intelligent, outrageous woman and they hatch a madcap scheme to prove his innocence.",
        "runtimeMinutes": "90"
    },
    "2020_284": {
        "plotSummary": "An insurance lawyer goes out on the town to celebrate an upcoming promotion with his co-worker, Jeff. But their night takes a turns bizarre when Frank ingests a hallucinogen that completely alters his perception of the world.",
        "runtimeMinutes": "87"
    },
    "2020_285": {
        "plotSummary": "I AM PATRICK peels back centuries of legend and myth to tell the true story of Saint Patrick. Through historical re-enactments, expert interviews and Patrick's own writings, experience the journey from man to saint.",
        "runtimeMinutes": "93"
    },
    "2020_286": {
        "plotSummary": "Maggie and Jimmy have never met, but they keep showing up in each other's dreams. As they navigate memories, traumas, hopes and desires in sleep and the waking world, they'll discover the truth of their linked destiny.",
        "runtimeMinutes": "99"
    },
    "2020_287": {
        "plotSummary": "Set to a new wave '80s soundtrack, a pair of young lovers from different backgrounds defy their parents and friends to stay together. A musical adaptation of the 1983 film.",
        "runtimeMinutes": "102"
    },
    "2020_288": {
        "plotSummary": "A girl born into an all-female cult led by a man in their compound begins to question his teachings and her own reality.",
        "runtimeMinutes": "96"
    },
    "2020_289": {
        "plotSummary": "A sadistic, small-town sheriff and her underlings brutalize Lisa and leave her for dead in the woods. Bitten by a werewolf and bestowed with supernatural abilities, can Lisa retain her humanity as she exacts revenge?",
        "runtimeMinutes": "92"
    },
    "2020_29": {
        "plotSummary": "Scooby and the gang face their most challenging mystery ever: a plot to unleash the ghost dog Cerberus upon the world. As they race to stop this dogpocalypse, the gang discovers that Scooby has an epic destiny greater than anyone imagined.",
        "runtimeMinutes": "93"
    },
    "2020_290": {
        "plotSummary": "A trio of friends are starting high school when their friend vanishes. With the police unable, or unwilling to find her, they take it upon themselves to find out what happened, undertaking a harrowing journey that will change them all.",
        "runtimeMinutes": "110"
    },
    "2020_291": {
        "plotSummary": "Bodies start to pile up when a drug-user nurse and her cousin try to find a replacement kidney for an organ trafficker.",
        "runtimeMinutes": "86"
    },
    "2020_292": {
        "plotSummary": "The lives of two different families collide when their children begin a relationship that leads to a tragic accident.",
        "runtimeMinutes": "98"
    },
    "2020_293": {
        "plotSummary": "Afterward delves into the secret wounds carried by victims as well as victimizers, through testimonies ranging from the horrifying to the hopeful.",
        "runtimeMinutes": "95"
    },
    "2020_294": {
        "plotSummary": "In the Life of Music, a story told in three chapters, tells of how one song 'Champa Battambang,' made famous by Sinn Sisamuth (the King of Khmer Music), plays a role in the lives of three different generations.",
        "runtimeMinutes": "92"
    },
    "2020_295": {
        "plotSummary": "Find Your Voice is a celebration of family and culture as a young Maori rapper finds his voice, on his comical yet spiritual journey home.",
        "runtimeMinutes": "99"
    },
    "2020_296": {
        "plotSummary": "Stardust will chronicle the young David Bowie's first visit to the US in 1971 - a trip that inspired the invention of his iconic alter ego Ziggy Stardust.",
        "runtimeMinutes": "109"
    },
    "2020_297": {
        "plotSummary": "Melanie experiences a terminal diagnosis, leading her to leave her husband and life behind for LA and an affair with a tintype photographer.",
        "runtimeMinutes": "93"
    },
    "2020_298": {
        "plotSummary": "When misfits Barry and Evan design their ideal woman as a robot, they realize a fortune could be made if they had the money to mass produce their prototype. A wealthy prince soon finds out about their invention and the three hatch a plan ...See moreWhen misfits Barry and Evan design their ideal woman as a robot, they realize a fortune could be made if they had the money to mass produce their prototype. A wealthy prince soon finds out about their invention and the three hatch a plan to rule the world and change sex and the future! If life were that simple.See less",
        "runtimeMinutes": "90"
    },
    "2020_299": {
        "plotSummary": "A New York journalist who gets assigned the story of a missing African-American young girl, risks his career and takes the matter into his own hands trying to find her.",
        "runtimeMinutes": "99"
    },
    "2020_3": {
        "plotSummary": "Armed with only one word, Tenet, and fighting for the survival of the entire world, a Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
        "runtimeMinutes": "150"
    },
    "2020_30": {
        "plotSummary": "A long time ago in a distant fairy tale countryside, a young girl leads her little brother into a dark wood in desperate search of food and work, only to stumble upon a nexus of terrifying evil.",
        "runtimeMinutes": "87"
    },
    "2020_300": {
        "plotSummary": "Follows chef Yotam on his quest to bring the sumptuous art and decadence of Versailles to life in cake form at the Metropolitan Museum of Art in New York.",
        "runtimeMinutes": "75"
    },
    "2020_301": {
        "plotSummary": "Lines between romantic ideals and control become blurred when Tanya's husband can no longer handle the stress of his career as a police officer. His warm kisses turn cold, and she is left fighting for her life. At the same time, ...See moreLines between romantic ideals and control become blurred when Tanya's husband can no longer handle the stress of his career as a police officer. His warm kisses turn cold, and she is left fighting for her life. At the same time, Elizabeth's idyllic life is marred when her charming husband manipulates her into believing that she is going insane. As Elizabeth counsels Tanya, she realizes the signs of abuse in her own marriage. When both women decide to leave, they realize it isn't going to go as smoothly as they'd planned. The escape they seek, turns deadly.See less",
        "runtimeMinutes": "99"
    },
    "2020_302": {
        "plotSummary": "King's Gambit is an Independent, live-action feature film set in present-day Florida about Bryce, a man who uses a mystic journal to alter the world around him.",
        "runtimeMinutes": "105"
    },
    "2020_303": {
        "plotSummary": "When five teenagers decide to rob a supermarket, they quickly discover that their actions have consequences.",
        "runtimeMinutes": "71"
    },
    "2020_304": {
        "plotSummary": "The last days of the poet Dylan Thomas as he dreams and drinks.",
        "runtimeMinutes": "101"
    },
    "2020_305": {
        "plotSummary": "A rogue director turns a run-of-the-mill Hollywood love story into a big band musical with the help of his crew and the out-of-the-loop actors.",
        "runtimeMinutes": "97"
    },
    "2020_306": {
        "plotSummary": "A major crime occurs in Tokyo when detectives Tang Ren and Qin Feng are invited to investigate the crime by Noda Hiroshi. A battle between the strongest detectives in Asia is about to break out with bursts of laughter.",
        "runtimeMinutes": "136"
    },
    "2020_307": {
        "plotSummary": "A teenager in a family shelter, wages war against the system to keep her sisters together while she pursues her dreams of being a dancer. A story about displaced youth, ambition and strength.",
        "runtimeMinutes": "88"
    },
    "2020_308": {
        "plotSummary": "An adventure set in the late 80s, a psychiatrist leads his junkie older brother towards the Canadian border to escape a murder charge.",
        "runtimeMinutes": "100"
    },
    "2020_309": {
        "plotSummary": "Roger, a Rasputin-like drifter, is in search of the ultimate indie-rock band, The Transcendents. What he finds is less than transcendent: a band who has all but abandoned society, a host of unpleasant memories, and more questions than ...See moreRoger, a Rasputin-like drifter, is in search of the ultimate indie-rock band, The Transcendents. What he finds is less than transcendent: a band who has all but abandoned society, a host of unpleasant memories, and more questions than answers in search of his own existential fulfillment. Set in the Wonderland of America's Do-it-Yourself music scene, The Transcendents is a dark comedic fairytale that straddles the line between the absurd and the all too real.  Written by AnonymousSee less",
        "runtimeMinutes": "96"
    },
    "2020_31": {
        "plotSummary": "A series of intertwining love stories set in the past and in the present.",
        "runtimeMinutes": "106"
    },
    "2020_310": {
        "plotSummary": "Gul Makai' accounts the courageous journey and struggle of Nobel laureate Malala Yousufzai, from her humble upbringing in the Swat Valley to her becoming the champion for free education to all.",
        "runtimeMinutes": "132"
    },
    "2020_311": {
        "plotSummary": "A prominent Southern family of blue-blood media moguls deteriorates at the crossroads of past and progress in matters of death, wealth, love and American journalism.",
        "runtimeMinutes": "86"
    },
    "2020_312": {
        "plotSummary": "A man refuses all assistance from his daughter as he ages. As he tries to make sense of his changing circumstances, he begins to doubt his loved ones, his own mind and even the fabric of his reality.",
        "runtimeMinutes": "97"
    },
    "2020_313": {
        "plotSummary": "Four people enter a corn maze for Halloween and are picked off one by one by the twisted family who own the scare attraction.",
        "runtimeMinutes": "79"
    },
    "2020_314": {
        "plotSummary": "\"Hai Tang Hong\" tells a tragic story of opera artist Haitanghong. It profoundly exposes the oppression and bullying of the opera artists by the evil forces in the old times, praises the great love of the world and embodies the traditional ...See more\"Hai Tang Hong\" tells a tragic story of opera artist Haitanghong. It profoundly exposes the oppression and bullying of the opera artists by the evil forces in the old times, praises the great love of the world and embodies the traditional virtues of the Chinese nation.See less",
        "runtimeMinutes": "90"
    },
    "2020_315": {
        "plotSummary": "Skateboards are considered contraband in Cuba. Despite this, a renegade group out of Miami, smuggles skateboards into the communist country and has hopes to build a skate park for the youth of Havana.",
        "runtimeMinutes": "72"
    },
    "2020_316": {
        "plotSummary": "The story of Brandon Burlsworth, possibly the greatest walk-on in the history of college football.",
        "runtimeMinutes": "130"
    },
    "2020_317": {
        "plotSummary": "A look at the group of people who built the Biosphere 2, a giant replica of the earth's ecosystem, in 1991.",
        "runtimeMinutes": "113"
    },
    "2020_318": {
        "plotSummary": "A young witch, on her mandatory year of independent life, finds fitting into a new community difficult while she supports herself by running an air courier service.",
        "runtimeMinutes": "103"
    },
    "2020_32": {
        "plotSummary": "After a family moves into the Heelshire Mansion, their young son soon makes friends with a life-like doll called Brahms.",
        "runtimeMinutes": "86"
    },
    "2020_33": {
        "plotSummary": "The final chapter in the Heaven's feel trilogy. Angra Mainyu has successfully possessed his vessel Sakura Matou . It's up to Rin, Shiro, and Rider to cleanse the grail or it will be the end of the world and magecraft as we all know it.",
        "runtimeMinutes": "120"
    },
    "2020_34": {
        "plotSummary": "A young governess is hired to look after an orphaned girl, but the return of the girl's problematic brother uncovers secrets from their past. A modern take on Henry James' novella \"The Turn of the Screw.\"",
        "runtimeMinutes": "94"
    },
    "2020_35": {
        "plotSummary": "The team discovers that when they grow up, their relationship with their Digimon will come closer to an end. They realize that the more they fight, the faster their bond breaks and the time to choose is approaching fast.",
        "runtimeMinutes": "94"
    },
    "2020_36": {
        "plotSummary": "A young boy and his grandmother have a run-in with a coven of witches and their leader.",
        "runtimeMinutes": "106"
    },
    "2020_37": {
        "plotSummary": "A man embarks on a bloody rampage to save his kidnapped brother.",
        "runtimeMinutes": "143"
    },
    "2020_38": {
        "plotSummary": "The true-life story of Christian music star Jeremy Camp and his journey of love and loss that looks to prove there is always hope.",
        "runtimeMinutes": "116"
    },
    "2020_39": {
        "plotSummary": "Jack Cunningham was an HS basketball phenom who walked away from the game, forfeiting his future. Years later, when he reluctantly accepts a coaching job at his alma mater, he may get one last shot at redemption.",
        "runtimeMinutes": "108"
    },
    "2020_4": {
        "plotSummary": "After discovering a small, blue, fast hedgehog, a small-town police officer must help him defeat an evil genius who wants to do experiments on him.",
        "runtimeMinutes": "99"
    },
    "2020_40": {
        "plotSummary": "A modern take on Charles Dickens's classic tale of a young orphan who is able to triumph over many obstacles.",
        "runtimeMinutes": "119"
    },
    "2020_41": {
        "plotSummary": "After swapping bodies with a deranged serial killer, a young girl in high school discovers she has less than 24 hours before the change becomes permanent. Read more: Synopsis",
        "runtimeMinutes": "102"
    },
    "2020_42": {
        "plotSummary": "Twelve strangers wake up in a clearing. They don't know where they are, or how they got there. They don't know they've been chosen - for a very specific purpose - The Hunt.",
        "runtimeMinutes": "90"
    },
    "2020_43": {
        "plotSummary": "A monster named Larry manifests itself through smart phones and mobile devices. Feature film version of the 2017 short film.",
        "runtimeMinutes": "96"
    },
    "2020_44": {
        "plotSummary": "The story of a humiliating high school mishap from 1992 that sends the Impractical Jokers on the road competing in hidden-camera challenges for the chance to turn back the clock and redeem three of the four Jokers.",
        "runtimeMinutes": "92"
    },
    "2020_45": {
        "plotSummary": "A hardened CIA operative finds himself at the mercy of a precocious 9-year-old girl, having been sent undercover to surveil her family.",
        "runtimeMinutes": "99"
    },
    "2020_46": {
        "plotSummary": "A retired sheriff and his wife, grieving over the death of their son, set out to find their only grandson.",
        "runtimeMinutes": "113"
    },
    "2020_47": {
        "plotSummary": "Antoine is the Head of HR of a big company. When his wife decides to go on holiday and leave him with the responsibility of their four kids, he knows it will be easy. But Antoine has underestimated the mess that it can be.",
        "runtimeMinutes": "104"
    },
    "2020_48": {
        "plotSummary": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.",
        "runtimeMinutes": "148"
    },
    "2020_49": {
        "plotSummary": "Barely escaping an avalanche during a family ski vacation in the Alps, a married couple is thrown into disarray as they are forced to reevaluate their lives and how they feel about each other.",
        "runtimeMinutes": "86"
    },
    "2020_5": {
        "plotSummary": "A physician who can talk to animals embarks on an adventure to find a legendary island with a young apprentice and a crew of strange pets.",
        "runtimeMinutes": "101"
    },
    "2020_50": {
        "plotSummary": "Advait visits Goa where he meets Sara, a free-spirited girl who lives life unshackled. Opposites attract and all goes well until life turns upside down. Years later, Advait is on a killing spree with cops Aghase and Michael in his way.",
        "runtimeMinutes": "135"
    },
    "2020_51": {
        "plotSummary": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
        "runtimeMinutes": "125"
    },
    "2020_52": {
        "plotSummary": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
        "runtimeMinutes": "134"
    },
    "2020_53": {
        "plotSummary": "Successful author Veronica Henley finds herself trapped in a horrifying reality and must uncover the mind-bending mystery before it's too late.",
        "runtimeMinutes": "105"
    },
    "2020_54": {
        "plotSummary": "The trials and triumphs of Malti, an acid attack survivor. From the investigation of the attack to the court proceedings, the medical treatment to the emotional healing. Chhapaak is the story of the unquashable human spirit.",
        "runtimeMinutes": "120"
    },
    "2020_55": {
        "plotSummary": "A woman's island getaway with her boyfriend is thrown for a loop when he forgets to take his prescription medications along.",
        "runtimeMinutes": "100"
    },
    "2020_56": {
        "plotSummary": "Once told they'd save the universe during a time-traveling adventure, 2 would-be rockers from San Dimas, California find themselves as middle-aged dads still trying to crank out a hit song and fulfill their destiny. Read more: Synopsis",
        "runtimeMinutes": "91"
    },
    "2020_57": {
        "plotSummary": "A woman seeks revenge against those who orchestrated a plane crash that killed her family.",
        "runtimeMinutes": "109"
    },
    "2020_58": {
        "plotSummary": "Follows Satoru, a successful businessman who relinquishes everything to pursue his true calling: the happiness of humankind.",
        "runtimeMinutes": "135"
    },
    "2020_59": {
        "plotSummary": "A curious youngster moves to Salem, where he struggles to fit in before awakening a trio of diabolical witches that were executed in the 17th century.",
        "runtimeMinutes": "96"
    },
    "2020_6": {
        "plotSummary": "Banished to the mortal world, a warrior has to slay a demon to return to the heavenly realm and become a god.",
        "runtimeMinutes": "110"
    },
    "2020_60": {
        "plotSummary": "Sayuri, a coffee shop waitress, uses her supernatural powers to help those who are troubled by spiritual phenomena. She gradually gets involved in serious matters, eventually facing a fierce battle with the devil.",
        "runtimeMinutes": "108"
    },
    "2020_61": {
        "plotSummary": "Panga is inspired from the life of a national level Kabbadi player from India. It follows her triumphs, struggle and overcoming of stereotypes. It shows how important the love and support of your family is for you to be successful.",
        "runtimeMinutes": "131"
    },
    "2020_62": {
        "plotSummary": "After SpongeBob's beloved pet snail Gary is snail-napped, he and Patrick embark on an epic adventure to The Lost City of Atlantic City to bring Gary home.",
        "runtimeMinutes": "91"
    },
    "2020_63": {
        "plotSummary": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
        "runtimeMinutes": "155"
    },
    "2020_64": {
        "plotSummary": "After a break-up, a young woman decides to start a gallery where people can leave trinkets from past relationships.",
        "runtimeMinutes": "109"
    },
    "2020_65": {
        "plotSummary": "A group of pensioners want to escape the boredom of their everyday life.",
        "runtimeMinutes": "104"
    },
    "2020_66": {
        "plotSummary": "With their partners away serving in Afghanistan, a group of women on the home front form a choir and quickly find themselves at the center of a media sensation and global movement.",
        "runtimeMinutes": "112"
    },
    "2020_67": {
        "plotSummary": "100% Wolf centers on Freddy Lupin, heir to a proud family line of werewolves. Positive he'll become the most fearsome werewolf ever, Freddy is in for a shock when his first \"warfing\" goes awry, turning him into a ferocious - poodle.",
        "runtimeMinutes": "96"
    },
    "2020_68": {
        "plotSummary": "A defiant teenage boy, struggling with his parents' imminent divorce, faces off with a thousand year-old witch, who is living beneath the skin of and posing as the woman next door.",
        "runtimeMinutes": "95"
    },
    "2020_69": {
        "plotSummary": "A social media personality travels with his friends to Moscow to capture new content for his successful VLOG. Always pushing the limits and catering to a growing audience, they enter a cold world of mystery, excess, and danger.",
        "runtimeMinutes": "91"
    },
    "2020_7": {
        "plotSummary": "After splitting with the Joker, Harley Quinn joins superheroes Black Canary, Huntress and Renee Montoya to save a young girl from an evil crime lord.",
        "runtimeMinutes": "109"
    },
    "2020_70": {
        "plotSummary": "An American man, played by Jim Caviezel, is kidnapped after a friend invites him to Cairo to speak out about recent militant uprisings. His wife heads to the city after hearing the news, determined to get him back.",
        "runtimeMinutes": "108"
    },
    "2020_71": {
        "plotSummary": "On the trail of a missing girl, an ex-cop comes across a secretive group attempting to summon a terrifying supernatural entity.",
        "runtimeMinutes": "137"
    },
    "2020_72": {
        "plotSummary": "Thirty-four years after his death, Airman William H. Pitsenbarger, Jr. (\"Pits\") is awarded the nation's highest military honor, for his actions on the battlefield.",
        "runtimeMinutes": "116"
    },
    "2020_73": {
        "plotSummary": "Two couples rent a vacation home for what should be a celebratory weekend get-away.",
        "runtimeMinutes": "88"
    },
    "2020_74": {
        "plotSummary": "A night. A car. Alie is in danger. To get by she must make the most important phone call of her life.",
        "runtimeMinutes": "17"
    },
    "2020_75": {
        "plotSummary": "SamSam appears to have it all: his own flying saucer and great family and friends. But the one thing he has yet to attain are actual superpowers.",
        "runtimeMinutes": "77"
    },
    "2020_76": {
        "plotSummary": "Ava is a deadly assassin who works for a black ops organization, traveling the globe specializing in high profile hits. When a job goes dangerously wrong she is forced to fight for her own survival.",
        "runtimeMinutes": "96"
    },
    "2020_77": {
        "plotSummary": "A widow struggling to get by meets a stranger who subscribes to a philosophy of positive thinking.",
        "runtimeMinutes": "107"
    },
    "2020_78": {
        "plotSummary": "A soon-to-be stepmom is snowed in with her fiance's two children at a remote holiday village. Just as relations begin to thaw between the trio, some strange and frightening events take place.",
        "runtimeMinutes": "108"
    },
    "2020_79": {
        "plotSummary": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader and a bounty hunter named Boba Fett all over the galaxy.",
        "runtimeMinutes": "124"
    },
    "2020_8": {
        "plotSummary": "Two elven brothers embark on a quest to bring their father back for one day.",
        "runtimeMinutes": "102"
    },
    "2020_80": {
        "plotSummary": "Three fathers who are also brothers-in-law make a pact to save their daughters from their boyfriends.",
        "runtimeMinutes": "91"
    },
    "2020_81": {
        "plotSummary": "Diagnosed with a mental illness halfway through his senior year of high school, a witty, introspective teen struggles to keep it a secret while falling in love with a brilliant classmate who inspires him to not be defined by his condition.",
        "runtimeMinutes": "110"
    },
    "2020_82": {
        "plotSummary": "A bohemian artist travels from London to Italy with his estranged son to sell the house he inherited from his late wife. Read more: Synopsis",
        "runtimeMinutes": "94"
    },
    "2020_83": {
        "plotSummary": "Jack Skellington, king of Halloween Town, discovers Christmas Town, but his attempts to bring Christmas to his home causes confusion.",
        "runtimeMinutes": "76"
    },
    "2020_84": {
        "plotSummary": "A daughter, mother and grandmother are haunted by a manifestation of dementia that consumes their family's home.",
        "runtimeMinutes": "89"
    },
    "2020_85": {
        "plotSummary": "A superstar singer and her overworked personal assistant are presented with a choice that could alter the course of their respective careers.",
        "runtimeMinutes": "113"
    },
    "2020_86": {
        "plotSummary": "Scott has been a case of arrested development since his firefighter dad died. He spends his days smoking weed and dreaming of being a tattoo artist until events force him to grapple with his grief and take his first steps forward in life.",
        "runtimeMinutes": "136"
    },
    "2020_87": {
        "plotSummary": "A small team of U.S. soldiers battle against hundreds of Taliban fighters in Afghanistan.",
        "runtimeMinutes": "123"
    },
    "2020_88": {
        "plotSummary": "A pragmatic paleontologist visiting an almost complete theme park is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose.",
        "runtimeMinutes": "127"
    },
    "2020_89": {
        "plotSummary": "N/A, status code: 500",
        "runtimeMinutes": "N/A, status code: 500"
    },
    "2020_9": {
        "plotSummary": "When Cecilia's abusive ex takes his own life and leaves her his fortune, she suspects his death was a hoax. As a series of coincidences turn lethal, Cecilia works to prove that she is being hunted by someone nobody can see.",
        "runtimeMinutes": "124"
    },
    "2020_90": {
        "plotSummary": "Three officers are tasked with escorting an illegal immigrant to Charles de Gaulle airport, where he will be forced onto a plane and sent back to his homeland. But when they find out about the truth they have to do a difficult choice.",
        "runtimeMinutes": "98"
    },
    "2020_91": {
        "plotSummary": "Satire about the world of the super-rich.",
        "runtimeMinutes": "104"
    },
    "2020_92": {
        "plotSummary": "A tough army major is deployed to Kurnool on a mission to keep the country safe from external threats.",
        "runtimeMinutes": "169"
    },
    "2020_93": {
        "plotSummary": "Follows a pious nurse who becomes dangerously obsessed with saving the soul of her dying patient.",
        "runtimeMinutes": "84"
    },
    "2020_94": {
        "plotSummary": "A group of young misfits called The Goonies discover an ancient map and set out on an adventure to find a legendary pirate's long-lost treasure.",
        "runtimeMinutes": "114"
    },
    "2020_95": {
        "plotSummary": "An intense, raw and deep revival of Rostand's Cyrano de Bergerac by the Jamie Lloyd Company.",
        "runtimeMinutes": "160"
    },
    "2020_96": {
        "plotSummary": "For two couples the future unfolds in different decades and different places, but a hidden connection will bring them together in a way no one could have predicted.",
        "runtimeMinutes": "101"
    },
    "2020_97": {
        "plotSummary": "A searing look at a day in the life of an assistant to a powerful executive. As Jane follows her daily routine, she grows increasingly aware of the insidious abuse that threatens every aspect of her position.",
        "runtimeMinutes": "87"
    },
    "2020_98": {
        "plotSummary": "A group of women hatch a plan to disrupt the 1970 Miss World beauty competition in London.",
        "runtimeMinutes": "106"
    },
    "2020_99": {
        "plotSummary": "Inspired by the true stories of New Zealand's street gangs across 30 years, SAVAGE follows DANNY at three defining moments in his life as he grows from a boy into the violent enforcer of a gang.",
        "runtimeMinutes": "100"
    }
}